[{"text": "Light is everywhere, but it’s not as\npredictable as you might think.", "start": 3.08, "duration": 3.28}, {"text": "It’s a wave that travels in straight lines, yet it also reflects off of surfaces, refracts through various materials, and generally changes direction all the time!", "start": 6.36, "duration": 7.74}, {"text": "We’ve learned how to bend light to our will, with lenses and mirrors, but it’s time to take a step back and ask what we can learn from light.", "start": 14.1, "duration": 6.08}, {"text": "What can we discover about the universe by taking a closer look at the light that’s produced and reflected all around us?", "start": 20.18, "duration": 5.64}, {"text": "It’s time to use our understanding of the wave\nnature of light, to explain what stars are made of,", "start": 25.82, "duration": 4.36}, {"text": "why you see rainbows in an oil stain in\nthe parking lot,", "start": 30.18, "duration": 2.74}, {"text": "and how some fancy sunglasses can\nmake a bright day a lot more bearable.", "start": 32.92, "duration": 5.3}, {"text": "[Theme Music]", "start": 38.22, "duration": 12.86}, {"text": "In order to unlock the secrets that light can reveal\nto us, we need to look again at diffraction.", "start": 51.08, "duration": 4.76}, {"text": "Remember? That’s what causes the pattern of lines that appear when you shine a light through a pair of thin slits.", "start": 55.84, "duration": 4.62}, {"text": "The bright lines are the result of constructive interference, when light waves build on one another, while the dark spaces in between are the result of destructive interference.", "start": 60.46, "duration": 8.3}, {"text": "Exactly how this diffraction pattern looks,\ndepends on the spacing of the slits and the light's wavelength.", "start": 68.76, "duration": 4.48}, {"text": "So, if you know the distance between the slits, then you can measure the diffraction lines to get some information about the light source.", "start": 73.24, "duration": 5.28}, {"text": "Now, you can also shine light through many equally\nspaced slits -- this called a diffraction grating.", "start": 78.52, "duration": 5.08}, {"text": "And when you shine a light through one of these gratings, the diffraction lines are much more intense and easier to measure.", "start": 83.6, "duration": 5.6}, {"text": "Plus, when there are more slits, there’s\nalso more opportunity for destructive interference,", "start": 89.2, "duration": 4.62}, {"text": "so the dark spots between bright lines are\nlarger as well.", "start": 93.82, "duration": 2.49}, {"text": "Now, if the light source has light of only\none wavelength, which is one distinct color,", "start": 96.31, "duration": 4.349}, {"text": "then all the lines would be the same color\nand would be evenly spaced.", "start": 100.66, "duration": 3.02}, {"text": "But if you have a light source with two wavelengths, then you’ll get multiple sets of bright lines, whose color and locations will depend on the wavelength.", "start": 103.68, "duration": 7.08}, {"text": "And if your light source is white light,\ncontaining all the visible wavelengths,", "start": 110.77, "duration": 3.68}, {"text": "then you’ll see a little rainbow in the place of every\nbright line, because the grating is separating out\neach wavelength.", "start": 114.45, "duration": 5.759}, {"text": "These patterns are known as spectra, and you\ncan study them to learn about the source of the light.", "start": 120.229, "duration": 3.671}, {"text": "To do that, you need a spectrometer, a tool that uses diffraction grating or a prism to separate the wavelengths.", "start": 123.9, "duration": 5.579}, {"text": "Let’s say that you heat up a cloud of hydrogen until it emits light, and then you point your spectrometer at the cloud.", "start": 129.48, "duration": 5.42}, {"text": "The gas will emit a line spectrum, a distinct pattern of lines at certain wavelengths that correspond to the elemental composition of the cloud – in this case, hydrogen.", "start": 134.9, "duration": 8.32}, {"text": "The spectrum would look like this, and you’d always see this line spectrum from a heated hydrogen cloud or a compound that contains hydrogen.", "start": 143.22, "duration": 6.54}, {"text": "Line spectra work for heated gases under\nthe right low-pressure conditions.", "start": 149.76, "duration": 3.9}, {"text": "But when solid materials or high pressure gaseous objects, like the sun, get heated up, they emit a continuous spectrum of light that covers a very wide range of wavelengths.", "start": 153.66, "duration": 8.4}, {"text": "And in that case, you can still get information about the light source, because the continuous spectrum from a heated object also contains absorption lines –", "start": 162.06, "duration": 7.74}, {"text": "characteristic wavelengths of light that have been absorbed by the same elements that emitted them.", "start": 169.8, "duration": 4.34}, {"text": "The Sun emits a continuous spectrum, but some\nelements in its atmosphere absorb some of the light.", "start": 174.15, "duration": 4.99}, {"text": "Hydrogen atoms, for example, absorb light\nemitted by other masses of heated hydrogen.", "start": 179.14, "duration": 4.46}, {"text": "But you don’t always need special equipment\nto see and study continuous spectra.", "start": 183.6, "duration": 4.02}, {"text": "Have you blown a soapy bubble and noticed\nthe bright rainbow colors on its surface?", "start": 187.62, "duration": 3.94}, {"text": "That coloring is also due to interference and the separation of wavelengths, an effect known as thin film interference.", "start": 191.56, "duration": 5.84}, {"text": "Thin films are layers of material whose thickness can be measured in micrometers, or even nanometers – of the order of a ‘wavelength’ of visible light.", "start": 197.4, "duration": 7.14}, {"text": "For example, a layer of oil on top of water\ncould be a thin film.", "start": 204.54, "duration": 3.23}, {"text": "Imagine such an arrangement of oil and water,\nwith a ray of white light coming down from above.", "start": 207.77, "duration": 4.71}, {"text": "We know some of the light will reflect off\nthe top of the oil, and some will pass through.", "start": 212.48, "duration": 3.94}, {"text": "Of the light that goes through the oil, some\nof it will reflect off the surface of the water.", "start": 216.42, "duration": 4.3}, {"text": "Now, the light that’s reflected off the oil will interfere\nwith the light that’s reflected off of the water.", "start": 220.72, "duration": 4.86}, {"text": "And whether that interference is constructive or destructive depends on the thickness of the oil and the light’s angle of incidence.", "start": 225.58, "duration": 5.94}, {"text": "So ultimately, you end up with both kinds\nof interference!", "start": 231.53, "duration": 2.96}, {"text": "Each kind occurs only for certain wavelengths\nof light, depending on the angle at which it's viewed.", "start": 234.49, "duration": 4.93}, {"text": "Because, as the viewing angle changes, so\ndoes the path length.", "start": 239.43, "duration": 3.51}, {"text": "So, different colors undergo a constructive\ninterference at different angles.", "start": 242.94, "duration": 3.17}, {"text": "The result is an alternating pattern of colorful\nreflected light, and no reflection at all.", "start": 246.11, "duration": 5.36}, {"text": "Constructive interference creates a visible, colored reflection, while destructive allows light to go through the oil to the water.", "start": 251.47, "duration": 6.75}, {"text": "This phenomenon happens not just with layers of liquid, but also with layers of some transparent solids -- namely, glass!", "start": 258.22, "duration": 5.92}, {"text": "You can create a similar effect, if you have a lens with one flat side and one curved side, and you put the curved side on a flat plate of glass.", "start": 264.14, "duration": 7.84}, {"text": "As light shines from above and enters the flat side of the lens, some rays reflect off the bottom of the curved lens, while others pass through into the thin gap of air that sits between the lens and the plate.", "start": 271.98, "duration": 10.28}, {"text": "That light then reflects off the bottom plate\nand returns back through the lens.", "start": 282.26, "duration": 3.74}, {"text": "The resulting interference creates a circular rainbow pattern that extends out from the point of contact between the lens and the plate.", "start": 286.0, "duration": 6.48}, {"text": "These circles are known as Newton’s Rings,\nand if the light source is monochromatic,", "start": 292.48, "duration": 4.04}, {"text": "the rings simply alternate light and dark,\ndisplaying the alternating constructive and destructive interference.", "start": 296.53, "duration": 4.97}, {"text": "Now, if you look at the very center of Newton’s Rings, where the glass plate is in contact with the lens, you’ll notice a dark spot.", "start": 301.5, "duration": 5.96}, {"text": "That’s where the reflected wave of light\nis not constructively interfering with itself.", "start": 307.46, "duration": 3.799}, {"text": "Instead, at this point of contact, the reflected\nray undergoes a phase shift of 180 degrees,\nessentially skipping forward half of a cycle.", "start": 311.26, "duration": 7.24}, {"text": "Remember, when a wave is in phase with another wave, their crests and troughs are amplified, meaning that the light is brighter, thanks to constructive interference.", "start": 318.5, "duration": 7.0}, {"text": "And when a wave is out of phase by 180 degrees, it’s destructive, with the crests and troughs cancelling each other out.", "start": 325.52, "duration": 6.16}, {"text": "The resulting destructive interference is\nseen in the dark spot at the center of the lens.", "start": 331.68, "duration": 4.04}, {"text": "When light reflects off of a surface that has a higher index of refraction than the medium it travels through –", "start": 335.72, "duration": 4.9}, {"text": "such as light traveling through air and reflecting off of glass – the ray undergoes a destructive, 180-degree phase shift.", "start": 340.62, "duration": 6.18}, {"text": "But, if light reflects off of a surface that has a lower index of refraction than the medium it’s passing through, there is no phase shift, and the wave then constructively interferes with itself.", "start": 346.8, "duration": 9.1}, {"text": "Now, light is a transverse wave, meaning that the wave travels in one direction and oscillates back and forth in a direction that’s perpendicular to the direction of travel.", "start": 355.9, "duration": 7.84}, {"text": "And, like all electromagnetic waves, what’s\noscillating in a light wave, is its electric field.", "start": 363.74, "duration": 4.8}, {"text": "So when a wave strikes an object, the effects of the changing electric field are felt in a direction that’s perpendicular to the direction, in which the wave is moving.", "start": 368.54, "duration": 8.18}, {"text": "BUT! A light wave’s electric field can not\nonly move vertically (that is, up and down) –", "start": 376.72, "duration": 4.42}, {"text": "it can also oscillate horizontally (or side to side), since that movement is still perpendicular to direction of travel.", "start": 381.14, "duration": 6.46}, {"text": "This oscillation is important, because you can limit what light passes through a filter, depending on which direction its electric field is oscillating in.", "start": 387.6, "duration": 6.559}, {"text": "The filtering of light depending on its oscillation-direction is called polarization.", "start": 394.159, "duration": 3.8}, {"text": "The light from a light bulb, or from the sun, has\nelectric fields oscillating in all possible directions", "start": 397.96, "duration": 4.94}, {"text": "But you can aim that light through a filter, like a vertical slit, so that only one kind of polarized light can pass through.", "start": 402.9, "duration": 5.22}, {"text": "In the case of a vertical slit, it will only\nlet light through that’s vertically polarized", "start": 408.12, "duration": 4.22}, {"text": "– that is, waves whose electric fields are\noscillating straight up and down.", "start": 412.34, "duration": 3.56}, {"text": "And if a light wave is horizontally polarized,\nthen it won’t be able to pass through the slit.", "start": 415.9, "duration": 4.64}, {"text": "This is basically how polarized sunglasses\nwork!", "start": 420.54, "duration": 2.52}, {"text": "Unpolarized glasses only use darkened glass\nto absorb some of the incoming light.", "start": 423.069, "duration": 4.24}, {"text": "But polarized glasses have lenses that work as vertical polarizers, blocking out all light except those whose electric fields oscillate up and down.", "start": 427.309, "duration": 7.34}, {"text": "This is particularly helpful when you’re\non or near the water.", "start": 434.649, "duration": 2.781}, {"text": "When sunlight reflects off of water, each reflected ray is partially polarized in the direction that’s parallel to the surface it reflected off of.", "start": 437.43, "duration": 6.25}, {"text": "So, when reflecting off of flat water, the\nreflected ray becomes partially, horizontally polarized.", "start": 443.68, "duration": 5.02}, {"text": "And since your fancy sunglasses only let in vertically polarized light, your eyes are protected from the glare that comes off the water.", "start": 448.7, "duration": 6.299}, {"text": "Next time, we’re going to learn about much\nmore complex instruments, that we use to manipulate light.", "start": 454.999, "duration": 5.08}, {"text": "But today, you learned about how to analyze the composition of a light source using diffraction grating and spectroscopy.", "start": 460.08, "duration": 5.34}, {"text": "You also observed Newton’s rings and\nthe patterns that arise from the interaction\nbetween light and thin films.", "start": 465.42, "duration": 4.959}, {"text": "Finally, you learned about the oscillation\nof light waves, and how polarization filters\ncertain kinds of light.", "start": 470.38, "duration": 5.3}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 475.69, "duration": 3.86}, {"text": "You can head over to their channel and check\nout a playlist of the latest episodes from", "start": 479.55, "duration": 3.11}, {"text": "shows like Gross Science, PBS Off Book, and\nBrain Craft.", "start": 482.66, "duration": 3.129}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Sheryll See Kinney Crash Course", "start": 485.789, "duration": 3.34}, {"text": "Studio with the help of these amazing people\nand our equally amazing graphics team, is Thought Cafe.", "start": 489.129, "duration": 5.32}]