[{"text": "When you study physics, you can start to see\nit everywhere – even here.", "start": 3.06, "duration": 3.46}, {"text": "As an engineer who studied physics, I have to say one the most interesting parts of the holidays is the lights.", "start": 6.52, "duration": 4.8}, {"text": "Just think of all of the crazy displays that you see, and what it would take to figure out the current required to power all of the tiny light bulbs that make them glow.", "start": 11.32, "duration": 7.08}, {"text": "So many resistors.", "start": 18.4, "duration": 1.42}, {"text": "Now, I’m not going to ask you to diagram\nthe holiday lights on your neighbor’s house.", "start": 19.83, "duration": 3.18}, {"text": "But, one of the best ways to understand how electricity works in a system like that, is through circuit analysis:", "start": 23.01, "duration": 5.32}, {"text": "the process of breaking down a circuit into its key components, and studying each one, to see what it can tell you about the others.", "start": 28.33, "duration": 5.9}, {"text": "So far, you’ve learned about the key components of every electrical circuit – namely voltage, resistance, and current.", "start": 34.23, "duration": 5.76}, {"text": "These properties are all related to one another\nthrough Ohm’s law.", "start": 39.99, "duration": 3.06}, {"text": "This means that if you know two out of the three variables, you can solve for the remaining one.", "start": 43.05, "duration": 3.9}, {"text": "For example, you can take a bunch of resistors in a circuit, find their equivalent resistance, and then use the voltage to figure out what the current is.", "start": 46.95, "duration": 7.24}, {"text": "And when you know the current, you can get even more important information, like the voltage across a particular component, or the current through a specific wire.", "start": 54.19, "duration": 8.27}, {"text": "So if nothing else, today’s lesson in circuit analysis will help you appreciate holiday lights on a whole new level.", "start": 62.46, "duration": 5.96}, {"text": "[Theme Music]", "start": 68.42, "duration": 12.48}, {"text": "Let’s keep things simple.", "start": 80.9, "duration": 1.4}, {"text": "There’s an enormous number of circuit-building methods that I’d love to go over with you, but we’re going to stick to the basics, which you’ll use in every circuit problem you’ll encounter.", "start": 82.3, "duration": 7.54}, {"text": "These are DC circuits, with resistors in series\nand parallel formations.", "start": 89.84, "duration": 3.62}, {"text": "You’ll recall that series formations occur when resistors are connected along the same path, so they have the same current passing through each one.", "start": 93.46, "duration": 7.499}, {"text": "And parallel connections are when resistors are placed on wires that branch out from a single point, all having the same voltage drop across them.", "start": 100.96, "duration": 6.78}, {"text": "And to find the equivalent resistance of resistors in series, you just add their resistances together.", "start": 107.74, "duration": 4.84}, {"text": "For resistors in parallel, meanwhile, you use a different method – one that gives you a resistor with an equivalent resistance that’s smaller than any of the individual resistors in the branches.", "start": 112.58, "duration": 9.28}, {"text": "Now, let’s put these equations to work!", "start": 121.869, "duration": 1.991}, {"text": "Here’s an example of a circuit with resistors\nin both series and parallel formations.", "start": 123.86, "duration": 4.14}, {"text": "Say you have a 20-volt battery, immediately\nfollowed by a resistor of 10 Ohms.", "start": 128.0, "duration": 4.06}, {"text": "Following that, there’s a parallel\nformation of more resistors:", "start": 132.06, "duration": 3.42}, {"text": "One branch consists of two resistors in series,\none of 15 Ohms and one of 2 Ohms.", "start": 135.48, "duration": 4.9}, {"text": "The other branch has a 6 Ohm resistor, and then another parallel formation of resistors, 3 and 5 Ohms each.", "start": 140.38, "duration": 6.2}, {"text": "Our goal is to simplify everything down to one resistor, which will have the equivalent resistance of all of these resistors combined.", "start": 146.58, "duration": 7.24}, {"text": "With that equivalent resistance, you can then know\nwhat the resulting current is in the circuit.", "start": 153.82, "duration": 4.52}, {"text": "Then, using Ohm’s Law, you can calculate the voltage across, and current through, each resistor.", "start": 158.34, "duration": 5.26}, {"text": "OK, let’s do the easiest steps first.", "start": 163.6, "duration": 2.5}, {"text": "Start by finding the resistors in a series.", "start": 166.1, "duration": 2.08}, {"text": "You can collapse these down into a single resistor by simply adding their resistances together.", "start": 168.18, "duration": 4.7}, {"text": "In this case, you add the 15 and 2 Ohm resistors\ninto a single, 17 Ohm equivalent resistor.", "start": 172.88, "duration": 5.3}, {"text": "Now that branch contains a single resistor.", "start": 178.18, "duration": 2.259}, {"text": "Let’s look at the other branch.", "start": 180.439, "duration": 1.531}, {"text": "This one has a single resistor and then two\nin parallel.", "start": 181.97, "duration": 2.83}, {"text": "So let’s start by turning the parallel connection of the 3 Ohm and 5 Ohm resistors into one equivalent resistor.", "start": 184.8, "duration": 6.24}, {"text": "Using our equation for resistors in parallel, you find that they simplify to a single resistor of about 1.88 Ohms.", "start": 191.04, "duration": 6.24}, {"text": "Then, you can add the newly formed resistor to the 6 Ohm one, and the branch simplifies even more – to a single resistor of 7.88 Ohms.", "start": 197.28, "duration": 7.54}, {"text": "All right, you’re almost there!", "start": 204.82, "duration": 1.759}, {"text": "Now, let’s combine the 17 Ohm and 7.88 Ohm resistors, which are in parallel, into one resistor and its resistance turns out to be 5.38 Ohms.", "start": 206.58, "duration": 9.22}, {"text": "And with that, you’re left with only two resistors in series, which you can combine to form a single resistor with the equivalent resistance of 15.38 Ohms.", "start": 215.8, "duration": 8.3}, {"text": "Now, there’s only one resistor left, which means you can easily find the current drawn from the battery!", "start": 224.1, "duration": 4.68}, {"text": "Using Ohm’s Law, you can find that the current through a circuit with a 20 volt battery and an equivalent resistance of 15.38 Ohms is about 1.30 Amperes.", "start": 228.78, "duration": 9.56}, {"text": "Just pause for a moment and appreciate what\nyou’ve done so far.", "start": 238.34, "duration": 3.36}, {"text": "You were able to take what you knew about the power source and the number and configuration of the resistors to figure out the current that runs through the circuit.", "start": 241.7, "duration": 8.04}, {"text": "And it wasn’t that hard, was it?", "start": 249.74, "duration": 1.7}, {"text": "And now that you’ve determined the current,\nyou can learn so much more!", "start": 251.45, "duration": 3.31}, {"text": "With the total current in the system, you can expand the equivalent circuit back to its original form.", "start": 254.76, "duration": 4.64}, {"text": "And while you’re doing that, you can determine both the current through, and the voltage drop across, every single resistor.", "start": 259.4, "duration": 5.86}, {"text": "Just go back one step to the ten Ohm resistor,\nand the 5.38 Ohm resistor.", "start": 265.26, "duration": 4.46}, {"text": "Nothing has changed about the current through\nthe circuit.", "start": 269.72, "duration": 2.14}, {"text": "And the two resistors are in series, so the\ncurrent flowing through them is the same.", "start": 271.86, "duration": 3.72}, {"text": "But the voltage drop across each resistor\nis different.", "start": 275.58, "duration": 2.8}, {"text": "You can calculate the voltage drop across each\nresistor by using Ohm’s Law, V equals I times R.", "start": 278.38, "duration": 5.48}, {"text": "You know the current, I, and you know each resistance, R, so you simply use them to find the distinct voltage drop, V, across each resistor.", "start": 283.86, "duration": 8.74}, {"text": "The voltage drop across the 10 Ohm resistor turns out to be 13 Volts, which leaves the remaining voltage drop across the rest of the circuit to be 7 Volts.", "start": 292.6, "duration": 7.72}, {"text": "And you don’t have to do anything with the 10 Ohm resistor, since that’s not a combination of resistors.", "start": 300.32, "duration": 4.76}, {"text": "So the current through and voltage across\nthat circuit element doesn’t change.", "start": 305.08, "duration": 3.96}, {"text": "In order to complete the rest of the circuit, let’s expand the 5.38 Ohm resistor back out again, to those two resistors in parallel.", "start": 309.04, "duration": 6.22}, {"text": "Now, you know that any two resistors in parallel have the same voltage drop, so both the 17 Ohm resistor and the 7.88 Ohm resistor have a voltage drop of 7 Volts, just when they were collapsed into one.", "start": 315.26, "duration": 11.86}, {"text": "But the current through each branch is not\nthe same.", "start": 327.12, "duration": 2.26}, {"text": "Since you know the resistance of, and voltage across, each resistor, you just use Ohm’s Law again to calculate the current through each wire.", "start": 329.38, "duration": 7.439}, {"text": "The 17 Ohm resistor, with a voltage drop of\n7 Volts, will have a current of 0.41 Amperes.", "start": 336.819, "duration": 5.181}, {"text": "And the 7.88 Ohm resistor, with the same voltage drop of 7 Volts, will have a current of 0.89 Amperes.", "start": 342.0, "duration": 6.72}, {"text": "And look at this: If you add these two currents\ntogether, they equal the 1.3 amperes.", "start": 348.72, "duration": 4.819}, {"text": "That’s the same value for the current that\nenters the junction where the wires split.", "start": 353.539, "duration": 4.44}, {"text": "This must be true, to satisfy conservation of charge, because remember: What goes in must come out!", "start": 357.98, "duration": 5.2}, {"text": "Now, let’s expand the resistor on the right into its two components, a 6 Ohm and a 1.88 Ohm resistor.", "start": 363.18, "duration": 5.9}, {"text": "The current through these two is still 0.89 Amperes, but the voltage drop of 7 Volts is now split across the two resistors.", "start": 369.08, "duration": 7.3}, {"text": "All you have to do is implement Ohm’s law yet again, multiplying current and resistance in order to find the voltage drop.", "start": 376.38, "duration": 5.84}, {"text": "So 0.89 Amperes times 6 Ohms equals a 5.33\nVolt drop.", "start": 382.22, "duration": 5.06}, {"text": "And 0.89 Amperes times 1.88 Ohms equals the\nremaining 1.67 Volt drop.", "start": 387.28, "duration": 5.82}, {"text": "Now, It’s good to check that you’re on the right track by looking at the relationships of all of these values.", "start": 393.1, "duration": 3.8}, {"text": "Keep in mind that, for resistors in series, the larger the resistance is, the larger the voltage drop that’s required.", "start": 396.9, "duration": 5.96}, {"text": "Think of a big light bulb and a tiny light bulb on the same wire of holiday lights, using the same current.", "start": 402.86, "duration": 5.16}, {"text": "The little light bulb doesn’t draw nearly as much power, so it uses less voltage for the same amount of current passing through it.", "start": 408.02, "duration": 5.78}, {"text": "OK, back to work!", "start": 413.8, "duration": 1.24}, {"text": "Our 1.88 Ohm resistor is a combination of\na 3 Ohm and 5 Ohm pair of resistors in parallel.", "start": 415.04, "duration": 5.9}, {"text": "So the voltage drop across each resistor is still 1.67 Volts, but the current passing through each will be different.", "start": 420.94, "duration": 6.3}, {"text": "Using Ohm’s Law, you can divide the voltage across each resistor by its respective resistance, giving you the current through each branch.", "start": 427.24, "duration": 6.98}, {"text": "1.67 volts divided by 3 Ohms gives you a current\nof 0.56 Amperes through the 3 Ohm resistor.", "start": 434.22, "duration": 6.42}, {"text": "And 1.67 volts divided by 5 Ohms gives you\na current of 0.33 Amperes.", "start": 440.64, "duration": 5.68}, {"text": "And since 0.56 plus 0.33 Amperes equals the 0.89 Amperes that enters the wire at the split, you know you’re on the right track.", "start": 446.32, "duration": 8.36}, {"text": "One last step!", "start": 454.68, "duration": 1.22}, {"text": "The 17 Ohm resistor is a series combination\nof a 15 Ohm and 2 Ohm resistor.", "start": 455.9, "duration": 4.3}, {"text": "Here, the current through them – 0.41 Amperes – stays the same, while the voltage drop across each one can be found using Ohm’s Law.", "start": 460.2, "duration": 8.02}, {"text": "0.41 Amperes times 15 Ohms equals 6.17 volts\nacross the 15 Ohm resistor.", "start": 468.22, "duration": 6.22}, {"text": "And 0.41 Amperes times 2 Ohms equals the remaining\n0.82 Volts across the 2 Ohm resistor.", "start": 474.449, "duration": 6.87}, {"text": "To check your work, you can go back and see that the two voltage drops equal the total voltage drop across each branch after the 10 Ohm resistor.", "start": 481.32, "duration": 7.18}, {"text": "And you’ve done it!\nCongrats!", "start": 488.5, "duration": 1.8}, {"text": "You’ve taken a whole circuit, simplified it down to the bare minimum, then expanded it again, discovering the current and voltage values for every single resistor.", "start": 490.3, "duration": 7.54}, {"text": "But, even though we all love math, what if\nthat’s not enough for you?", "start": 497.84, "duration": 3.139}, {"text": "What if you physically constructed this circuit yourself, and you wanted to measure the values so that you knew your math checked out?", "start": 500.98, "duration": 5.659}, {"text": "To measure voltage, you’d just need a tool\nknown as a voltmeter.", "start": 506.64, "duration": 2.92}, {"text": "Pretty creative, I know.", "start": 509.56, "duration": 1.24}, {"text": "Now, you want a way to measure voltage without\naltering the actual circuit.", "start": 510.8, "duration": 3.3}, {"text": "No solution is perfect, but you can get a pretty accurate reading by attaching the voltmeter on either side of the device that you want to measure.", "start": 514.1, "duration": 6.52}, {"text": "And you do it that way, because you know that any components connected in parallel will have the same voltage.", "start": 520.62, "duration": 4.48}, {"text": "But even if you measure the voltage, you still\nwant to avoid changing the resulting circuit.", "start": 525.11, "duration": 4.48}, {"text": "So, what you do is give the voltmeter a resistance that's so high that it’s considered infinite, relative to the rest of the circuit.", "start": 529.59, "duration": 6.19}, {"text": "With an “infinite” resistance, the same voltage is read across both the voltmeter and the device you’re measuring, and a tiny amount of current ends up running through the voltmeter.", "start": 535.78, "duration": 8.76}, {"text": "OK, you’re a stickler, and even though you’ve confirmed your voltage, you want to do the same thing with the current.", "start": 544.54, "duration": 5.1}, {"text": "This time, you’ll use the fact that devices\nconnected in series share the same current.", "start": 549.65, "duration": 4.02}, {"text": "So, you need a device that can measure current, in series with another component, without changing the current.", "start": 553.67, "duration": 5.03}, {"text": "This is known as an ammeter, and it measures the current in Amperes by connecting in series with the circuit.", "start": 558.7, "duration": 4.82}, {"text": "It doesn’t affect the circuit, because the\ndevice has a near-zero resistance.", "start": 563.52, "duration": 3.88}, {"text": "But here’s a pro tip: When you use these devices in the lab, be very careful not to mix up the methods of connection!", "start": 567.4, "duration": 6.04}, {"text": "Attaching the ammeter, a device with near-zero resistance, in parallel with another resistor, will cause nearly all the current to run through the ammeter, possibly damaging it.", "start": 573.44, "duration": 8.64}, {"text": "And if a voltmeter is attached in series, you’re not going to see any current flowing, because the resistance is so large!", "start": 582.08, "duration": 5.82}, {"text": "But used correctly, these devices can not only allow you to confirm your maths, they can also give you a hands-on way to measure the basic principles of Ohm’s Law in action.", "start": 587.9, "duration": 8.56}, {"text": "And they just might help you raise your holiday-lighting\ngame to a whole new level.", "start": 596.46, "duration": 3.68}, {"text": "Today, we saw how circuit analysis can be used on any series and parallel configuration of resistors in a DC circuit.", "start": 600.14, "duration": 5.54}, {"text": "We used Ohm’s Law to go from an equivalent circuit to solving for every current value and voltage drop in the system.", "start": 605.68, "duration": 6.4}, {"text": "Finally, we saw how to measure voltage and current in a real circuit using voltmeters and ammeters.", "start": 612.08, "duration": 4.98}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 617.06, "duration": 3.94}, {"text": "You can head over to their channel to check out a playlist of the latest episodes from shows like PBS Space Time, The Good Stuff, and Indie Alaska.", "start": 621.0, "duration": 6.82}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 627.82, "duration": 3.74}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 631.56, "duration": 4.44}]