[{"text": "Professor Dave again, let’s learn the law\nof cosines.", "start": 0.52, "duration": 3.0}, {"text": "We just learned the law of sines for oblique\ntriangles, so let’s learn one more law of", "start": 10.16, "duration": 5.12}, {"text": "importance.", "start": 15.289, "duration": 1.0}, {"text": "That’s the law of cosines.", "start": 16.289, "duration": 1.961}, {"text": "This one is sort of like the Pythagorean theorem,\nin that it relates the squares of the lengths", "start": 18.25, "duration": 4.86}, {"text": "of the triangle, but the Pythagorean theorem\nworks only for right triangles, whereas the", "start": 23.11, "duration": 5.66}, {"text": "law of cosines works for any triangle.", "start": 28.77, "duration": 4.18}, {"text": "Here is a general triangle with sides of length\nA, B, and C, in lower case, and angles A,", "start": 32.95, "duration": 6.64}, {"text": "B, and C in upper case which correspond to\nthe lengths directly opposite.", "start": 39.59, "duration": 5.79}, {"text": "What this law says is that if we know the\nlength of any two sides of a triangle, and", "start": 45.38, "duration": 4.72}, {"text": "the measure of the angle between them, we\ncan calculate the length of the third side.", "start": 50.1, "duration": 5.2}, {"text": "A squared equals B squared plus C squared\nminus two BC cosine A. As you can see, the", "start": 55.3, "duration": 8.009}, {"text": "square of the missing length is expressed\nin terms of the other two lengths and the", "start": 63.309, "duration": 4.861}, {"text": "angle between them.", "start": 68.17, "duration": 1.58}, {"text": "While the law of sines allowed us to solve\nside angle angle, angle side angle, and side", "start": 69.75, "duration": 6.27}, {"text": "side angle triangles, now with the law of\ncosines we can solve side angle side triangles.", "start": 76.02, "duration": 7.489}, {"text": "Take this one for example.", "start": 83.509, "duration": 1.101}, {"text": "We’ve got our two sides and the angle between\nthem known, so let’s plug everything into", "start": 84.61, "duration": 5.549}, {"text": "the equation, simplify a little bit, and there’s\nour value for the third side.", "start": 90.159, "duration": 10.901}, {"text": "From here, we could use the law of sines to\nget one more angle, and then subtract these", "start": 101.06, "duration": 7.089}, {"text": "two from one eighty to get the final angle.", "start": 108.149, "duration": 3.241}, {"text": "Now we know everything about this triangle.", "start": 111.39, "duration": 4.24}, {"text": "Notice that we couldn’t have solved this\nwith the law of sines alone, because to use", "start": 115.63, "duration": 4.45}, {"text": "that law we need one side and angle that correspond\nto one another, as well as one other piece", "start": 120.08, "duration": 6.859}, {"text": "of information, in order to start using the\nratio.", "start": 126.939, "duration": 5.33}, {"text": "With the law of cosines, we can also solve\nfor side side side triangles.", "start": 132.269, "duration": 5.11}, {"text": "This is because if we know all three side\nlengths, we can solve for any one of the angles.", "start": 137.379, "duration": 6.041}, {"text": "The easiest way to do this is to solve for\nthe angle that is opposite the longest side,", "start": 143.42, "duration": 5.63}, {"text": "so for this triangle, let’s call the longest\nside C. Using the general formula, let’s", "start": 149.05, "duration": 7.269}, {"text": "solve for angle C. Bring this term containing\nthe angle to the other side to make it positive,", "start": 156.319, "duration": 8.34}, {"text": "and bring A squared to the other side.", "start": 164.659, "duration": 4.711}, {"text": "Then we just divide, and now we are ready\nto plug in all the values.", "start": 169.37, "duration": 4.86}, {"text": "We plug in side lengths A, B, and C, simplify,\nand we get our answer for cosine of A. We", "start": 174.23, "duration": 11.85}, {"text": "take the inverse cosine, and there’s our\nangle to the nearest tenth.", "start": 186.08, "duration": 7.079}, {"text": "From here, we just use the law of sines to\nget one more angle, and then subtract these", "start": 193.159, "duration": 6.39}, {"text": "two from one eighty to get the third angle.", "start": 199.549, "duration": 6.89}, {"text": "So as we can see both the law of sines and\nlaw of cosines are very straightforward in", "start": 206.439, "duration": 6.151}, {"text": "their application, so let’s go ahead and\ncheck comprehension.", "start": 212.59, "duration": 3.71}]