[{"text": "Closed captioning is on. To turn off, click the CC button at bottom right.", "start": 0.0, "duration": 3.66}, {"text": "Follow us on Twitter (@amoebasisters) and Facebook!", "start": 3.66, "duration": 4.64}, {"text": "Are you a morning person? One of us is and\none if us is definitely not. Mainly because,", "start": 8.53, "duration": 6.21}, {"text": "when I wake up in the morning, it just takes\na while for me to feel like I get my energy", "start": 14.74, "duration": 3.84}, {"text": "back. It takes a lot of time---and coffee---for\nthat to happen for me.", "start": 18.58, "duration": 4.87}, {"text": "Cells don’t really have that luxury. They\nare busy performing cell processes all the", "start": 23.45, "duration": 4.41}, {"text": "time and many of the processes ", "start": 27.86, "duration": 1.48}, {"text": " that they\ndo require energy. Specifically, ATP energy.", "start": 29.34, "duration": 4.73}, {"text": "ATP stands for adenosine tri phosphate. It’s\na type of nucleic acid actually, and it is", "start": 34.07, "duration": 6.419}, {"text": "action packed with three phosphates. When\nthe chemical bond that holds the third phosphate", "start": 40.489, "duration": 5.111}, {"text": "is broken, it releases a great amount of energy.\nIt also is converted into ADP, adenosine di", "start": 45.6, "duration": 6.599}, {"text": "phosphate. And really, that’s just a fancy\nway of saying that it has two phosphates after", "start": 52.199, "duration": 5.91}, {"text": "losing one.", "start": 58.109, "duration": 1.29}, {"text": "So where am I going with this? Well, cells\nhave to make this ATP energy. It doesn’t", "start": 59.399, "duration": 5.41}, {"text": "really matter what kind of cell you are---prokaryote\nor eukaryote---you have to make ATP energy.", "start": 64.809, "duration": 6.061}, {"text": "The process for making that ATP energy can\nbe different, however, depending on the type", "start": 70.87, "duration": 4.2}, {"text": "of cell. But you have to make ATP energy.", "start": 75.07, "duration": 2.82}, {"text": "One way that this can be done efficiently\nis called aerobic cellular respiration. We", "start": 77.89, "duration": 6.28}, {"text": "are going to focus on aerobic  in eukaryote", "start": 84.17, "duration": 3.78}, {"text": "cells which have many membrane bound organelles\nsuch as mitochondria. The mitochondria is", "start": 87.95, "duration": 6.82}, {"text": "are going to be kind of a big deal in this.", "start": 94.77, "duration": 2.09}, {"text": "So let’s get started. Remember we are trying\nto make ATP energy. Let’s take a look at", "start": 96.86, "duration": 5.369}, {"text": "this formula. Remember that reactants (inputs)\nare on the left side of the arrow. And products", "start": 102.229, "duration": 7.0}, {"text": "(outputs) are on the right side of the arrow.", "start": 109.509, "duration": 3.551}, {"text": "This formula, by the way, looks remarkably\nsimilar to photosynthesis. Look how the reactants", "start": 113.06, "duration": 7.0}, {"text": "and products just seem to be on different\nsides.", "start": 120.89, "duration": 3.019}, {"text": "You know why? See, in photosynthesis, organisms\n(like plants and protists for example) made", "start": 123.909, "duration": 7.0}, {"text": "glucose. Notice how glucose is a product.\nBut in cellular respiration, we break the", "start": 133.87, "duration": 6.979}, {"text": "glucose. Notice how glucose is a reactant.\nIn order to make ATP energy.", "start": 140.849, "duration": 6.151}, {"text": "So photosynthesis makes glucose---and cellular\nrespiration, it breaks glucose. Kind of cool.", "start": 147.0, "duration": 7.0}, {"text": "Photosynthetic organisms have the best of\nboth worlds because they not only do photosynthesis", "start": 155.12, "duration": 5.539}, {"text": "to make their glucose but they do cellular\nrespiration to break it. I say that’s pretty", "start": 160.659, "duration": 6.811}, {"text": "great, because glucose is the starter molecule\nin cellular respiration and needed in order", "start": 167.47, "duration": 5.299}, {"text": "to get this going. If you aren’t photosynthetic,\nsuch as a human or an amoeba, you have to", "start": 172.769, "duration": 7.0}, {"text": "find a food source to get your glucose. Cellular\nrespiration involves three major steps. We", "start": 179.94, "duration": 6.35}, {"text": "are going to assume that we are starting with\none glucose molecule so that you can see what", "start": 186.29, "duration": 4.43}, {"text": "is produced from one glucose molecule.", "start": 190.72, "duration": 3.61}, {"text": "#1 Glycolysis- This step takes place in the\ncytoplasm, and this step does not require", "start": 194.33, "duration": 7.0}, {"text": "oxygen. Glucose, the sugar from the formula,\nis converted into a more usable form called", "start": 202.2, "duration": 6.25}, {"text": "pyruvate. It actually takes a little ATP energy\nitself to get this process started. The net", "start": 208.45, "duration": 7.0}, {"text": "yield from this step is approximately 2 ATP\nmolecules. And 2 NADH molecules. What is NADH?", "start": 215.5, "duration": 7.0}, {"text": "NADH is a coenzyme, and it has the ability\nto transfer electrons, which will be very", "start": 223.819, "duration": 6.81}, {"text": "useful in making even more ATP later on. We’ll\nget to that in a minute.", "start": 230.629, "duration": 6.33}, {"text": "#2 Krebs Cycle-This is also called the Citric\nAcid Cycle. We are now involved in the mitochondria,", "start": 236.959, "duration": 7.0}, {"text": "and this step requires oxygen. The pyruvate\nthat was made is converted and will be oxidized.", "start": 245.0, "duration": 5.769}, {"text": "CO2 (carbon dioxide) is produced. We produce", "start": 250.769, "duration": 6.231}, {"text": "2 ATP, 6 NADH, and 2FADH2. FADH is also a\ncoenzyme, like NADH, and it will also assist", "start": 257.0, "duration": 7.0}, {"text": "in transferring electrons to make even more\nATP.", "start": 267.99, "duration": 3.26}, {"text": "#3 The electron transport chain. This is,\njust, a beautiful thing. Really. We’re still", "start": 271.25, "duration": 7.0}, {"text": "in the mitochondria, and we do require oxygen\nfor this step. This is a very complicated", "start": 278.63, "duration": 5.12}, {"text": "process, and we are greatly simplifying it\nby saying that electrons are transferred from", "start": 283.75, "duration": 4.56}, {"text": "the NADH and FADH2 to several electron carriers.\nThey are used to create a proton gradient.", "start": 288.31, "duration": 7.0}, {"text": "The protons are used to power an amazing enzyme\ncalled \nATP synthase. Remember that the word synthase", "start": 295.9, "duration": 7.0}, {"text": "means to “make” so that’s what ATP synthase\ndoes. All the time. It makes the ATP by adding", "start": 312.78, "duration": 7.0}, {"text": "phosphates to ADP. Oxygen is the final acceptor\nof the electrons. When oxygen combines with", "start": 320.74, "duration": 7.0}, {"text": "two protons, you get H20---aka", "start": 327.74, "duration": 6.13}, {"text": "water. The electron transport chain produces\na lot of ATP compared to the other two steps.", "start": 333.87, "duration": 7.0}, {"text": "There isn’t an exact number on this---many\ntextbooks will say 34 ATP. Meaning that the", "start": 342.15, "duration": 7.0}, {"text": "net amount of ATP made when you add all the\nsteps together is 38 ATP. But you need to", "start": 349.319, "duration": 6.451}, {"text": "understand that this is a “perfect case”\nscenario and in general, you can expect a", "start": 355.77, "duration": 6.29}, {"text": "lot less ATP made.", "start": 362.06, "duration": 1.539}, {"text": "If we look at our formula again, we can see\nhow the glucose and oxygen on the reactant", "start": 363.599, "duration": 4.781}, {"text": "side was used to produce carbon dioxide (a\nwaste product), water (a waste product), and", "start": 368.38, "duration": 6.599}, {"text": "ATP energy. ATP energy was our goal.", "start": 374.979, "duration": 3.491}, {"text": "Now, this was just one way of creating ATP\nenergy---and a very efficient way at that.", "start": 378.47, "duration": 6.55}, {"text": "But like we had said at the beginning, all\ncells have to make ATP energy. But the way", "start": 385.02, "duration": 3.91}, {"text": "that they do it can differ. If there is no\noxygen available, some cells have the ability", "start": 388.93, "duration": 5.45}, {"text": "to perform a process known as fermentation.\nIt is not nearly as efficient, but it can", "start": 394.38, "duration": 6.009}, {"text": "still can make ATP when there isn’t oxygen.", "start": 400.389, "duration": 2.201}, {"text": "We really can’t emphasize enough how important\nthe process of making ATP energy is. If you", "start": 402.74, "duration": 5.739}, {"text": "doubt how powerful it is, consider cyanide.\nThis toxin is found in some rat poisons and", "start": 408.479, "duration": 7.0}, {"text": "highly toxic. It works by blocking a step\nin the electron transport chain. Without being", "start": 415.49, "duration": 6.019}, {"text": "able to continue the electron transport chain,\ncells cannot produce their ATP, and this poison", "start": 421.509, "duration": 5.351}, {"text": "can be deadly in a very short timeframe.", "start": 426.86, "duration": 2.83}, {"text": "There is also a demand for increased research\non various mitochondrial disorders. Many mitochondrial", "start": 429.69, "duration": 3.75}, {"text": "disorders can be deadly, because the role\nof the mitochondria in our body cells is so", "start": 433.44, "duration": 2.27}, {"text": "essential for our ATP production. We are confident\nthat the understanding of how to treat these", "start": 435.71, "duration": 7.0}, {"text": "disorders will continue to improve as more\npeople, like you, ask questions. Well that’s", "start": 445.93, "duration": 6.59}, {"text": "it for the amoeba sisters and we remind you\nto stay curious.", "start": 452.52, "duration": 2.07}]