[{"text": "This little toy is called a Drinking Bird.", "start": 3.0, "duration": 2.26}, {"text": "You put a cup of water in front of it, and\nits head dunks into the cup.", "start": 5.26, "duration": 4.08}, {"text": "Eventually, the head bobs up again – but\nthen it goes right back into the water.", "start": 9.349, "duration": 3.98}, {"text": "If you don’t know much about thermodynamics, the Drinking Bird might seem like it could go on forever, without an external source of energy powering it – a perpetual motion machine, in other words.", "start": 13.329, "duration": 8.402}, {"text": "But the toy isn't a perpetual motion machine – because perpetual motion is impossible, according to the laws of physics.", "start": 21.74, "duration": 5.22}, {"text": "One of the reasons is the first law of thermodynamics.", "start": 26.96, "duration": 2.94}, {"text": "[Theme Music]", "start": 29.9, "duration": 12.5}, {"text": "One of the main goals of thermodynamics is\nto describe the transfer of energy.", "start": 42.4, "duration": 3.6}, {"text": "We’ve already described two processes as a transfer of energy – work and heat – and they’re both connected to each other.", "start": 46.0, "duration": 5.22}, {"text": "As a thermodynamic system does work, it loses\nheat.", "start": 51.22, "duration": 2.92}, {"text": "When work is done on a system, it gains heat.", "start": 54.149, "duration": 2.59}, {"text": "So heat is converted to work, and work is\nconverted to heat.", "start": 56.739, "duration": 3.181}, {"text": "Together, the work and heat transferred into or out of the system represent the change in its internal energy,", "start": 59.92, "duration": 5.46}, {"text": "which – as you might recall – is the total kinetic and potential energy of all the molecules in the system.", "start": 65.38, "duration": 5.46}, {"text": "This idea – that the change in internal energy is equal to the change in work plus heat – is so fundamental that it’s known as the first law of thermodynamics.", "start": 70.84, "duration": 7.68}, {"text": "So we can have an equation to use for analyzing\nproblems, we write the first law like this:", "start": 78.52, "duration": 4.5}, {"text": "The internal energy, U, of a closed system,\nis equal to Q, the heat transfer to the system,", "start": 83.02, "duration": 5.42}, {"text": "minus W, the work done on or by the system.", "start": 88.44, "duration": 3.0}, {"text": "It’s important to remember that when we talk about changes in internal energy, if heat is transferred into the system, Q is positive,", "start": 91.44, "duration": 6.5}, {"text": "and if heat is transferred out of the system,\nQ is negative.", "start": 97.94, "duration": 3.12}, {"text": "And, if work is done on the system, W is negative.", "start": 101.06, "duration": 3.05}, {"text": "And if work is done by the system, W is positive.", "start": 104.11, "duration": 2.92}, {"text": "Some textbooks will change those signs around, so it’s worth keeping track of what the positives and negatives mean.", "start": 107.03, "duration": 4.85}, {"text": "Now, you’ll notice that the first law of\nthermodynamics describes only those two factors", "start": 111.88, "duration": 3.7}, {"text": "– work and heat – as affecting a change\nin internal energy.", "start": 115.59, "duration": 3.35}, {"text": "That’s because as long as the system is\nclosed – meaning, it’s isolated from the", "start": 118.94, "duration": 3.31}, {"text": "rest of the universe – there just aren’t\nany other factors involved.", "start": 122.25, "duration": 3.28}, {"text": "The amount of heat lost by the system is exactly equal to the amount of work done by the system, and vice versa.", "start": 125.53, "duration": 5.71}, {"text": "So, really, the first law of thermodynamics is just another way to describe the conservation of energy,", "start": 131.24, "duration": 4.88}, {"text": "which keeps coming up in our lessons\nbecause it’s such a key principle of physics.", "start": 136.12, "duration": 3.48}, {"text": "There’s always some kind of heat loss, like\nthrough friction.", "start": 139.6, "duration": 2.7}, {"text": "Even that tiny amount means that the motion\ncan’t continue forever.", "start": 142.3, "duration": 3.54}, {"text": "It will eventually run out of the energy it\nneeds to drive the work it’s doing.", "start": 145.84, "duration": 3.18}, {"text": "That’s part of why the Drinking Bird isn’t a perpetual motion machine – it relies on the energy it gets from the cup of water to power its movement.", "start": 149.02, "duration": 6.94}, {"text": "The bird is filled with a fluid that has a low boiling point, so it can easily change from a gas to a liquid and back, with just a slight change in temperature.", "start": 155.96, "duration": 7.5}, {"text": "There's some liquid at the bottom, and some\nvapor at the top.", "start": 163.47, "duration": 2.98}, {"text": "When the bird’s head dips into the cup,\nit gets wet.", "start": 166.45, "duration": 2.83}, {"text": "It keeps bobbing back and forth for a while, and as the water evaporates, it cools the vapor in the bird's head, which condenses into liquid, creating a partial vacuum in the head.", "start": 169.28, "duration": 8.86}, {"text": "That makes liquid travel up the tube.", "start": 178.14, "duration": 2.06}, {"text": "The head gets heavier and dips back into the\nwater.", "start": 180.21, "duration": 2.46}, {"text": "But the tipping makes a bubble rise through the liquid into the bird's head, sending more liquid into the bottom, and setting the little bird swinging, and starting the cycle all over again.", "start": 182.67, "duration": 9.48}, {"text": "But it still needs the water for it to do its thing: Once the water in the cup runs out, the bird stops moving.", "start": 192.15, "duration": 5.24}, {"text": "Now, there are four basic types of processes\nwhere the thermodynamic properties of a system", "start": 197.39, "duration": 4.39}, {"text": "– generally an ideal gas in some kind of container –\ncan change according to the first law.", "start": 201.78, "duration": 4.74}, {"text": "In each case, one property is held constant – volume, pressure, temperature, or heat – while the other properties change.", "start": 206.52, "duration": 6.14}, {"text": "Variations on all these properties are used\nin all kinds of machines, especially engines.", "start": 212.66, "duration": 4.74}, {"text": "First there are iso-volumetric processes, where the volume is held constant – usually because the gas is in a rigid container – while heat is added or removed.", "start": 217.4, "duration": 7.7}, {"text": "As you add heat, the pressure of the gas will\nincrease, and so will its temperature.", "start": 225.1, "duration": 3.559}, {"text": "As you remove heat, the pressure and temperature\nwill decrease.", "start": 228.659, "duration": 3.1}, {"text": "Isovolumetric processes are kind of boring,\nas thermodynamic processes go.", "start": 231.76, "duration": 4.58}, {"text": "The gas is stuck inside its container, and no matter how much heat you add, the gas doesn’t do any work.", "start": 236.34, "duration": 5.14}, {"text": "You’re just increasing its internal energy.", "start": 241.48, "duration": 2.18}, {"text": "But isobaric processes, where the pressure is held constant while heat is added or removed, are a little more interesting.", "start": 243.66, "duration": 5.68}, {"text": "Here, the volume of the container is allowed to change, usually because the gas can move a piston.", "start": 249.34, "duration": 4.58}, {"text": "As you add heat, the volume and temperature of the system increase, and as you remove heat, the volume and temperature decrease.", "start": 253.92, "duration": 5.6}, {"text": "Which means that an isobaric process can do work.\nHere’s why:", "start": 259.52, "duration": 3.82}, {"text": "In earlier episodes, we’ve said that work is equal to force x distance – in this case, the distance the piston moves.", "start": 263.34, "duration": 5.96}, {"text": "We’ve also said that pressure is equal to force/area, which means that force is equal to pressure x area.", "start": 269.3, "duration": 5.899}, {"text": "Here, it’s the pressure of the gas x the\narea of the piston.", "start": 275.199, "duration": 3.06}, {"text": "So work is equal to the gas’s pressure x\nthe piston’s area x the distance it moves.", "start": 278.26, "duration": 4.8}, {"text": "And one more step: the area of the piston x the distance it moves, will be equal to the change in the volume of the container.", "start": 283.06, "duration": 5.98}, {"text": "So the work done during an isobaric process is equal to the pressure of the gas x the change in volume.", "start": 289.04, "duration": 4.86}, {"text": "If heat is added, the volume goes up and the\npiston moves outward, so the system does work.", "start": 293.9, "duration": 4.92}, {"text": "If you push the piston inward, you’re doing\nwork on the system, so its volume – goes down.", "start": 298.82, "duration": 4.78}, {"text": "The third type of thermodynamic processes\nare isothermal.", "start": 303.6, "duration": 3.0}, {"text": "That’s where temperature is held constant,", "start": 306.6, "duration": 1.8}, {"text": "usually by connecting the system to a much bigger system whose temperature would take a lot of heat to change, known as a heat reservoir.", "start": 308.4, "duration": 6.499}, {"text": "The heat or volume of the system is then changed\nvery slowly, so that the other properties", "start": 314.899, "duration": 4.091}, {"text": "can adjust while the temperature essentially\nstays constant.", "start": 318.99, "duration": 3.22}, {"text": "An isothermal process is kind of like an isobaric process, in that if you add heat, the volume will expand, so the system will do work.", "start": 322.21, "duration": 6.89}, {"text": "But for isothermal processes, you can’t use that simple W = P delta V equation, because the pressure does change.", "start": 329.1, "duration": 6.88}, {"text": "Instead, you need to take the integral of the pressure with respect to volume.", "start": 335.98, "duration": 3.74}, {"text": "This way, you’re still calculating work, but you’re taking the changes in pressure into account too.", "start": 339.72, "duration": 4.16}, {"text": "Another difference between isobaric and isothermal processes is that, since temperature is held constant in isothermal processes, the internal energy of the ideal gas can’t change.", "start": 343.88, "duration": 9.12}, {"text": "And the first law of thermodynamics says that heat minus work is equal to the change in the internal energy of the system – in this case, zero.", "start": 353.0, "duration": 7.36}, {"text": "So, the work done by the system will be equal to the amount of heat added, and vice versa.", "start": 360.36, "duration": 4.18}, {"text": "Finally, there are adiabatic processes, where no heat is allowed to flow in or out of the system, but the gas can expand or be compressed.", "start": 364.54, "duration": 7.34}, {"text": "Again, the equation for the first law of thermodynamics helps us out here.", "start": 371.88, "duration": 3.54}, {"text": "Q is zero, because the heat of the system isn’t changing.", "start": 375.42, "duration": 2.94}, {"text": "But the internal energy of the gas can change, so the system can do work, or have work done on it.", "start": 378.36, "duration": 5.12}, {"text": "In fact, the change in the internal energy of the gas will be exactly equal to the negative of the work.", "start": 383.48, "duration": 5.38}, {"text": "But this is all just the first law of thermodynamics.", "start": 388.86, "duration": 2.02}, {"text": "There’s also the second law, which says that heat will spontaneously flow from something hotter to something colder,", "start": 390.88, "duration": 5.72}, {"text": "but it won't flow from something colder to something hotter.", "start": 396.6, "duration": 2.84}, {"text": "And that’s because of this thing called entropy.", "start": 399.44, "duration": 2.08}, {"text": "Entropy is often described as the inherent disorder of a system – the more disordered the system, the higher its entropy.", "start": 401.52, "duration": 6.06}, {"text": "So a gas, for example, with all its molecules randomly bouncing around, has a higher entropy than a solid, with its molecules neatly arranged.", "start": 407.58, "duration": 7.06}, {"text": "And a more general way to state the second law of thermodynamics is that in real life, entropy can only increase, overall.", "start": 414.64, "duration": 6.36}, {"text": "That doesn’t mean entropy can never decrease in certain situations.", "start": 421.0, "duration": 3.08}, {"text": "Like, gases do sometimes turn into liquids or solids, obviously.", "start": 424.08, "duration": 3.92}, {"text": "You’ve seen water vapor condense and liquid water freeze.", "start": 428.0, "duration": 2.42}, {"text": "But if the entropy in a system decreases, that means the entropy of the environment around the system must increase enough to compensate, and then some, so that there’s an overall increase in the entropy of the universe.", "start": 430.42, "duration": 11.26}, {"text": "Say you put water in your freezer to make ice, for example.", "start": 441.68, "duration": 2.54}, {"text": "The entropy of the water goes down as it freezes.", "start": 444.22, "duration": 2.58}, {"text": "But meanwhile, your freezer is putting out heat as it works to keep itself cold inside.", "start": 446.8, "duration": 4.32}, {"text": "And the heat from your freezer is increasing the entropy of your kitchen, more than the entropy of the ice is decreasing.", "start": 451.12, "duration": 5.7}, {"text": "So overall, there's an increase in the entropy of the universe.", "start": 456.82, "duration": 2.74}, {"text": "Remember that! Every time you're making ice, you’re increasing the disorder of the universe!", "start": 459.56, "duration": 4.26}, {"text": "Now, entropy’s tendency to increase has to do with probability.", "start": 463.82, "duration": 3.32}, {"text": "To see what I mean, picture a shattered ceramic mug.", "start": 467.14, "duration": 2.62}, {"text": "There are molecules that make up that mug.", "start": 469.76, "duration": 1.74}, {"text": "And there are lots and lots of ways that those molecules can be arranged in space, and all of them are equally likely.", "start": 471.5, "duration": 5.28}, {"text": "But only in a few of those arrangements can the molecules make up a whole, solid, unshattered cup – the state where they have a lower entropy.", "start": 476.78, "duration": 6.56}, {"text": "Still, there are lots of possible arrangements of those molecules where they could make up a shattered cup – a set of pieces, with a higher entropy.", "start": 483.34, "duration": 6.66}, {"text": "The cup can be shattered into pieces, 300 pieces, with the pieces far apart or very close together.", "start": 490.0, "duration": 5.18}, {"text": "And every way the cup can shatter is another possible way for the molecules inside the pieces to be arranged.", "start": 495.18, "duration": 5.26}, {"text": "But when there are so many ways for the cup to be broken, and so few ways for it to be whole,", "start": 500.44, "duration": 4.24}, {"text": "it becomes very, very unlikely that the pieces will spontaneously put themselves back together if you drop them.", "start": 504.68, "duration": 5.2}, {"text": "Basically, it’ll never happen.", "start": 509.88, "duration": 1.9}, {"text": "On the other hand, it’s very likely that a cup that’s whole will break when you drop it.", "start": 511.78, "duration": 4.14}, {"text": "So the process that leads to an increase in entropy has a much higher probability of happening.", "start": 515.92, "duration": 4.68}, {"text": "And in thermodynamics, entropy is related to heat flow, because when heat flows between systems, their entropy increases.", "start": 520.6, "duration": 6.3}, {"text": "Before, when their molecules were different temperatures, that was an orderly arrangement.", "start": 526.9, "duration": 3.66}, {"text": "But when their temperatures become equal, that neat organization is gone, so the systems have a higher entropy.", "start": 530.56, "duration": 5.8}, {"text": "So: heat spontaneously flows from warmer systems to cooler ones, because that leads to an increase in entropy.", "start": 536.36, "duration": 6.06}, {"text": "Which is also why this little bird keeps bopping up and down!", "start": 542.42, "duration": 2.86}, {"text": "When the heat flows out of it, the gas condenses and it dunks into the water.", "start": 545.28, "duration": 3.64}, {"text": "The bird may not be a perpetual motion machine, but it's a great way to see the first and second laws of thermodynamics in action.", "start": 548.92, "duration": 6.14}, {"text": "Today, you learned about the first law of thermodynamics, and how it applies to isovolumetric, isobaric, isothermal, and adiabatic processes.", "start": 555.06, "duration": 7.02}, {"text": "We also talked about the second law of thermodynamics and entropy.", "start": 562.08, "duration": 3.12}, {"text": "Crash Course Physics is produced in association with PBS Digital Studios.", "start": 565.2, "duration": 3.5}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 568.7, "duration": 4.12}, {"text": "The Good Stuff, Brain Craft, and Physics Girl.", "start": 572.82, "duration": 2.62}, {"text": "This episode of Crash Course was filmed in the Doctor Cheryl C. Kinney Crash Course Studio", "start": 575.44, "duration": 3.98}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 579.42, "duration": 4.52}]