[{"text": "It was the autumn of 1820.", "start": 3.04, "duration": 1.94}, {"text": "Hans Christian Oersted had just discovered\nthe connection between electricity and magnetism.", "start": 4.98, "duration": 4.2}, {"text": "Meanwhile, a French physicist named André-Marie\nAmpère was experimenting with some wires,", "start": 9.18, "duration": 5.22}, {"text": "trying to learn more about the connection between currents and the magnetic fields they create.", "start": 14.4, "duration": 4.26}, {"text": "He took two parallel wires, ran a current through both of them in the same direction, and the wires attracted each other!", "start": 18.66, "duration": 5.78}, {"text": "And when he ran a current through both wires in the opposite directions, the wires repelled each other!", "start": 24.44, "duration": 5.4}, {"text": "Studying this strange force between the wires led Ampère to discover one of the most fundamental laws of electromagnetism: what we now call Ampère's Law.", "start": 29.84, "duration": 8.38}, {"text": "And that's not the only weird thing that current-carrying\nwires do.", "start": 38.22, "duration": 3.16}, {"text": "If you wrap a current-carrying wire into a\ncoil, the inside of the coil acts like a magnet.", "start": 41.38, "duration": 4.8}, {"text": "There's a north pole at one end of the coil\nand a south pole at the other.", "start": 46.18, "duration": 3.56}, {"text": "And if you put a loop of current-carrying\nwire in a magnetic field, it'll turn!", "start": 49.749, "duration": 4.34}, {"text": "Ampère's law lets you calculate the strength of the currents and magnetic fields in all these situations.", "start": 54.089, "duration": 4.64}, {"text": "This also helps explain how motors work.", "start": 58.729, "duration": 3.0}, {"text": "[Theme Music]", "start": 61.729, "duration": 12.491}, {"text": "So first, those two parallel wires: why do\nthey attract and repel each other?", "start": 74.22, "duration": 5.1}, {"text": "It's easier to see why the two wires act the\nway they do if you look at one wire first.", "start": 79.32, "duration": 4.119}, {"text": "Like we talked about in our last episode, the current running through a wire generates a magnetic field.", "start": 83.44, "duration": 4.599}, {"text": "So, let's say you have a long, straight wire\nwith a current running through it.", "start": 88.039, "duration": 3.22}, {"text": "The current will create a magnetic field circling\nthe wire.", "start": 91.259, "duration": 3.101}, {"text": "That magnetic field decreases the further\nyou are from the wire.", "start": 94.36, "duration": 3.56}, {"text": "If you draw a circle that's, say, a centimeter from the wire, the magnetic field along the circle will have a set strength.", "start": 97.92, "duration": 5.5}, {"text": "Ampère realized that the stronger the current is that's running through the wire, the stronger the magnetic field would be along that circle.", "start": 103.42, "duration": 6.1}, {"text": "That's the basic logic behind Ampère's Law.", "start": 109.52, "duration": 1.94}, {"text": "But this is physics, and in physics, we tend\nto express relationships in terms of equations.", "start": 111.469, "duration": 4.621}, {"text": "The equation for Ampère's law applies to any kind of loop – not just a circle – surrounding a current, no matter how many wires there are or how they're arranged or shaped.", "start": 116.09, "duration": 7.79}, {"text": "The law is valid as long as the current is\nconstant.", "start": 123.88, "duration": 2.8}, {"text": "The equation itself says that the integral of the magnetic field, B, along the loop, times the cosine of theta, with respect to distance, is equal to a constant – called mu_0 – multiplied by the current running through the loop.", "start": 126.68, "duration": 11.18}, {"text": "This equation just means that the total magnetic field along the loop is equal to the current running through the loop, times a constant number.", "start": 137.86, "duration": 6.78}, {"text": "The constant mu_0 is sometimes called the magnetic constant, and it's equal to 4 times pi times 10to the -7th Newtons per Amperes squared.", "start": 144.64, "duration": 7.9}, {"text": "Now, you may have noticed that there's an integral on the left-hand side of the equation for Ampere's law.", "start": 152.54, "duration": 4.2}, {"text": "And you might remember that we use integrals when we need to add up lots of infinitely tiny values.", "start": 156.74, "duration": 4.32}, {"text": "Well, in Ampère's Law, we're adding up all the\nlittle bits of magnetic field along the loop.", "start": 161.06, "duration": 4.06}, {"text": "We're saying that all those bits of magnetic field added together are equal to the enclosed current, times the magnetic constant.", "start": 165.12, "duration": 6.58}, {"text": "B is the strength of the magnetic field at\neach point along the loop.", "start": 171.7, "duration": 2.88}, {"text": "Theta is the angle between the magnetic field\nand each point on the loop.", "start": 174.59, "duration": 3.66}, {"text": "And ds is referring to each infinitely tiny\nsection of the loop.", "start": 178.25, "duration": 3.76}, {"text": "The mathematics of Ampère's law can get very\ncomplicated very quickly.", "start": 182.01, "duration": 4.06}, {"text": "But to get a basic sense of how it works, let's return to our scenario: a circle around one long straight wire.", "start": 186.07, "duration": 5.87}, {"text": "We're trying to find the magnetic field at each point on the circle – that's B – in terms of the enclosed current and the radius of the circle.", "start": 191.94, "duration": 6.42}, {"text": "So first, let's solve the integral in Ampère's law,\nto get the total magnetic field along the circle.", "start": 198.36, "duration": 5.18}, {"text": "According to the law, we're solving the integral of the magnetic field, times the cosine of theta, with respect to the points along the circle.", "start": 203.54, "duration": 7.16}, {"text": "But we can simplify this integral pretty easily.", "start": 210.71, "duration": 2.71}, {"text": "First, you'll notice that the magnetic field coming from our wire is parallel to the circle at every point.", "start": 213.42, "duration": 4.96}, {"text": "So the angle, theta, is 0, and the cosine\nof 0 is 1.", "start": 218.38, "duration": 4.02}, {"text": "Anything times 1 is equal to itself, so we can just knock the cosine of theta term out of the integral.", "start": 222.4, "duration": 5.32}, {"text": "Now we're left with the integral of the magnetic field, B, with respect to the points along the circle.", "start": 227.72, "duration": 4.46}, {"text": "But every part of the circle is the exact\nsame distance from the wire!", "start": 232.18, "duration": 3.28}, {"text": "So the magnetic field will be the same at\nevery point.", "start": 235.46, "duration": 2.84}, {"text": "In other words: B is constant, so we can move\nit in front of the integral sign.", "start": 238.3, "duration": 3.64}, {"text": "Now all we need to do is figure out the integral of all the points along the circle, which is equal to the circumference of the circle.", "start": 241.94, "duration": 5.74}, {"text": "So, 2 times pi times the radius.", "start": 247.69, "duration": 2.17}, {"text": "Putting that all together, we find that when we apply Ampère's law to a long straight wire, the total magnetic field along a circle surrounding a wire is equal to B times 2 times pi times the radius.", "start": 249.86, "duration": 11.26}, {"text": "And that total magnetic field is equal to\nthe magnetic constant times the enclosed current.", "start": 261.12, "duration": 4.68}, {"text": "So! For a long straight wire, B is equal to the magnetic constant times the enclosed current, divided by 2 pi r.", "start": 265.8, "duration": 5.62}, {"text": "The equation for the magnetic field along a circle surrounding one wire turned out to be really important for Ampère when he was trying to figure out what was going on with two wires.", "start": 271.42, "duration": 8.24}, {"text": "When both wires had current running through them in the same direction, they attracted each other.", "start": 279.66, "duration": 4.64}, {"text": "And when the current was going in opposite\ndirections, they repelled each other.", "start": 284.3, "duration": 3.48}, {"text": "It's easy to see why, if you apply the first\nright-hand rule.", "start": 287.79, "duration": 3.14}, {"text": "That's the one that says if you point your right thumb in the direction of a current and curl your fingers, the magnetic field points in the same direction as your fingers.", "start": 290.93, "duration": 7.83}, {"text": "So first, let's look at the wires with currents\nrunning in the same direction.", "start": 298.76, "duration": 3.48}, {"text": "For this example, we'll say that they're vertical\nwires, with the current flowing upward.", "start": 302.24, "duration": 4.14}, {"text": "If you point your right thumb in the direction of the current in each wire, your fingers will curl in the direction of the magnetic field.", "start": 306.38, "duration": 5.54}, {"text": "The magnetic field from the wire on the left\nwill be pointing to the right.", "start": 311.92, "duration": 3.62}, {"text": "And the magnetic field from the wire on the right will be pointing to the left, so the wires will attract each other.", "start": 315.54, "duration": 5.08}, {"text": "For the case where the current is flowing in opposite directions, the reverse is true, so they'll repel each other.", "start": 320.62, "duration": 4.96}, {"text": "Now, Ampere also wanted to find the force\nfrom the magnetic field on the wires.", "start": 325.58, "duration": 3.94}, {"text": "Like we talked about last time, the force depends on the angle between the current and the magnetic field, the strength of the current, the length of the wire, and the strength of the magnetic field.", "start": 329.52, "duration": 8.6}, {"text": "Calculating that magnetic field, B, was the\ntricky part.", "start": 338.12, "duration": 2.68}, {"text": "But the equation he came up with, the one that we now call Ampere's Law, allowed him – and future physicists! – to figure out what B was in a lot of situations, including the case of the two parallel wires.", "start": 340.8, "duration": 11.0}, {"text": "So the two parallel wires attracted and repelled each other because of the magnetic field created by the current.", "start": 351.8, "duration": 5.78}, {"text": "What about the coil of wire that turned into\na magnet?", "start": 357.58, "duration": 2.3}, {"text": "Well, you can probably guess that its behavior also has to do with the magnetic field produced by a current.", "start": 359.88, "duration": 4.82}, {"text": "See, that coil of wire is a special shape\ncalled a solenoid.", "start": 364.7, "duration": 3.16}, {"text": "And when a solenoid has a current running through it, it produces a magnetic field, basically all of which goes through the inside of the coils.", "start": 367.86, "duration": 6.52}, {"text": "If you curl your right hand around the solenoid so that your fingers point in the direction of the current running through the loops, your thumb will point in the direction of the magnetic field.", "start": 374.38, "duration": 8.68}, {"text": "Ampère's law is useful for solenoids, too: it says that the magnetic field inside the coils, B, is equal to the magnetic constant, times the current running through the coils, times the number of coils.", "start": 383.06, "duration": 11.3}, {"text": "So that's what happens when loops of wire\ncreate a magnetic field.", "start": 394.37, "duration": 3.28}, {"text": "When you stick a loop of wire in a magnetic\nfield, something a little stranger happens:\nthe loop of wire turns.", "start": 397.65, "duration": 6.41}, {"text": "That's because the magnetic field creates\na torque on the wire.", "start": 404.06, "duration": 2.68}, {"text": "Take a look at this loop of wire.", "start": 406.75, "duration": 1.93}, {"text": "The horizontal parts of the loop are parallel to the magnetic field, so it won't exert a force on them.", "start": 408.68, "duration": 4.74}, {"text": "But the vertical parts of the loop are perpendicular to the magnetic field, so it will exert a force on them – a force that turns the loop.", "start": 413.42, "duration": 6.86}, {"text": "From the last episode, we know that the force from the magnetic field on the wire will be equal to the current, times the length of that part of the coil, times the magnetic field.", "start": 420.28, "duration": 9.02}, {"text": "And we can use the second right-hand rule\nto figure out the direction of that force.", "start": 429.3, "duration": 3.6}, {"text": "If you point your hand in the direction of the current, then bend your fingers in the direction of the magnetic field, your thumb will point in the direction of the force.", "start": 432.9, "duration": 8.06}, {"text": "Which turns out to be away from you for the left-hand side of the coil, and toward you for the right-hand side.", "start": 440.96, "duration": 5.16}, {"text": "So the coil turns clockwise.", "start": 446.12, "duration": 1.85}, {"text": "This is how electric motors work: they have an electric current that continuously flips directions, making loops of wire spin.", "start": 447.97, "duration": 6.43}, {"text": "Those moving loops of wire can be used to do mechanical work, like turning the drum in your washing machine, or your power drill, or the fan that probably cools your computer.", "start": 454.4, "duration": 8.48}, {"text": "There are electric motors all over the place.", "start": 462.88, "duration": 2.18}, {"text": "So the next time you wash your clothes, or put together some furniture, or use your computer without it overheating, or do anything else that involves an electric motor, you have Ampère to thank.", "start": 465.06, "duration": 9.32}, {"text": "Today, you learned about Ampère's law, and\nhow it applies to a long straight wire.", "start": 474.38, "duration": 3.48}, {"text": "We also talked about the forces between two parallel wires, and the magnetic field created by a solenoid.", "start": 477.86, "duration": 5.4}, {"text": "Finally, we described the torque on a current\nloop.", "start": 483.27, "duration": 2.49}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 485.76, "duration": 3.64}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 489.4, "duration": 3.82}, {"text": "Gross Science, PBS Idea Channel, and It's\nOkay to be Smart.", "start": 493.22, "duration": 3.88}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 497.1, "duration": 3.92}, {"text": "with the help of these amazing people and our\nequally amazing graphics team, is Thought Cafe.", "start": 501.02, "duration": 4.66}]