[{"text": "Professor Dave here, let’s integrate trig\nfunctions.", "start": 0.4, "duration": 2.3}, {"text": "We now understand what indefinite integrals are, and we can evaluate them for simple polynomial functions.", "start": 9.86, "duration": 6.36}, {"text": "But as we know, there are many types of functions\nthat are more complicated than this, and we", "start": 16.28, "duration": 4.74}, {"text": "have to be able to integrate them too, so\nlet’s start with the trig functions that", "start": 21.029, "duration": 4.431}, {"text": "we learned in trigonometry.", "start": 25.46, "duration": 2.079}, {"text": "These are sine, cosine, tangent, cosecant,\nsecant, and cotangent.", "start": 27.539, "duration": 6.071}, {"text": "If you’ve forgotten what these are, go check\nout my trig tutorials to review, otherwise", "start": 33.61, "duration": 4.21}, {"text": "let’s get to integrating.", "start": 37.82, "duration": 2.259}, {"text": "The good news is that there are a few things\nthat we can simply memorize when it comes", "start": 40.079, "duration": 4.071}, {"text": "to integrating trig functions, and these will\nbecome ingrained over time and with practice.", "start": 44.15, "duration": 5.34}, {"text": "Let’s start with cosine x.", "start": 49.49, "duration": 2.56}, {"text": "Earlier, when we discussed differentiation\nof trig functions, we learned that the derivative", "start": 52.05, "duration": 5.16}, {"text": "of sine is cosine.", "start": 57.21, "duration": 1.93}, {"text": "If this doesn’t sound familiar, go and check\nout that tutorial now, because all of the", "start": 59.14, "duration": 4.27}, {"text": "derivatives of trig functions that we learned\nbefore will be used here, just in reverse.", "start": 63.41, "duration": 6.59}, {"text": "In other words, if the derivative of sine\nis cosine, then the integral of cosine must be sine.", "start": 70.0, "duration": 6.58}, {"text": "Whatever happens one way, the opposite thing\nhappens when we go the other way.", "start": 77.4, "duration": 5.14}, {"text": "And of course as with any indefinite integral,\nwe must add the constant, C. So the integral", "start": 82.54, "duration": 6.13}, {"text": "of cosine x is sine x plus C.", "start": 88.67, "duration": 6.01}, {"text": "We also know that the derivative of cosine\nis negative sine.", "start": 94.68, "duration": 3.57}, {"text": "So if we need to take the integral of sine\nx, let’s turn it into a form that lists", "start": 98.25, "duration": 4.92}, {"text": "a common derivative, simply by writing negative\nthe quantity negative sine x.", "start": 103.17, "duration": 4.94}, {"text": "Then we can pull this first negative outside\nof the integral, since negative one is a constant,", "start": 108.11, "duration": 5.58}, {"text": "and then integrating negative sine gives us cosine.", "start": 113.69, "duration": 5.05}, {"text": "So the integral of sine x is negative cosine\nx plus C. The derivative of tangent is secant", "start": 118.74, "duration": 10.21}, {"text": "squared, so if we have the integral of secant\nsquared x, that will be tangent x plus C.", "start": 128.95, "duration": 9.48}, {"text": "The derivative of cotangent is negative cosecant\nsquared, so if we see the integral of cosecant", "start": 138.43, "duration": 6.29}, {"text": "squared x, again we make this the double negative,\nbring one out of the integral, and we end", "start": 144.72, "duration": 6.02}, {"text": "up with negative cotangent x plus C. Then\nthere were the two weirder ones.", "start": 150.74, "duration": 9.41}, {"text": "The derivative of secant is secant tangent,\nso the integral of secant x tangent x will", "start": 160.15, "duration": 6.24}, {"text": "be secant x plus C. And then lastly, the derivative\nof cosecant is negative cosecant cotangent,", "start": 166.39, "duration": 11.29}, {"text": "so if we see the integral of cosecant x cotangent\nx, we do the double negative thing one more", "start": 177.68, "duration": 5.86}, {"text": "time, bring one of them outside, and we end\nup with negative cosecant x plus C. So the", "start": 183.54, "duration": 10.67}, {"text": "good news is that if we have the derivatives\nof the six trig functions memorized, we don’t", "start": 194.21, "duration": 5.12}, {"text": "really have to learn anything new, we just\nto have to recognize these common derivatives", "start": 199.33, "duration": 4.93}, {"text": "when we see them, and then to integrate, we\njust go backwards to the original function.", "start": 204.26, "duration": 5.9}, {"text": "Let’s put this to use.", "start": 210.16, "duration": 2.87}, {"text": "For example, how about the integral of ten\nx to the fourth minus two secant squared x.", "start": 213.03, "duration": 5.68}, {"text": "Let’s make things easy on ourselves and\nsplit this difference up into separate integrals.", "start": 218.71, "duration": 7.43}, {"text": "The first one is no problem, ten x to the\nfourth becomes ten x to the fifth over five,", "start": 226.14, "duration": 5.81}, {"text": "or two x to the fifth.", "start": 231.95, "duration": 4.06}, {"text": "Then for the other one, we can pull the two\nout here so that we aren’t distracted, and", "start": 236.01, "duration": 4.18}, {"text": "we can recall that secant squared is the derivative\nof tangent, so this can become minus two tangent", "start": 240.19, "duration": 6.54}, {"text": "x, and then finally we finish with plus C.\nNot too bad, right?", "start": 246.73, "duration": 7.16}, {"text": "Of course, sometimes the common derivative\nwon’t just be sitting there for you to spot.", "start": 253.89, "duration": 4.55}, {"text": "You may have to manipulate things a little bit.", "start": 258.44, "duration": 3.74}, {"text": "How about the integral of cosine x over sine squared x.", "start": 262.18, "duration": 4.1}, {"text": "Again, there is no product rule or quotient\nrule for integrating, so we can’t do anything with this.", "start": 266.28, "duration": 6.62}, {"text": "But when in doubt, just rewrite things in\nanother form, and see what happens.", "start": 272.9, "duration": 5.22}, {"text": "What if we write out sine squared as sine\ntimes sine.", "start": 278.12, "duration": 4.51}, {"text": "We could then split this into the product\nof two fractions, one over sine times cosine over sine.", "start": 282.63, "duration": 7.29}, {"text": "Then we could take one over sine and turn\nthat into cosecant, and we can also take cosine", "start": 290.78, "duration": 4.92}, {"text": "over sine and turn that into cotangent.", "start": 295.71, "duration": 4.11}, {"text": "Now we have cosecant x cotangent x, and that\nis one of the common derivatives we have memorized,", "start": 299.82, "duration": 6.21}, {"text": "so this will become negative cosecant x plus\nC. Let’s do just one more.", "start": 306.03, "duration": 7.46}, {"text": "How about sine squared x plus cosine squared\nx, over cosine squared x.", "start": 313.49, "duration": 5.73}, {"text": "Here, we are going to have to use one of our\ntrig identities to change things around.", "start": 319.22, "duration": 6.75}, {"text": "Well we know that sine squared plus cosine\nsquared equals one, so let’s make this one", "start": 325.97, "duration": 5.79}, {"text": "over cosine squared, which we know is the\nsame as secant squared.", "start": 331.76, "duration": 4.88}, {"text": "The integral of secant squared is tangent,\nso we get tangent x plus C.", "start": 336.64, "duration": 7.41}, {"text": "If you didn’t spot that, don’t worry.", "start": 344.05, "duration": 1.869}, {"text": "Even if you split this up into fractions to\nstart, getting sine squared over cosine squared", "start": 345.919, "duration": 5.711}, {"text": "plus cosine squared over cosine squared, that\nwill simplify to tangent squared plus one.", "start": 351.63, "duration": 6.18}, {"text": "And another one of the Pythagorean identities\ntells us that tangent squared plus one equals", "start": 357.81, "duration": 7.06}, {"text": "secant squared, so we would have ended up\nat the same answer anyway, assuming that we", "start": 364.87, "duration": 4.98}, {"text": "have our basic trig identities memorized.", "start": 369.85, "duration": 3.61}, {"text": "And if we find trig functions inside an integrand\nthat is a sum or difference, that won’t", "start": 373.46, "duration": 6.37}, {"text": "change things at all, we will just have to\nget used to splitting them up and applying", "start": 379.83, "duration": 4.29}, {"text": "the different rules we know depending on which\nterm we are looking at.", "start": 384.12, "duration": 4.9}, {"text": "Let’s check comprehension.", "start": 389.02, "duration": 1.46}]