[{"text": "Professor Dave here, let’s talk strategy.\nIn our journey through calculus, we started", "start": 0.44, "duration": 2.16}, {"text": "with differentiation because it’s quite\nsimple and straightforward. We learned the", "start": 9.44, "duration": 6.62}, {"text": "power rule to take the derivative of a polynomial,\nand then we learned the sum and difference", "start": 16.07, "duration": 4.8}, {"text": "rules, product and quotient rules, and then\nthe chain rule. From these, we found that", "start": 20.87, "duration": 5.44}, {"text": "we could take the derivative of just about\nanything, and even if it got a little messy,", "start": 26.31, "duration": 4.17}, {"text": "there was no question as to how to go about\ndoing it, we just have to do the work. Integration", "start": 30.48, "duration": 5.32}, {"text": "doesn’t work like this, unfortunately. There\nis no rigid algorithm to follow. We sometimes", "start": 35.8, "duration": 4.969}, {"text": "have to look at an integrand and come up with\na strategy for integration, and this strategy", "start": 40.769, "duration": 5.47}, {"text": "could involve one of the techniques we have\ndiscussed, or something different still. This", "start": 46.239, "duration": 5.292}, {"text": "is what makes integration so difficult, but\nalso so exciting. It’s like a sport. There", "start": 51.531, "duration": 5.639}, {"text": "is no guaranteed way to win, you just have\nto learn as many tips, tricks, and methods", "start": 57.17, "duration": 5.439}, {"text": "as you can, practice a lot, and over time\nyou will become more and more adept. If you", "start": 62.609, "duration": 5.461}, {"text": "haven’t watched my tutorials that go over\nthe substitution rule, integration by parts,", "start": 68.07, "duration": 4.98}, {"text": "and trigonometric substitution, go back a\nbit in the series and check those out now,", "start": 73.05, "duration": 5.18}, {"text": "as in this clip, we will assume that these\nmethods are already understood. If you’re", "start": 78.23, "duration": 4.8}, {"text": "all caught up, let’s go ahead and use this\nopportunity to synthesize everything we’ve", "start": 83.03, "duration": 4.7}, {"text": "learned about integration so far. We will\nlook at some examples where it’s not immediately", "start": 87.73, "duration": 4.75}, {"text": "obvious what approach will be the one to use,\nbut we will talk through the logic that should", "start": 92.48, "duration": 5.04}, {"text": "be employed in order to get to the answer.\nFirst things first, it will either be the", "start": 97.52, "duration": 5.75}, {"text": "case that you have access to a table of integration\nformulas, or we will have to memorize as many", "start": 103.27, "duration": 6.04}, {"text": "of them as possible. Either way, we will need\na table like this to refer to while determining", "start": 109.31, "duration": 6.69}, {"text": "a strategy for integration. In this table\nwe can see the formula that allows us to integrate", "start": 116.0, "duration": 5.75}, {"text": "each term in a polynomial, followed by all\nof the special formulas we should know. For", "start": 121.75, "duration": 6.03}, {"text": "example, we must recall that the integral\nof one over x is the natural log of x. Then", "start": 127.78, "duration": 6.39}, {"text": "there is one for an exponential function.\nThen all of the trigonometric functions. These", "start": 134.17, "duration": 6.371}, {"text": "are useful, because if we can get an integrand\nto look like something we see here, we will", "start": 140.541, "duration": 4.939}, {"text": "probably have an easy time integrating, but\nwe may need to do some substitution to get", "start": 145.48, "duration": 5.16}, {"text": "there. We will also want to memorize, or at\nleast be able to recognize, the formulas that", "start": 150.64, "duration": 5.75}, {"text": "allow us to perform integration by parts,\nas well as trigonometric substitution. Armed", "start": 156.39, "duration": 6.85}, {"text": "with all of this, let’s see what we can do.", "start": 163.24, "duration": 2.61}, {"text": "Alright, let’s give this first one a shot.\nHow about the integral of x over root (x squared", "start": 165.85, "duration": 6.61}, {"text": "plus four), dx. We immediately recognize that\nthis is too complicated to be integrated directly,", "start": 172.46, "duration": 7.41}, {"text": "so we need to use one of our techniques. With\nthis example, we will learn right away that", "start": 179.87, "duration": 5.97}, {"text": "sometimes, multiple techniques could be applied.\nWe could be tempted to use trigonometric substitution,", "start": 185.84, "duration": 7.119}, {"text": "noticing that this radical expression allows\nit. We absolutely can use this technique,", "start": 192.959, "duration": 5.64}, {"text": "however, we might also notice that direct\nsubstitution will be much easier, since we", "start": 198.599, "duration": 5.621}, {"text": "see that there is an expression for which\na form of its derivative is also present.", "start": 204.22, "duration": 6.17}, {"text": "If we take u to equal x squared plus four,\nthis part becomes root u, and then du will", "start": 210.39, "duration": 9.41}, {"text": "equal two x dx. We have x dx, so that’s\nno problem, we can just rearrange slightly", "start": 219.8, "duration": 6.79}, {"text": "to make x dx equal to du over two, plug that\nin, and we are left with du over two root", "start": 226.59, "duration": 7.92}, {"text": "u. If we modify slightly, we can pull one\nhalf out of the integral, change the root", "start": 234.51, "duration": 8.65}, {"text": "u in the denominator into u to the negative\none half, and now things look nice and easy.", "start": 243.16, "duration": 6.52}, {"text": "U to the negative one half becomes u to the\none half over one half, or two u to the one", "start": 249.68, "duration": 7.23}, {"text": "half, plus C. The twos cancel, u to the one\nhalf is simply root u, and we change u back", "start": 256.91, "duration": 8.41}, {"text": "to the other form. This leaves us with a nice\nand tidy answer, root x squared plus four,", "start": 265.32, "duration": 6.27}, {"text": "plus C. So as we just saw, there may be more\nthan one path to an answer, and it’s not", "start": 271.59, "duration": 7.81}, {"text": "a big deal if you end up taking a route with\na couple extra steps, provided you still arrive", "start": 279.4, "duration": 4.989}, {"text": "at the correct answer. And in fact, you can\nalways check that your answer is correct by", "start": 284.389, "duration": 5.56}, {"text": "taking its derivative and verifying that the\nresult is equivalent to the integrand, which", "start": 289.949, "duration": 5.841}, {"text": "means you can walk out at the end of your\nintegration exam already knowing that you", "start": 295.79, "duration": 4.68}, {"text": "got one hundred percent. But to summarize\nthe lesson learned from this example we just", "start": 300.47, "duration": 5.199}, {"text": "completed, we should carefully note that apart\nfrom basic situations where simplifying the", "start": 305.669, "duration": 5.391}, {"text": "integrand will allow it to be integrated,\nlike distributing something across a sum or", "start": 311.06, "duration": 4.73}, {"text": "difference, expressing roots as fractional\nexponents, or applying trig identities, it", "start": 315.79, "duration": 5.721}, {"text": "is the case that direct substitution will\nusually be the easiest technique if a special", "start": 321.511, "duration": 6.279}, {"text": "technique must be applied. So it may be a\ngood strategy to check if this is possible", "start": 327.79, "duration": 5.97}, {"text": "first, and only if it isn’t should you then\nsee which of the other two techniques might", "start": 333.76, "duration": 5.03}, {"text": "apply. How about this one, the integral of cotangent", "start": 338.79, "duration": 6.849}, {"text": "x times the natural log of sine x, dx. This\nis a product of functions, so integration", "start": 345.639, "duration": 6.891}, {"text": "by parts may come to mind, but remember, let’s\nfirst check to see if one of these functions", "start": 352.53, "duration": 5.479}, {"text": "is the derivative of the other. Cotangent\nis cosine over sine, that would require the", "start": 358.009, "duration": 6.631}, {"text": "quotient rule, maybe we could try that if\nwe get to that point, but how about the other", "start": 364.64, "duration": 5.18}, {"text": "function? This derivative will require the\nchain rule. The derivative of natural log", "start": 369.82, "duration": 5.77}, {"text": "of sine of x will involve the derivative of\nnatural log first, which is one over whatever", "start": 375.59, "duration": 6.43}, {"text": "it’s operating on, so we get one over sine\nx, then we multiply by the derivative of the", "start": 382.02, "duration": 5.56}, {"text": "inner function, and the derivative of sine\nis cosine, so we get cosine x over sine x.", "start": 387.58, "duration": 5.77}, {"text": "Well that is cotangent, so substitution should\nwork out perfectly here. We make LN sine x", "start": 393.35, "duration": 9.19}, {"text": "equal to u, and then we find that cotangent\nx dx is equal to du. That will give us u du,", "start": 402.54, "duration": 9.63}, {"text": "we integrate to get one half u squared, switch\nu back to what it was before, and then finish", "start": 412.17, "duration": 5.7}, {"text": "things off with plus C. Easier than you expected, I bet.", "start": 417.87, "duration": 5.49}, {"text": "Let’s try another. How about the integral\nof cosine root x dx. This seems like it could", "start": 423.36, "duration": 6.69}, {"text": "be straightforward, but it’s possible that\nno strategy jumps out at you immediately.", "start": 430.05, "duration": 5.06}, {"text": "When in doubt, try substitution. Here the\nmost obvious thing to do is to make u equal", "start": 435.11, "duration": 5.47}, {"text": "to root x, that way we no longer have a composite\nfunction. And if u will be root x, we need", "start": 440.58, "duration": 6.18}, {"text": "to get du. Well du over dx will be the derivative\nof x to the one half, and that’s one half", "start": 446.76, "duration": 7.61}, {"text": "times x to the one half minus one, or negative\none half. The negative means we put it on", "start": 454.37, "duration": 6.43}, {"text": "the bottom of a fraction, and one half means\nsquare root, so du over dx is one over two", "start": 460.8, "duration": 6.89}, {"text": "root x. Now normally, we would bring dx up\nhere, and then we would look for one over", "start": 467.69, "duration": 8.49}, {"text": "two root x, dx in the integrand, so that we\ncould replace it with du. That’s how the", "start": 476.18, "duration": 5.76}, {"text": "substitution method typically works. Unfortunately\nwe don’t see that in the integrand, but", "start": 481.94, "duration": 6.43}, {"text": "here’s another trick. If you’re trying\nsubstitution and you don’t see g prime x", "start": 488.37, "duration": 5.549}, {"text": "dx in the integrand, try solving for dx instead.\nHere, that will be two root x du, so let’s", "start": 493.919, "duration": 11.361}, {"text": "replace dx with this expression. It may be\nthe case that the terms with x in them cancel", "start": 505.28, "duration": 6.9}, {"text": "out any remaining x terms in the integrand,\nwhich will solve our problem, or failing that,", "start": 512.18, "duration": 6.12}, {"text": "they may be terms that can also be expressed\nin terms of u. In this case, u is root x,", "start": 518.3, "duration": 6.47}, {"text": "and we have a root x here, so why not just\nchange that to u instead? Now we can pull", "start": 524.77, "duration": 6.61}, {"text": "the two out, and we are left with the integral\nof cosine u times u du. This is something", "start": 531.38, "duration": 7.07}, {"text": "that can very easily be integrated by parts.\nSo let’s put a box around this to mark our", "start": 538.45, "duration": 5.82}, {"text": "progress, as we don’t want to get lost,\nand once we solve this integral we can come", "start": 544.27, "duration": 5.129}, {"text": "back to where we were. Now when we integrate\nby parts, we assign a u and a dv, and then", "start": 549.399, "duration": 7.051}, {"text": "find du and v. Here we have u’s already,\nso in order to avoid confusion, let’s change", "start": 556.45, "duration": 6.72}, {"text": "this to some other variable, like z. So now\nwe have cosine z times z dz. Now let’s integrate", "start": 563.17, "duration": 7.45}, {"text": "by parts. Remember, we pick a function for\nu that when in the form of du in the new integral,", "start": 570.62, "duration": 6.8}, {"text": "will make it much easier to integrate, so\nthat should definitely be z, because that", "start": 577.42, "duration": 5.25}, {"text": "will become one. So u equals z, and dv equals\ncosine z dz. That means du is simply dz, and", "start": 582.67, "duration": 11.229}, {"text": "v is sine z, since sine is the integral of\ncosine. Now we use the formula. The first", "start": 593.899, "duration": 6.801}, {"text": "integral is equal to uv, which is z sine z,\nminus the integral of v du, which is sine", "start": 600.7, "duration": 9.0}, {"text": "z dz. The integral of sine is negative cosine,\nso the negatives cancel, leaving us with z", "start": 609.7, "duration": 9.91}, {"text": "sine z plus cosine z, plus C. Now that we\nare all done with the integration, we are", "start": 619.61, "duration": 6.84}, {"text": "safe to return the z’s back to u’s, because\nwe only changed them so that we could use", "start": 626.45, "duration": 5.6}, {"text": "the integration by parts method without confusion,\nso that’s now u sine u plus cosine u, plus", "start": 632.05, "duration": 6.22}, {"text": "C. Let’s also recall that when we did the\noriginal substitution, we arrived at two times", "start": 638.27, "duration": 8.54}, {"text": "this integral, which we then integrated by\nparts, so we have to bring back the two now,", "start": 646.81, "duration": 5.92}, {"text": "since we are done integrating. Now we just\nremember that we initially used u to represent", "start": 652.73, "duration": 5.72}, {"text": "root x, so let’s bring back root x, and\nwe get two times this quantity. Then we just", "start": 658.45, "duration": 7.91}, {"text": "distribute to get two root x sine root x,\nplus two cosine root x, plus C. So that may", "start": 666.36, "duration": 9.0}, {"text": "seem like it was terribly complicated in retrospect,\nand our answer does look far more complex", "start": 675.36, "duration": 5.789}, {"text": "than the integrand, but that’s the answer,\nand all we really did to get there was a simple", "start": 681.149, "duration": 5.731}, {"text": "substitution, followed by integration by parts.\nSo let’s take a breathe here. We’ve seen", "start": 686.88, "duration": 6.78}, {"text": "that sometimes it’s best to just try a substitution\nand see what happens. It may go as planned,", "start": 693.66, "duration": 6.54}, {"text": "or we may get to something else that can be\nintegrated by parts. This is because integration", "start": 700.2, "duration": 5.03}, {"text": "by parts requires a product of functions in\nthe integrand, and this approach works best", "start": 705.23, "duration": 5.669}, {"text": "when one function is a power of x, or a polynomial,\nand the other is some transcendental function,", "start": 710.899, "duration": 6.271}, {"text": "like a trig function, or an exponential or\nlogarithmic function, and we can assign u", "start": 717.17, "duration": 5.18}, {"text": "and dv according to the strategy we described\nwhen we learned this technique. Sometimes,", "start": 722.35, "duration": 6.95}, {"text": "as we just saw, we need to do some kind of\nsubstitution first in order to get things", "start": 729.3, "duration": 5.21}, {"text": "to a place where integrating by parts makes\nsense, and if that’s the case, then that’s", "start": 734.51, "duration": 5.38}, {"text": "just what we have to do. Sometimes the substitution\nisn’t obvious, so just try something. If", "start": 739.89, "duration": 6.711}, {"text": "it doesn’t work, try something else. Unfortunately\nthere will indeed be cases when even these", "start": 746.601, "duration": 5.449}, {"text": "techniques don’t apply, and if so, we have\nto be clever and try something else. Sometimes", "start": 752.05, "duration": 5.301}, {"text": "we have to manipulate the integrand in particular\nway. Take something like the integral of dx", "start": 757.351, "duration": 6.108}, {"text": "over one minus cosine x. None of our techniques\nwill work here. But with a difference in the", "start": 763.459, "duration": 6.431}, {"text": "denominator, we might be able to think of\nsomething else to try. We know that we can", "start": 769.89, "duration": 5.23}, {"text": "simplify a sum or difference in the denominator\nof a fraction by multiplying by its conjugate.", "start": 775.12, "duration": 6.31}, {"text": "So what if we multiply by one plus cosine\nx over one plus cosine x? Remember that this", "start": 781.43, "duration": 5.62}, {"text": "is useful because then on the bottom when\nwe foil, we get one plus cosine minus cosine", "start": 787.05, "duration": 6.27}, {"text": "minus cosine squared, so the cosine terms\ncancel. With squared trig functions, an identity", "start": 793.32, "duration": 9.25}, {"text": "can usually be used, and in fact one minus\ncosine squared is indeed sine squared. This", "start": 802.57, "duration": 8.191}, {"text": "was useful because with a single term in the\ndenominator, we can now split this up into", "start": 810.761, "duration": 4.889}, {"text": "simpler fractions. One over sine squared is\ncosecant squared, and the other fraction can", "start": 815.65, "duration": 8.68}, {"text": "remain as cosine over sine squared. This can\nbe split up into two integrals, the first", "start": 824.33, "duration": 6.09}, {"text": "of which is easy to integrate, because cosecant\nsquared simply becomes negative cotangent.", "start": 830.42, "duration": 8.24}, {"text": "Then with the other one, it is fairly easy\nto spot that substitution will be our best", "start": 838.66, "duration": 4.55}, {"text": "approach. If we put u in place of sine x,\nwe get u squared on the bottom, and du will", "start": 843.21, "duration": 6.39}, {"text": "be cosine x dx, which we have here, so du\nover u squared, or u to the negative two du.", "start": 849.6, "duration": 10.34}, {"text": "This becomes negative one over u, or negative\none over sine x, which is cosecant x, so we", "start": 859.94, "duration": 8.16}, {"text": "end up with negative cotangent x minus cosecant\nx plus C.", "start": 868.1, "duration": 8.76}, {"text": "We have learned a lot about integration over\nthe past few tutorials. We learned what it", "start": 876.86, "duration": 4.539}, {"text": "means, how to do it, and a few tricks for\nwhen it becomes more complicated. Sometimes", "start": 881.399, "duration": 5.272}, {"text": "we have to substitute twice, sometimes we\nhave to substitute and then integrate by parts,", "start": 886.671, "duration": 5.348}, {"text": "or vice versa. With practice, you will only\nbecome better and better at the art of integration,", "start": 892.019, "duration": 6.021}, {"text": "and you will be able to apply ingenuity to\nfigure out an appropriate strategy, allowing", "start": 898.04, "duration": 4.82}, {"text": "you to integrate expressions you’ve never\neven seen before. We will now be moving on", "start": 902.86, "duration": 4.52}, {"text": "to other concepts involving integration, but\nfirst, let’s check comprehension.", "start": 907.38, "duration": 4.02}]