[{"text": "Wherever you are right now, there’s probably\nan electrical outlet within easy reach.", "start": 3.06, "duration": 3.58}, {"text": "Whether you want to vacuum the living room or recharge your phone, all you have to do is plug into the wall, and bam – instant access to electricity.", "start": 6.64, "duration": 7.12}, {"text": "But have you ever wondered how all of that electrical power gets to your house, school, or office in the first place?", "start": 13.76, "duration": 5.74}, {"text": "There are a lot of steps, but two of the most important ones involve electric generators and transformers.", "start": 19.5, "duration": 5.12}, {"text": "And both of these devices work because of\na concept we introduced last time: induction.", "start": 24.62, "duration": 4.64}, {"text": "[Theme Music]", "start": 29.26, "duration": 12.82}, {"text": "Electric generators are like the opposite\nof electric motors.", "start": 42.08, "duration": 3.2}, {"text": "Motors take electrical energy – so, the current running through a coil of wire – and convert it into mechanical energy as the motor turns.", "start": 45.28, "duration": 6.74}, {"text": "Generators, on the other hand, take mechanical energy – the rotation of a coil of wire – and use induction to convert it into electrical energy, in the form of a current running through a wire.", "start": 52.02, "duration": 8.68}, {"text": "Generators use a wire wound around something called an armature – basically, a cylinder that rotates within a uniform magnetic field.", "start": 60.7, "duration": 6.56}, {"text": "As the loop rotates, the changing magnetic\nflux induces a current in the loops of the coil.", "start": 67.26, "duration": 4.68}, {"text": "But the angle that the coil makes with respect to the magnetic field keeps changing, which causes the direction of the induced current to reverse itself at every half-turn.", "start": 71.94, "duration": 7.68}, {"text": "So the magnetic field in the generator stays\nconstant.", "start": 79.63, "duration": 2.519}, {"text": "But because the coil is rotating, the angle\nbetween the coil and the magnetic field changes.", "start": 82.149, "duration": 4.391}, {"text": "This means that the magnetic flux through the loops in the coil changes over time, which is what induces an emf.", "start": 86.54, "duration": 5.28}, {"text": "And as we’ll soon see, the emf depends on the sine of the angle between the coil and the magnetic field.", "start": 91.82, "duration": 5.52}, {"text": "So for half of the rotation, the sine of the angle is positive, and for the other half, the sine of the angle is negative.", "start": 97.34, "duration": 5.48}, {"text": "When it’s positive, the current flows in\none direction.", "start": 102.829, "duration": 2.551}, {"text": "When it’s negative, it flows in the other.", "start": 105.38, "duration": 2.22}, {"text": "This means that the direction of the current\nflips with every half-rotation.", "start": 107.6, "duration": 3.469}, {"text": "This produces a type of flow of electricity\nknown as alternating current, or AC.", "start": 111.069, "duration": 4.22}, {"text": "Until now, we’ve mainly been talking about\nDC, or direct current.", "start": 115.289, "duration": 3.62}, {"text": "There are DC generators, which include special parts to make the current keep flowing in the same direction the whole time, instead of reversing itself as the coil turns.", "start": 118.909, "duration": 7.71}, {"text": "But AC power is the kind that flows from the\noutlets in your walls.", "start": 126.619, "duration": 3.18}, {"text": "And in most places in the world, it reverses\nitself either 50 or 60 times per second.", "start": 129.8, "duration": 3.98}, {"text": "This is called the frequency of the current,\nand you’ll normally see it written in hertz.", "start": 133.78, "duration": 3.86}, {"text": "Now, we can calculate the strength of the emf in a generator using some of the principles we talked about last time.", "start": 137.64, "duration": 4.88}, {"text": "We’ve already described what happens when you move a loop of wire in or out of a magnetic field:", "start": 142.52, "duration": 4.26}, {"text": "The emf induced in the wire is equal to the strength of the magnetic field, times the length of the loop, times its perpendicular velocity.", "start": 146.78, "duration": 7.04}, {"text": "In other words, it’s the velocity times the sine of the angle between the magnetic field and the loop.", "start": 153.82, "duration": 5.2}, {"text": "And the same idea applies to a coil of wire\nrotating in a magnetic field, too.", "start": 159.02, "duration": 3.84}, {"text": "We just have to replace some of the variables\nwith ones that apply to a rotating coil.", "start": 162.86, "duration": 3.86}, {"text": "First, instead of the length of the loop,\nwe’ll use the area of one loop of the coil, A.", "start": 166.72, "duration": 4.6}, {"text": "And instead of translational velocity, we’ll\nuse angular velocity, ω.", "start": 171.32, "duration": 4.04}, {"text": "Next, the angle, theta, is just equal to the\nangular velocity multiplied by time.", "start": 175.36, "duration": 4.2}, {"text": "And finally, instead of finding the emf in just one loop of wire, we’re finding the emf in a whole coil of wire.", "start": 179.56, "duration": 6.14}, {"text": "Which means that we need to multiply this\nequation by N, the number of loops in the coil.", "start": 185.7, "duration": 4.44}, {"text": "So, the emf induced in a coil rotating in a magnetic field is equal to the number of loops in the coil, times the strength of the magnetic field,", "start": 190.14, "duration": 7.94}, {"text": "times the area of a loop of the coil, times the angular velocity, times the sine of the angular velocity multiplied by time.", "start": 198.08, "duration": 6.74}, {"text": "It’s a bit of a mouthful, but that’s because there are so many factors that affect the emf induced in the coil.", "start": 204.82, "duration": 4.78}, {"text": "Basically, the equation is saying that you’ll have a greater induced current in the generator if there are more coils in the wire, or if there’s a stronger magnetic field,", "start": 209.6, "duration": 7.76}, {"text": "or if each loop of the coil is bigger,\nor if it rotates faster.", "start": 217.36, "duration": 3.5}, {"text": "Now, it might seem kind of strange to have a generator produce a current that reverses itself dozens of times a second.", "start": 220.86, "duration": 5.58}, {"text": "But actually, this is incredibly useful.", "start": 226.44, "duration": 2.46}, {"text": "That’s because another important device that gets electricity from the power plant to your house is a transformer, which is made up of two coils of wire.", "start": 228.9, "duration": 7.5}, {"text": "And transformers only work with AC power.", "start": 236.4, "duration": 2.46}, {"text": "They’re necessary because one of the problems with transmitting electricity over long distances is that, if the voltage is low, a lot of power gets wasted as heat.", "start": 238.86, "duration": 7.9}, {"text": "We’re talking like 80% in some cases.", "start": 246.76, "duration": 2.46}, {"text": "Which is a huge waste of energy!", "start": 249.22, "duration": 1.65}, {"text": "When electricity is transmitted at higher voltages,\nthough, much less power gets wasted as heat.", "start": 250.87, "duration": 4.61}, {"text": "That’s because, for the same power, a lower voltage translates to a higher current, and power loss increases proportionally to the square of the current.", "start": 255.48, "duration": 8.0}, {"text": "In other words, if you double the voltage, you end up with only a quarter the power loss you had before.", "start": 263.48, "duration": 4.3}, {"text": "And if you triple the voltage, you get a ninth\nof the power loss.", "start": 267.78, "duration": 2.6}, {"text": "So it’s worth transmitting electricity at\nvery high voltages.", "start": 270.38, "duration": 3.28}, {"text": "But then you need a way to change the voltage\nof the electricity running through the lines", "start": 273.66, "duration": 3.71}, {"text": "– from its original voltage from the generator,\nwhich could be around 12,000 volts;", "start": 277.37, "duration": 4.46}, {"text": "then up to a very high voltage as it travels long\ndistances, which might be as high as 240,000 volts.", "start": 281.83, "duration": 6.01}, {"text": "That’s definitely not safe to use in your\nhousehold appliances.", "start": 287.84, "duration": 2.74}, {"text": "So once the electricity gets to where it needs\nto go, you need to lower its voltage again.", "start": 290.58, "duration": 4.26}, {"text": "In the US, the power coming out of your wall is\n110 volts, and in most other places it’s 220 volts.", "start": 294.84, "duration": 6.02}, {"text": "All those voltage changes are made using transformers, which take advantage of something called mutual inductance, where a change in the current in one coil leads to a change in emf in another, nearby coil.", "start": 300.86, "duration": 9.82}, {"text": "And emf is the same thing as voltage.", "start": 310.68, "duration": 1.98}, {"text": "This change happens because the changing current\nin the first coil produces a changing magnetic field.", "start": 312.66, "duration": 4.98}, {"text": "So the magnetic flux through the second coil\nchanges, which induces an emf.", "start": 317.64, "duration": 3.84}, {"text": "And the emf induced in the second coil will be equal to the change in current in the first coil, divided by the change in time, and multiplied by a constant, M.", "start": 321.48, "duration": 7.66}, {"text": "M depends on things like the size and shape of the coils, and how they’re positioned relative to each other.", "start": 329.14, "duration": 4.3}, {"text": "This works in the opposite direction, too:", "start": 333.44, "duration": 2.14}, {"text": "a change in current in the second coil will\ninduce a corresponding emf in the first coil.", "start": 335.59, "duration": 4.26}, {"text": "In transformers, the power running through the first coil is AC, which means the current and the magnetic field it produces are constantly changing.", "start": 339.85, "duration": 6.79}, {"text": "So an emf is induced in the second coil.", "start": 346.64, "duration": 2.08}, {"text": "But if the second coil has more turns than the first,\nit’ll have a higher voltage, and vice versa.", "start": 348.72, "duration": 5.02}, {"text": "Here’s why:", "start": 353.74, "duration": 0.9}, {"text": "Faraday’s law, which we talked about last time, says that the emf – or voltage – in each coil is equal to the number of loops in the coil, times the change in magnetic flux over time.", "start": 354.64, "duration": 8.4}, {"text": "We can write this out as an equation for each coil separately, using a subscript P for the primary coil and a subscript S for the secondary coil.", "start": 363.04, "duration": 7.04}, {"text": "Now, we want to know how the voltage in the secondary coil compares to the voltage of the primary one.", "start": 370.08, "duration": 4.18}, {"text": "To find out, we divide the voltage in the secondary\ncoil by the voltage in the primary coil.", "start": 374.26, "duration": 4.3}, {"text": "The change in magnetic flux over time cancels out,\nwhich leaves us with a simple but useful equation:", "start": 378.56, "duration": 4.82}, {"text": "The voltage in the secondary coil divided by the voltage in the primary coil is equal to the number of loops in the secondary coil divided by the number of loops in the primary coil.", "start": 383.4, "duration": 7.58}, {"text": "So if the secondary coil has twice as many loops as the primary coil, it’ll have twice as much voltage.", "start": 390.98, "duration": 5.04}, {"text": "And if it has triple the loops, it’ll have\ntriple the voltage, and so on.", "start": 396.02, "duration": 3.25}, {"text": "If the secondary coil has more loops than the primary coil, so that it increases the voltage, that’s called a step-up transformer.", "start": 399.27, "duration": 6.87}, {"text": "And if it has fewer loops than the primary coil, so it decreases the voltage, that’s a step-down transformer.", "start": 406.14, "duration": 5.46}, {"text": "As the electricity in power lines travels from the power plant to your house, it goes through lots of step-up and step-down transformers.", "start": 411.6, "duration": 6.87}, {"text": "If you’ve ever seen a Tesla coil in action –\nthat’s just a fancy version of a step-up transformer.", "start": 418.48, "duration": 4.56}, {"text": "The secondary coil is designed so that it shoots out bursts of electricity that look like lightning bolts.", "start": 423.04, "duration": 4.7}, {"text": "Mutual inductance is also used in lots of other things, too – like wireless chargers, for example.", "start": 427.74, "duration": 4.84}, {"text": "Lots of cell phones have a wireless charging feature, where you just put the phone on top of a charging pad and it charges.", "start": 432.58, "duration": 5.44}, {"text": "No need to plug anything in.", "start": 438.02, "duration": 1.3}, {"text": "It works because there’s a coil inside the charging\npad, and another one inside your phone.", "start": 439.32, "duration": 4.26}, {"text": "The AC power running through the charging pad induces an emf in your phone’s coil, which can use the energy to charge its battery.", "start": 443.58, "duration": 6.4}, {"text": "So the same technology that helps get electricity to the outlets in your wall can move power from one device to another – even if there are no physical connections between them.", "start": 449.98, "duration": 8.46}, {"text": "Today, you learned about how electricity is\nproduced and transmitted.", "start": 458.449, "duration": 3.18}, {"text": "We explained how electric generators work,\nand derived the generator equation.", "start": 461.629, "duration": 4.071}, {"text": "We also talked about transformers, and how\nthey use mutual inductance to change voltage.", "start": 465.7, "duration": 4.3}, {"text": "Finally, we described how mutual inductance\nis used in wireless chargers.", "start": 470.009, "duration": 4.051}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 474.06, "duration": 3.82}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 477.88, "duration": 3.9}, {"text": "The Art Assignment, Blank on Blank, and Braincraft.", "start": 481.78, "duration": 2.539}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 484.319, "duration": 4.121}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 488.44, "duration": 4.62}]