[{"text": "Professor Dave here, let’s take some derivatives.", "start": 0.54, "duration": 2.26}, {"text": "In the previous tutorial, we made the connection", "start": 9.82, "duration": 2.12}, {"text": "between the concept of differentiation, and\nthe act of taking the derivative of a function,", "start": 11.94, "duration": 6.079}, {"text": "and we even derived the power rule. Being\nable to connect all of these concepts will", "start": 18.019, "duration": 5.83}, {"text": "give us a dramatically enhanced understanding\nof what it is to do calculus, and why we need", "start": 23.849, "duration": 6.211}, {"text": "to do it. But the fact of the matter is, there\nare times where we simply have to know an", "start": 30.06, "duration": 5.299}, {"text": "algorithm, and be able to use it to get correct\nanswers. So whether or not the previous tutorials", "start": 35.359, "duration": 5.86}, {"text": "were of help to you, it’s now time to practice\nusing the power rule to take the derivative", "start": 41.219, "duration": 5.89}, {"text": "of various polynomial functions, something\nthat every calculus student will absolutely", "start": 47.109, "duration": 5.951}, {"text": "have to be able to do.\nAs we said, the power rule tells us that in", "start": 53.06, "duration": 5.51}, {"text": "order to take the derivative of some function\ninvolving a positive integer exponent, we", "start": 58.57, "duration": 5.45}, {"text": "just pull the exponent down to become a coefficient,\nand then reduce the exponent by one. So the", "start": 64.02, "duration": 7.56}, {"text": "derivative of x squared is two times x to\nthe one, or simply two x. At this point, let’s", "start": 71.58, "duration": 8.38}, {"text": "introduce another type of notation. When we\nwrite d over dx, this notation implies differentiation.", "start": 79.96, "duration": 8.54}, {"text": "It means that we are differentiating something\nwith respect to x, which is the same thing", "start": 88.5, "duration": 5.56}, {"text": "as taking the derivative of something, so\njust as f prime of x means the derivative", "start": 94.06, "duration": 6.33}, {"text": "of f of x, d over dx followed by some function\nmeans to take the derivative of that function", "start": 100.39, "duration": 7.15}, {"text": "with respect to x. So in short, f prime of\nx is completely identical to d over dx, f", "start": 107.54, "duration": 8.49}, {"text": "of x. Sometimes we will use one notation,\nsometimes we will use the other. With that", "start": 116.03, "duration": 6.72}, {"text": "understood, let’s take the derivative of\nsome more polynomials. Again, using the power", "start": 122.75, "duration": 6.38}, {"text": "rule, the derivative of x cubed is three x\nsquared. The derivative of x to the fourth", "start": 129.13, "duration": 6.83}, {"text": "is four x cubed. This pattern will continue\nfor any exponent. Now let’s take the derivative", "start": 135.96, "duration": 7.78}, {"text": "of three x to the fourth. As we are bringing\nthis four down here, we must multiply by the", "start": 143.74, "duration": 6.31}, {"text": "three that is already there, so we get twelve\nx cubed. Another way of explaining this is", "start": 150.05, "duration": 6.51}, {"text": "by mentioning the constant multiple rule,\nwhich says that the quantity (CF) prime equals", "start": 156.56, "duration": 7.11}, {"text": "c times f prime. If we are taking the derivative\nof some function that is being multiplied", "start": 163.67, "duration": 6.399}, {"text": "by some constant, this will be the same as\nmultiplying the constant times the derivative", "start": 170.069, "duration": 6.061}, {"text": "of the function, so we can just pull the constant\nout here. Using this to look at the previous", "start": 176.13, "duration": 6.94}, {"text": "example, the derivative of three x to the\nfourth, we can pull the three out, take the", "start": 183.07, "duration": 6.35}, {"text": "derivative of x to the fourth to get four\nx cubed, and then we simply multiply by the", "start": 189.42, "duration": 5.43}, {"text": "three that we pulled out before, and we get\nthe same answer that we already had. So however", "start": 194.85, "duration": 7.03}, {"text": "we think about it, when taking a derivative,\nthe exponent that we pull down front must", "start": 201.88, "duration": 5.73}, {"text": "multiply any existing coefficient.\nNow what about polynomials with multiple terms?", "start": 207.61, "duration": 6.959}, {"text": "Actually, this will be no problem, due to\nthe sum rule. This says that the derivative", "start": 214.569, "duration": 5.25}, {"text": "of the quantity f of x plus g of x, will be\nequal to the derivative of f of x plus the", "start": 219.819, "duration": 6.571}, {"text": "derivative of g of x, or more simply, (f plus\ng) quantity prime equals f prime plus g prime.", "start": 226.39, "duration": 7.86}, {"text": "Similarly, there is the difference rule, which\nworks just like the sum rule, stating that", "start": 234.25, "duration": 4.91}, {"text": "(f minus g) quantity prime equals f prime\nminus g prime. That means that no matter how", "start": 239.16, "duration": 6.94}, {"text": "many terms are in a polynomial, we will just\ntake the derivative of one term at a time.", "start": 246.1, "duration": 5.96}, {"text": "So for (x to the sixth) plus (two x to the\nfourth) minus (three x squared) plus two,", "start": 252.06, "duration": 6.849}, {"text": "we can just go from left to right to get (six\nx to the fifth) plus (eight x cubed) minus", "start": 258.909, "duration": 9.141}, {"text": "(six x). Don’t forget that the two will\ngo away as it’s a constant. So as long as", "start": 268.05, "duration": 7.72}, {"text": "we know the power rule, taking the derivative\nof any polynomial in standard form is actually", "start": 275.77, "duration": 5.92}, {"text": "quite trivial. Let’s try just one more for\npractice. Try (x to the eighth) minus (five", "start": 281.69, "duration": 8.34}, {"text": "x to the fifth) plus (eleven x cubed) minus\n(two x). Again, moving left to right, we get", "start": 290.03, "duration": 7.62}, {"text": "(eight x to the seventh) minus (twenty five\nx to the fourth) plus (thirty three x squared)", "start": 297.65, "duration": 7.78}, {"text": "minus two.\nNow with the power rule under our belts, let’s", "start": 305.43, "duration": 7.609}, {"text": "try something a little trickier. What about\nthe derivative of a product of functions?", "start": 313.039, "duration": 6.171}, {"text": "Unfortunately, this is not as simple as just\nthe product of the two derivatives. Inotherwords,", "start": 319.21, "duration": 6.12}, {"text": "fg quantity prime is not equal to f prime\ntimes g prime. Instead, we have to use the", "start": 325.33, "duration": 7.259}, {"text": "product rule. This says that the derivative\nof f of x times g of x is equal to (f of x)", "start": 332.589, "duration": 7.36}, {"text": "times (g prime of x) plus (g of x) times (f\nprime of x), or more simply, fg quantity prime", "start": 339.949, "duration": 8.421}, {"text": "equals f, g prime, plus g, f prime. We can\neven verify that this works by looking at", "start": 348.37, "duration": 8.4}, {"text": "x squared. We know the derivative is two x,\nbut say we turn this into x times x, and apply", "start": 356.77, "duration": 7.91}, {"text": "the product rule. X times the derivative of\nx is simply x, and the derivative of x, times", "start": 364.68, "duration": 8.049}, {"text": "x, is also x, so we add them together to get\ntwo x, and we can see that this works just", "start": 372.729, "duration": 7.49}, {"text": "as expected. Let’s try this with some other\nfunctions. What is the derivative of (x cubed)", "start": 380.219, "duration": 7.22}, {"text": "times (two x)? Well first, let’s leave the\nfirst function alone and take the derivative", "start": 387.439, "duration": 5.48}, {"text": "of the second. The derivative of two x is\ntwo, so we get two x cubed. Now, let’s take", "start": 392.919, "duration": 8.732}, {"text": "the derivative of the first function and leave\nthe second one alone. That will be three x", "start": 401.651, "duration": 5.358}, {"text": "squared, times the two x that we didn’t\ntouch, and that will be six x cubed. Adding", "start": 407.009, "duration": 6.91}, {"text": "them up, we get eight x cubed. As we can see,\nthis is not simply the product of the derivatives", "start": 413.919, "duration": 6.791}, {"text": "of each function, we had to use the product\nrule, and if we had simply multiplied these", "start": 420.71, "duration": 5.799}, {"text": "two original terms together to get two x to\nthe fourth, the power rule would have given", "start": 426.509, "duration": 5.36}, {"text": "us the same result, eight x cubed. Let’s\ntry one more. Find the derivative of three", "start": 431.869, "duration": 8.25}, {"text": "x to the fourth times five x squared. We can\nuse precisely the same algorithm every time,", "start": 440.119, "duration": 7.101}, {"text": "so let’s leave the first function alone,\nand take the derivative of the second to get", "start": 447.22, "duration": 4.619}, {"text": "ten x, which gives a product of thirty x to\nthe fifth. Then we take the derivative of", "start": 451.839, "duration": 6.741}, {"text": "the first to get twelve x cubed, and leave\nthe second function alone, which then multiply", "start": 458.58, "duration": 5.579}, {"text": "to give sixty x to the fifth. Adding them\ntogether, we get ninety x to the fifth. Again,", "start": 464.159, "duration": 8.0}, {"text": "this agrees with the answer we would get if\nwe were to multiply the original terms together", "start": 472.159, "duration": 4.57}, {"text": "and use the power rule. Later, we will see\nplenty of functions where we can’t just", "start": 476.729, "duration": 6.74}, {"text": "multiply these terms together, making the\nproduct rule absolutely necessary. So as long", "start": 483.469, "duration": 6.45}, {"text": "as we can memorize the product rule, which\nis fairly simple, it’s just a matter of", "start": 489.919, "duration": 4.28}, {"text": "taking a couple of simple derivatives, followed\nby some multiplication and addition.", "start": 494.199, "duration": 6.37}, {"text": "Lastly, what about the derivative of a quotient\nof functions? Say we want to find the derivative", "start": 500.569, "duration": 6.09}, {"text": "of f of x over g of x. To do this, we need\nthe quotient rule, and unfortunately, this", "start": 506.659, "duration": 6.841}, {"text": "is not an exact parallel of the product rule.\nThis is a different rule that should also", "start": 513.5, "duration": 5.089}, {"text": "be memorized. To find the derivative of f\nof x over g of x, we find (g of x) times (f", "start": 518.589, "duration": 6.701}, {"text": "prime of x), minus (f of x) times (g prime\nof x), and all of that will be over g of x", "start": 525.29, "duration": 6.98}, {"text": "quantity squared. Again, more simply, f over\ng quantity prime equals g f prime minus f", "start": 532.27, "duration": 9.47}, {"text": "g prime all over g squared. Make note that\nfor the product rule, the order of the terms", "start": 541.74, "duration": 6.92}, {"text": "didn’t matter, since it involved a sum,\nbut for the quotient rule it will matter.", "start": 548.66, "duration": 5.48}, {"text": "It must be g times f prime minus f times g\nprime. If you switch this, you will get incorrect", "start": 554.14, "duration": 7.49}, {"text": "answers, and we also can’t forget the g\nof x quantity squared on the bottom. Don’t", "start": 561.63, "duration": 6.37}, {"text": "worry, you will memorize this quite easily.\nLet’s try an example. What about the derivative", "start": 568.0, "duration": 6.579}, {"text": "of (x squared plus 1) over (x plus two)? First\nlet’s set up the expression, making sure", "start": 574.579, "duration": 7.01}, {"text": "to put everything in the correct place. Then\nlet’s evaluate these two derivatives. For", "start": 581.589, "duration": 8.191}, {"text": "the first, we get two x, and for the other\nwe get one. Now we can multiply these terms,", "start": 589.78, "duration": 8.69}, {"text": "distribute this negative sign and simplify,\nand expand the denominator if we wish, to", "start": 598.47, "duration": 8.4}, {"text": "get (x squared plus four x minus one) over\n(x squared plus four x plus four), which can", "start": 606.87, "duration": 6.649}, {"text": "be left as is.\nSo these are the basic algorithms we will", "start": 613.519, "duration": 5.541}, {"text": "use in order to take the derivatives of functions.\nWe will expand on them as we go, finding that", "start": 619.06, "duration": 6.27}, {"text": "when using the power rule, this exponent can\nbe a negative integer, or even a non-integer,", "start": 625.33, "duration": 6.02}, {"text": "but the rules don’t really change, and even\nwhen products or quotients get more complicated,", "start": 631.35, "duration": 4.69}, {"text": "it’s not really any harder, just more steps,\nand therefore more opportunities to make a", "start": 636.04, "duration": 5.88}, {"text": "mistake. But if we practice and become diligent,\nwe will find that it’s not too difficult", "start": 641.92, "duration": 4.93}, {"text": "to take the derivative of any polynomial.\nLet’s check comprehension.", "start": 646.85, "duration": 4.03}]