[{"text": "This episode of Crash Course Physics is sponsored by Audible.", "start": 3.02, "duration": 3.499}, {"text": "I think fluids are fascinating and awesome.", "start": 6.519, "duration": 2.35}, {"text": "Because they happen to be my area of expertise\nas an engineer, in fluid dynamics.", "start": 8.869, "duration": 3.93}, {"text": "But it’s not just me who’s intrigued by\nhow things flow.", "start": 12.799, "duration": 3.37}, {"text": "Legend has it that a man once ran naked through\nthe streets because he was so excited about", "start": 16.169, "duration": 4.32}, {"text": "discovering an important property of fluids.", "start": 20.489, "duration": 2.131}, {"text": "Now, I’ve never quite gone that \nfar...", "start": 22.62, "duration": 1.78}, {"text": "But still, an understanding of fluids is incredibly\nuseful.", "start": 24.41, "duration": 3.5}, {"text": "Because anything that flows -- liquid or gas\n-- is a fluid.", "start": 27.91, "duration": 2.93}, {"text": "So, water counts, but so does air, and so\ndoes corn syrup.", "start": 30.84, "duration": 3.56}, {"text": "Using their knowledge of fluids, physicists and engineers can design things like", "start": 34.4, "duration": 3.14}, {"text": "pressure sensors, hydraulic pumps, and even airplanes.", "start": 37.54, "duration": 3.46}, {"text": "But first, let’s start with the basics:\nthe physics of fluids, at rest.", "start": 41.0, "duration": 4.42}, {"text": "[Theme Music]", "start": 45.42, "duration": 12.46}, {"text": "Until now, we’ve often described the physics\nof objects based on their mass.", "start": 57.89, "duration": 4.03}, {"text": "But when it comes to fluids, we mostly use\na different quality:", "start": 61.92, "duration": 3.42}, {"text": "density, represented in equations\nby the greek letter rho.", "start": 65.34, "duration": 3.34}, {"text": "You’re probably familiar with density:", "start": 68.68, "duration": 1.74}, {"text": "it’s mass, divided by volume, and measured in kilograms per meters cubed.", "start": 70.42, "duration": 3.76}, {"text": "If an object -- or a fluid -- is made of heavier\natoms or molecules, or those particles are", "start": 74.189, "duration": 4.191}, {"text": "packed more closely together, then it’s\ngoing to have a higher density.", "start": 78.38, "duration": 3.329}, {"text": "And there’s another important quality of fluids, one that scuba divers and mountain climbers think about a lot: pressure.", "start": 81.709, "duration": 6.151}, {"text": "In our last episode, we defined pressure as\napplied force, divided by area.", "start": 87.869, "duration": 3.93}, {"text": "It’s measured in units of Newtons per meters\nsquared, known as Pascals.", "start": 91.799, "duration": 3.68}, {"text": "And fluids apply pressure in EVERY direction.", "start": 95.479, "duration": 2.34}, {"text": "So, right now, there’s air putting pressure\non you -- and me -- from every side.", "start": 97.819, "duration": 4.59}, {"text": "In fact, the average air pressure at sea level\nis 101 THOUSAND 325 Pascals.", "start": 102.409, "duration": 5.94}, {"text": "And if you jumped in a pool, the water would\nalso exert pressure on you.", "start": 108.349, "duration": 3.24}, {"text": "But if you’ve ever tried diving to the bottom\nof a pool, you'll know that there’s more pressure", "start": 111.589, "duration": 4.071}, {"text": "at the bottom than at the surface -- which\nis why, at the bottom, your ears hurt", "start": 115.669, "duration": 3.72}, {"text": "and your head feels like it’s about to implode.", "start": 119.389, "duration": 2.22}, {"text": "That’s because the deeper you go, the more fluid there is above you, with its weight pressing down.", "start": 121.609, "duration": 4.751}, {"text": "There’s an easy way to calculate the\npressure of a fluid at a given depth:", "start": 126.36, "duration": 3.18}, {"text": "it’s just (the fluid’s density); (times small g); (times the distance to the surface), represented by the letter h -- for height.", "start": 129.54, "duration": 6.38}, {"text": "And the change in pressure based on depth\nis equal to", "start": 135.92, "duration": 2.46}, {"text": "(the fluid’s density), (times small g),\n(times the change in distance to the surface).", "start": 138.38, "duration": 4.32}, {"text": "So, let’s say you’re swimming in a pool\nthat’s three meters deep, and you want to", "start": 142.7, "duration": 3.1}, {"text": "know how much more pressure you’ll experience\nat the bottom of the pool, versus how deep", "start": 145.81, "duration": 4.11}, {"text": "you are now, which is, let’s assume...a\nquarter of a meter.", "start": 149.92, "duration": 3.32}, {"text": "The density of water is 1000 kilograms per meters cubed, and the change in distance to the surface is 2.75 meters.", "start": 153.24, "duration": 6.74}, {"text": "Which means that the pressure at the bottom of the pool is 27,000 Pascals more than the pressure, a quarter of a meter down.", "start": 159.98, "duration": 6.74}, {"text": "The water in the pool could be one example\nof a confined fluid, because if you had a", "start": 166.72, "duration": 4.36}, {"text": "piston the size of the pool’s surface and used it to push down on the water, the water would have nowhere to go.", "start": 171.08, "duration": 5.9}, {"text": "And back in the mid-1600s, French physicist Blaise Pascal realized something about the way pressure worked in confined fluids:", "start": 176.98, "duration": 7.3}, {"text": "If you apply pressure to a confined fluid, the pressure in every part of the fluid increases by that amount.", "start": 184.28, "duration": 5.48}, {"text": "If you have water in a cup, and you use a piston to apply 10,000 Pascals of pressure to the surface of the water,", "start": 189.76, "duration": 5.36}, {"text": "then the pressure everywhere in the water increases by 10,000 Pascals.", "start": 195.12, "duration": 3.8}, {"text": "Today, that concept is known as Pascal’s\nPrinciple, and it’s the reason hydraulics are so useful.", "start": 198.92, "duration": 5.34}, {"text": "Say you have some water in a tube, with pistons\non either side.", "start": 204.26, "duration": 3.08}, {"text": "Pascal’s principle tells you that if you use the piston on the left side to apply pressure to the water,", "start": 207.34, "duration": 4.48}, {"text": "the water will exert the same pressure on the piston on the right side of the tube.", "start": 211.82, "duration": 4.24}, {"text": "And pressure is equal to (force) divided by\n(area).", "start": 216.06, "duration": 3.22}, {"text": "So, say you have another tube that’s more\nof a cone shape, with a piston on the left side", "start": 219.28, "duration": 3.52}, {"text": "that has an area of one meter squared, and\none on the right that has an area of 2 meters squared", "start": 222.8, "duration": 4.64}, {"text": "Again, you apply 10,000 Pascals of pressure\nto the piston on the left side --", "start": 227.45, "duration": 3.7}, {"text": "meaning, 10,000 Newtons of force.", "start": 231.15, "duration": 2.17}, {"text": "But the piston on the right side has double\nthe area.", "start": 233.32, "duration": 2.58}, {"text": "So, for the pressures to be equal, the water\nhas to apply double the force to the piston", "start": 235.91, "duration": 4.13}, {"text": "as you applied to the water, and so you end up with 20,000 Newtons of force on the right-side piston.", "start": 240.04, "duration": 5.72}, {"text": "This is a huge deal! You’re doubling the input force, but you didn’t have to put in any extra effort!", "start": 245.76, "duration": 5.48}, {"text": "And the bigger the difference in area, the\nmore extra force you get!", "start": 251.24, "duration": 2.98}, {"text": "To put it in math terms: the ratio of the\noutput force to the input force is equal to", "start": 254.22, "duration": 4.2}, {"text": "the ratio of the output area to the input\narea.", "start": 258.43, "duration": 3.019}, {"text": "Systems like hydraulic lifts take advantage of this, by having big differences in area on either side of a fluid.", "start": 261.449, "duration": 5.731}, {"text": "So if you want to apply a lot of force -- to lift something heavy, for example -- hydraulics are the way to go.", "start": 267.18, "duration": 4.84}, {"text": "Now, if you’re going to be using pressure to do stuff, you’re probably going to want to be able to measure that pressure.", "start": 272.02, "duration": 4.66}, {"text": "Which is where manometers and barometers come\nin.", "start": 276.689, "duration": 2.171}, {"text": "A manometer is just a U-shaped tube with a\nfluid inside.", "start": 278.86, "duration": 2.69}, {"text": "Say you wanted to use one to measure the pressure\nof a bike tire.", "start": 281.55, "duration": 3.299}, {"text": "You’d stick one side of the tube in the tire, and leaving the other side open to the atmosphere.", "start": 284.849, "duration": 3.531}, {"text": "If there’s a difference in the pressure\non each side of the manometer,", "start": 288.389, "duration": 2.98}, {"text": "whichever side has the higher pressure will push the fluid away from it --", "start": 291.369, "duration": 3.831}, {"text": "creating a difference in the height of the fluid on either side of the U.", "start": 295.209, "duration": 3.331}, {"text": "In this case, the inside of the bike tire\nhas a much higher pressure than the atmosphere,", "start": 298.55, "duration": 4.169}, {"text": "so the level of the fluid on the side of the\nU that’s closer to the tire will be lower.", "start": 302.719, "duration": 4.581}, {"text": "If you measured the difference in fluid height directly, you’d get what’s known as gauge pressure --", "start": 307.3, "duration": 4.3}, {"text": "the difference between atmospheric\npressure and the pressure inside the tire.", "start": 311.6, "duration": 3.42}, {"text": "But the actual pressure of the tire -- the absolute pressure -- is the atmospheric pressure, plus the gauge pressure.", "start": 315.02, "duration": 5.38}, {"text": "So, the pressure inside the tire will be equal\nto (the atmospheric pressure),", "start": 320.4, "duration": 3.56}, {"text": "plus (the density of the fluid inside the manometer) (times small g) (times the difference in the heights of the fluid).", "start": 323.96, "duration": 5.819}, {"text": "Barometers, on the other hand, use a long,\nvertical tube that’s closed on one end,", "start": 329.779, "duration": 4.0}, {"text": "usually filled with mercury and then stuck\nupside-down in a bowl that’s also full of mercury,", "start": 333.78, "duration": 4.36}, {"text": "with the closed end of the tube at\nthe top.", "start": 338.15, "duration": 2.079}, {"text": "The pressure of the atmosphere pushes down\non the mercury in the bowl,", "start": 340.229, "duration": 3.22}, {"text": "which keeps a certain amount of mercury in the tube.", "start": 343.449, "duration": 2.751}, {"text": "At standard atmospheric pressure, the mercury\nin the tube will be exactly 76 centimeters high.", "start": 346.2, "duration": 5.179}, {"text": "If the air pressure goes up, so does the level\nof the mercury, and vice versa.", "start": 351.379, "duration": 3.861}, {"text": "So we have one more property to talk\nabout when it comes to fluids at rest --", "start": 355.24, "duration": 3.02}, {"text": "and it's the one that supposedly made that guy run naked through the streets, yelling “Eureka!”", "start": 358.26, "duration": 4.38}, {"text": "That guy was Archimedes, and he lived in Greece\nin the third century BCE.", "start": 362.64, "duration": 4.08}, {"text": "Legend has it that he was asked to find a way to figure out if the king’s crown was pure gold.", "start": 366.72, "duration": 4.1}, {"text": "And the best way to do that was to calculate\nits density.", "start": 370.82, "duration": 2.509}, {"text": "Archimedes could measure the crown’s mass easily enough, but he didn’t know how to find its density.", "start": 373.329, "duration": 4.671}, {"text": "He was taking a bath one day when he realized that the volume of the water displaced by an object", "start": 378.0, "duration": 4.66}, {"text": "is equal to that object’s volume.", "start": 382.66, "duration": 2.1}, {"text": "And since he already knew the crown’s mass,\nthat meant he’d be able to find its volume,", "start": 384.76, "duration": 3.96}, {"text": "and therefore its density, just by putting\nit in water.", "start": 388.72, "duration": 2.48}, {"text": "That’s when he did the whole running-through-the-streets-naked thing.", "start": 391.2, "duration": 2.6}, {"text": "So Archimedes discovered that when you\nput something in a fluid,", "start": 393.8, "duration": 3.34}, {"text": "the fluid’s volume increases by the amount of the object's volume.", "start": 397.14, "duration": 3.44}, {"text": "This tells us a lot about what makes objects\nfloat or sink.", "start": 400.58, "duration": 3.019}, {"text": "For example, say you have a tub of water and\ntwo balls of the same size, but of different densities.", "start": 403.599, "duration": 5.44}, {"text": "Say, one is an American-style billiard ball,\nand the other’s a racquetball.", "start": 409.04, "duration": 3.26}, {"text": "We’re going to gently place the balls in the middle of the tub, let go, and explain what happens to them.", "start": 412.3, "duration": 4.94}, {"text": "But first, let’s talk about the forces acting on the water that’s occupying the space where we’re going to put them.", "start": 417.24, "duration": 4.899}, {"text": "Picture a sphere of water within the volume\nof water that’s in the tub.", "start": 422.139, "duration": 3.38}, {"text": "What are the forces acting on that watery sphere?", "start": 425.52, "duration": 2.44}, {"text": "Well, the force of gravity is pulling it down.", "start": 427.96, "duration": 2.229}, {"text": "And, since the sphere is in static equilibrium,\nthere must be some force pushing up on it,", "start": 430.189, "duration": 4.7}, {"text": "counteracting the force of gravity.", "start": 434.889, "duration": 1.911}, {"text": "We call that force the buoyant force, and\nit comes from the fact that the water pressure", "start": 436.809, "duration": 3.961}, {"text": "at the bottom of the sphere is greater than\nthe pressure at the top.", "start": 440.77, "duration": 2.929}, {"text": "Now, let’s put the billiard ball where the\nsphere of water used to be.", "start": 443.699, "duration": 2.97}, {"text": "What are the forces acting on that?", "start": 446.669, "duration": 1.941}, {"text": "The force from gravity that’s pulling down\non the billiard ball is stronger than the", "start": 448.619, "duration": 3.11}, {"text": "force that was pulling down on the sphere\nof water.", "start": 451.729, "duration": 2.231}, {"text": "That’s because the billiard ball is denser\nthan water -- so even though the ball and", "start": 453.96, "duration": 4.0}, {"text": "the sphere of water have the same size, the\nball is much heavier.", "start": 457.96, "duration": 3.06}, {"text": "But the buoyant force on the billiard ball\nis exactly the same as it was on the sphere", "start": 461.02, "duration": 3.509}, {"text": "of water, since they’re the same shape and\nsize.", "start": 464.529, "duration": 3.301}, {"text": "That’s Archimedes’ principle: there’s a buoyant force pushing upward on objects in water,", "start": 467.83, "duration": 4.79}, {"text": "and it’s equal to the weight of\nthe water that the object displaced.", "start": 472.62, "duration": 3.58}, {"text": "The billiard ball weighs more than the\nsphere of water that it’s replacing,", "start": 476.21, "duration": 2.96}, {"text": "so there’s a net downward force on the ball, and it sinks to the bottom of the tub.", "start": 479.17, "duration": 3.79}, {"text": "But if you were to fill in that sphere of water with a racquetball, the opposite would happen.", "start": 482.96, "duration": 3.94}, {"text": "In that case, the force from gravity pulling\nit downward is weaker than the force pulling", "start": 486.9, "duration": 3.96}, {"text": "down the sphere of water, but the buoyant\nforce pushing upward is still the same.", "start": 490.869, "duration": 4.29}, {"text": "So there’s a net force upward on the racquetball,\nwhich is why it floats to the top of the tub.", "start": 495.159, "duration": 4.44}, {"text": "Some of the racquetball will pop out of the\nwater, but some of it will stay underwater", "start": 499.6, "duration": 3.62}, {"text": "-- in fact, once it stops moving, the racquetball will displace a volume of water that weighs exactly as much as the ball.", "start": 503.22, "duration": 6.44}, {"text": "Because at that point, the buoyant force pushing\nthe racquetball upward and the force of gravity", "start": 509.66, "duration": 3.92}, {"text": "pulling the racquetball downward have the\nsame magnitude, so they cancel each other out!", "start": 513.58, "duration": 4.46}, {"text": "Thanks to Archimedes, we know why objects\nfloat and sink.", "start": 518.05, "duration": 2.96}, {"text": "Today, you learned about the properties of\nfluids at rest, including density, and pressure.", "start": 521.01, "duration": 3.96}, {"text": "We also talked about Pascal’s Principle,\nand how it’s used in hydraulics.", "start": 524.97, "duration": 3.74}, {"text": "Then, we covered how manometers and\nbarometers measure pressure.", "start": 528.71, "duration": 3.12}, {"text": "Finally, we explained Archimedes’ Principle and the buoyant force.", "start": 531.83, "duration": 3.25}, {"text": "This episode of Crash Course Physics is supported by Audible.com", "start": 535.09, "duration": 3.83}, {"text": "and right now Audible is offering viewers a 30 day trial period.", "start": 538.94, "duration": 3.74}, {"text": "All you have to do is just go to audible dot com slash crash course to access their audio programs and titles, like this book", "start": 542.68, "duration": 6.84}, {"text": "Tibetan Buddhism and Modern Physics by Victor Mansfield and the Dalai Lama.", "start": 549.52, "duration": 5.24}, {"text": "This is something I've really wanted to read for a long time, and with my travel schedule, audio books and Audible make that possible.", "start": 554.76, "duration": 6.4}, {"text": "Go to audible.com/crashcourse and make sure you use that link to help us out and to get your membership trial.", "start": 561.16, "duration": 7.2}, {"text": "Crash Course Physics is produced in association with PBS Digital Studios.", "start": 568.36, "duration": 3.88}, {"text": "You can head over to their channel to check out a playlist of the latest episodes from shows like The Art Assignment, Coma Niddy, and Deep Look.", "start": 572.24, "duration": 7.26}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 579.51, "duration": 4.0}, {"text": "with the help of these amazing people and\nour equally amazing graphics team is Thought Cafe.", "start": 583.51, "duration": 4.84}]