[{"text": "Professor Dave again, let’s talk about volume.", "start": 0.1, "duration": 2.48}, {"text": "We just learned how to calculate the two-dimensional\narea covered by the surface of a three-dimensional", "start": 9.36, "duration": 5.86}, {"text": "object, but sometimes we want to do more than\nthat.", "start": 15.23, "duration": 4.38}, {"text": "Sometimes we want to calculate the three-dimensional\nspace that is contained within that object,", "start": 19.61, "duration": 5.89}, {"text": "which we can think of as the amount of water\nwe will need to fill up the object if it were", "start": 25.5, "duration": 5.59}, {"text": "perfectly hollow.", "start": 31.09, "duration": 2.59}, {"text": "Just the way the area of a square is found\nby running a side length across the shape,", "start": 33.68, "duration": 6.42}, {"text": "if we take that square plane and run it across\na third dimension, we can get a cube.", "start": 40.1, "duration": 6.32}, {"text": "A cube is a prism with squares for all its\nfaces.", "start": 46.42, "duration": 5.0}, {"text": "To find the volume of a cube, instead of just\nsquaring the side length, which gives us the", "start": 51.42, "duration": 5.76}, {"text": "area of one square face, we cube the side\nlength to get the volume of the cube.", "start": 57.18, "duration": 7.15}, {"text": "With a side length of two meters, this cube\nhas a volume of eight meters cubed, or cubic meters.", "start": 64.33, "duration": 7.27}, {"text": "We can easily visualize this by saying that\nif we have some one by one by one cubes, or", "start": 73.88, "duration": 6.88}, {"text": "cubic units, it will take eight of them to\nfill this larger cube.", "start": 80.76, "duration": 6.19}, {"text": "For a rectangular prism, it’s just length\ntimes width times height.", "start": 86.95, "duration": 5.52}, {"text": "Two times three times five gives thirty cubic\nmeters.", "start": 92.47, "duration": 6.56}, {"text": "What we are really doing is calculating the\narea of the base, and multiplying by the height,", "start": 99.03, "duration": 5.96}, {"text": "as though running the base up through the\nheight of the shape to span its volume.", "start": 104.99, "duration": 8.41}, {"text": "This works for any type of prism, like a triangular\nprism.", "start": 113.4, "duration": 4.99}, {"text": "Here we have triangular bases, so we just\nget the area of one base, and multiply by", "start": 118.39, "duration": 6.01}, {"text": "the height.", "start": 124.4, "duration": 1.31}, {"text": "If the triangle itself has a base and height\nof two and three meters, and the prism has", "start": 125.71, "duration": 6.48}, {"text": "a height of ten meters, we get one half two\ntimes three times ten, or thirty cubic meters.", "start": 132.19, "duration": 10.32}, {"text": "This works for cylinders, too, it’s always\njust base times height.", "start": 142.51, "duration": 4.96}, {"text": "The base of a cylinder is a circle, so we\nfind the area of this circle, and then multiply", "start": 147.47, "duration": 5.59}, {"text": "by the height of the cylinder.", "start": 153.06, "duration": 2.48}, {"text": "If the height is six meters and the radius\nis three, we get pi R squared, or nine pi,", "start": 155.54, "duration": 7.68}, {"text": "times six, or fifty-four pi cubic meters.", "start": 163.22, "duration": 6.04}, {"text": "Now let’s move on to some trickier shapes.", "start": 169.26, "duration": 3.089}, {"text": "How do we calculate the volume of a pyramid?", "start": 172.349, "duration": 3.281}, {"text": "This will be different from a prism, because\nwe can’t just multiply the base times the", "start": 175.63, "duration": 4.53}, {"text": "height, as the triangular faces slope inward.", "start": 180.16, "duration": 4.23}, {"text": "Instead, we will use the formula one third\nbase times height.", "start": 184.39, "duration": 5.27}, {"text": "So if we have a square pyramid which has a\nbase with a length of three, and the pyramid", "start": 189.66, "duration": 5.64}, {"text": "has a height of five, we get nine for the\nbase, times five is forty-five, times one", "start": 195.3, "duration": 7.36}, {"text": "third is fifteen cubic meters.", "start": 202.66, "duration": 5.22}, {"text": "What if we don’t know the height of the\npyramid but only the height of the triangles?", "start": 207.88, "duration": 5.09}, {"text": "Luckily we know the pythagorean theorem, so\nwe could imagine a triangle where one leg", "start": 212.97, "duration": 6.75}, {"text": "is the height of the pyramid, the other leg\nis half the length of the base, and the hypotenuse", "start": 219.72, "duration": 6.72}, {"text": "is the height of a triangular face.", "start": 226.44, "duration": 3.019}, {"text": "We plug them into the equation, and we can\nthen solve for the height, so it’s just", "start": 229.459, "duration": 6.751}, {"text": "one extra step.", "start": 236.21, "duration": 2.88}, {"text": "Cones work just like pyramids.", "start": 239.09, "duration": 2.27}, {"text": "Again it will be one third base times height,\nexcept that here the area of the base is given", "start": 241.36, "duration": 6.33}, {"text": "by pi R squared, so we get one third pi R\nsquared H. If we have two for R and nine for", "start": 247.69, "duration": 8.07}, {"text": "H, we get four pi times nine is thirty-six,\ntimes a third is twelve cubic meters.", "start": 255.76, "duration": 8.589}, {"text": "Lastly, we need to be able to calculate the\nvolume of a sphere.", "start": 264.349, "duration": 5.88}, {"text": "The formula for this is four thirds pi R cubed.", "start": 270.229, "duration": 3.701}, {"text": "So with a radius of three, we cube it to get\ntwenty-seven, divide by three to get nine,", "start": 273.93, "duration": 6.549}, {"text": "and multiply by four to get thirty-six, times\npi is thirty-six pi cubic meters.", "start": 280.479, "duration": 7.511}, {"text": "These are most of the regular shapes for which\nwe have reliable equations to calculate volume.", "start": 287.99, "duration": 6.37}, {"text": "There are, of course, many irregular shapes\nthat have a more unpredictable curvature,", "start": 294.36, "duration": 4.88}, {"text": "and to calculate the volumes of these, we\nwill need calculus.", "start": 299.24, "duration": 4.609}, {"text": "We aren’t there yet, we have lots more algebra\nto learn first, and since we’ve wrapped", "start": 303.849, "duration": 4.201}, {"text": "up most of the crucial topics in geometry,\nwe are safe to go back to equations with variables,", "start": 308.05, "duration": 5.599}, {"text": "right after we check comprehension.", "start": 313.649, "duration": 1.891}]