[{"text": "Oh, hey!", "start": 0.12, "duration": 1.0}, {"text": "I didn't see you up there.", "start": 1.12, "duration": 1.089}, {"text": "How long have you been waiting in this line?", "start": 2.209, "duration": 1.86}, {"text": "I've been here for like 15 minutes and it's\nfreaking freezing out here!", "start": 4.069, "duration": 2.79}, {"text": "I mean, whose banana do you gotta peel in\norder to get into this club?", "start": 6.859, "duration": 1.74}, {"text": "Well, while we're here I guess this might\nnot be a bad time to continue our discussion about cells—because cells, like nightclubs, have to be selectively permeable.", "start": 8.599, "duration": 10.331}, {"text": "They can only work if they let in the stuff\nthat they need and they, you know, kick out the stuff that they don't need like trash and ridiculously drunk people and Justin Bieber fans.", "start": 18.93, "duration": 9.39}, {"text": "No matter what stuff it is it has to pass\nthrough the cell's membrane.", "start": 28.32, "duration": 2.66}, {"text": "Some things can pass really easily into cells and without a lot of help, like water or oxygen.", "start": 30.98, "duration": 3.92}, {"text": "But a lot of other things that they need, like sugar, other nutrients, or signaling molecules or steroids—they can't get in or it will take a really long time for them to do it.", "start": 35.04, "duration": 8.52}, {"text": "Yeah, I can relate.", "start": 43.56, "duration": 1.0}, {"text": "[Theme Music]", "start": 44.56, "duration": 9.32}, {"text": "Today we're going to be talking about how substances move through cell membranes, which is happening all the time, including right now, in me and right now, in you.", "start": 53.88, "duration": 7.479}, {"text": "And this is vital to all life, because it's not just how cells acquire what they need and get rid of what they don’t.", "start": 61.359, "duration": 5.456}, {"text": "It's also how cells communicate with one another.", "start": 66.815, "duration": 2.125}, {"text": "Different materials have different ways of\ncrossing the cell membrane.", "start": 68.94, "duration": 2.87}, {"text": "And there are basically two categories of ways: there's active transport and there's passive transport.", "start": 71.81, "duration": 5.89}, {"text": "Passive transport doesn't require any energy, which is great, because important things like oxygen and water can use this to get into cells really easily.", "start": 77.7, "duration": 7.6}, {"text": "And they do this through what we call diffusion.", "start": 85.31, "duration": 2.21}, {"text": "Let's say I'm finally in this show, and I'm\nin the show with my brother John.", "start": 87.52, "duration": 3.27}, {"text": "Some of you know my brother John, and I love him, but he uh...he's not a big fan of people.", "start": 90.79, "duration": 8.27}, {"text": "I mean he likes people.", "start": 99.06, "duration": 1.41}, {"text": "He doesn't like big crowds.", "start": 100.47, "duration": 1.77}, {"text": "Being parts of big crowds and people standing nearby him, breathing on him, touching him accidentally and that sort of thing—because John's with me at the show, we're hanging out with all of our friends near the stage.", "start": 102.24, "duration": 8.69}, {"text": "But then he starts moving further and further from the stage so he doesn't get a bunch of hipsters invading his space.", "start": 110.93, "duration": 5.49}, {"text": "That's basically what diffusion is.", "start": 116.42, "duration": 1.19}, {"text": "If everyone in the club were John Green they would try and get as much space between all of them as possible until it was a uniform mass of John Greens throughout the club.", "start": 117.61, "duration": 10.899}, {"text": "When oxygen gets crowded, it finds places\nthat are less crowded and moves into those spaces.", "start": 128.509, "duration": 4.131}, {"text": "When water gets crowded, it does the same thing and moves to where there is less water.", "start": 132.64, "duration": 3.26}, {"text": "When water does this across a membrane, it's a kind of diffusion called osmosis.", "start": 135.9, "duration": 3.459}, {"text": "This is how your cells regulate their water\ncontent.", "start": 139.359, "duration": 2.041}, {"text": "Not only does this apply to water itself, which as we've discussed is the world's best solvent.", "start": 141.4, "duration": 6.339}, {"text": "You're going to learn more about water in our water episode.", "start": 147.739, "duration": 2.291}, {"text": "It also works with water that contains dissolved materials, or solutions, like solutions of salt water, or solutions of sugar water, or booze, which is just a solution of ethanol in water.", "start": 150.03, "duration": 9.45}, {"text": "If the concentration of a solution is higher inside of a cell than it is outside of the cell, then that solution is called hypertonic—like Powerthirst, it's got everything packed into it!", "start": 159.48, "duration": 9.36}, {"text": "And if the concentration inside of the cell\nis lower than outside of the cell, it's called hypotonic—which is sort of a sad version of hypertonic.", "start": 168.849, "duration": 8.97}, {"text": "Like with Charlie Sheen: we don't want the\ncrazy, manic Charlie Sheen and we don't like he super-sad, depressed Charlie Sheen.", "start": 177.819, "duration": 5.39}, {"text": "We want the \"in-the-middle\" Charlie Sheen\nwho can just make us laugh and be happy.", "start": 183.209, "duration": 4.25}, {"text": "And that is the state that water concentrations are constantly seeking.", "start": 187.459, "duration": 3.461}, {"text": "It's called isotonic.", "start": 190.92, "duration": 1.23}, {"text": "When the concentration is the same on both sides, outside and in—and this works in real life!", "start": 192.15, "duration": 4.03}, {"text": "We can actually show it to you.", "start": 196.18, "duration": 1.0}, {"text": "This vase is full of fresh water.", "start": 197.38, "duration": 1.639}, {"text": "And we also have a sausage casing, which is actually made of cellulose, and inside of that we have salt water.", "start": 199.019, "duration": 5.631}, {"text": "We've dyed it so that you can see it move through the casing, which is acting as our membrane.", "start": 204.65, "duration": 4.35}, {"text": "This time lapse shows how over a few hours, the salt water diffuses into the pure water.", "start": 209.18, "duration": 4.56}, {"text": "It'll keep diffusing until the concentration of salt in the water is the same inside the membrane as outside.", "start": 213.749, "duration": 4.88}, {"text": "When water does this, attempting to become isotonic, it's called moving across its concentration gradient.", "start": 218.629, "duration": 5.171}, {"text": "Most of my cells right now are bathed in a solution that has the same concentration as inside of them, and this is important.", "start": 223.8, "duration": 6.08}, {"text": "For example, if you took one of my red blood cells and put it in a glass of pure water,", "start": 229.88, "duration": 4.18}, {"text": "it would be so hypertonic so much stuff would be in the cell compared to outside the cell that water would rush into the red blood cell and it would literally explode.", "start": 234.06, "duration": 8.48}, {"text": "So, we don't want that!", "start": 242.54, "duration": 1.029}, {"text": "But if the concentration of my blood plasma were too high, water would rush out of my cell, and it would shrivel up and be useless.", "start": 243.569, "duration": 6.31}, {"text": "That's why your kidneys are constantly on the job, regulating the concentration of your blood plasma to keep it isotonic.", "start": 249.879, "duration": 5.94}, {"text": "Now, water can permeate a cell membrane without any help, but it's not actually particularly easy.", "start": 255.82, "duration": 5.12}, {"text": "As we discussed in the last episode, some\nmembranes are made out of phospholipids, and the phospholipid bilayer is hydrophilic, or water-loving, on the outside and hydrophobic, or water-hating, on the inside.", "start": 261.0, "duration": 10.52}, {"text": "So water molecules have a hard time passing through these layers because they get stuck at the non-polar, hydrophobic core.", "start": 271.52, "duration": 6.28}, {"text": "That is where the channel proteins come in.", "start": 277.86, "duration": 2.54}, {"text": "They allow passage of stuff like water and\nions without using any energy.", "start": 280.41, "duration": 3.08}, {"text": "They straddle the width of the membrane and inside they have channels that are hydrophilic, which draws the water through.", "start": 283.49, "duration": 5.47}, {"text": "The proteins that are specifically for channelling water are called aquaporins, and each one can pass 3 billion water molecules a second!", "start": 288.96, "duration": 7.39}, {"text": "It makes me have to pee just thinking about it.", "start": 296.35, "duration": 1.87}, {"text": "Things like oxygen and water, that cells need constantly, they can get into the cell without any energy necessary but most chemicals use what's called active transport.", "start": 298.22, "duration": 10.58}, {"text": "This is especially useful if you want to move something in the opposite direction of its concentration gradient, from a low concentration to a high concentration.", "start": 308.8, "duration": 6.52}, {"text": "So, say we're back at that show, and I'm keeping company with John who's being all antisocial in his polite and charming way,", "start": 315.32, "duration": 6.14}, {"text": "but after half a beer and an argument about who the was the best Doctor Who, I want to get back to my friends across the crowded bar.", "start": 321.46, "duration": 5.179}, {"text": "So I transport myself against the concentration gradient of humans, spending a lot of energy, dodging stomping feet, throwing an elbow, to get to them.", "start": 326.64, "duration": 9.2}, {"text": "THAT is high energy transport!", "start": 335.84, "duration": 1.76}, {"text": "In a cell, getting the energy necessary to do pretty much anything, including moving something the wrong direction across its concentration gradient, requires ATP.", "start": 337.6, "duration": 11.14}, {"text": "ATP or adenosine tri-phosphate.", "start": 348.74, "duration": 2.959}, {"text": "You just want to replay that over and over again until it just rolls off the tongue because it's one of the most important chemicals that you will ever, ever, ever hear about.", "start": 351.7, "duration": 9.58}, {"text": "Adenosine tri-phosphate; ATP.", "start": 361.28, "duration": 2.28}, {"text": "If our bodies were America, ATP would be credit cards.", "start": 363.56, "duration": 4.49}, {"text": "It's such an important form of information currency that we're going to do an entire separate episode about it, which will be here, (uh I ended up going to the wrong direction but it will be here) when we've done it.", "start": 368.05, "duration": 10.01}, {"text": "But for now, here's what you need to know.", "start": 378.06, "duration": 1.379}, {"text": "When a cell requires active transport, it basically has to pay a fee, in the form of ATP, to a transport protein.", "start": 379.439, "duration": 6.07}, {"text": "A particularly important kind of freakin' sweet transport protein is called the sodium-potassium pump.", "start": 385.509, "duration": 6.601}, {"text": "Most cells have them, but they're especially vital to cells that need lots of energy, like muscle cells and brain cells.", "start": 392.11, "duration": 5.71}, {"text": "[ Bio-lography Music]", "start": 397.82, "duration": 5.08}, {"text": "Oh!", "start": 403.16, "duration": 1.6}, {"text": "Biolo-graphy!", "start": 405.42, "duration": 1.22}, {"text": "It's my favorite part of the show.", "start": 406.74, "duration": 2.22}, {"text": "The sodium-potassium pump was discovered in the 1950s by a Danish medical doctor named Jens Christian Skou, who was studying how anesthetics work on membranes.", "start": 408.96, "duration": 8.66}, {"text": "He noticed that there was a protein in cell\nmembranes that could pump sodium out of a cell.", "start": 417.62, "duration": 5.44}, {"text": "And the way he got to know this pump was by studying the nerves of crabs, because crab nerves are huge compared to humans' nerves and are easier to dissect and observe.", "start": 423.06, "duration": 10.26}, {"text": "But crabs are still small, so he needed a\nlot of them.", "start": 433.33, "duration": 2.94}, {"text": "He struck a deal with a local fisherman and, over the years, studied approximately 25,000 crabs, each of which he boiled to study their fresh nerve fibers.", "start": 436.27, "duration": 10.01}, {"text": "He published his findings on the sodium-potassium pump in 1957 and in the meantime became known for the distinct odor that filled the halls of the Department of Physiology at the university where he worked.", "start": 446.28, "duration": 11.06}, {"text": "Forty years after making his discovery, Skou was awarded the Nobel Prize in Chemistry.", "start": 457.34, "duration": 4.4}, {"text": "And here's what he taught us: Turns out these pumps work against two gradients at the same time.", "start": 461.74, "duration": 4.86}, {"text": "One is the concentration gradient, and the\nother is the electrochemical gradient.", "start": 466.6, "duration": 4.28}, {"text": "That's the difference in electrical charge\non either side of a cell's membrane.", "start": 470.889, "duration": 3.221}, {"text": "So the nerve cells that Skou was studying, like the nerve cells in your brain, typically have a negative charge inside relative to the outside.", "start": 474.11, "duration": 6.579}, {"text": "They also usually have a low concentration\nof sodium ions inside.", "start": 480.689, "duration": 3.471}, {"text": "The pump works against both of these conditions, collecting three positively-charged sodium ions and pushing them out into the positively charged, sodium ion-rich environment.", "start": 484.16, "duration": 9.969}, {"text": "To get the energy to do this, the protein\npump breaks up a molecule of ATP.", "start": 494.129, "duration": 4.22}, {"text": "ATP, adenosine tri-phosphate, is an adenosine molecule with three phosphate groups attached  to it,", "start": 498.349, "duration": 5.551}, {"text": "so when ATP connects with the protein pump, an enzyme breaks the covalent bond on one of those phosphates in a burst of excitement and energy.", "start": 503.9, "duration": 7.02}, {"text": "This split releases enough energy to change the shape of the pump so it \"opens\" outward and releases the three sodium ions.", "start": 510.92, "duration": 6.27}, {"text": "This new shape also makes it a good fit for potassium ions that are outside the cell, so the pump lets two of those in.", "start": 517.19, "duration": 5.649}, {"text": "So what you end up with is a nerve cell that\nis literally and metaphorically charged.", "start": 522.839, "duration": 3.771}, {"text": "It has all those sodium ions waiting outside\nwith this intense desire to get inside of the cell.", "start": 526.61, "duration": 5.229}, {"text": "And when something triggers the nerve cell, it lets all of those in.", "start": 531.839, "duration": 2.55}, {"text": "And that gives the nerve cell a bunch of electrochemical energy which it can then use to help you feel things, or touch, or smell, or taste, or have a thought.", "start": 534.389, "duration": 8.081}, {"text": "There is still yet another way that stuff\ngets inside of cells, and this also requires energy.", "start": 542.47, "duration": 4.13}, {"text": "It's also a form of active transport.", "start": 546.6, "duration": 1.64}, {"text": "It's called vesicular transport, and the heavy lifting is done by vesicles, which are tiny sacs made of phospholipids just like the cell membrane.", "start": 548.25, "duration": 8.36}, {"text": "This kind of active transport is also called\ncytosis, from the Greek for \"cell action.\"", "start": 556.61, "duration": 4.78}, {"text": "When vesicles transport materials outside of a cell it's called exocytosis, or outside cell action.", "start": 561.39, "duration": 5.85}, {"text": "A great example of this is going on in your\nbrain right now.", "start": 567.24, "duration": 2.45}, {"text": "It's how your nerve cells release neurotransmitters.", "start": 569.69, "duration": 3.24}, {"text": "You've heard of neurotransmitters.", "start": 572.93, "duration": 1.029}, {"text": "They are very important in helping you feel\ndifferent ways.", "start": 573.959, "duration": 2.901}, {"text": "Like dopamine and serotonin.", "start": 576.86, "duration": 1.83}, {"text": "After neurotransmitters are synthesized and packaged into vesicles, they're transported until the vesicle reaches the membrane.", "start": 578.69, "duration": 5.339}, {"text": "When that happens, the two bilayers rearrange so that they fuse.", "start": 584.029, "duration": 3.811}, {"text": "And then the neurotransmitter spills out and—now I remember where I left my keys!", "start": 587.84, "duration": 3.71}, {"text": "Now just play that process in reverse and\nyou'll see how material gets inside a cell.", "start": 591.55, "duration": 4.36}, {"text": "That's endocytosis.", "start": 595.91, "duration": 1.0}, {"text": "There are three different ways that this happens.", "start": 596.91, "duration": 1.76}, {"text": "My personal favorite is phagocytosis, and the awesome there begins with the fact that that name itself means DEVOURING CELL ACTION!", "start": 598.67, "duration": 7.74}, {"text": "Check this out.", "start": 606.41, "duration": 1.0}, {"text": "So this particle outside here is some kind\nof dangerous bacterium in your body.", "start": 607.41, "duration": 3.98}, {"text": "And this is a white blood cell.", "start": 611.39, "duration": 2.42}, {"text": "Chemical receptors on the blood cell membrane detect this punk invader and attach to it, actually reaching out around it and engulfing it.", "start": 613.81, "duration": 7.93}, {"text": "Then the membrane forms a vesicle to carry it inside, where it lays a total, unholy beat down on it with enzymes and other cool weapons.", "start": 621.74, "duration": 8.32}, {"text": "Pinocytosis, or drinking action, is very similar to phagocytosis, except instead of surrounding whole particles, it just surrounds things that have already been dissolved.", "start": 630.06, "duration": 8.399}, {"text": "Here the membrane just folds in a little to form the beginning of a channel and then pinches off to form a vesicle that holds the fluid.", "start": 638.46, "duration": 6.42}, {"text": "Most of your cells are doing this right now,\nbecause it's how our cells absorb nutrients.", "start": 644.88, "duration": 3.36}, {"text": "But what if a cell needs something that only occurs in very small concentrations?", "start": 648.24, "duration": 4.3}, {"text": "That's when cells use clusters of specialized receptor proteins in the membrane that form a vesicle when receptors connect with the molecule that they're looking for.", "start": 652.64, "duration": 8.38}, {"text": "For example, your cells have specialized cholesterol receptors that allow you to absorb cholesterol;", "start": 661.029, "duration": 4.521}, {"text": "if those receptors don't work, which can happen with some genetic conditions, cholesterol is left to float around in your blood and eventually causes heart disease.", "start": 665.55, "duration": 6.469}, {"text": "So that's just one of many reasons to appreciate what's called receptor-mediated endocytosis.", "start": 672.019, "duration": 4.32}, {"text": "Ah!", "start": 676.339, "duration": 1.0}, {"text": "Hey, glad you made it in too!", "start": 677.339, "duration": 1.701}, {"text": "Now comes review time.", "start": 679.04, "duration": 1.08}, {"text": "You can click on any of these links and go back to the part of the video where I talk about that thing if you are at all confused.", "start": 680.12, "duration": 5.7}, {"text": "And you may be.", "start": 685.82, "duration": 1.459}, {"text": "This is totally, pretty complicated stuff we're dealing with right now, so uh you just go ahead and watch all that.", "start": 687.279, "duration": 6.231}, {"text": "And if you have any questions, of course, we'll be down below in the comments and on Twitter and Facebook as well and we'll see you next time.", "start": 693.51, "duration": 6.73}]