[{"text": "It’s Professor Dave, let’s check out some spaces.", "start": 0.44, "duration": 2.42}, {"text": "We’ve talked a lot about vectors and matrices\nlately, as well as how certain mathematical", "start": 9.54, "duration": 5.539}, {"text": "operations like addition and scalar multiplication\nwork on them. Now we want to generalize these", "start": 15.079, "duration": 7.261}, {"text": "operations to define what is known as a vector\nspace, which is sometimes also called a linear", "start": 22.34, "duration": 7.41}, {"text": "space, so let’s look at this concept now.\nBefore defining anything, let’s just introduce", "start": 29.75, "duration": 6.19}, {"text": "some notation. Let’s call our vector space\nV. If some vector is a member, or “element”", "start": 35.94, "duration": 6.959}, {"text": "of V, we can denote it with this symbol here,\nso the following means that A is an element", "start": 42.899, "duration": 6.0}, {"text": "of V. All elements of the vector space have\nthe same properties we already discussed for", "start": 48.899, "duration": 6.62}, {"text": "vectors, so elements must abide by the commutative\nand associative properties of addition, as", "start": 55.519, "duration": 6.56}, {"text": "is shown here. There also exists a zero vector\nin the vector space such that any element", "start": 62.079, "duration": 7.491}, {"text": "plus the zero vector will just give back the\nelement. For each element a, there exists", "start": 69.57, "duration": 6.14}, {"text": "another element, -a, within V, such that the\naddition of the two gives the zero vector.", "start": 75.71, "duration": 7.38}, {"text": "Scalars can be distributed across the addition\nof two members of V, just as an element can", "start": 83.09, "duration": 5.61}, {"text": "be distributed across the addition of two\nscalars. The product of two scalars multiplied", "start": 88.7, "duration": 7.29}, {"text": "by an element is the same as one of the scalars\ntimes the product of the other scalar and", "start": 95.99, "duration": 6.46}, {"text": "the element. And finally multiplying by the\nscalar 1 just gives back that element. So", "start": 102.45, "duration": 6.58}, {"text": "these are simply properties that elements\nof the vector space must possess. And in this", "start": 109.03, "duration": 6.33}, {"text": "way we can regard a vector space as a collection\nof elements that can be added together in", "start": 115.36, "duration": 7.03}, {"text": "any combination, and multiplied by scalars\nin any combination.", "start": 122.39, "duration": 5.42}, {"text": "Now, an important property of a vector space\nis something called closure. Closure requires", "start": 127.81, "duration": 8.06}, {"text": "two properties. First, for an element a of\nV, multiplying a by any scalar will give a", "start": 135.87, "duration": 7.33}, {"text": "result that is also within V. Second, for\nany two elements a and b within V, adding", "start": 143.2, "duration": 7.83}, {"text": "the two elements will also give a result that\nis contained within V. These closure properties", "start": 151.03, "duration": 7.31}, {"text": "are what determine if V is a vector space.\nLet’s take some time to examine these properties.", "start": 158.34, "duration": 7.25}, {"text": "At this point it will be useful to introduce\nthis R symbol, which represents the set of", "start": 165.59, "duration": 5.16}, {"text": "all real numbers, meaning positive, negative,\nrational, irrational, all the real numbers", "start": 170.75, "duration": 7.3}, {"text": "we talked about when we discussed the types\nof numbers in a previous tutorial. We can", "start": 178.05, "duration": 7.88}, {"text": "pick any element of this set, a real number,\nand multiply it by any scalar we want. Let’s", "start": 185.93, "duration": 6.919}, {"text": "take the number 5 as our element and multiply\nit by a few scalars. 2 times 5 is 10. 8 thirds", "start": 192.849, "duration": 7.721}, {"text": "times five is 40 thirds. One ninth times 5\nis 5 ninths. Pi times 5 is 5 pi, and so on.", "start": 200.57, "duration": 9.83}, {"text": "Notice that all of our results are still real\nnumbers. This is because no matter what we", "start": 210.4, "duration": 4.699}, {"text": "choose, a real number times a real number\nis still real. So the set of real numbers", "start": 215.099, "duration": 5.22}, {"text": "satisfies the first closure property. Now\nfor the second property, we will need to choose", "start": 220.319, "duration": 6.681}, {"text": "two elements to add together. We could choose\n74 and -10, adding them together to get 64.", "start": 227.0, "duration": 7.8}, {"text": "Adding two and four fifths gives us fourteen\nfifths. No matter what two real numbers we", "start": 234.8, "duration": 5.71}, {"text": "choose, the sum of two real numbers is still\nreal. So because the two criteria have been", "start": 240.51, "duration": 6.21}, {"text": "met, the set of real numbers is closed and\ncan be considered a vector space.", "start": 246.72, "duration": 8.36}, {"text": "Moving to another example, let’s expand\non our notation. If R is the set of real numbers,", "start": 255.08, "duration": 6.27}, {"text": "Rn is the set of real vectors with a length\nof some integer n. Similarly, Rm x n is the", "start": 261.35, "duration": 8.69}, {"text": "set of real m by n matrices. First, let’s\njust look at R3 vectors. We can multiply any", "start": 270.04, "duration": 9.09}, {"text": "such vector by any scalar and find that our\nresult is a vector of length 3, made of real", "start": 279.13, "duration": 6.819}, {"text": "numbers. Similarly we can add any two elements\nand find the same to be true, given that each", "start": 285.949, "duration": 7.521}, {"text": "component is simply now a sum that will result\nin another real number. This set is closed,", "start": 293.47, "duration": 7.59}, {"text": "and is thus also a vector space. Given what\nwe know about matrix addition, if some set", "start": 301.06, "duration": 7.329}, {"text": "is comprised of matrices with the same dimensions,\nmultiplying by some scalar or adding any two", "start": 308.389, "duration": 7.021}, {"text": "matrices together will not change their dimensions,\nwhich makes this, too, a vector space. So", "start": 315.41, "duration": 8.21}, {"text": "it would seem that vector spaces can actually\nbe made of more than just vectors. In fact,", "start": 323.62, "duration": 6.23}, {"text": "we could define a vector space that was made\nup of functions if we wanted to. For example", "start": 329.85, "duration": 6.5}, {"text": "let’s take the set of linear polynomials,\nin the form of ax + b. If we multiply by a", "start": 336.35, "duration": 7.4}, {"text": "scalar c, we can distribute to get ca times\nx, plus bc. Since we are dealing with real", "start": 343.75, "duration": 7.36}, {"text": "numbers, ca and bc will also be real, and\nthe form of our equation is still a linear", "start": 351.11, "duration": 5.89}, {"text": "polynomial, so our result is still within\nthe set. Similarly if we have two different", "start": 357.0, "duration": 6.91}, {"text": "equations, a1 times x plus b1, and a2 times\nx plus b2, and we add them, once we group", "start": 363.91, "duration": 7.849}, {"text": "like terms we get the quantity (a1 plus a2)\ntimes x, plus the quantity (b1 plus b2). Once", "start": 371.759, "duration": 7.012}, {"text": "again all of these are real numbers and we\nget another linear polynomial that is contained", "start": 378.771, "duration": 4.759}, {"text": "in our set. With these two closure properties\nsatisfied, we therefore have a vector space", "start": 383.53, "duration": 7.24}, {"text": "made of functions.\nWe’ve listed a lot of examples of vector", "start": 390.77, "duration": 5.31}, {"text": "spaces now, so what does it look like when\nthe closure properties are not satisfied?", "start": 396.08, "duration": 6.42}, {"text": "Take for example a simple set made of vectors\nof length two. However all the elements of", "start": 402.5, "duration": 5.66}, {"text": "this set have a value of 2 in the second row.\nLet’s take two elements of this set, a and", "start": 408.16, "duration": 6.26}, {"text": "b, and try adding them together. We don’t\neven need to assign values for the entries", "start": 414.42, "duration": 5.85}, {"text": "in the first row to see what will happen.\nThe first row will be the sum of a1 and b1,", "start": 420.27, "duration": 5.88}, {"text": "while the second row will be 2 plus 2, which\nis 4. Our starting set only contained elements", "start": 426.15, "duration": 6.46}, {"text": "with the value 2 in the second row. But when\nwe added two vectors of this set we got a", "start": 432.61, "duration": 6.36}, {"text": "4 in the second row, which means the sum is\nnot a member of the set. Thus the set is not", "start": 438.97, "duration": 6.5}, {"text": "closed and is not a vector space, despite\nthe fact that it is made of vectors. A lot", "start": 445.47, "duration": 8.57}, {"text": "of the topics we introduce in the coming tutorials\nwill involve working with vector spaces, so", "start": 454.04, "duration": 5.571}, {"text": "let’s check comprehension.", "start": 459.611, "duration": 1.389}]