[{"text": "You know what can be kind of peculiar and\nsurprising?", "start": 3.08, "duration": 3.04}, {"text": "The fact that, whenever you want to shoot outside, everyone decides to mow their lawn.", "start": 6.12, "duration": 4.94}, {"text": "You know what else can be kind of peculiar\nand surprising?", "start": 11.06, "duration": 3.66}, {"text": "Water.", "start": 14.72, "duration": 1.04}, {"text": "And in the right circumstances, I could even take water that’s flowing down and spurt it straight up.", "start": 15.76, "duration": 6.0}, {"text": "How?", "start": 21.76, "duration": 0.84}, {"text": "All of these things are possible, thanks to\nthe study of the flow of fluids, known as Fluid Dynamics.", "start": 22.6, "duration": 5.68}, {"text": "[Theme Music]", "start": 28.28, "duration": 12.82}, {"text": "By now, you’ve picked up on the fact that\n-- even though we live in the physical universe", "start": 41.1, "duration": 4.0}, {"text": "-- describing the rules of the universe sometimes requires us to pretend that certain things aren’t happening.", "start": 45.1, "duration": 5.22}, {"text": "Like the time we rolled a bunch of stuff down\na ramp, and pretended that there was no  kinetic friction.", "start": 50.32, "duration": 4.34}, {"text": "The same is true when we talk about fluids.", "start": 54.66, "duration": 2.02}, {"text": "Because, fluids in motion are dynamic and there are many, many things going on in and around them all at once.", "start": 56.68, "duration": 6.3}, {"text": "So, in order to grasp the essentials of fluid\ndynamics, let’s just do some pretending, shall we?", "start": 62.98, "duration": 4.88}, {"text": "For one thing, we’re going to consider the\nfluids in our examples to be incompressible,", "start": 67.87, "duration": 4.1}, {"text": "meaning that their densities won’t change.", "start": 71.97, "duration": 2.23}, {"text": "We’re also going to assume that fluids flow\nperfectly smoothly, and have no viscosity.", "start": 74.21, "duration": 4.63}, {"text": "You’ve probably heard of viscosity before:", "start": 78.84, "duration": 2.46}, {"text": "When a fluid flows easily, like water, we say that it has a low viscosity.", "start": 81.3, "duration": 4.38}, {"text": "Fluids that don’t flow as easily, like honey, have a higher viscosity.", "start": 85.68, "duration": 4.08}, {"text": "And much like kinetic friction does in moving objects, viscosity tends to complicate things in moving fluids,", "start": 89.76, "duration": 5.7}, {"text": "which is why we’re generally going to pretend that the fluids we’re studying don’t have any.", "start": 95.46, "duration": 4.56}, {"text": "Now, say you have some water -- which exists\nunder all of these hypothetical conditions", "start": 100.03, "duration": 3.69}, {"text": "-- in a pipe, moving along smoothly.", "start": 103.72, "duration": 2.53}, {"text": "This pipe narrows about halfway through, so\nthat one end is narrower than the other.", "start": 106.25, "duration": 4.18}, {"text": "This shape is going to affect some of the\nproperties of the water’s flow,", "start": 110.43, "duration": 2.8}, {"text": "as it passes through the narrower side of the pipe compared to the wider side.", "start": 113.23, "duration": 3.8}, {"text": "But one thing that won't change is the mass of water that’s moving through any given area in the pipe over time.", "start": 117.03, "duration": 5.67}, {"text": "This is called the mass flow rate, and it’s\nalways going to be the same everywhere in the pipe.", "start": 122.7, "duration": 4.28}, {"text": "That’s just because, as the water flows through the pipe, it pushes along the water in the rest of the pipe, too.", "start": 126.99, "duration": 4.74}, {"text": "So if one part of the pipe has, say, a kilogram\nof water moving through it every second,", "start": 131.73, "duration": 4.62}, {"text": "the rest of the pipe ALSO has to have a kilogram\nof water moving through it every second.", "start": 136.35, "duration": 4.36}, {"text": "This fact, that the mass flow rate at one point in the pipe will be equal to the mass flow rate at any other point,", "start": 140.71, "duration": 5.29}, {"text": "is called the equation of continuity.", "start": 146.0, "duration": 2.06}, {"text": "And it can tell you a lot about the relationship between the velocity of a fluid", "start": 148.06, "duration": 3.62}, {"text": "and the cross-sectional area of the pipe that it’s flowing through.", "start": 151.68, "duration": 2.84}, {"text": "Let’s say you’re an engineer for the Water\nDepartment of Hypothetical City,", "start": 154.52, "duration": 3.58}, {"text": "and you need to understand the mass flow rate of hypothetical water that’s going through a certain point in your underground pipe system.", "start": 158.1, "duration": 6.02}, {"text": "But you don’t know the mass that’s going through that part of the pipe at any given moment.", "start": 164.12, "duration": 4.12}, {"text": "All you know are the water’s velocity and the area of the cross-section of that certain section of pipe.", "start": 168.24, "duration": 5.6}, {"text": "In order to describe the mass flow rate, you’ll\nhave to use what we know about density, area,", "start": 173.84, "duration": 5.3}, {"text": "and velocity to work some algebra magic:", "start": 179.15, "duration": 2.6}, {"text": "First, let’s have a look at a cross section\nof that point of the pipe.", "start": 181.75, "duration": 3.14}, {"text": "From our last lesson, you know that the mass of the fluid moving past this cross-sectional area, over time,", "start": 184.89, "duration": 5.75}, {"text": "is equal to its density,\ntimes its volume.", "start": 190.64, "duration": 2.58}, {"text": "And, the volume of the fluid moving past this point is simply the area of the pipe at this cross section,", "start": 193.22, "duration": 5.08}, {"text": "times the distance the fluid\nmoves.", "start": 198.3, "duration": 2.24}, {"text": "And! From our episodes on the physics of motion,\nyou also know that the distance the fluid moves,", "start": 200.54, "duration": 4.66}, {"text": "divided by the change in time, is equal\nto the fluid’s velocity.", "start": 205.2, "duration": 3.22}, {"text": "So, by putting all that together, you can\nget a different version of the equation of continuity:", "start": 208.42, "duration": 4.78}, {"text": "At any given point in the pipe, the density\nof the fluid flowing through it,", "start": 213.2, "duration": 3.6}, {"text": "times the area of the pipe, times the fluid’s velocity, will be the same as for any other point in the pipe.", "start": 216.8, "duration": 5.88}, {"text": "And since you’re dealing with an incompressible fluid, the density is going to be the same for every point in the pipe anyway.", "start": 222.68, "duration": 5.639}, {"text": "So really, you’ve just figured out that\nat any point in the pipe, the area of the pipe", "start": 228.32, "duration": 4.56}, {"text": "times the fluid’s velocity will be\nthe same as for any other point.", "start": 232.88, "duration": 3.7}, {"text": "It’s the same thing we said before: The mass\nflow rate is the same for every point in the pipe.", "start": 236.58, "duration": 4.64}, {"text": "But instead of putting that relationship\nin terms of mass and time,", "start": 241.22, "duration": 3.28}, {"text": "you’re putting it in terms of area and velocity.", "start": 244.5, "duration": 2.84}, {"text": "And, in your role as a water-department engineer,\nthis is important for you to know!", "start": 247.349, "duration": 4.14}, {"text": "Because it means that, where the pipe is narrower,\nthe fluid will have to flow faster, in order to compensate.", "start": 251.489, "duration": 5.5}, {"text": "But here’s a weird thing:", "start": 256.989, "duration": 1.37}, {"text": "A fluid that’s flowing really fast actually has less pressure than when it’s flowing more slowly.", "start": 258.359, "duration": 4.98}, {"text": "Sure, it might feel like it’s exerting more\nforce than when it flows through a wider opening.", "start": 263.349, "duration": 4.03}, {"text": "But that’s not what physicists mean when\nthey talk about the pressure in a pipe.", "start": 267.379, "duration": 3.85}, {"text": "They’re really talking about the pressure\non the walls of the pipe.", "start": 271.229, "duration": 3.11}, {"text": "This means that, the slower the fluid flows,\nthe more pressure it puts on the pipe itself.", "start": 274.339, "duration": 4.14}, {"text": "This is known as Bernoulli’s principle.", "start": 278.48, "duration": 2.0}, {"text": "It states that the higher a fluid’s velocity\nis through a pipe,", "start": 280.48, "duration": 3.6}, {"text": "the lower the pressure on the pipe’s walls,\nand vice versa.", "start": 284.08, "duration": 3.26}, {"text": "Bernoulli also came up with what we now know\nas Bernoulli’s equation.", "start": 287.349, "duration": 3.701}, {"text": "It might look kind of intimidating at first.", "start": 291.05, "duration": 2.46}, {"text": "But when you break it down, it’s actually just a way of combining a bunch of things that you’ve already learned.", "start": 293.51, "duration": 5.02}, {"text": "Bernoulli based his equation on the\nconcept of conservation of energy:", "start": 298.53, "duration": 3.84}, {"text": "as a fluid flows through a pipe, it won’t gain or lose any energy.", "start": 302.37, "duration": 3.9}, {"text": "This means that, no matter where\nthe fluid is in the pipe,", "start": 306.27, "duration": 2.72}, {"text": "if you take all of the forms of energy that the fluid has at that point and add them up,", "start": 308.99, "duration": 3.99}, {"text": "they’ll equal the same number\nas any other point in the pipe.", "start": 312.98, "duration": 3.16}, {"text": "To better understand this, have a look at how the three forms of energy in a fluid are represented in Bernoulli’s equation:", "start": 316.14, "duration": 5.479}, {"text": "First, there’s pressure times volume.", "start": 321.619, "duration": 1.98}, {"text": "In our episode on work and energy, we defined\nenergy as the ability to do work.", "start": 323.599, "duration": 4.66}, {"text": "And when a fluid applies pressure and moves\nthe volume of fluid that’s downstream, it’s doing work.", "start": 328.26, "duration": 5.399}, {"text": "So, pressure times volume must be a form of\nenergy.", "start": 333.659, "duration": 2.421}, {"text": "The first term in Bernoulli’s equation takes\nthat energy, and divides it by volume.", "start": 336.08, "duration": 4.28}, {"text": "Which just leaves pressure.", "start": 340.36, "duration": 1.54}, {"text": "Next, a flowing fluid also has kinetic energy.", "start": 341.9, "duration": 2.87}, {"text": "When we first talked about kinetic energy, we said that it’s equal to half of an object’s mass, times its velocity squared.", "start": 344.77, "duration": 7.0}, {"text": "Again, Bernoulli divided this form of energy by volume, to get half the fluid’s density, times its velocity squared.", "start": 351.77, "duration": 6.57}, {"text": "That’s called the kinetic energy density,\nand it’s the second term of Bernoulli’s equation.", "start": 358.34, "duration": 5.06}, {"text": "Finally, a flowing fluid also has the potential\nenergy that comes from gravity.", "start": 363.4, "duration": 4.12}, {"text": "And we’ve said before that the potential\nenergy from gravity is equal to", "start": 367.52, "duration": 3.26}, {"text": "an object’s mass, times small g, times its height.", "start": 370.78, "duration": 3.2}, {"text": "When Bernoulli divided that by volume, he\ngot density times small g times height --", "start": 373.98, "duration": 4.96}, {"text": "the potential energy density,\nand the third term of his equation.", "start": 378.94, "duration": 3.86}, {"text": "Why divide all these terms by volume?", "start": 382.8, "duration": 2.14}, {"text": "Well, when it comes to fluids, it’s just easier to talk about things in terms of density than it is to talk about mass.", "start": 384.94, "duration": 5.94}, {"text": "So when you look at his equation piece by\npiece, you can see that Bernoulli was really", "start": 390.88, "duration": 4.12}, {"text": "just putting conservation of energy into a\nspecial form that would be useful for fluids.", "start": 395.009, "duration": 4.64}, {"text": "Now, let’s look at a special case of Bernoulli’s\nequation, known as Torricelli’s theorem.", "start": 399.649, "duration": 4.1}, {"text": "Torricelli’s theorem uses conservation of energy to find the velocity of fluid flowing from a small spout in a container.", "start": 403.749, "duration": 5.791}, {"text": "And it says that the velocity of the fluid\ncoming out of the spout is the same as the", "start": 409.54, "duration": 4.379}, {"text": "velocity of a single droplet of fluid that\nfalls from the height of the surface of the fluid in the container.", "start": 413.919, "duration": 4.36}, {"text": "In other words, the pressure that’s pushing\nthe fluid out of the spout", "start": 418.279, "duration": 2.86}, {"text": "gives it the same velocity that it would get from the force of gravity.", "start": 421.14, "duration": 2.8}, {"text": "To see this theorem in action, let’s say you’re not a water department engineer -- you’re just YOU,", "start": 423.94, "duration": 5.42}, {"text": "and you’re watering your garden\nwith the water you’ve saved up in your rain barrel.", "start": 429.36, "duration": 3.52}, {"text": "Your barrel doesn’t have a top, and you’re\nwatering your carrots and lettuce and stuff", "start": 432.889, "duration": 3.2}, {"text": "from a hole -- or a spout -- in the side.", "start": 436.089, "duration": 1.991}, {"text": "Now: You want to know: What’s the velocity\nof the water coming out of the spout?", "start": 438.08, "duration": 3.459}, {"text": "From Bernoulli’s equation, we know that\nthe sum of the pressure, kinetic energy density,", "start": 441.539, "duration": 4.48}, {"text": "and the potential energy density of the water\nat the TOP of the cooler, will equal the sum", "start": 446.02, "duration": 4.42}, {"text": "of those three qualities of the water coming\nout of the spout.", "start": 450.449, "duration": 2.7}, {"text": "But we can simplify that relationship a bit,\nto find the velocity of the fluid coming out.", "start": 453.149, "duration": 4.491}, {"text": "First, the upper surface of\nthe water in the barrel,", "start": 457.649, "duration": 2.26}, {"text": "and the water that’s coming out of the spout, are both exposed to the atmosphere.", "start": 459.909, "duration": 3.671}, {"text": "So the pressure at those points will be the same -- it’s just the atmospheric pressure.", "start": 463.58, "duration": 3.979}, {"text": "So we can cross off the pressure from each\nside of the equation.", "start": 467.559, "duration": 2.76}, {"text": "Now, there might be water coming out of the spout, but the top of the barrel has a much bigger area.", "start": 470.32, "duration": 4.7}, {"text": "So the water at the top of the barrel isn’t\ngoing to be moving very much.", "start": 475.029, "duration": 2.9}, {"text": "In fact, we can say that its velocity is basically zero.", "start": 477.929, "duration": 3.4}, {"text": "Which means that the kinetic energy density\nfor the water at the top of the barrel is zero.", "start": 481.329, "duration": 3.971}, {"text": "Finally, we can cross out the density in each\nterm of the equation, since it’s not changing.", "start": 485.309, "duration": 4.37}, {"text": "We’re left with a much simpler equation,\nwith only three terms --", "start": 489.68, "duration": 3.4}, {"text": "an equation that should look VERY familiar, if you’ve watched our episodes on the physics of motion.", "start": 493.08, "duration": 4.22}, {"text": "It’s a kinematic equation!", "start": 497.3, "duration": 1.569}, {"text": "You already know the two main kinematic equations:\nthe definition of acceleration and the displacement curve.", "start": 498.869, "duration": 5.1}, {"text": "And you can rearrange them to get another\nequation that relates displacement, velocity,", "start": 503.969, "duration": 3.69}, {"text": "and acceleration -- without considering time.", "start": 507.659, "duration": 2.55}, {"text": "It’s exactly the same equation as the one\nwe just found by using Bernoulli’s equation", "start": 510.209, "duration": 3.721}, {"text": "to describe the velocity of the water coming\nout of the spout.", "start": 513.93, "duration": 2.989}, {"text": "So, Torricelli’s theorem tells you that if a droplet of water fell from the same height as the top of the barrel,", "start": 516.92, "duration": 5.14}, {"text": "when it reached the level of the spout, it’d have the same velocity as the water coming out of the spout.", "start": 522.06, "duration": 5.3}, {"text": "Now you know how fast the water’s\ncoming out your rain barrel,", "start": 527.36, "duration": 2.92}, {"text": "and how much water you’re putting in your garden over a certain amount of time.", "start": 530.28, "duration": 3.22}, {"text": "But you want to try something fun?", "start": 533.5, "duration": 1.74}, {"text": "Let’s turn the spout on your barrel so it’s pointing up instead of down.", "start": 535.24, "duration": 3.44}, {"text": "If the water from this spout could shoot straight up,", "start": 538.68, "duration": 2.3}, {"text": "the stream would get exactly as high as the water at the top of the barrel, before falling down to the ground.", "start": 540.98, "duration": 4.8}, {"text": "Today, you learned about fluids in motion,\nwith a focus on the continuity equation,", "start": 545.78, "duration": 3.92}, {"text": "Bernoulli’s equation, and Torricelli’s theorem.", "start": 549.7, "duration": 2.58}, {"text": "You also learned that lawn mowers are loud.", "start": 552.28, "duration": 3.58}, {"text": "Crash Course Physics is produced in\nassociation with PBS Digital Studios.", "start": 555.86, "duration": 3.82}, {"text": "You can head over to their channel to check out amazing shows like BBQ With Franklin, PBS Off Book, and The Art Assignment.", "start": 559.68, "duration": 7.56}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 567.24, "duration": 4.62}, {"text": "with the help of these amazing people and\nour equally amazing graphics team is Thought Cafe.", "start": 571.86, "duration": 4.92}]