[{"text": "This episode is supported by Prudential.", "start": 3.58, "duration": 3.2}, {"text": "Resistors, batteries, and capacitors – these are just a few of the tools you use to build circuits, and provide power to the world around us.", "start": 6.78, "duration": 6.48}, {"text": "Today, we’re going to build some basic circuits out of resistors and batteries to figure out how they react and change, depending on their configuration.", "start": 13.26, "duration": 6.9}, {"text": "For instance, in this circuit, I’ve got\na battery connected to a light bulb.", "start": 20.17, "duration": 4.08}, {"text": "Easy enough, right?", "start": 24.25, "duration": 1.17}, {"text": "The battery provides a voltage, generating a current that runs through the whole circuit, lighting up our connected light bulb due to its resistance.", "start": 25.42, "duration": 7.16}, {"text": "Now, what if you have two identical light\nbulbs in a row?", "start": 32.58, "duration": 3.24}, {"text": "How will the current change?", "start": 35.82, "duration": 1.54}, {"text": "How bright will each one be?", "start": 37.36, "duration": 1.42}, {"text": "And what if, instead of two identical light bulbs on the same wire, you place the second bulb on its own wire that connects to the battery?", "start": 38.78, "duration": 6.5}, {"text": "These are all basic DC, or direct current circuits, made up of batteries and resistors with current flowing constantly out of the battery in one direction.", "start": 45.28, "duration": 8.04}, {"text": "We’ll talk about currents that aren’t so constant later on, but for now, everything we deal with will be a DC circuit.", "start": 53.32, "duration": 5.72}, {"text": "And hopefully, once we’re through, these\nbulbs here won’t be the only ones lighting up!", "start": 59.04, "duration": 4.14}, {"text": "[Theme Music]", "start": 63.18, "duration": 12.44}, {"text": "Let’s start our anatomy of a circuit lesson\nwith our source of energy: the battery.", "start": 75.62, "duration": 4.459}, {"text": "An ideal battery provides a constant voltage to a circuit, powered by its conversion of stored chemical energy to electrical energy.", "start": 80.08, "duration": 6.96}, {"text": "Scientists say that the battery is a source of electromotive force, because it gets charge to move – but it’s not really providing a force, but rather a difference in electrical potential.", "start": 87.04, "duration": 9.26}, {"text": "So we shorten this to say that the ideal voltage\nsupplied by the battery is its emf.", "start": 96.3, "duration": 3.92}, {"text": "Ideally, the battery uses all of its voltage\nto power the devices in a circuit.", "start": 100.22, "duration": 4.059}, {"text": "But, like most things in real life, batteries\naren’t perfect.", "start": 104.279, "duration": 3.26}, {"text": "While a battery’s purpose is to provide a steady voltage, its inner workings still contain conductive materials that will naturally lose energy as heat.", "start": 107.54, "duration": 7.94}, {"text": "Like when you watch Crash Course on your phone\nfor three hours and it gets warm.", "start": 115.48, "duration": 3.52}, {"text": "That heat is partly caused by the components inside the battery having resistance, and you know that when there’s resistance in a flow of current, power will be drawn and released – often in the form of heat.", "start": 119.0, "duration": 9.119}, {"text": "In a circuit, you model this effect as an internal resistance between the battery’s terminals.", "start": 128.12, "duration": 4.64}, {"text": "So, when you measure the actual voltage between the terminals of the battery, you get a value that’s less than our ideal emf potential.", "start": 132.76, "duration": 6.64}, {"text": "This real voltage is called the terminal voltage.", "start": 139.4, "duration": 2.559}, {"text": "And you calculate the terminal voltage by subtracting the voltage drop due to internal resistance from the supplied emf voltage, designated by a script E.", "start": 141.96, "duration": 8.46}, {"text": "This internal voltage drop, according to Ohm’s law, is equal to the current through the circuit times the internal resistance.", "start": 150.42, "duration": 6.02}, {"text": "The internal resistance is typically much smaller than the resistance of any connected devices, so the terminal voltage is usually only a little bit less than the emf voltage.", "start": 156.44, "duration": 9.08}, {"text": "For example, say you have a 12 Volt battery with no internal resistance, and it’s connected in a circuit with a resistor of 100 Ohms.", "start": 165.52, "duration": 6.88}, {"text": "You can use Ohm’s Law to find that the resulting\ncurrent is 0.120 Amperes.", "start": 172.4, "duration": 4.76}, {"text": "Now, let’s say that the battery has an internal\nresistance of 1 Ohm.", "start": 177.16, "duration": 2.68}, {"text": "If you substitute Ohm’s law into our equation for terminal voltage and solve the equation with both the internal resistance and the resistance of the circuit it’s hooked up to,", "start": 179.84, "duration": 8.78}, {"text": "you find that the current through the circuit\nis now 0.119 Amperes.", "start": 188.62, "duration": 4.18}, {"text": "Compared to the ideal battery, it’s only\na 1 Milliampere difference.", "start": 192.8, "duration": 3.14}, {"text": "Now, to find out exactly how much power is lost to the battery’s internal resistance, you can use the power expression we used in our last lesson:", "start": 195.94, "duration": 7.02}, {"text": "power equals current times voltage.", "start": 202.96, "duration": 2.54}, {"text": "Because, that equation shows the rate at which energy is converted from electricity into another form of energy, such as heat, light, or mechanical power.", "start": 205.5, "duration": 7.68}, {"text": "But since we don’t know the voltage drop across the internal resistance, you can use Ohm’s law, and substitute “current times resistance” for the voltage.", "start": 213.18, "duration": 7.26}, {"text": "From this equation, you can see that the internal resistance causes the battery to use about 14 milliWatts of power.", "start": 220.44, "duration": 5.9}, {"text": "Now, you might have noticed in this example, that while the two resistance values were different, the current going throughout the whole circuit was the same.", "start": 226.34, "duration": 6.8}, {"text": "When at least two resistors are connected along the same path, they’re connected in series, and any devices connected in series have the same current flowing through them.", "start": 233.14, "duration": 7.96}, {"text": "And while all resistors along the same wire have the same current, they each have different voltages dropping across them.", "start": 241.1, "duration": 5.919}, {"text": "According to the conservation of energy, the total voltage supplied to the system is equal to the sum of all the voltage drops across the circuit.", "start": 247.02, "duration": 7.2}, {"text": "Think of it as a river, like we’ve done before, with each resistor as a group of rocks sitting in the water.", "start": 254.22, "duration": 5.079}, {"text": "The current will be the same going through each set of rocks, whether it’s a pile of large boulders, with high resistance, or a clump of small pebbles, with low resistance.", "start": 259.3, "duration": 7.46}, {"text": "Since it’s much easier for current to go through small pebbles, the energy spent going through them is low.", "start": 266.76, "duration": 5.74}, {"text": "And for large boulders, which offer higher\nresistance, more energy will be lost.", "start": 272.5, "duration": 4.23}, {"text": "And this change in potential energy is just\nlike a voltage drop.", "start": 276.73, "duration": 3.35}, {"text": "For the same current, the voltage drop across greater resistances is higher than the lower voltage drops for the low resistances.", "start": 280.08, "duration": 6.62}, {"text": "But let’s figure out how to express this\nmathematically.", "start": 286.7, "duration": 2.8}, {"text": "If the voltage supplied by a battery is the equal to the sum of all voltage drops across, say, three resistors in a series, you can substitute Ohm’s law for each resistor.", "start": 289.5, "duration": 9.32}, {"text": "The voltage drop across each resistor is proportional\nto its resistance.", "start": 298.82, "duration": 3.76}, {"text": "Also, since the current is equal for all of the components, you can represent the total resistance of the circuit as the sum of all the resistances in the series.", "start": 302.58, "duration": 8.38}, {"text": "This total is called the equivalent resistance.", "start": 310.96, "duration": 2.14}, {"text": "Now there’s another way you can combine resistors in a circuit – by splitting one path of current into two or more branches.", "start": 313.1, "duration": 5.88}, {"text": "When multiple resistors are configured so the current splits into many branches from a single source, they’re said to be connected in parallel.", "start": 318.98, "duration": 6.84}, {"text": "And in the case of parallel connection, you want to pay close attention to the principle known as the conservation of charge.", "start": 325.82, "duration": 6.12}, {"text": "This principle states that all current flowing to the junction where the path splits, equals all of the current flowing out of the same junction.", "start": 331.94, "duration": 7.02}, {"text": "That's to say that what goes in must come out!", "start": 338.96, "duration": 2.44}, {"text": "Now, for each of these branches, the amount of current passing through it depends on its respective resistance.", "start": 341.4, "duration": 5.18}, {"text": "And since you no longer have a single current throughout your whole circuit, charge is not limited to one path.", "start": 346.58, "duration": 5.22}, {"text": "So, let’s think about this again in terms\nof flowing water.", "start": 351.8, "duration": 2.62}, {"text": "If a river breaks off into two different branches, and there’s one branch with lots of resistance and another with very little, where do you think most of the water will go?", "start": 354.42, "duration": 8.26}, {"text": "The path of least resistance!", "start": 362.68, "duration": 1.76}, {"text": "Not all of the water goes down the easy way.", "start": 364.44, "duration": 1.84}, {"text": "There’s still water that moves through the\nrocky branch, but just not as much.", "start": 366.28, "duration": 3.47}, {"text": "And in our hypothetical river, both branches, no matter how rocky, start and end at the same elevation, giving them the same potential.", "start": 369.75, "duration": 7.54}, {"text": "In terms of electricity, this means that for every branch in a parallel connection, the voltage is the same, no matter what the resistance is.", "start": 377.29, "duration": 6.98}, {"text": "So, for a series connection, the current is the same for all resistors, and the voltage drop changes.", "start": 384.27, "duration": 5.72}, {"text": "But in a parallel connection, the voltage is the same for all resistors, and the current through each changes.", "start": 389.99, "duration": 5.95}, {"text": "Now, remember how you add up all the resistances to find an equivalent resistance for resistors in a series?", "start": 395.94, "duration": 5.84}, {"text": "Would the same be true for a parallel setup?", "start": 401.78, "duration": 1.82}, {"text": "Let’s look at this mathematically to find\nout.", "start": 403.6, "duration": 2.36}, {"text": "Conservation of charge says that the current in the wire before the split junction is equal to the current coming out.", "start": 405.96, "duration": 5.6}, {"text": "So if we’ve got three branches, the current\ngoes in three directions.", "start": 411.56, "duration": 3.86}, {"text": "We can substitute Ohm’s law for each current to get an equation in terms of voltage and resistance.", "start": 415.42, "duration": 4.97}, {"text": "And since the voltage for each resistor is the same in parallel, you can cancel the voltage term out of the entire equation and we’re left with the equation for parallel equivalent resistance.", "start": 420.4, "duration": 9.02}, {"text": "This shows you that the equivalent resistance for a parallel setup of resistors will actually be smaller than any one of the resistors in the circuit.", "start": 429.42, "duration": 7.66}, {"text": "And this kind of makes sense, if you think\nback to our river analogy!", "start": 437.08, "duration": 3.02}, {"text": "Even if one of the two branches in a river is very clogged up, there’s still more current flowing through the total system than if that clogged up branch did not exist.", "start": 440.1, "duration": 8.04}, {"text": "So any additional branch will serve to decrease the total resistance of the system, and increase the amount of current through the entire circuit.", "start": 448.14, "duration": 6.88}, {"text": "All right, now that we’ve learned what series and parallel connections are, let’s go back to those circuits we talked about at the beginning, and see what happens when you connect them for real.", "start": 455.02, "duration": 7.9}, {"text": "When you connect a single light bulb to our\nbattery, you see how it lights up brightly.", "start": 462.92, "duration": 4.44}, {"text": "Now what happens when you add an identical\nlight bulb in a series connection?", "start": 467.36, "duration": 3.68}, {"text": "Since identical light bulbs have identical resistances, you know that the resistance in the circuit would be double.", "start": 471.04, "duration": 5.38}, {"text": "And this corresponds to a current that’s\nhalf of what it would be for a single bulb.", "start": 476.42, "duration": 4.04}, {"text": "And sure enough, once you complete the circuit, you can see that the bulbs are less bright than the original, single-bulb circuit.", "start": 480.46, "duration": 5.68}, {"text": "And if you added more bulbs in series, you’d see that the brightness would keep decreasing for each additional bulb.", "start": 486.14, "duration": 5.4}, {"text": "Now, let’s take our single-bulb circuit and add one bulb in a parallel connection, so the current splits into two different branches, each with equal resistance.", "start": 491.54, "duration": 8.62}, {"text": "Now you see that each bulb is the same brightness\nas the single-bulb circuit!", "start": 500.16, "duration": 3.48}, {"text": "So, why is that?", "start": 503.64, "duration": 1.2}, {"text": "Well, in this setup, the current has an additional – but identical – path to go through, so the overall resistance is half of what it was with a single-wire circuit.", "start": 504.84, "duration": 7.86}, {"text": "Since the equivalent resistance is half of what it used to be, and the voltage hasn’t changed, the current increases to double its original value.", "start": 512.7, "duration": 7.14}, {"text": "But since the current must divide equally into each of the different paths, we’re left with two bulbs that have the same amount of current flowing through them that the single bulb circuit had!", "start": 519.84, "duration": 8.36}, {"text": "This is incredibly useful.", "start": 528.2, "duration": 1.6}, {"text": "Think about the outlets in your house – they’re all connected in parallel, so no matter how many items are plugged in, they all receive the same voltage.", "start": 529.8, "duration": 6.8}, {"text": "But! What happens when you create circuits that\nare combinations of series and parallel connections?", "start": 536.6, "duration": 5.0}, {"text": "We’ve already got the tools to solve most circuit arrangements that you’ll encounter, so next time we’ll look at some key examples, mathematically and electrically, so don’t forget to bring your light bulbs!", "start": 541.6, "duration": 9.78}, {"text": "Today we learned about batteries, and how terminal voltage results from the natural internal resistance of every real battery.", "start": 551.38, "duration": 5.96}, {"text": "We discussed both series and parallel circuit configurations, and how the laws of conservation affect the current and voltage for each.", "start": 557.34, "duration": 6.84}, {"text": "Finally, we saw how series and parallel connections affect real circuits in our light bulb circuit demonstration.", "start": 564.18, "duration": 5.34}, {"text": "This episode was supported by Prudential.", "start": 569.52, "duration": 2.48}, {"text": "The time between when people think they should start saving for retirement and when they actually do is known as the Action Gap.", "start": 572.0, "duration": 6.4}, {"text": "According to a recent survey conducted by Prudential, the average American starts saving for retirement 7 years later than when they think is best.", "start": 578.4, "duration": 7.74}, {"text": "That could cost you $410,675.92 in a lifetime.", "start": 586.14, "duration": 6.1}, {"text": "Prudential also found that 80% of Americans have never estimated how much retirement may cost.", "start": 592.24, "duration": 5.4}, {"text": "1 in 3 Americans is not saving enough for their retirement, and over half are not on track to maintain their current standard of living when they retire.", "start": 597.64, "duration": 6.5}, {"text": "Go to Raceforretirement.com and see how the\naction gap affects you.", "start": 604.14, "duration": 3.86}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 608.01, "duration": 3.75}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 611.76, "duration": 4.74}, {"text": "Deep Look, PBS Idea Channel, and The Art Assignment.", "start": 616.5, "duration": 3.22}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 619.73, "duration": 4.11}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 623.84, "duration": 4.42}]