[{"text": "Professor Dave here, let’s find cross products.", "start": 0.5, "duration": 2.44}, {"text": "Earlier in the series, we learned about vectors\nand their operations, including one way to", "start": 10.06, "duration": 4.73}, {"text": "multiply two vectors together, which we called\nthe dot product.", "start": 14.79, "duration": 4.62}, {"text": "But the dot product is just a scalar.", "start": 19.41, "duration": 2.5}, {"text": "There is another way to multiply two vectors\nto get another vector, and this new vector", "start": 21.91, "duration": 5.629}, {"text": "is called the cross product, which is denoted\nby the multiplication sign.", "start": 27.539, "duration": 5.331}, {"text": "Now that we know a little bit about matrices\nand their operations, we are ready to understand", "start": 32.87, "duration": 5.39}, {"text": "how to find the cross product of two vectors,\nso let’s learn how to do that now.", "start": 38.26, "duration": 5.829}, {"text": "Let’s take two vectors, A and B. A has components\none, three, four, which can also be expressed", "start": 44.089, "duration": 7.371}, {"text": "as I plus three J plus four K, and B has components\ntwo, seven, negative five, which can be expressed", "start": 51.46, "duration": 7.969}, {"text": "as two I plus seven J minus five K.", "start": 59.429, "duration": 3.94}, {"text": "The way we find this cross product, or A cross\nB, is by finding the determinant of the following", "start": 63.369, "duration": 6.881}, {"text": "three by three matrix, with I, J, and K across\nthe top row, the components from vector A", "start": 70.25, "duration": 7.53}, {"text": "in the second row, and the components from\nvector B in the third row.", "start": 77.78, "duration": 4.81}, {"text": "We know how to get the determinant of a three\nby three matrix, so this is no problem.", "start": 82.59, "duration": 5.44}, {"text": "We just get I times the determinant of this\ntwo by two matrix, minus J times the determinant", "start": 88.03, "duration": 6.28}, {"text": "of this one, plus K times the determinant\nof this one.", "start": 94.31, "duration": 4.11}, {"text": "Now we can find each of these determinants.", "start": 98.42, "duration": 2.95}, {"text": "First we have negative fifteen minus twenty\neight, then negative five minus eight, and", "start": 101.37, "duration": 7.22}, {"text": "then seven minus six.", "start": 108.59, "duration": 3.71}, {"text": "Simplifying and combining with the unit vectors,\nwe are left with negative forty three I, plus", "start": 112.3, "duration": 5.63}, {"text": "thirteen J, plus K.", "start": 117.93, "duration": 3.5}, {"text": "So we can see how using determinants, we have\nfound the cross product of these two vectors,", "start": 121.43, "duration": 6.03}, {"text": "which is another, different vector.", "start": 127.46, "duration": 3.019}, {"text": "We must understand that a vector cross product\nwill always yield a vector that is orthogonal,", "start": 130.479, "duration": 6.1}, {"text": "or perpendicular, to the original two vectors,\nor rather to the plane containing them.", "start": 136.579, "duration": 6.461}, {"text": "In fact, if you place the edge of your right\nhand directly on vector B and curl your fingers", "start": 143.04, "duration": 6.19}, {"text": "in the direction of vector A, so that your\nhand is sort of mimicking the angle the angle", "start": 149.23, "duration": 4.709}, {"text": "formed between them, your thumb will be pointing\nin the direction of their cross product.", "start": 153.939, "duration": 6.211}, {"text": "Alternately, you can point your index finger\nin the direction of A, and your middle finger", "start": 160.15, "duration": 5.61}, {"text": "in the direction of B, and again your thumb\nwill be pointed in the direction of the cross product.", "start": 165.76, "duration": 6.44}, {"text": "So the right-hand rule that we originally\nlearned for three-dimensional coordinate systems", "start": 173.1, "duration": 4.74}, {"text": "can help us understand the direction of a\ncross product.", "start": 177.859, "duration": 5.701}, {"text": "There are a few other key points to understand\nabout cross products.", "start": 183.56, "duration": 3.659}, {"text": "First, if you take the cross product of a\nvector and itself, like A cross A, you will", "start": 187.219, "duration": 5.95}, {"text": "always get zero.", "start": 193.169, "duration": 1.691}, {"text": "This will be easy to prove to yourself if\nyou work out the determinant just as we did", "start": 194.86, "duration": 4.59}, {"text": "before and see that all the terms cancel out.", "start": 199.45, "duration": 5.239}, {"text": "Also, we can make the following statement\nabout the length of the cross product vector.", "start": 204.689, "duration": 7.541}, {"text": "The magnitude of A cross B is equal to the\nmagnitude of A times the magnitude of B times", "start": 212.23, "duration": 7.049}, {"text": "the sine of the angle between them.", "start": 219.279, "duration": 2.751}, {"text": "This definition can also be used to find the\ncross product of two vectors, because magnitude", "start": 222.03, "duration": 5.09}, {"text": "and direction are the two pieces of information\nconveyed by any vector, and if we calculate", "start": 227.12, "duration": 6.08}, {"text": "the magnitude of the cross product this way,\nand then determine its direction by using", "start": 233.2, "duration": 5.739}, {"text": "the right-hand rule, we can therefore accurately\ndefine this cross product.", "start": 238.939, "duration": 6.61}, {"text": "From this method we can also arrive at another\ntruth, that any two parallel vectors must", "start": 245.549, "duration": 5.741}, {"text": "have a cross product equal to zero.", "start": 251.29, "duration": 2.339}, {"text": "That’s because parallel vectors have an\nangle of zero between them, and the sine of", "start": 253.629, "duration": 5.291}, {"text": "zero is zero, so the whole cross product,\naccording to this expression, must go to zero.", "start": 258.92, "duration": 8.0}, {"text": "One other interesting thing about the cross\nproduct is that the magnitude of the resulting", "start": 266.92, "duration": 5.13}, {"text": "vector, which is the AB sine theta expression\nwe just used, will also be equal to the area", "start": 272.05, "duration": 6.76}, {"text": "of the parallelogram created by vectors A\nand B.", "start": 278.81, "duration": 4.2}, {"text": "This is another reason that the cross product\nof parallel vectors is the zero vector, because", "start": 283.01, "duration": 5.22}, {"text": "they span zero area.", "start": 288.23, "duration": 2.3}, {"text": "Lastly, just as we learned some properties\nof the dot product, let’s quickly mention", "start": 290.53, "duration": 5.86}, {"text": "some properties of the cross product.", "start": 296.39, "duration": 2.58}, {"text": "First, the cross product is not commutative.", "start": 298.97, "duration": 4.44}, {"text": "A cross B does not equal B cross A. Rather,\nA cross B equals negative B cross A. Second,", "start": 303.41, "duration": 8.96}, {"text": "the cross product is not associative.", "start": 312.37, "duration": 2.69}, {"text": "The quantity A cross B, cross C is not equal\nto A cross the quantity B cross C. However,", "start": 315.06, "duration": 7.97}, {"text": "the cross product does distribute.", "start": 323.03, "duration": 2.6}, {"text": "A cross the quantity B plus C is equal to\nA cross B plus A cross C.", "start": 325.63, "duration": 6.95}, {"text": "This understanding of the cross product will\nsuffice for our purposes, and we should note", "start": 332.58, "duration": 4.79}, {"text": "that the cross product crops up all the time\nin physics, but let’s keep going with linear", "start": 337.37, "duration": 4.81}, {"text": "algebra, right after we check comprehension.", "start": 342.18, "duration": 1.94}]