[{"text": "Professor Dave here, let’s graph some hyperbolas.", "start": 0.16, "duration": 2.92}, {"text": "We’ve made it to the last conic section,\nthe hyperbola.", "start": 9.58, "duration": 4.0}, {"text": "This is the one that extends through the base\nof one side of the cone all the way through", "start": 13.58, "duration": 4.6}, {"text": "to the base of the other side of the cone,\nproducing something that at first looks kind", "start": 18.18, "duration": 5.03}, {"text": "of like a double parabola, with its two separate\nbranches, although the shape is actually quite different.", "start": 23.21, "duration": 6.71}, {"text": "The definition of a hyperbola is similar to\nthat of an ellipse, where there are two foci,", "start": 30.04, "duration": 5.6}, {"text": "except that while every point on an ellipse\nhas distances to these foci that give a constant", "start": 35.64, "duration": 6.31}, {"text": "sum, every point on a hyperbola has distances\nto the foci that give a constant difference.", "start": 41.95, "duration": 8.679}, {"text": "The foci sit here, on the outsides of the\nbranches.", "start": 50.629, "duration": 3.991}, {"text": "Then here we have the two vertices, and between\nthose we can find the center, which sits on", "start": 54.62, "duration": 6.31}, {"text": "the transverse axis that connects the vertices.", "start": 60.93, "duration": 5.41}, {"text": "The equation for a hyperbola will be extremely\nsimilar to that of an ellipse.", "start": 66.34, "duration": 4.72}, {"text": "In fact, the only difference is that instead\nof a plus here, we have a minus, which makes", "start": 71.06, "duration": 6.3}, {"text": "sense given the difference between distances\nto the foci being constant instead of the sum.", "start": 77.36, "duration": 6.84}, {"text": "Everything else will be the same, except that\nfor an ellipse, we always put X squared first", "start": 84.24, "duration": 5.78}, {"text": "and Y squared second, while the A and B terms\ncould move around.", "start": 90.03, "duration": 4.93}, {"text": "This time, the A and B terms will stay put,\nwhile X and Y can swap spots.", "start": 94.96, "duration": 6.98}, {"text": "If it’s the X term first, the hyperbola\nwill open up around the X axis.", "start": 101.94, "duration": 5.44}, {"text": "If the Y comes first, it will open up around\nthe Y axis.", "start": 107.38, "duration": 3.53}, {"text": "The A, B, and C terms we know will mean pretty\nmuch the same things, as well.", "start": 110.91, "duration": 6.73}, {"text": "A is the distance from the center to a vertex,\nand C is the distance from the center to a focus.", "start": 117.64, "duration": 7.3}, {"text": "One difference is that B no longer means much\ngraphically, and we will just use it to solve", "start": 124.94, "duration": 5.88}, {"text": "for A or C, and this time the equation will\nbe C squared equals A squared plus B squared.", "start": 130.82, "duration": 7.85}, {"text": "Let’s try an example.", "start": 138.67, "duration": 3.11}, {"text": "Here’s an equation in standard form, where\nA squared is sixteen and B squared is nine.", "start": 141.78, "duration": 6.48}, {"text": "A is the distance to a vertex, so the vertices\nmust be at plus and minus four.", "start": 148.26, "duration": 5.58}, {"text": "Then, we do C squared equals sixteen plus\nnine, or twenty-five, so C is five, and the", "start": 153.84, "duration": 7.11}, {"text": "foci must be at plus and minus five.", "start": 160.95, "duration": 3.37}, {"text": "And that’s enough information to do a rough\nsketch of the hyperbola.", "start": 164.32, "duration": 5.64}, {"text": "If the X and Y terms were reversed, we would\nhave a similar situation, except that now", "start": 169.96, "duration": 5.82}, {"text": "the transverse axis is vertical, but the distance\nto the vertices and foci will remain the same.", "start": 175.78, "duration": 8.75}, {"text": "Just like with ellipses, we can also be given\ncoordinates for vertices and foci and generate", "start": 184.53, "duration": 6.07}, {"text": "the equation from that.", "start": 190.6, "duration": 2.5}, {"text": "Vertices on the X axis at plus and minus two\nand foci at plus and minus five means that", "start": 193.1, "duration": 6.65}, {"text": "twenty five equals four plus B squared, which\nmakes B squared twenty-one.", "start": 199.75, "duration": 7.38}, {"text": "So our A squared and B squared terms go here,\nthe X term comes first since it’s horizontal,", "start": 207.13, "duration": 7.67}, {"text": "and that’s the equation for the hyperbola.", "start": 214.8, "duration": 4.52}, {"text": "If you’re having trouble drawing the branches\nof the hyperbola, one thing that can help", "start": 219.32, "duration": 4.88}, {"text": "is to draw the asymptotes.", "start": 224.2, "duration": 2.96}, {"text": "These are the lines that the branches approach,\ngetting closer and closer but never touching,", "start": 227.16, "duration": 5.25}, {"text": "and for a hyperbola that opens around the\nX axis, these asymptotes are given by the", "start": 232.41, "duration": 6.06}, {"text": "equations Y equals B over A times X, and Y\nequals negative B over A times X.", "start": 238.47, "duration": 8.39}, {"text": "For a hyperbola that opens around the Y axis,\nthe asymptotes are given by the equations", "start": 246.86, "duration": 6.76}, {"text": "Y equals A over B times X, and Y equals negative\nA over B times X.", "start": 253.62, "duration": 7.22}, {"text": "If you draw these asymptotes with dotted lines,\nthey can help you draw the hyperbola a bit", "start": 260.84, "duration": 5.94}, {"text": "more accurately.", "start": 266.78, "duration": 1.55}, {"text": "Again, if a hyperbola is not in standard form\nbecause this number is not one, we just divide", "start": 268.33, "duration": 7.25}, {"text": "through by that number to get rid of it.", "start": 275.58, "duration": 2.95}, {"text": "And finally, hyperbolas can be transformed\nsimilarly to ellipses.", "start": 278.53, "duration": 5.63}, {"text": "If we rewrite as X minus H and Y minus K,\nthe point HK will be the new center of the", "start": 284.16, "duration": 6.8}, {"text": "hyperbola.", "start": 290.96, "duration": 1.0}, {"text": "That’s what we need to know about hyperbolas,\nso let’s check comprehension.", "start": 291.96, "duration": 3.84}]