[{"text": "Imagine you’re floating down a river.", "start": 3.07, "duration": 1.72}, {"text": "Maybe the stream is calm and serene, flowing\nwithout obstruction.", "start": 4.79, "duration": 3.64}, {"text": "Or perhaps it’s a rushing river, churning\nand splashing over rocks!", "start": 8.43, "duration": 3.27}, {"text": "Well, the way water moves in a river is a\nlot like how electricity flows through a wire.", "start": 11.7, "duration": 4.32}, {"text": "But when we say that electricity is flowing,\nwe’re really talking about the flow of electrons.", "start": 16.02, "duration": 4.58}, {"text": "Electric current is the total amount of charge\npassing through a wire over a period of time.", "start": 20.6, "duration": 4.939}, {"text": "But how does current actually form?", "start": 25.539, "duration": 1.78}, {"text": "What can it pass through?", "start": 27.32, "duration": 1.26}, {"text": "And what determines how strong it is?", "start": 28.58, "duration": 2.07}, {"text": "It’s time to sit back, relax, and go with\nthe flow.", "start": 30.65, "duration": 3.24}, {"text": "[Theme Music]", "start": 33.89, "duration": 12.16}, {"text": "Let’s talk about how we get charges to flow\nfrom one place to another.", "start": 46.05, "duration": 3.63}, {"text": "Last time, we learned that when there’s a difference in electric potential between two points, the voltage gives charged particles, like electrons, the energy to move from one place to another.", "start": 49.68, "duration": 8.9}, {"text": "Just like a river flows from high elevation to low elevation, electric charge flows from high voltage to low voltage.", "start": 58.58, "duration": 6.12}, {"text": "So, we need a way to generate a voltage that gets charge to flow continuously, creating an electric current.", "start": 64.7, "duration": 5.5}, {"text": "Before the 19th century, scientists had been able to generate static charge by rubbing different materials together.", "start": 70.2, "duration": 5.42}, {"text": "But they couldn’t do much more than create\nsmall sparks.", "start": 75.62, "duration": 2.68}, {"text": "They didn’t fully understand what they were doing, so they couldn’t figure out how to create a constant voltage to generate a steady flow of electricity.", "start": 78.3, "duration": 6.3}, {"text": "To solve this problem, Italian scientist Alessandro Volta invented the first voltaic cell,", "start": 84.6, "duration": 4.86}, {"text": "which uses chemical reactions to create an electric potential difference between two pieces of different metals, known as electrodes.", "start": 89.46, "duration": 6.62}, {"text": "When the two electrodes are connected, current\nbegins to flow.", "start": 96.08, "duration": 2.96}, {"text": "We call these connection points terminals, and we can connect multiple voltaic cells together by placing wires between their opposite electrodes.", "start": 99.04, "duration": 6.8}, {"text": "When one or more voltaic cells are combined, their voltages add up, and together they form a battery.", "start": 105.84, "duration": 4.98}, {"text": "Today’s batteries operate under the same\nprinciple as the very first voltaic cell.", "start": 110.82, "duration": 3.76}, {"text": "Now that we have a source for our current, we’ll also need a ground that’s connected to the wire.", "start": 114.58, "duration": 4.46}, {"text": "This is just a common conductor that ensures the current always has a path to a large reservoir of charge -- usually the Earth itself.", "start": 119.04, "duration": 6.52}, {"text": "Next, once we can generate an electric current, we’ll need a way to describe how strongly the charge flows.", "start": 125.56, "duration": 4.94}, {"text": "If you picture the cross section of a wire, you can measure how much charge flows through that cross section over a period of time.", "start": 130.5, "duration": 5.7}, {"text": "The amount of charge moving past this point, divided by the time period, gives us a value in Coulombs per second, which we call by the special unit, amperes.", "start": 136.2, "duration": 7.18}, {"text": "So one Coulomb of charge passing through that cross section of wire over one second is equal to one ampere of current.", "start": 143.38, "duration": 5.94}, {"text": "OK but wait.", "start": 149.33, "duration": 1.12}, {"text": "Did you notice that we’re talking about\npositive charge flowing through a wire?", "start": 150.45, "duration": 3.08}, {"text": "How can that be?", "start": 153.53, "duration": 1.13}, {"text": "After all, the current is made up of negatively\ncharged electrons moving through the wire.", "start": 154.66, "duration": 3.9}, {"text": "Well, when American polymath Benjamin Franklin\ndid experiments with electricity in the 1700s,", "start": 158.57, "duration": 4.98}, {"text": "he established what he thought to be the direction in which electricity flows, and he named it the “positive” direction of current.", "start": 163.55, "duration": 5.94}, {"text": "It’s a convention we still use today.", "start": 169.49, "duration": 2.1}, {"text": "It wasn’t until much later that we learned the direction Franklin chose was actually the opposite of how electrons move in a wire.", "start": 171.59, "duration": 6.72}, {"text": "But as far as electric current is concerned, the flow of negatively charged electrons in one direction is equivalent to the flow of positively charged particles in the opposite direction.", "start": 178.31, "duration": 8.73}, {"text": "While this can be confusing, remember that when we talk about the flow of current, the convention is to say the current is in the direction that positive charge flows.", "start": 187.04, "duration": 7.54}, {"text": "Now, if you’ve ever installed a battery in…anything…you also know that one terminal of a battery is called positive and the other one is negative.", "start": 194.58, "duration": 7.2}, {"text": "And conventionally speaking, current flows\nfrom the positive to the negative terminal.", "start": 201.78, "duration": 3.98}, {"text": "But this means that electrons must flow from\nthe negative terminal of the battery to the positive.", "start": 205.76, "duration": 4.64}, {"text": "Picture the positive terminal as the start of our river, up in the mountains, and the negative terminal as the end of the river, draining out into the ocean.", "start": 210.4, "duration": 6.82}, {"text": "In a river, the strength of the water’s flow depends on how far the river drops from a high point to a low point.", "start": 217.22, "duration": 5.74}, {"text": "And the same is true for electric current\nand voltage.", "start": 222.96, "duration": 2.32}, {"text": "A high voltage typically corresponds to a\nhigh current in a circuit.", "start": 225.29, "duration": 3.42}, {"text": "But voltage alone doesn’t determine how\nmuch current flows.", "start": 228.71, "duration": 2.88}, {"text": "Just like rocks and branches obstruct the passage of water, the materials used to conduct electricity have properties that impede the perfect flow of electrons.", "start": 231.59, "duration": 7.231}, {"text": "This property is known as resistance.", "start": 238.821, "duration": 1.96}, {"text": "And resistance is described in Ohms, where one Ohm of resistance would let one Volt of potential generate one Ampere of current.", "start": 240.781, "duration": 6.899}, {"text": "When resistance is constant, voltage is directly\nproportional to current.", "start": 247.68, "duration": 4.0}, {"text": "And this relationship is known as Ohm’s\nLaw.", "start": 251.68, "duration": 2.38}, {"text": "This law assumes that the resistance of a\nmaterial is constant.", "start": 254.07, "duration": 2.97}, {"text": "So we can express voltage simply as current\ntimes resistance.", "start": 257.04, "duration": 3.28}, {"text": "There are substances in which the resistance is not constant, and it changes with current or voltage.", "start": 260.32, "duration": 5.12}, {"text": "But for many materials -- known as ohmic materials\n-- Ohm’s law works quite well.", "start": 265.44, "duration": 4.04}, {"text": "Now, in ohmic materials, we can use our new expression of Ohm’s Law to predict and calculate the behavior of a circuit.", "start": 269.48, "duration": 5.2}, {"text": "Let’s say we have a 9 Volt battery, and we want to know how much current it supplies to a light bulb when we complete the circuit.", "start": 274.68, "duration": 5.82}, {"text": "If we know the system has a total resistance of 15 Ohms, we can divide the battery’s voltage by the resistance, to find that it has a current of 0.6 amperes, or 600 milliamperes.", "start": 280.5, "duration": 10.9}, {"text": "And whether it’s a light bulb, a speaker system, or a supercomputer, most electrical devices and materials contain some level of resistance.", "start": 291.4, "duration": 7.14}, {"text": "Even wires in a circuit have some resistance, but compared to the resistance of a connected device like a light bulb, it’s so minuscule that we typically neglect it.", "start": 298.54, "duration": 7.84}, {"text": "But you want to know a neat trick?", "start": 306.38, "duration": 1.56}, {"text": "Well it doesn't matter because I'm going to tell you, anyway.", "start": 307.94, "duration": 1.74}, {"text": "If you can make certain conductive materials\nextremely cold, you can bring their resistance to zero.", "start": 309.68, "duration": 5.3}, {"text": "We call these materials superconductors, and trust me when I say that research into these materials is a very important -- and lucrative -- field of study.", "start": 314.98, "duration": 8.04}, {"text": "Because, if you can reduce the resistance of a material, by getting rid of that natural loss of energy, you can significantly increase the amount of electricity you transmit.", "start": 323.02, "duration": 7.7}, {"text": "And in all aspects of engineering, efficiency\nis key.", "start": 330.73, "duration": 3.17}, {"text": "Now, in that spirit, I should probably point out here that the whole point of batteries isn’t to just push electrons around.", "start": 333.9, "duration": 5.38}, {"text": "We need to put those electrons to work.", "start": 339.28, "duration": 2.0}, {"text": "For example, when we attach a battery to a light bulb, we take the potential energy in the battery and turn it into what we need, light.", "start": 341.28, "duration": 6.22}, {"text": "As current flows through the light bulb, the small piece of filament provides resistance, which transfers electric energy into thermal energy and light.", "start": 347.5, "duration": 7.48}, {"text": "And since we’re dealing with energy transformed over time, what we really want to know is how much power is used by the bulb.", "start": 354.98, "duration": 5.58}, {"text": "Power is the amount of energy transformed\nby a device over time.", "start": 360.56, "duration": 3.74}, {"text": "And by “transformed,” I mean the energy is converted from electric energy into some other useful kind of energy, like heat or light.", "start": 364.3, "duration": 6.14}, {"text": "We’ve already learned how to calculate how much energy is in a certain amount of charge that’s moving between a difference in potential -- that is, the voltage.", "start": 370.44, "duration": 7.48}, {"text": "And since charge transferred over time is just current, it follows that the power used by the bulb is equal to the current in the circuit times the voltage across the system.", "start": 377.92, "duration": 9.0}, {"text": "And just like in our other calculations of power, our resulting units are in Watts, named for Scottish inventor James Watt.", "start": 386.92, "duration": 6.7}, {"text": "This equation holds true for the power used by any electronic device, or the power supplied by a battery.", "start": 393.62, "duration": 5.56}, {"text": "Now, anything that consumes power -- from a light bulb to a refrigerator to an entire house -- can be modeled in our equations as a resistor, because they create resistance.", "start": 399.2, "duration": 9.16}, {"text": "And if you want to find the power that’s consumed by a resistor, you can substitute Ohm’s law into the power equation to discover some helpful relationships that hold true for all ohmic materials.", "start": 408.36, "duration": 9.84}, {"text": "Let’s start with the fact that power is a function of current through, and voltage across, a resistor.", "start": 418.2, "duration": 4.9}, {"text": "And Ohm’s law is about relating voltage,\ncurrent, and resistance together.", "start": 423.1, "duration": 3.16}, {"text": "So, you can either replace the current in the equation, and get a new power equation in terms of voltage and resistance", "start": 426.26, "duration": 5.499}, {"text": "…or you can replace the voltage, and get an expression in terms of only current and resistance.", "start": 431.76, "duration": 5.34}, {"text": "This is especially useful when you don’t\nhave all the possible information about the circuit.", "start": 437.1, "duration": 4.18}, {"text": "So that’s your introduction to electric\ncurrents!", "start": 441.28, "duration": 2.28}, {"text": "They really are just like flowing rivers!", "start": 443.56, "duration": 1.76}, {"text": "And, once you understand the elegant math\nbehind them, they’re almost as beautiful.", "start": 445.33, "duration": 3.75}, {"text": "Today we learned about what defines electric current and how we generate it using voltaic cells that make up batteries.", "start": 449.08, "duration": 5.22}, {"text": "We also learned about Ohm’s Law and the\nrelationship between voltage, current, and resistance.", "start": 454.3, "duration": 4.74}, {"text": "Finally, we discussed what power is and how we measure the power produced and consumed in a circuit.", "start": 459.04, "duration": 5.18}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 464.22, "duration": 4.08}, {"text": "You can head over to their channel to check out amazing shows like PBS Game Show, The Good BBQ With Franklin, and Blank on Blank.", "start": 468.3, "duration": 5.98}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 474.28, "duration": 3.84}, {"text": "with the help of these amazing people and\nour equally amazing graphics team, is Thought Cafe.", "start": 478.12, "duration": 4.76}]