[{"text": "Here's a question for you:", "start": 3.06, "duration": 1.28}, {"text": "If you shine a light on a coin that’s hanging in mid-air, what do you think its shadow will look like?", "start": 4.34, "duration": 5.0}, {"text": "Do you think its shadow would have a bright\nspot of light right in the middle of it?", "start": 9.34, "duration": 3.3}, {"text": "Because it would!", "start": 12.64, "duration": 1.0}, {"text": "It might seem counterintuitive, and 19th-century physicists thought so too, when they tried this experiment.", "start": 13.64, "duration": 4.46}, {"text": "But that little spot in the middle of the coin's shadow helps prove one of the most important discoveries ever made in physics:", "start": 18.1, "duration": 5.56}, {"text": "Light is a wave.", "start": 23.66, "duration": 2.04}, {"text": "[Theme Music]", "start": 25.7, "duration": 12.5}, {"text": "In the 17th and 18th centuries, most physicists thought that light was a particle, because it often behaved like one.", "start": 38.2, "duration": 5.74}, {"text": "But over the years, some scientists began\nto think that it might actually be a wave.", "start": 43.95, "duration": 4.02}, {"text": "They did experiments to test this idea, and\nslowly, evidence started to build.", "start": 47.97, "duration": 4.03}, {"text": "We now know that light is both a particle and a wave – a strange-sounding concept that we'll explore more later on.", "start": 52.0, "duration": 5.24}, {"text": "But the point is, light is a wave, and we know this because waves behave in very specific (and sometimes weird) ways.", "start": 57.24, "duration": 5.64}, {"text": "One of the most important reasons that light acts the way it does is known as Huygens' Principle.", "start": 62.88, "duration": 4.36}, {"text": "Christian Huygens was a 17th-century Dutch\nphysicist who believed light acted as a wave.", "start": 67.24, "duration": 4.36}, {"text": "He came up with a way to predict how a wave will spread out, and we still use his method today.", "start": 71.6, "duration": 4.7}, {"text": "Huygens’ Principle says that you can predict a wave’s position in the future by analyzing its current position.", "start": 76.3, "duration": 5.38}, {"text": "All you have to do is think of each point on the wave as the source of its own, tinier wave.", "start": 81.68, "duration": 4.54}, {"text": "See, Huygens knew that when you multiply the velocity of something by the amount of time it's traveled, you can figure out how far it went.", "start": 86.22, "duration": 6.18}, {"text": "And he figured that this would also be true\nfor each individual point on a wave.", "start": 92.4, "duration": 3.64}, {"text": "Let's say you have a wave that's traveling 10 centimeters per second, and you want to know what the wave will look like after 2 seconds.", "start": 96.04, "duration": 6.08}, {"text": "To use Huygens' principle, you first draw\na bunch of little points along a wave.", "start": 102.12, "duration": 3.819}, {"text": "Then, you draw a half-circle around each point, in front of the wave, with a radius equal to the wave's velocity multiplied by time – so, 20 centimeters.", "start": 105.94, "duration": 8.16}, {"text": "Each of those little half-circles is called\na wavelet.", "start": 114.1, "duration": 2.439}, {"text": "Finally, you draw a curve that's tangent to each wavelet, meaning that it touches each half circle at exactly one point.", "start": 116.54, "duration": 6.44}, {"text": "That line shows the location of the wave after\ntwo seconds!", "start": 122.98, "duration": 3.0}, {"text": "So a two-dimensional wave traveling through\nempty space will look pretty simple;", "start": 125.98, "duration": 4.0}, {"text": "it's basically an expanding circle.", "start": 129.99, "duration": 1.73}, {"text": "But things get a little more complicated when\na wave hits an obstacle.", "start": 131.72, "duration": 3.18}, {"text": "For example, let's apply Huygens' principle to a\nwave that moves past the edge of a flat object.", "start": 134.9, "duration": 4.58}, {"text": "When the wave hits the obstacle, part of it\ngets blocked.", "start": 139.48, "duration": 2.66}, {"text": "But the part that isn’t blocked keeps moving past the edge, and it follows Huygens' principle, forming wavelets.", "start": 142.14, "duration": 6.04}, {"text": "The wavelets from the part of the wave near\nthe edge will curve behind the edge.", "start": 148.18, "duration": 3.58}, {"text": "And when you draw a line to connect all the wavelets, you end up with a line that bends around the edge.", "start": 151.76, "duration": 4.5}, {"text": "In the same way, when a wave moves through a slit that's roughly the same width as its wavelength, it travels past the slit in a circular curve that spreads outward.", "start": 156.26, "duration": 8.22}, {"text": "When waves are re-shaped by obstacles, that's\ncalled diffraction.", "start": 164.48, "duration": 3.72}, {"text": "And it's very different from what a stream\nof particles would do.", "start": 168.2, "duration": 2.649}, {"text": "For example, if you rolled a bunch of marbles straight through a doorway, you'd expect them all to hit the far wall directly opposite the doorway.", "start": 170.849, "duration": 6.851}, {"text": "They wouldn't hit the wall in places to the\nright or to the left of the door.", "start": 177.7, "duration": 3.2}, {"text": "But when waves diffract, they often spread\noutward behind obstacles.", "start": 180.9, "duration": 3.68}, {"text": "Diffraction is one of the reasons there's a bright spot in the middle of the shadow when you shine a light on a round object.", "start": 184.58, "duration": 5.28}, {"text": "The other reason is interference.", "start": 189.86, "duration": 1.7}, {"text": "In our lesson on traveling waves, we described\nwhat happens when waves run into each other:", "start": 191.569, "duration": 4.04}, {"text": "they interfere in one of two ways.", "start": 195.609, "duration": 1.751}, {"text": "Waves interfere constructively when the crests of both waves end up in the same spot, and so do their troughs.", "start": 197.36, "duration": 5.58}, {"text": "The waves essentially combine into one wave that has a larger amplitude – with higher crests and lower troughs – than either of the two waves did before.", "start": 202.94, "duration": 7.7}, {"text": "But waves interfere DEstructively when one wave's crest run into the other wave's trough, and vice versa.", "start": 210.64, "duration": 5.72}, {"text": "In that case, the combined wave has a lower\namplitude than either of the waves did before.", "start": 216.36, "duration": 4.18}, {"text": "With perfectly destructive interference, the waves actually disappear completely; they flatten out.", "start": 220.54, "duration": 4.8}, {"text": "Together, diffraction and interference help explain the results of the famous double-slit experiment conducted by English physicist Thomas Young in 1801.", "start": 225.34, "duration": 8.92}, {"text": "Young covered a window so that only a very narrow stream of sunlight passed through a slit into the room.", "start": 234.26, "duration": 5.08}, {"text": "Then, he positioned a plate with two more tiny slits cut into it, spaced very close together so that the single beam of sunlight passed through them.", "start": 239.34, "duration": 7.48}, {"text": "Finally, he placed a screen behind the slits.", "start": 246.82, "duration": 2.54}, {"text": "If light were just a stream of particles, you'd expect to see two bright lines on the screen, behind the two slits.", "start": 249.36, "duration": 5.5}, {"text": "But that's not what Young saw.", "start": 254.86, "duration": 1.48}, {"text": "His screen had many lines on it.", "start": 256.34, "duration": 1.8}, {"text": "There was a bright line in the middle, then\nmore bright lines above and below it.", "start": 258.14, "duration": 3.599}, {"text": "This pattern is called a diffraction pattern, and it comes from the diffraction and interference of light waves.", "start": 261.74, "duration": 4.78}, {"text": "Light waves interfere constructively when\nthey’re lined up exactly right.", "start": 266.52, "duration": 3.66}, {"text": "For example, to form that line on the screen between the two slits the waves from each slit travel exactly the same distance.", "start": 270.18, "duration": 6.18}, {"text": "So they line up, interfere constructively, which increases their amplitude to create a bright spot.", "start": 276.36, "duration": 5.22}, {"text": "But in other places on the screen, there’s a difference between the distances traveled by each wave.", "start": 281.58, "duration": 4.32}, {"text": "This is called the path difference.", "start": 285.9, "duration": 1.58}, {"text": "So light waves will interfere either constructively or destructively, depending on the size of this path difference.", "start": 287.48, "duration": 5.86}, {"text": "When the waves are an exact number of wavelengths apart, the crests and troughs will line up – creating constructive interference and a bright line.", "start": 293.34, "duration": 7.12}, {"text": "But when the waves are shifted by exactly half a wavelength — or by 1.5 wavelengths, or 2.5, and so on – light rays will interfere DEstructively.", "start": 300.46, "duration": 8.08}, {"text": "By using trigonometry, you can calculate the\npath difference in a slit experiment:", "start": 308.54, "duration": 4.16}, {"text": "It’s equal to the distance between the center\nof each slit, d,", "start": 312.7, "duration": 3.1}, {"text": "multiplied by the sine of the angle between the point on the screen and the straight line between the slits and the screen.", "start": 315.8, "duration": 5.04}, {"text": "Now, since light is a wave, it has the same\nproperties as other waves.", "start": 320.85, "duration": 3.82}, {"text": "Intensity, for example, is the energy transported\nby the light per unit area, over time.", "start": 324.67, "duration": 4.98}, {"text": "Essentially, intensity is the brightness of\nthe light.", "start": 329.65, "duration": 2.75}, {"text": "As with other waves, intensity is proportional\nto the amplitude squared.", "start": 332.41, "duration": 3.87}, {"text": "So if you double the amplitude of a wave's\npeaks, it gets four times as bright.", "start": 336.28, "duration": 3.72}, {"text": "If you triple the amplitude, it gets nine\ntimes as bright.", "start": 340.0, "duration": 2.68}, {"text": "When light passes through two slits like in the double-slit experiment, the line in the center will be the most intense.", "start": 342.68, "duration": 5.66}, {"text": "And the farther the lines get from the center, the less intense, and therefore, the less bright, they'll be.", "start": 348.34, "duration": 4.68}, {"text": "Like other waves, light also has a frequency\nand wavelength.", "start": 353.02, "duration": 3.58}, {"text": "These determine whether light is visible,\nand if so, what its color is.", "start": 356.6, "duration": 3.32}, {"text": "Light with a higher frequency, and therefore a shorter wavelength, is on the bluer side of the spectrum.", "start": 359.92, "duration": 4.94}, {"text": "Light with a lower frequency and longer wavelength\nis on the redder side of the spectrum.", "start": 364.86, "duration": 4.16}, {"text": "White light – like from sunlight – is actually\nall of the different colors of light combined.", "start": 369.02, "duration": 4.48}, {"text": "When white light passes through the two slits in the experiment, they interfere in a way that allows you to see this rainbow of colors in the lines on the screen.", "start": 373.5, "duration": 7.16}, {"text": "But the double-slit experiment isn't the only situation where light creates a diffraction pattern.", "start": 380.66, "duration": 4.48}, {"text": "Diffraction will happen when light passes\nthrough a single slit, too,", "start": 385.14, "duration": 3.36}, {"text": "producing a pattern that looks like a series of lines\nthat get dimmer the farther you get from the center.", "start": 388.5, "duration": 4.38}, {"text": "The light will be brightest on the part of the\nscreen that's opposite the middle of the slit.", "start": 392.88, "duration": 3.66}, {"text": "That bright line is created by the rays that go straight through the slit, perpendicular to the plate.", "start": 396.54, "duration": 4.86}, {"text": "They have a path difference of zero.", "start": 401.4, "duration": 1.699}, {"text": "But to reach the other points on the screen, different rays of light travel different distances, depending on their angle going through the slit.", "start": 403.1, "duration": 6.219}, {"text": "And again, whether the light interferes constructively\nor destructively depends on how the rays line up.", "start": 409.32, "duration": 4.86}, {"text": "For a single slit, the path difference is between the light coming from the very top of the slit and the light coming from the very bottom of the slit.", "start": 414.18, "duration": 6.78}, {"text": "The path difference is equal to the width of the slit, D, times the sine of the angle between the point on the screen and a line straight from the slit to the screen.", "start": 420.96, "duration": 7.5}, {"text": "If the path difference is one wavelength long, then the path difference between the light from the top of the slit and the light from the center of the slit is only half a wavelength.", "start": 428.46, "duration": 8.44}, {"text": "The same holds true for the path difference between the light from the center of the slit and the bottom.", "start": 436.9, "duration": 4.06}, {"text": "So a total path difference of a full wavelength means that for each light ray coming through the slit at that angle, there's a corresponding light ray that's shifted by half a wavelength.", "start": 440.96, "duration": 9.0}, {"text": "And remember: when waves of light are shifted by half a wavelength, that means one wave’s crests line up with the other’s trough, causing destructive interference.", "start": 449.96, "duration": 8.36}, {"text": "So, for a single slit, when the total path\ndifference is equal to a full wavelength,", "start": 458.32, "duration": 4.1}, {"text": "you end up with pairs of waves that cancel\neach other out and make a dark line.", "start": 462.43, "duration": 3.82}, {"text": "Now, constructive interference through a single\nslit works a little differently.", "start": 466.25, "duration": 3.65}, {"text": "When the path difference between the top and bottom of the slit is equal to 1.5 wavelengths – or 2.5 wavelengths, and so on – there will be a bright line.", "start": 469.9, "duration": 8.28}, {"text": "That’s where the rays interfere constructively.", "start": 478.189, "duration": 2.46}, {"text": "As with the previous example, this also has to do with the path difference between individual rays passing through the single slit.", "start": 480.649, "duration": 6.05}, {"text": "Say the light is angled so that the total path difference between the top and bottom of the slit is 1.5 wavelengths.", "start": 486.7, "duration": 5.74}, {"text": "The rays passing through the middle third and bottom third of the slit will be half a wavelength apart, so they'll cancel each other out.", "start": 492.44, "duration": 6.06}, {"text": "But that top third won't cancel with anything –\ninstead, it will reach the screen, creating a bright line.", "start": 498.5, "duration": 5.56}, {"text": "So, how do diffraction and interference create the\nphenomenon we see in the shadow of the coin?", "start": 504.06, "duration": 4.52}, {"text": "Diffraction makes the light waves curve around\nthe coin’s edges.", "start": 508.58, "duration": 3.34}, {"text": "When these diffracted waves run into each\nother, they interfere.", "start": 511.92, "duration": 2.96}, {"text": "The places where the waves interfere destructively\nbecome shadows.", "start": 514.89, "duration": 3.38}, {"text": "That's what makes those little ripples spreading\noutward from the circular shadow.", "start": 518.27, "duration": 3.61}, {"text": "But the places where the waves interfere constructively\nbecome bright spots.", "start": 521.89, "duration": 4.03}, {"text": "That’s why there's a bright spot right in\nthe middle of the coin's shadow!", "start": 525.92, "duration": 2.94}, {"text": "At that point, the waves of light that diffracted around the edges of the coin have all traveled the same distance.", "start": 528.86, "duration": 5.22}, {"text": "So the crests of different light waves combine, and so do the troughs, forming one wave with a higher amplitude.", "start": 534.08, "duration": 5.56}, {"text": "And a bright spot.", "start": 539.64, "duration": 1.36}, {"text": "Today, you learned about the wave theory of\nlight.", "start": 541.01, "duration": 1.78}, {"text": "We talked about Huygens' principle,", "start": 542.79, "duration": 1.58}, {"text": "and described how diffraction and interference\nlead to the results of the double-slit experiment.", "start": 544.37, "duration": 4.44}, {"text": "We also explored the diffraction pattern from\na single slit.", "start": 548.81, "duration": 2.57}, {"text": "Finally, we explained the diffraction pattern\nfor a disk.", "start": 551.38, "duration": 3.01}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 554.39, "duration": 3.37}, {"text": "You can head over to their channel and check\nout a playlist of the latest episodes from shows like:", "start": 557.76, "duration": 4.66}, {"text": "PBS Space Time, Blank on Blank, and BBQ With\nFranklin.", "start": 562.42, "duration": 3.52}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 565.94, "duration": 4.06}, {"text": "with the help of these amazing people and our\nequally amazing graphics team, is Thought Cafe.", "start": 570.0, "duration": 4.78}]