[{"text": "It’s Professor Dave, let’s graph some\nellipses.", "start": 0.16, "duration": 2.88}, {"text": "We just learned how to graph circles, so let’s\nmove on the next type of conic section, the ellipse.", "start": 9.74, "duration": 6.78}, {"text": "Let’s recall that while a circle is the\nconic section formed when a plane intersects", "start": 16.52, "duration": 5.7}, {"text": "this cone parallel to the base, an ellipse\nis what we get when this plane is not parallel", "start": 22.23, "duration": 6.18}, {"text": "to the base, but it still just intersects\none half of the cone.", "start": 28.41, "duration": 4.78}, {"text": "So that’s one way to define an ellipse.", "start": 33.19, "duration": 3.04}, {"text": "Another way is to say that an ellipse is the\nset of all points surrounding two foci, whereby", "start": 36.23, "duration": 6.84}, {"text": "the distance from a point to one focus plus\nthe distance from that point to the other", "start": 43.07, "duration": 6.33}, {"text": "focus is constant.", "start": 49.4, "duration": 2.319}, {"text": "No matter what point we are looking at on\nthis ellipse, the sum of these two distances", "start": 51.719, "duration": 5.781}, {"text": "will be the same.", "start": 57.5, "duration": 1.89}, {"text": "As it gets closer to one, it’s farther from\nthe other, and vice versa.", "start": 59.39, "duration": 5.84}, {"text": "The midpoint of the line segment that connects\nthe foci is the center of the ellipse.", "start": 65.23, "duration": 7.02}, {"text": "Ellipses also have two axes of symmetry, a\nmajor axis, which will be the longer one,", "start": 72.25, "duration": 5.8}, {"text": "and a minor axis, which is the shorter one.", "start": 78.05, "duration": 4.24}, {"text": "At each end of the major axis we can find\na vertex.", "start": 82.29, "duration": 4.17}, {"text": "And that’s all the terminology we need to\nknow.", "start": 86.46, "duration": 3.06}, {"text": "The standard form of the equation of an ellipse\nthat has its center at the origin looks like this.", "start": 89.52, "duration": 7.64}, {"text": "It’s similar to the equation for a circle,\nbut we have these terms A and B, which give", "start": 97.2, "duration": 5.28}, {"text": "us information about the major and minor axes.", "start": 102.49, "duration": 3.66}, {"text": "Specifically, the major axis has a length\nof two A, and the minor axis has a length", "start": 106.15, "duration": 6.31}, {"text": "of two B, or we could think of A as the distance\nfrom the center to a vertex on the major axis,", "start": 112.46, "duration": 7.75}, {"text": "which means that positive and negative A are\nthe X intercepts and positive and negative", "start": 120.21, "duration": 5.99}, {"text": "B are the Y intercepts.", "start": 126.2, "duration": 2.839}, {"text": "Beyond this, we can use this equation, C squared\nequals A squared minus B squared, and if we", "start": 129.039, "duration": 8.131}, {"text": "solve for C, that is the distance from the\ncenter to either of the foci.", "start": 137.17, "duration": 7.94}, {"text": "If an ellipse has its equation in standard\nform, with a one over here, it’s very easy", "start": 145.11, "duration": 5.48}, {"text": "to graph it.", "start": 150.59, "duration": 1.56}, {"text": "Say we have a nine for A squared and a four\nfor B squared.", "start": 152.15, "duration": 5.01}, {"text": "That means A is three and B is two, so we\nwould just draw the four intercepts, connect", "start": 157.16, "duration": 6.4}, {"text": "them, and there’s the ellipse.", "start": 163.56, "duration": 3.56}, {"text": "The foci are not part of the ellipse, but\nif we need those as well, that will come from", "start": 167.12, "duration": 5.36}, {"text": "C squared equals nine minus four, or C equals\nplus or minus root five.", "start": 172.48, "duration": 8.66}, {"text": "We should note that A is always greater than\nB, so if the term below X squared is greater", "start": 181.14, "duration": 5.56}, {"text": "than the term below Y squared, we have A here\nand B here, which produces an ellipse that", "start": 186.7, "duration": 6.21}, {"text": "is wider than it is tall.", "start": 192.91, "duration": 3.72}, {"text": "But if the other number is larger, then this\nterm is A squared, and this other term is", "start": 196.63, "duration": 5.59}, {"text": "B squared.", "start": 202.22, "duration": 1.58}, {"text": "This is because the ellipse will now be taller\nthan it is wide, but the A term must always", "start": 203.8, "duration": 5.93}, {"text": "correspond to the major axis, which is the\nlonger axis, so that will now be the vertical", "start": 209.73, "duration": 6.16}, {"text": "axis given by Y.", "start": 215.89, "duration": 1.45}, {"text": "Let’s say we have an equation for an ellipse\nwhere this number doesn’t equal one.", "start": 217.34, "duration": 6.41}, {"text": "We will have to divide the entire equation\nby this term so that we get a one on this", "start": 223.75, "duration": 5.51}, {"text": "side, as it will be easier to graph in standard\nform, even if we end up with weird numbers", "start": 229.26, "duration": 5.37}, {"text": "for A and B.", "start": 234.63, "duration": 1.579}, {"text": "We could also graph an ellipse if given information\nabout its foci and vertices.", "start": 236.209, "duration": 6.39}, {"text": "Say the foci are at plus and minus one, while\nthe vertices are at plus and minus two.", "start": 242.599, "duration": 6.261}, {"text": "That means that C is one and A is two.", "start": 248.86, "duration": 4.79}, {"text": "It will then be true that one equals four\nminus B squared, or B squared equals three.", "start": 253.65, "duration": 7.42}, {"text": "Then we just put A squared and B squared into\nthe standard form, and there’s our equation.", "start": 261.07, "duration": 9.16}, {"text": "Ellipses can be transformed by some of the\nways we already know, except in this case,", "start": 270.23, "duration": 5.28}, {"text": "we can write X minus H quantity squared and\nY minus K quantity squared rather than X squared", "start": 275.51, "duration": 6.9}, {"text": "and Y squared, and these H and K values will\nbe the horizontal and vertical shifts respectively.", "start": 282.41, "duration": 7.33}, {"text": "Notice the minus signs, so X minus two will\nmean a shift of two to the right, not left.", "start": 289.74, "duration": 6.11}, {"text": "When we have H and K terms, the ellipse has\na center at the point H, K, and everything", "start": 295.85, "duration": 6.1}, {"text": "else we learned about the axes and foci will\nstay the same.", "start": 301.95, "duration": 5.14}, {"text": "That’s really all we need to know about\nellipses right now.", "start": 307.09, "duration": 4.29}, {"text": "These are extremely important shapes for astronomy\nand astrophysics, so if you move on to my", "start": 311.38, "duration": 4.75}, {"text": "astronomy course, you will learn all about\nhow celestial objects, like planets and comets,", "start": 316.13, "duration": 6.02}, {"text": "follow elliptical orbits, rather than circular\nones as originally thought many centuries ago.", "start": 322.15, "duration": 5.83}, {"text": "But for right now, we’ve got a lot more\nmath  to cover, so let's check comprehension.", "start": 327.98, "duration": 3.8}]