[{"text": "For the last 38 episodes of Crash Course Biology, we've talked about how to make an organism.", "start": 0.21, "duration": 5.531}, {"text": "And you know what I've learned in those 38 weeks?", "start": 5.741, "duration": 2.428}, {"text": "Putting a living thing together is hard!", "start": 8.169, "duration": 2.7}, {"text": "There are molecules that make up organelles that run cells, which come together to form tissues, which make up organs that make up systems.", "start": 10.869, "duration": 8.431}, {"text": "And knowing this stuff is incredibly important, because it shows us the ground rules for being a living thing, on this particular planet anyway.", "start": 19.3, "duration": 6.549}, {"text": "But still, there's so much more to biology than that!", "start": 25.849, "duration": 2.58}, {"text": "I mean, understanding how an organism goes about its internal business is great, but it doesn't tell us much about its place in our world.", "start": 28.429, "duration": 6.905}, {"text": "For that, we need ecology, the study of the rules of engagement for all of us Earthlings.", "start": 35.334, "duration": 5.062}, {"text": "Ecology seeks to explain why the world looks and acts the way it does.", "start": 40.396, "duration": 4.063}, {"text": "Why the South Pole looks different from the Congo, and why there are mosquitos all over the place while black rhinos are practically extinct.", "start": 44.459, "duration": 7.361}, {"text": "The short answer to this question is:", "start": 51.82, "duration": 1.759}, {"text": "because the world is crammed with things, both animate and not, that have been interacting with each other all the time, every day, since life on this planet began.", "start": 53.579, "duration": 9.361}, {"text": "The even shorter answer is that all life and all of these things interacting with each other depend on just two things.", "start": 62.94, "duration": 5.74}, {"text": "Try to guess what they are.", "start": 68.68, "duration": 1.479}, {"text": "In the meantime, get ready, because Crash Course Biology is taking its final voyage outside the body and into the entire world!", "start": 70.159, "duration": 8.563}, {"text": "[Theme Music]", "start": 78.722, "duration": 9.802}, {"text": "In a way, you can think of all living things, great white sharks, pond scum, potato plants, as molecules that react with each other. ", "start": 88.524, "duration": 6.205}, {"text": "Each one of us organisms is pretty piddling in the scheme of things, just like a single oxygen molecule, which we need to make ATP to fuel our bodies.", "start": 94.729, "duration": 6.869}, {"text": "But it can't get much done by itself.", "start": 101.598, "duration": 2.432}, {"text": "But if you get a million oxygen molecules together with some other types of molecules, suddenly they're unleashing a googlejillion megawatts of ATP power to animate the bag of meat that is you.", "start": 104.03, "duration": 9.56}, {"text": "This same principle applies to organisms:", "start": 113.59, "duration": 1.879}, {"text": "As you put individual organisms together, they can interact with each other and their environments, to create something larger than the sum of its parts.", "start": 115.469, "duration": 6.573}, {"text": "And just as every organism has a hierarchy of biological systems, from molecules to organelles to cells to tissues and organs, so too does Earth have tiers of ecological order.", "start": 122.042, "duration": 10.418}, {"text": "Like, when a bunch of members of a species are together in a certain area, and they interact pretty often, you've got a population.", "start": 132.46, "duration": 6.772}, {"text": "Population ecologists study why populations grow or shrink over time, depending on where they are.", "start": 139.232, "duration": 5.068}, {"text": "When two or more populations of different species live together,  we call that a community.", "start": 144.3, "duration": 4.356}, {"text": "You can think of an ecological community as Mr. Roger's Neighborhood, but with the people in the neighborhood eating each other sometimes.", "start": 148.656, "duration": 5.429}, {"text": "Because that's what species do when they live together, they interact.", "start": 154.085, "duration": 2.835}, {"text": "Sometimes that means predation, sometimes cooperation, and sometimes competition for resources like food, water and living space.", "start": 156.92, "duration": 6.24}, {"text": "So, a community ecologist studies how the interactions between community members and their environment affect how many of each species there are within a community.", "start": 163.16, "duration": 7.53}, {"text": "One level up from communities are ecosystems, which are made up of groups of organisms in a specific area and the nonliving parts of their environment, like soil, water, and air.", "start": 170.69, "duration": 9.7}, {"text": "If you take a bunch of living things and plop them down in one place that has a specific mix of climate, soil chemistry, and topography, that's going to make up one kind of ecosystem.", "start": 180.39, "duration": 8.84}, {"text": "But if you put them down in a completely different place, they're going to work in completely different ways to form a completely different ecosystem.", "start": 189.23, "duration": 6.199}, {"text": "Ecosystem ecology specifically explores how energy and materials flow through an ecosystem, and how the physical environment impacts the stuff living there.", "start": 195.429, "duration": 7.181}, {"text": "Now, a lot of people get ecosystems confused with the next step up: which is biomes.", "start": 202.61, "duration": 3.74}, {"text": "A biome, however, is where organisms have evolved similar techniques to adapt to a general set of conditions.", "start": 206.35, "duration": 5.62}, {"text": "For example, a grassland is a kind of biome--there are scores of different grassland ecosystems all over the globe,", "start": 211.97, "duration": 5.614}, {"text": "but the organisms in each one have made similar evolutionary concessions to all the conditions that grasslands share, like your hot summers, and your cold winters, and not too much rain, but more rain than you'd find in a desert biome.", "start": 217.584, "duration": 10.526}, {"text": "Other biomes include tropical rainforest, tundra, deserts, and oceans.", "start": 228.11, "duration": 3.224}, {"text": "The only level above the biome is the biosphere, which includes the atmosphere, the whole earth and everything that gets used by anything that's alive.", "start": 231.334, "duration": 7.336}, {"text": "So, why do all of these many levels of ecological activity look the way that they do?", "start": 238.67, "duration": 5.07}, {"text": "Like, why do some organisms like to live in one place but not another?", "start": 243.74, "duration": 3.75}, {"text": "And what makes Earth's various populations, communities, ecosystems, and biomes different from each other?", "start": 247.49, "duration": 4.61}, {"text": "Well, factors that determine what a place is gonna look like fall into two different categories: biotic, or living, and abiotic, not living.", "start": 252.1, "duration": 6.876}, {"text": "Biotic factors include stuff like predators, as well as animals or plants that provide either competition or some benefit, like food or shelter.", "start": 258.976, "duration": 6.764}, {"text": "Abiotic factors, on the other hand, include temperature, moisture, sunlight, elevation, elements that have nothing to do with organisms in the ecosystem, but which influence them just as much as other living things do.", "start": 265.74, "duration": 9.75}, {"text": "Now, from these two categories, the most influential factors are the ones that living things are most particular about.", "start": 275.49, "duration": 5.669}, {"text": "That is, the things they need most, but only at certain levels.", "start": 281.159, "duration": 3.54}, {"text": "And these preferences all come down to chemistry.", "start": 284.699, "duration": 2.62}, {"text": "For example, almost all chemical reactions that happen inside living things are governed by enzymes.", "start": 287.319, "duration": 4.88}, {"text": "They're the catalysts for pretty much all the action going on inside you.", "start": 292.199, "duration": 3.421}, {"text": "And these enzymes are most effective within a set of temperatures:", "start": 295.62, "duration": 3.515}, {"text": "Chemical reactions within the body slow way down when it's really cold, and very high temperatures change the shape of enzymes, making them less effective.", "start": 299.135, "duration": 7.699}, {"text": "So temperature is one of the major factors that determines  why animals live in certain places.", "start": 306.834, "duration": 4.925}, {"text": "And if you look at the places on the earth with the most biodiversity, or different kinds of living things, you'll find that it's in the places where the temperature's within the ideal range for enzyme function.", "start": 311.759, "duration": 8.321}, {"text": "What else?", "start": 320.08, "duration": 0.8}, {"text": "Well, everybody's got to eat, at least if you're an animal or a fungus or some other kind of heterotroph, so you'd think that food would also be way up on the list.", "start": 320.88, "duration": 6.67}, {"text": "But actually, it's plants and other autotrophs like cyanobacteria and protists that are the base of nearly every food chain, and they have to be fed, too.", "start": 327.55, "duration": 7.889}, {"text": "So again, it comes down to chemistry.", "start": 335.439, "duration": 2.176}, {"text": "The key ingredient plants need for photosynthesis is water, which is also what we need to burn ATP, maintain homeostasis in our bodies, and all that jazz.", "start": 337.615, "duration": 8.315}, {"text": "So the quest for food ultimately comes down for a need for water.", "start": 345.93, "duration": 4.185}, {"text": "So, yeah: surprise!", "start": 350.115, "duration": 1.004}, {"text": "Water and temperature are the two things that organisms care about the most.", "start": 351.119, "duration": 3.751}, {"text": "Ergo, they're what ecologists focus on when determining why certain organisms hang out in one place over another.", "start": 354.87, "duration": 6.299}, {"text": "Together, these two factors define every biome on the planet.", "start": 361.169, "duration": 3.191}, {"text": "For instance, a Saguaro cactus has evolved to live in the Sonoran Desert of North America, which is super hot and gets very little precipitation.", "start": 364.36, "duration": 6.399}, {"text": "So, the Sonoran Desert is full of animals and plants that can, just like the Saguaro, take the heat and also the extreme, face-crumbling dryness.", "start": 370.759, "duration": 8.53}, {"text": "But if you put these animals in the Amazon rainforest, even though it's hot enough for them, it's just too wet.", "start": 379.289, "duration": 5.15}, {"text": "So, yeah, the things that live in a biome are ultimately determined by how much water is there and the temperature.", "start": 384.439, "duration": 4.574}, {"text": "And in turn, these inhabitants determine how the biome looks, called its physiognomy.", "start": 389.013, "duration": 4.426}, {"text": "So now, we are going to take a look at all the different types of biomes out there.", "start": 393.439, "duration": 4.361}, {"text": "There are places on the planet that get lots and lots of rain, around 300 centimeters a year, and are pretty warm, around 25-30 degrees C on average, which is Speedo-wearin' weather, as far as I'm concerned.", "start": 397.8, "duration": 11.729}, {"text": "These biomes are the tropical rainforests, which generally hug the equator and have unbelievably high biodiversity because everybody's wanting to get a piece of that sweet tropical action.", "start": 409.529, "duration": 11.36}, {"text": "And then on the complete opposite side of that scale, we have the tundra, most of which is above the Arctic Circle, in Antarctica, or way up at the top of some mountains.", "start": 420.889, "duration": 7.86}, {"text": "Tundra gets little precipitation and some well-below-zero temperatures.", "start": 428.749, "duration": 4.027}, {"text": "And what lives there?", "start": 432.776, "duration": 1.353}, {"text": "Not much.", "start": 434.129, "duration": 0.5}, {"text": "A couple of mosses and liverworts, maybe a few species of grasses, some birds and a handful of mammals.", "start": 434.629, "duration": 5.804}, {"text": "The same goes for the desert biome, where there's very little rainfall and very high temperatures.", "start": 440.433, "duration": 3.901}, {"text": "Like the tundra, without much water, there can't be very many large plants.", "start": 444.334, "duration": 3.425}, {"text": "And where there aren't a lot of plants, there aren't a lot of other organisms, even when temperatures are close to what makes living things happiest.", "start": 447.759, "duration": 6.62}, {"text": "Between these three extremes, we've got biomes that require more or less water, combined with high-ish or lowish temperatures.", "start": 454.379, "duration": 6.301}, {"text": "These are your moderate or temperate biomes,", "start": 460.68, "duration": 2.256}, {"text": "and they include temperate grasslands, like what you find in the North American prairie,", "start": 462.936, "duration": 3.322}, {"text": "or temperate deciduous forests, found over much of Europe and North America, and taigas or coniferous forests, found across Canada, much of northern Russia, and Scandinavia.", "start": 466.258, "duration": 9.369}, {"text": "So, if all these biomes in the middle experience pretty moderate temperatures most of the time, the availability of water must be what makes them different from each other.", "start": 475.627, "duration": 6.602}, {"text": "Some of these biomes have a lot of trees, and as we know, trees need a lot of water.", "start": 482.229, "duration": 4.21}, {"text": "So if you find yourself in a temperate forest, it's a pretty safe bet that that particular ecosystem gets a fair amount of precipitation.", "start": 486.439, "duration": 6.16}, {"text": "And if the Carboniferous forests taught us anything, it's that having a bunch of trees around changes the landscape, the climate, and even the geology of a biome.", "start": 492.599, "duration": 7.34}, {"text": "If you don't have a lot of trees in a biome, it means you probably don't get enough rainfall for their liking.", "start": 499.939, "duration": 4.41}, {"text": "And without trees, more sunlight reaches the ground and gets to grasses and other small plants, leading to more of a temperate grassland ecosystem.", "start": 504.349, "duration": 6.581}, {"text": "And where you get grass, you get animals like bison and pronghorn and other ungulates whose digestive systems are big fermentation vats that process cellulose all day long.", "start": 510.93, "duration": 9.59}, {"text": "And then when you've got ungulates, you also get predators.", "start": 520.52, "duration": 3.01}, {"text": "All these animals are way different than what you'd find in a temperate forest.", "start": 523.53, "duration": 3.88}, {"text": "So, biomes are different, because the plants are different, because the rainfall and temperatures are different.", "start": 527.41, "duration": 4.84}, {"text": "But, of course, there are also biomes entirely underwater.", "start": 532.25, "duration": 2.43}, {"text": "We can't forget that the surface of the planet is three-fourths water.", "start": 534.68, "duration": 2.51}, {"text": "And since water availability isn't an issue in the ocean, marine biomes differ in things like temperature, pressure, oxygen content, how much light is available, and stuff like that.", "start": 537.19, "duration": 9.03}, {"text": "So, thanks to the science of ecology, we know that the way the world works can be explained mostly by temperature and water.", "start": 546.22, "duration": 6.04}, {"text": "But this is just the beginning my friends.", "start": 552.26, "duration": 1.964}, {"text": "Oh yes!", "start": 554.224, "duration": 0.776}, {"text": "The end of Biology 101, maybe.", "start": 555.0, "duration": 2.638}, {"text": "And we'll always have that time we spent learning and loving, won't we?", "start": 557.638, "duration": 3.114}, {"text": "But there's so much more to find out together!", "start": 560.752, "duration": 3.105}, {"text": "How do living things affect the climate, the chemical makeup of the atmosphere, even the geology of our planet?", "start": 563.857, "duration": 5.553}, {"text": "How do they affect each other?", "start": 569.41, "duration": 1.24}, {"text": "And maybe more importantly, how are we humans affecting all of these things, and what can we do differently to ensure that we all get to keep existing?", "start": 570.65, "duration": 9.63}, {"text": "Join me as we get to know our planet on a whole new level, starting next week!", "start": 580.28, "duration": 4.82}, {"text": "Thanks for watching this final episode of Crash Course Biology and if you've been with us the whole time thank you for participating and learning with us here at Crash Course.", "start": 585.1, "duration": 8.94}, {"text": "And of course, thank you to all the people who helped write these episodes, who helped do these awesome animations, the people who filmed and edited them.", "start": 594.04, "duration": 6.76}, {"text": "It really is a team effort here at Crash Course.", "start": 600.8, "duration": 2.02}, {"text": "If you want to review anything that we talked about in this episode there's a table of contents over there.", "start": 602.82, "duration": 3.78}, {"text": "And if you have any questions, we're on Facebook, Twitter, and of course, in the comments below.", "start": 606.6, "duration": 4.289}]