[{"text": "Professor Dave again, let’s talk about related\nrates.", "start": 0.4, "duration": 3.14}, {"text": "There are plenty of real-world scenarios that\ncalculus can apply to, and now that we’ve", "start": 10.58, "duration": 5.02}, {"text": "learned about implicit differentiation, we\nare ready to look at one such application,", "start": 15.6, "duration": 4.49}, {"text": "the concept of related rates.", "start": 20.09, "duration": 4.05}, {"text": "Let’s say we are inflating a balloon, and\nlet’s pretend that the balloon is a perfect", "start": 24.14, "duration": 5.84}, {"text": "sphere, so we essentially have a sphere that\nis expanding at a constant rate.", "start": 29.98, "duration": 5.95}, {"text": "Now say we want to describe the rate at which\nthe volume of the sphere is increasing, as", "start": 35.93, "duration": 6.04}, {"text": "well as the rate at which the radius of the\nsphere is increasing.", "start": 41.97, "duration": 5.21}, {"text": "Both of these values are increasing due to\nthe expansion of the balloon, and their rates", "start": 47.18, "duration": 5.44}, {"text": "of increase are related, hence related rates.", "start": 52.62, "duration": 4.55}, {"text": "But one of these is probably much easier to\nphysically measure than the other, so rather", "start": 57.17, "duration": 4.939}, {"text": "than trying to measure both, let’s measure\nthe one that we can, and compute the rate", "start": 62.109, "duration": 5.261}, {"text": "of change in the other using calculus.", "start": 67.37, "duration": 3.58}, {"text": "It’s probably easier to measure the change\nin volume, so let’s say that we do measure", "start": 70.95, "duration": 6.38}, {"text": "the volume over some period of time, and we\nfind that it is increasing by one hundred", "start": 77.33, "duration": 4.81}, {"text": "cubic centimeters per second.", "start": 82.14, "duration": 2.64}, {"text": "How can we use this to find out how fast the\nradius is increasing at a particular instant,", "start": 84.78, "duration": 6.25}, {"text": "like the moment when the diameter of the balloon\nis fifty centimeters?", "start": 91.03, "duration": 7.08}, {"text": "Well let’s say that volume is V and radius\nis r.", "start": 98.11, "duration": 4.1}, {"text": "Then dV over dt, or the change in volume over\ntime, equals one hundred cubic centimeters", "start": 102.21, "duration": 7.19}, {"text": "per second, as we measured.", "start": 109.4, "duration": 2.34}, {"text": "But what we want to know is dr over dt, or\nthe change in radius over time, at the moment", "start": 111.74, "duration": 7.03}, {"text": "that the radius is twenty five centimeters,\nsince the radius is half the diameter.", "start": 118.77, "duration": 6.61}, {"text": "To see how these values will relate, we need\nan equation that relates V and r, and that", "start": 125.38, "duration": 6.48}, {"text": "will be the equation for the volume of the\nsphere.", "start": 131.86, "duration": 3.73}, {"text": "When we learned geometry, we saw that this\nformula is V equals four thirds pi r cubed.", "start": 135.59, "duration": 7.28}, {"text": "Now as we said, what we are looking for is\ndr over dt, so let’s differentiate this", "start": 142.87, "duration": 6.22}, {"text": "with respect to t.", "start": 149.09, "duration": 3.43}, {"text": "For V, that simply becomes dV over dt, but\nfor the right side we will need to use the chain rule.", "start": 152.52, "duration": 7.92}, {"text": "This is because t is not present in this equation,\nthe radius is the variable, but the radius", "start": 160.54, "duration": 6.88}, {"text": "is itself a function of t, which is why we\nuse the chain rule.", "start": 167.42, "duration": 5.95}, {"text": "So we will have to differentiate this expression\nwith respect to r, and then multiply that", "start": 173.37, "duration": 5.89}, {"text": "by the derivative of r with respect to t,\nor dr over dt.", "start": 179.26, "duration": 7.309}, {"text": "The derivative with respect to r is easy,\nwe just bring the three down here, and change", "start": 186.569, "duration": 4.731}, {"text": "the three to a two, giving us four pi r squared,\nand then that must be followed by dr over dt.", "start": 191.3, "duration": 9.06}, {"text": "Well dr over dt is what we are trying to solve\nfor, because we are interested in how the", "start": 200.4, "duration": 5.14}, {"text": "radius changes over time, so let’s solve\nfor that.", "start": 205.54, "duration": 4.3}, {"text": "This means simply dividing both sides by four\npi r squared.", "start": 209.84, "duration": 5.59}, {"text": "That means that dr over dt equals dV over\ndt, times one over four pi r squared.", "start": 215.43, "duration": 9.15}, {"text": "We plug in our value for dV over dt, which\nis one hundred, and the value for r that we", "start": 224.58, "duration": 5.51}, {"text": "are interested in, which is twenty five.", "start": 230.09, "duration": 3.67}, {"text": "We evaluate, and we get one over twenty five\npi centimeters per second.", "start": 233.76, "duration": 6.14}, {"text": "Let’s try another example.", "start": 239.9, "duration": 4.98}, {"text": "Say we have a ladder resting against a wall.", "start": 244.88, "duration": 3.4}, {"text": "The ladder is ten feet long, and it is sliding\naway from the wall at a rate of one foot per second.", "start": 248.28, "duration": 6.62}, {"text": "How fast is the top of the ladder sliding\ndown the wall when the bottom of the ladder", "start": 254.9, "duration": 5.54}, {"text": "is six feet away from the wall?", "start": 260.44, "duration": 3.21}, {"text": "Just as with any other example we could look\nat, we will quickly see that we need to be", "start": 263.65, "duration": 4.92}, {"text": "able to construct equations that represent\nthe scenario.", "start": 268.57, "duration": 5.14}, {"text": "Looking at the diagram, we have a ladder with\na constant length of ten, and then these values", "start": 273.71, "duration": 6.75}, {"text": "are the variables x and y, as they both change over time.", "start": 280.46, "duration": 4.73}, {"text": "So that makes a right triangle with a known\nhypotenuse and the two legs unknown.", "start": 285.19, "duration": 6.83}, {"text": "We can relate the variables by the Pythagorean\ntheorem.", "start": 292.02, "duration": 3.73}, {"text": "That would be x squared plus y squared equals\nten squared, or a hundred.", "start": 295.75, "duration": 7.71}, {"text": "Now as we said, we want to know how these\nparameters change over time, so let’s differentiate", "start": 303.46, "duration": 6.36}, {"text": "both sides of this equation with respect to time.", "start": 309.82, "duration": 4.11}, {"text": "The derivative of x squared with respect to\ntime will be two x times dx over dt.", "start": 313.93, "duration": 6.84}, {"text": "For y, we get the same thing, two y times\ndy over dt.", "start": 320.77, "duration": 5.58}, {"text": "On the right, the derivative of any constant is zero.", "start": 326.35, "duration": 5.28}, {"text": "Now we want to know about how fast the ladder\nis sliding down the wall, which is described", "start": 331.63, "duration": 5.34}, {"text": "by dy over dt, so let’s solve for dy over dt.", "start": 336.97, "duration": 5.72}, {"text": "We take the term with all the x’s to the\nother side, and then we divide by two y, and", "start": 342.69, "duration": 7.57}, {"text": "we get negative x over y times dx over dt.", "start": 350.26, "duration": 5.17}, {"text": "So all we have to do is plug in what we know,\nand solve.", "start": 355.43, "duration": 5.18}, {"text": "We are asking about dy over dt when the ladder\nis six feet away from the wall.", "start": 360.61, "duration": 6.07}, {"text": "That means x must be six.", "start": 366.68, "duration": 2.19}, {"text": "Then, by the pythagorean theorem, we can solve\nfor y at that instant, and that must be eight.", "start": 368.87, "duration": 8.519}, {"text": "We can also plug in dx over dt, because we\nsaid that the ladder was sliding away from", "start": 377.389, "duration": 5.731}, {"text": "the wall at one foot per second.", "start": 383.12, "duration": 2.95}, {"text": "That means x is increasing by one foot every\nsecond, so dx over dt is positive one.", "start": 386.07, "duration": 9.62}, {"text": "We simplify, and we get negative three fourths\nfeet per second.", "start": 395.69, "duration": 4.6}, {"text": "This is a negative value, because y is decreasing\nover time, as the ladder slides down the wall.", "start": 400.29, "duration": 10.379}, {"text": "So as we can see, related rates problems can\nbe rather straightforward.", "start": 410.669, "duration": 5.72}, {"text": "The real challenge lies in understanding what\nthe problem is asking, and being able to first", "start": 416.389, "duration": 6.441}, {"text": "draw a diagram.", "start": 422.83, "duration": 2.1}, {"text": "Then we must write equations from that diagram\nthat relate the two variables in question.", "start": 424.93, "duration": 6.72}, {"text": "Because we are describing rates, these will\nalways be functions of time, and we will be", "start": 431.65, "duration": 4.829}, {"text": "taking derivatives of functions with respect to time.", "start": 436.479, "duration": 4.451}, {"text": "This may require the chain rule, as we may\nbe taking the derivative of a function first", "start": 440.93, "duration": 5.72}, {"text": "with respect to some variable, so we must\nthen multiply by the derivative of that variable", "start": 446.65, "duration": 6.829}, {"text": "with respect to t, since we are ultimately\nconcerned with terms involving dt.", "start": 453.479, "duration": 6.881}, {"text": "Once we have done that, we just plug in the\ninformation we know, and solve for what we", "start": 460.36, "duration": 4.929}, {"text": "are looking for, which will always be d something over dt.", "start": 465.289, "duration": 4.751}, {"text": "Let’s check comprehension.", "start": 470.2, "duration": 1.38}]