[{"text": "Professor Dave again, let’s check out some\ntests.", "start": 0.46, "duration": 2.62}, {"text": "We just learned about convergent series, which\nare ones where the sum of all the terms in", "start": 10.14, "duration": 5.61}, {"text": "the series is some finite number.", "start": 15.75, "duration": 2.82}, {"text": "But it can often be difficult to calculate\nthe precise value of the sum, and there are", "start": 18.57, "duration": 4.66}, {"text": "only certain special cases where we can easily\nget the sum using simple computation.", "start": 23.23, "duration": 5.82}, {"text": "Luckily there are special tricks we can use\nto help us find sums, or at least estimate", "start": 29.05, "duration": 5.59}, {"text": "them, and one such trick is called the integral test.", "start": 34.64, "duration": 6.06}, {"text": "Take something like the sum of one over N\nsquared, from one to infinity, giving us one", "start": 40.7, "duration": 5.38}, {"text": "over one squared, plus one over two squared,\nplus one over three squared, and so forth,", "start": 46.08, "duration": 6.92}, {"text": "and we can easily plot these points graphically.", "start": 53.0, "duration": 4.36}, {"text": "If we also show the function Y equals one\nover X squared, essentially connecting the", "start": 57.36, "duration": 6.02}, {"text": "dots, we recognize that this is the precise\nexample we looked at when we learned about", "start": 63.38, "duration": 6.01}, {"text": "improper integrals, and we know the area under\nthe curve over this infinite interval is actually finite.", "start": 69.39, "duration": 7.43}, {"text": "Therefore, we shouldn’t be surprised to\nlearn that this similar looking series is", "start": 77.82, "duration": 5.68}, {"text": "convergent, especially since the sequence one over N squared does go to zero as N approaches infinity.", "start": 83.5, "duration": 8.54}, {"text": "In fact, we can actually use this function\nto estimate the sum of the series.", "start": 93.02, "duration": 4.78}, {"text": "Let’s make some rectangles under the curve,\neach with a base of one and a height equal", "start": 97.8, "duration": 7.26}, {"text": "to the value of the function at the right\nendpoint of the interval.", "start": 105.06, "duration": 6.78}, {"text": "The area of each rectangle is equal to one\nof the terms in the series, because this rectangle", "start": 111.84, "duration": 6.16}, {"text": "has an area of one over two squared, and the\nsecond term in the series is one over two squared.", "start": 118.0, "duration": 6.2}, {"text": "This rectangle has an area of one over three\nsquared, and the third term in the series", "start": 124.98, "duration": 5.18}, {"text": "is one over three squared.", "start": 130.17, "duration": 2.17}, {"text": "So every rectangle all the way to infinity\nhas a corresponding term in the series, and", "start": 132.34, "duration": 6.46}, {"text": "we are leaving out only the first term, one.", "start": 138.8, "duration": 3.9}, {"text": "The sum of the areas of these rectangles is\npretty close to being the area under the curve,", "start": 142.7, "duration": 6.72}, {"text": "which we know is just the integral of the function.", "start": 149.42, "duration": 4.42}, {"text": "So the sum of the series will be approximately\nequal to one, to account for the first term", "start": 153.84, "duration": 6.37}, {"text": "in the series that has no corresponding rectangle,\nplus this improper integral, which approximates", "start": 160.21, "duration": 8.06}, {"text": "the sum of all the rectangle areas and therefore\naccounts for the rest of the terms in the series.", "start": 168.27, "duration": 6.219}, {"text": "We know how to evaluate the integral, we just\nfind the antiderivative, which is negative", "start": 176.9, "duration": 5.919}, {"text": "one over X, and we evaluate at infinity and\nthen at one, which gives us zero minus negative", "start": 182.819, "duration": 8.861}, {"text": "one, or positive one.", "start": 191.68, "duration": 4.36}, {"text": "The one from before plus the one from the\nintegral equals two, so that’s our estimate", "start": 196.04, "duration": 5.61}, {"text": "for this sum.", "start": 201.65, "duration": 2.76}, {"text": "Now we know that the rectangles don’t quite\nfill up the total area, as there are some", "start": 204.41, "duration": 5.189}, {"text": "empty spaces, so the integral is bigger than\nwhat we really wanted, and therefore the actual", "start": 209.599, "duration": 6.091}, {"text": "value for the sum of the series must be a\nlittle less than two, but we’ve still done", "start": 215.69, "duration": 6.4}, {"text": "a pretty good job at getting some information\nabout the series.", "start": 222.09, "duration": 6.429}, {"text": "How can we summarize this technique in a general way?", "start": 228.519, "duration": 3.661}, {"text": "We can say that if we have some function,\nF, that is positive, continuous, and decreasing", "start": 232.18, "duration": 6.839}, {"text": "from one to infinity, and we also have a sequence\nthat is derived from this function, in otherwords,", "start": 239.019, "duration": 6.61}, {"text": "A sub N equals F of N, then the series that\ncan be formed from this sequence, from one", "start": 245.629, "duration": 7.211}, {"text": "to infinity, will be convergent only if the\ncorresponding improper integral is convergent.", "start": 252.84, "duration": 8.19}, {"text": "If the integral is divergent, the series will\nbe divergent.", "start": 261.03, "duration": 6.3}, {"text": "If the series is indeed convergent, then we\ncan also estimate its sum by calculating the", "start": 267.33, "duration": 6.58}, {"text": "improper integral in some way that is similar\nto the example we just performed.", "start": 273.91, "duration": 6.17}, {"text": "And that is the essence of the integral test.", "start": 280.08, "duration": 3.99}, {"text": "Let’s just mention a few important truths\nthat can be found by applying the integral test.", "start": 284.07, "duration": 7.04}, {"text": "Any series in the form of one over N raised\nto some exponent is called a P-series.", "start": 292.59, "duration": 8.09}, {"text": "This includes our first example, one over\nN squared.", "start": 300.68, "duration": 3.829}, {"text": "As it happens, any P-series will be convergent\nif P is greater than one, and it will be divergent", "start": 304.509, "duration": 7.611}, {"text": "if P is less than or equal to one.", "start": 312.12, "duration": 3.609}, {"text": "So if we have one over N cubed, it will converge.", "start": 315.729, "duration": 3.871}, {"text": "If we have one over the cube root of N, or\none over N to the one third, it will diverge.", "start": 319.6, "duration": 10.09}, {"text": "There is one more test we can learn that will\nbe an important technique, and it is called", "start": 329.69, "duration": 4.319}, {"text": "the comparison test.", "start": 334.009, "duration": 1.991}, {"text": "With this technique, we will take some series\nand compare it with a similar series that", "start": 336.0, "duration": 6.06}, {"text": "we know to be convergent or divergent.", "start": 342.06, "duration": 3.87}, {"text": "For example, say we are looking at the series\none over the quantity two to the N, plus one,", "start": 345.93, "duration": 7.24}, {"text": "from one to infinity.", "start": 353.17, "duration": 3.089}, {"text": "This looks like it could be tricky to assess,\nbut what if we compare it to a simpler series,", "start": 356.259, "duration": 5.041}, {"text": "one over two to the N.", "start": 361.3, "duration": 2.1}, {"text": "This is a simple geometric series, and as\nwe have already seen, the fraction gets smaller", "start": 363.4, "duration": 6.03}, {"text": "and smaller as the exponent gets larger and\nlarger, so the sequence converges to zero,", "start": 369.43, "duration": 7.239}, {"text": "and as we saw in the previous tutorial, this\nis indeed a convergent series with a sum that", "start": 376.669, "duration": 6.501}, {"text": "is equal to one.", "start": 383.17, "duration": 3.05}, {"text": "If we know that this series converges, what\ncan we say about the original one?", "start": 386.22, "duration": 5.18}, {"text": "Well, this plus one term in the denominator\nmeans that each term in this series must be", "start": 391.4, "duration": 6.56}, {"text": "smaller than each corresponding term in the\nother series, and if every term is smaller,", "start": 397.96, "duration": 6.54}, {"text": "then this series must also converge, and the\nsum of this series must also be less than one.", "start": 404.5, "duration": 8.02}, {"text": "So we aren’t calculating the precise sum\nwith the comparison test, but it is a useful", "start": 414.04, "duration": 5.46}, {"text": "tool for determining whether a series is convergent\nor divergent.", "start": 419.5, "duration": 5.58}, {"text": "If every term in a series is smaller than\neach corresponding term in another series", "start": 425.08, "duration": 6.48}, {"text": "that is known to be convergent, then it too,\nmust be convergent, as we just saw.", "start": 431.56, "duration": 9.03}, {"text": "On the other hand, if every term in a series\nis larger than each corresponding term in", "start": 440.59, "duration": 6.56}, {"text": "another series that is known to be divergent,\nthen it too, must be divergent.", "start": 447.15, "duration": 5.85}, {"text": "Apart from understanding the comparison test\nlogically, in this manner, we can also represent", "start": 453.0, "duration": 1.0}, {"text": "it a little more formally, by comparing two\nseries, A sub N and B sub N, and setting up", "start": 454.0, "duration": 1.21}, {"text": "these relationships between them, whereby\nif B converges or diverges, and these conditions", "start": 455.21, "duration": 1.0}, {"text": "are met for A and B, A will also converge\nor diverge accordingly.", "start": 456.21, "duration": 1.0}, {"text": "Let’s just do one example to make sure we\ncan apply this.", "start": 457.21, "duration": 3.37}, {"text": "Take the series five over the quantity (two\nN squared plus four N plus three).", "start": 460.58, "duration": 6.69}, {"text": "We can simplify this to five over two N squared\nto use the comparison test.", "start": 467.27, "duration": 6.829}, {"text": "What do we know about this simpler series?", "start": 474.099, "duration": 3.391}, {"text": "Well we can manipulate series just like we\ndo integrals, and five halves is a constant", "start": 477.49, "duration": 6.769}, {"text": "that can be pulled outside of the sum, as\ndoing this is essentially like factoring five", "start": 484.259, "duration": 5.671}, {"text": "halves out of all the infinite terms in the series.", "start": 489.93, "duration": 4.799}, {"text": "Then we are left with something very familiar,\nand we know that this series is convergent.", "start": 494.729, "duration": 7.291}, {"text": "Our original series has terms that must be\nsmaller than the terms in this series, because", "start": 502.02, "duration": 6.09}, {"text": "there is more in the denominator, and N is\nalways positive, so the fraction is always", "start": 508.11, "duration": 6.0}, {"text": "smaller than if those terms weren’t there.", "start": 514.11, "duration": 4.219}, {"text": "Therefore this series is also convergent,\nand its sum must be less than that of the", "start": 518.329, "duration": 6.561}, {"text": "one we are comparing it to.", "start": 524.89, "duration": 2.679}, {"text": "Now that we have the basics down for assessing\nwhether a series is convergent or divergent,", "start": 527.569, "duration": 5.531}, {"text": "let’s check comprehension.", "start": 533.1, "duration": 1.24}]