[{"text": "We couldn’t keep the lights on without alternating\ncurrents.", "start": 3.5, "duration": 7.48}, {"text": "We’ve talked about how they change voltage, which helps transmit electricity over long distances, but there’s so much more to the physics of AC circuitry.", "start": 10.98, "duration": 8.34}, {"text": "For example, how are alternating currents affected\nwhen you add resistors? Or capacitors? Or an inductor?", "start": 19.32, "duration": 5.1}, {"text": "These three pieces of the electricity puzzle are used everywhere, and today we’re going to put them together.", "start": 24.42, "duration": 5.06}, {"text": "[Theme Music]", "start": 29.48, "duration": 12.46}, {"text": "When you talk about direct current circuits, describing the voltage and current in a given situation is pretty straightforward.", "start": 41.94, "duration": 5.76}, {"text": "Typically, the voltage source in a DC circuit is\nunchanging, so the current will be constant, too.", "start": 47.7, "duration": 5.5}, {"text": "But in an AC circuit, both the voltage and the current are constantly changing directions, from positive to negative and back again.", "start": 53.2, "duration": 6.16}, {"text": "So how do you describe values when they’re\nconstantly changing?", "start": 59.36, "duration": 2.34}, {"text": "Well, when a current alternates quickly, it’s changing back and forth between maximum and minimum values, known as peak current.", "start": 61.7, "duration": 5.699}, {"text": "And “peak” here means either maximum or minimum, positive or negative, since the flow of current has the same magnitude.", "start": 67.4, "duration": 6.88}, {"text": "Mathematically, a current is equal to the peak current times a sine function related to the system’s frequency, typically 60 Hertz.", "start": 74.28, "duration": 6.7}, {"text": "And the same is true for the voltage in an\nAC circuit.", "start": 80.98, "duration": 2.94}, {"text": "It changes between a maximum and minimum peak voltage in order to generate the alternating current.", "start": 83.92, "duration": 5.0}, {"text": "Now, let’s say you’re calculating the\naverage power consumed by an AC circuit.", "start": 88.92, "duration": 3.76}, {"text": "You can use the handy power expression for\nDC circuits, which we’ve already derived,", "start": 92.68, "duration": 3.86}, {"text": "in order to find the consumed energy over\ntime, in terms of current and resistance.", "start": 96.54, "duration": 4.32}, {"text": "Then you can replace the current with our\nnew equation for alternating current.", "start": 100.86, "duration": 3.46}, {"text": "Then, since you want to find the average power,\njust take the average of the power expression.", "start": 104.32, "duration": 4.5}, {"text": "The sine squared function always reduces to\none half when averaged.", "start": 108.829, "duration": 2.851}, {"text": "This leaves you with an average power of peak current squared, times resistance, divided by two.", "start": 111.68, "duration": 4.8}, {"text": "But you can only take this equation for DC circuits so far, before you have to start making some serious changes for it to help you figure out AC circuits.", "start": 116.48, "duration": 7.2}, {"text": "Why?\nBecause of I: the value for the current itself.", "start": 123.68, "duration": 3.24}, {"text": "Think of driving a car in stop-and-go traffic.", "start": 126.92, "duration": 2.119}, {"text": "You speed up at times, you slow down at others,\nbut if you average it out over the whole trip,", "start": 129.04, "duration": 4.52}, {"text": "you’ve got an “effective” speed somewhere\nin the middle.", "start": 133.569, "duration": 2.28}, {"text": "That’s what current is like in AC calculations.", "start": 135.849, "duration": 2.451}, {"text": "So, in order to express current in this equation, we need a new variable that represents this effective value.", "start": 138.3, "duration": 5.54}, {"text": "And that variable is the root-mean-squared,\nor RMS value, of current.", "start": 143.84, "duration": 4.0}, {"text": "It's really just the value you would get if you squared the current, took the average, and then square rooted it again.", "start": 147.84, "duration": 4.58}, {"text": "Hence the name: root mean square.", "start": 152.42, "duration": 1.74}, {"text": "Now, this same derivation works for alternating voltage, as well, with the RMS value of voltage being equal to the peak voltage divided by the square root of 2.", "start": 154.16, "duration": 8.2}, {"text": "With these two RMS values at your disposal, you can then use them in place of current and voltage in DC equations, with power equaling the RMS current times RMS voltage.", "start": 162.36, "duration": 8.8}, {"text": "So, now that we have RMS values to better\ndescribe current and voltage in AC circuits,", "start": 171.16, "duration": 4.279}, {"text": "let’s think about how we can use the unique\nnature of AC circuits to our advantage.", "start": 175.439, "duration": 3.94}, {"text": "For example, with coils of wire, we know that when the current is changing, a magnetic flux is induced in the coil.", "start": 179.38, "duration": 6.14}, {"text": "And that flux seeks to oppose the current with an electromotive force, or emf, in the opposite direction.", "start": 185.52, "duration": 5.74}, {"text": "And this is the rule that we know as Lenz’s\nLaw.", "start": 191.26, "duration": 2.18}, {"text": "And this relationship works the opposite way as well, with a changing magnetic flux inducing an emf that opposes the flux.", "start": 193.44, "duration": 6.5}, {"text": "So in an AC circuit, what you end up with is a changing current that induces an opposing magnetic flux, which in turn induces an emf in the opposite direction of the current!", "start": 199.94, "duration": 9.36}, {"text": "This induction of an emf that opposes the\nmain current is called self-inductance.", "start": 209.3, "duration": 4.3}, {"text": "And to calculate an induced emf, you just take the change in current over time and multiply it by negative L.", "start": 213.6, "duration": 5.639}, {"text": "L is a constant, known as the inductance, signifying how well that specific coil induces an opposing current, depending on its shape and size.", "start": 219.24, "duration": 7.62}, {"text": "And it’s negative, because the induced emf\nis in the opposite direction of the main current.", "start": 226.87, "duration": 4.33}, {"text": "Inductance, by the way, is expressed in units\ncalled Henrys.", "start": 231.2, "duration": 2.74}, {"text": "Induction of an electromagnetic force is so useful, that engineers make coils that are designed to maximize their self-inductance.", "start": 233.94, "duration": 6.66}, {"text": "These coils that are designed for self-inductance\nare called inductors.", "start": 240.6, "duration": 3.3}, {"text": "In a circuit diagram, they look like small coils,\n'cause that’s pretty much what they are!", "start": 243.9, "duration": 4.14}, {"text": "So to get a handle on how inductors work,\nlet’s first consider one in a DC circuit.", "start": 248.04, "duration": 4.339}, {"text": "Let’s say this circuit has an inductor connected in series with a battery that has a constant voltage, V naught.", "start": 252.38, "duration": 5.46}, {"text": "Since most inductors have a natural resistance, we’ll say that there’s also a small resistor in series with the inductor and battery.", "start": 257.84, "duration": 6.32}, {"text": "And because we have an inductance L and a resistance R, we call this configuration an LR circuit.", "start": 264.16, "duration": 5.631}, {"text": "If we set up this circuit and then insert the battery,\nthe voltage will immediately be V naught.", "start": 269.8, "duration": 4.88}, {"text": "But the current won’t reach its maximum\nvalue.", "start": 274.68, "duration": 2.57}, {"text": "That’s because the inductor opposes the sudden change in current that was caused by the sudden voltage change.", "start": 277.25, "duration": 4.85}, {"text": "So the current will increase gradually, until it eventually reaches maximum current, which is the battery’s voltage divided by the resistance.", "start": 282.1, "duration": 6.88}, {"text": "The current in this case is kind of like a\ncar that’s accelerating from a dead stop.", "start": 288.98, "duration": 3.98}, {"text": "Even if you stomp down on the gas pedal, you\nwon’t immediately start going at top speed.", "start": 292.97, "duration": 4.199}, {"text": "You’re going to have to build up to it over\ntime.", "start": 297.169, "duration": 2.09}, {"text": "So you have to consider time when you’re\ndealing with inductors.", "start": 299.259, "duration": 3.28}, {"text": "Mathematically, the current in a circuit with an inductor is expressed as the maximum current times one minus e to the negative t over tau.", "start": 302.54, "duration": 6.94}, {"text": "The maximum current is the voltage divided\nby the resistance, and tau is the time constant,", "start": 309.49, "duration": 4.86}, {"text": "equal to the inductance divided by the resistance.", "start": 314.35, "duration": 2.34}, {"text": "This time constant has all kinds of mathematical\nmeaning that we can’t get into right now.", "start": 316.69, "duration": 3.87}, {"text": "But you can see that as time goes to infinity,\nyou get closer to the maximum current value.", "start": 320.56, "duration": 4.18}, {"text": "Put in terms of our car analogy, the maximum current is like the fastest that your car will go.", "start": 324.74, "duration": 4.68}, {"text": "And the time constant lets you know how long you need to press down on the accelerator to get there.", "start": 329.42, "duration": 4.08}, {"text": "A small time constant means less time is needed to reach maximum speed, and also less time to slow down to a stop.", "start": 333.5, "duration": 5.66}, {"text": "A large time constant means the opposite: that a lot of time is necessary to speed up and slow down.", "start": 339.16, "duration": 5.36}, {"text": "Now, let’s say the circuit has reached steady-state,\nwith the current at that maximum value.", "start": 344.52, "duration": 3.72}, {"text": "There’s no longer a changing current, so\nthe inductor acts just like a piece of wire.", "start": 348.25, "duration": 3.36}, {"text": "But if the battery is suddenly removed, the\ncurrent won’t drop to 0 immediately.", "start": 351.61, "duration": 3.66}, {"text": "Because, remember, the inductor opposes the change in current with its own changing magnetic flux.", "start": 355.28, "duration": 4.54}, {"text": "So after the battery is removed, the inductor\ngenerates its own current!", "start": 359.82, "duration": 3.48}, {"text": "This is like driving a car and then taking\nyour foot off the accelerator.", "start": 363.3, "duration": 3.4}, {"text": "You’ve stopped the car from going faster,\nbut you won’t stop immediately.", "start": 366.7, "duration": 3.439}, {"text": "Instead, you’ll slow down over time, before\nyou stop entirely.", "start": 370.139, "duration": 3.28}, {"text": "So you can write this as the decreasing version\nof the earlier current equation,", "start": 373.419, "duration": 3.56}, {"text": "with current equaling the maximum possible\ncurrent, times e to the negative t over tau.", "start": 376.979, "duration": 5.18}, {"text": "I max is the same, and tau is the same, and once enough time has passed, then the current is equal to 0.", "start": 382.16, "duration": 5.52}, {"text": "So, inductors oppose a change in current,\nwhether it’s an increase or a decrease.", "start": 387.68, "duration": 3.96}, {"text": "When you switch a device on or off, and you notice a delay, that’s probably because an inductor is in the system.", "start": 391.64, "duration": 5.28}, {"text": "By flipping the switch, you’ve either started or ended a voltage supply, but an inductor in the system delays the current from starting or stopping immediately.", "start": 396.92, "duration": 7.18}, {"text": "OK so that’s inductors 101!", "start": 404.11, "duration": 1.88}, {"text": "Now let’s go back to AC circuits, and combine an inductor, a resistor, and a capacitor all in one circuit.", "start": 405.99, "duration": 5.48}, {"text": "Each component will behave differently when\nconnected to the source of alternating voltage.", "start": 411.47, "duration": 3.69}, {"text": "So before we combine everything, let’s look at each component as if it alone were in series with the source.", "start": 415.16, "duration": 5.46}, {"text": "Let’s start with a resistor.", "start": 420.62, "duration": 1.48}, {"text": "When the voltage is at peak voltage, the current through the resistor will also be at peak current.", "start": 422.1, "duration": 4.68}, {"text": "Since the voltage and current peaks occur at the\nsame time, the two are said to be in phase.", "start": 426.78, "duration": 4.38}, {"text": "For inductors and capacitors, however, the\nstory’s a little different.", "start": 431.16, "duration": 3.2}, {"text": "As the alternating voltage is applied across the inductor, the opposing emf that’s induced equals the amount of voltage that drops across the device.", "start": 434.36, "duration": 7.44}, {"text": "The inductor has an insignificant amount of resistance, so when it’s the only device in the circuit, all the voltage must be opposed by the opposing emf.", "start": 441.8, "duration": 7.72}, {"text": "In this equation, the voltage is at maximum when the current is changing the fastest, and the voltage is 0 when the current isn’t changing at all.", "start": 449.52, "duration": 6.88}, {"text": "This means that, when the current is 0, there’s peak voltage, and when current is at its peak and unchanging, the voltage is 0.", "start": 456.4, "duration": 6.08}, {"text": "When you express this graphically, it means that the current lags behind voltage by 90 degrees, or a quarter cycle.", "start": 462.48, "duration": 5.54}, {"text": "So in AC circuit inductors, we say that the current and voltage are out-of-phase, which means they don’t peak at the same time.", "start": 468.02, "duration": 6.28}, {"text": "Capacitors in AC circuits are also out of\nphase, but for a different reason.", "start": 474.3, "duration": 4.04}, {"text": "Let’s look at a circuit with only an alternating\nvoltage source and a capacitor.", "start": 478.34, "duration": 4.08}, {"text": "When the current flows in one direction, charge\nmomentarily builds up on one of the plates.", "start": 482.42, "duration": 4.14}, {"text": "So when the voltage changes from positive to negative, the capacitor acts as a smaller voltage source that still pushes the current along.", "start": 486.56, "duration": 6.9}, {"text": "In this case, current leads voltage by 90 degrees, changing the direction ahead of the voltage source.", "start": 493.46, "duration": 4.82}, {"text": "So let’s sum up: Current in inductors lags\nvoltage.", "start": 498.28, "duration": 3.48}, {"text": "Current in resistors is in phase with voltage.", "start": 501.76, "duration": 2.379}, {"text": "And current in capacitors leads voltage.", "start": 504.139, "duration": 2.511}, {"text": "Another thing that sets inductors and capacitors apart from resistors is that they don’t release a lot of heat.", "start": 506.65, "duration": 4.79}, {"text": "The only part of an AC circuit that dissipates\npower as thermal energy is the resistance.", "start": 511.44, "duration": 4.32}, {"text": "Inductors and capacitors both have negligible\nresistance, and they don’t dissipate heat,", "start": 515.76, "duration": 4.759}, {"text": "but they do have voltage drops across each\ncomponent.", "start": 520.519, "duration": 2.531}, {"text": "So their voltage drops will still affect how much voltage the circuit can supply to other components that DO need to dissipate power.", "start": 523.05, "duration": 6.099}, {"text": "So, when you have an AC circuit with a resistor, inductor, and capacitor in series, you can calculate the voltage supplied,", "start": 529.149, "duration": 6.68}, {"text": "versus the voltage applied across each component, by adding all of the component voltage drops together.", "start": 535.829, "duration": 5.06}, {"text": "Every voltage drop peaks at a different time,\nbut the sum will always equal that of the source.", "start": 540.889, "duration": 4.971}, {"text": "What goes in must go out!", "start": 545.86, "duration": 1.54}, {"text": "This wraps up our last look at electricity!", "start": 547.4, "duration": 2.08}, {"text": "But you can’t forget everything you’ve learned about electromagnetism yet, because it’s coming back in a shiny new form, known as light!", "start": 549.48, "duration": 6.52}, {"text": "Today, we learned about currents and voltages\nin AC circuits.", "start": 556.01, "duration": 2.75}, {"text": "We also learned about inductors and we combined\nour knowledge of AC circuits with inductors,", "start": 558.76, "duration": 4.26}, {"text": "capacitors, and resistors in order to analyze how voltage and current interact with an alternating voltage source.", "start": 563.02, "duration": 6.02}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 569.05, "duration": 3.77}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 572.82, "duration": 3.72}, {"text": "PBS Offbook, Gross Science, and Coma Niddy.", "start": 576.54, "duration": 3.06}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 579.61, "duration": 3.7}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 583.31, "duration": 4.29}]