[{"text": "By the 19th century, we were pretty sure there was something was going on between electricity and magnetism.", "start": 3.07, "duration": 4.65}, {"text": "First, in the early 1800s, Michael Faraday showed us how a changing magnetic field induces an electromotive force, or emf, resulting in an electric current.", "start": 7.72, "duration": 9.18}, {"text": "He also found that electric fields sometimes act like magnetic fields, and developed equations to calculate the forces exerted by both.", "start": 16.9, "duration": 7.06}, {"text": "In the mid-1800s, Scottish physicist James Maxwell thought something interesting was going on there, too.", "start": 23.96, "duration": 5.24}, {"text": "So he decided to assemble a set of equations\nthat held true for all electromagnetic interactions.", "start": 29.21, "duration": 5.08}, {"text": "And he did a great job of it, compiling a set of equations as critical to physics as Newton’s laws of motion.", "start": 34.29, "duration": 5.87}, {"text": "And while he was coming up with his all-encompassing equations, Maxwell predicted the existence of electromagnetic waves.", "start": 40.16, "duration": 6.06}, {"text": "And these are the waves that help you view the world around you, talk to friends a thousand miles away, and heat up that midnight breakfast burrito you’ve been craving.", "start": 46.22, "duration": 6.9}, {"text": "So Maxwell and his equations are, to put it\nsimply, enlightening.", "start": 53.12, "duration": 3.7}, {"text": "[Theme Music]", "start": 56.82, "duration": 12.5}, {"text": "When James Maxwell created his dream team of electromagnetic equations, he started with the ideas – and the mathematics – that other physicists had already established.", "start": 69.32, "duration": 8.72}, {"text": "But he put them together, to create a new,\ncomplete understanding of electromagnetism.", "start": 78.04, "duration": 4.78}, {"text": "Maxwell’s first equation is a form of Gauss’s Law, which states that the electric flux through a closed surface is proportional to the total charge enclosed by that surface.", "start": 82.82, "duration": 8.88}, {"text": "A “closed surface” in this case is just the surface of any shape that completely encloses a charge, like a sphere or any other three dimensional shape.", "start": 91.7, "duration": 7.98}, {"text": "And electric flux is a measure of the electric\nfield that passes through a given area.", "start": 99.68, "duration": 4.32}, {"text": "Mathematically, this equation says that electric flux is the integral of the electric field over the area of the surface, which is equal to the enclosed charge, divided by the permittivity of free space.", "start": 104.0, "duration": 10.18}, {"text": "I won’t blame you if you don’t remember, but the permittivity of free space is a constant of proportionally we’ve used before, that relates electric charge to the physical effect of electric fields.", "start": 114.18, "duration": 9.16}, {"text": "If the electric field is constant over the surface, then the left side of the equation becomes E times A.", "start": 123.34, "duration": 5.059}, {"text": "Maxwell’s second equation is also a form of Gauss’s Law, only with magnetic flux instead of electric flux.", "start": 128.4, "duration": 5.84}, {"text": "Magnetic sources are always dipoles, with a north and south pole, and magnetic field lines that leave from the north pole and return back to the south.", "start": 134.24, "duration": 7.02}, {"text": "When you’re looking at how a magnetic field interacts with a surrounding surface, you see that the field lines that leave the surface out of the north pole must enter back through the surface to reach the south pole.", "start": 141.26, "duration": 9.9}, {"text": "This results in the overall magnetic flux\nbeing zero.", "start": 151.16, "duration": 3.06}, {"text": "If you compare this with Maxwell’s first equation, you can tell that the format – with the integral of the magnetic field over the surface area – is the same.", "start": 154.22, "duration": 7.16}, {"text": "But here, the integral will always equal zero\nfor a closed surface.", "start": 161.38, "duration": 3.99}, {"text": "Now, Maxwell’s third equation doesn’t\nhave anything to do with Gauss’s Law.", "start": 165.37, "duration": 3.12}, {"text": "Instead, it’s Faraday’s Law, but slightly\ndifferent than how we’ve seen it before.", "start": 168.49, "duration": 4.44}, {"text": "This is how we've seen it before.", "start": 172.93, "duration": 1.57}, {"text": "If you remember, Faraday’s Law of Induction says that a changing magnetic field will induce an electromotive force in a loop of wire.", "start": 174.5, "duration": 6.7}, {"text": "Maxwell’s version is more general, simplifying Faraday’s Law to show the value of that induced emf.", "start": 181.2, "duration": 5.68}, {"text": "It says that the emf is equal to the line integral of the electric field over a closed loop.", "start": 186.88, "duration": 4.7}, {"text": "So with this equation, you can see the connection between a changing magnetic flux and an induced electric field.", "start": 191.58, "duration": 5.4}, {"text": "The fourth and final equation is one that Maxwell made the most tweaks to, in order to make it applicable to all electromagnetic phenomena.", "start": 196.98, "duration": 5.88}, {"text": "Maxwell’s first and second equations were so similar – one for electric fields and one for magnetic fields – that he knew there must be an equation that complemented Faraday’s Law as well.", "start": 202.86, "duration": 8.0}, {"text": "After all, if a changing magnetic flux produces an electric field, why is there not a complementary law saying the reverse?", "start": 210.86, "duration": 5.9}, {"text": "Why couldn’t a changing electric flux result\nin an induced magnetic field?", "start": 216.76, "duration": 3.94}, {"text": "Here, Maxwell started with Ampère’s Law, which states that a current through a wire induces a magnetic field around a path surrounding the wire.", "start": 220.7, "duration": 6.56}, {"text": "In order to make this equation work for all possible electromagnetic scenarios, Maxwell needed to consider a situation where a magnetic field is induced, but not from the flow of current.", "start": 227.26, "duration": 9.44}, {"text": "For example, picture a charged capacitor that’s\nconnected to wires on both sides.", "start": 236.7, "duration": 4.16}, {"text": "As the capacitor discharges, current runs through both wires, generating a changing magnetic flux, just like Ampere’s Law says.", "start": 240.86, "duration": 7.22}, {"text": "But a changing magnetic flux is also induced between the two plates when there’s no wire connecting the plates.", "start": 248.08, "duration": 5.38}, {"text": "However, there is a changing electric field,\nand it acts like a wireless current.", "start": 253.46, "duration": 3.98}, {"text": "In order to account for the magnetic flux\ngenerated by this “wireless current,”", "start": 257.44, "duration": 3.9}, {"text": "Maxwell added what’s known as the displacement current into Ampère’s Law, to complete the equation.", "start": 261.34, "duration": 4.72}, {"text": "Despite being called the displacement current,\nit isn’t really an electric current.", "start": 266.06, "duration": 3.4}, {"text": "It’s just called that because it fits into\nthe equation just like an actual current does.", "start": 269.46, "duration": 4.26}, {"text": "Mathematically, the displacement current is equal to the change in the capacitor’s charge over time.", "start": 273.72, "duration": 4.44}, {"text": "And that is equal to the change in electric flux over time, multiplied by the permittivity of free space constant.", "start": 278.16, "duration": 5.42}, {"text": "With the addition he made to Ampère’s Law,\nMaxwell’s equations were complete!", "start": 283.58, "duration": 3.38}, {"text": "And using his laws today, we can see a pattern\nin the production of electric and magnetic fields.", "start": 286.96, "duration": 4.28}, {"text": "If a changing electric field is generated, then a magnetic field is induced, which results in a changing magnetic field that induces an electric field, and the cycle continues.", "start": 291.24, "duration": 9.06}, {"text": "These oscillations are electromagnetic waves, and they’re made up of changing electric and magnetic fields that travel through space.", "start": 300.3, "duration": 6.54}, {"text": "Maxwell believed that we could reproduce electromagnetic waves in the laboratory, and he was right!", "start": 306.84, "duration": 4.59}, {"text": "To prove it, let’s look at an object that can produce electromagnetic waves and transmit them through the air: an antenna!", "start": 311.44, "duration": 6.0}, {"text": "This antenna is made up of two conductive rods,\neach attached to opposite ends of an AC generator.", "start": 317.44, "duration": 5.18}, {"text": "When the antenna is operating, the two rods switch between being positively charged and negatively charged, as the generator changes voltage.", "start": 322.62, "duration": 6.58}, {"text": "And when one rod is positively charged, the\nother is negatively charged, and vice versa.", "start": 329.21, "duration": 4.47}, {"text": "When electric current travels up into the top of the rod, you can use the right hand rule, pointing your right thumb in the direction of the current, to see that how the magnetic field flows around the antenna.", "start": 333.68, "duration": 9.32}, {"text": "The electric fields generated by the antenna itself are easier to track, since they’ll just go from the positive rod to the negative rod.", "start": 343.0, "duration": 6.46}, {"text": "But as the direction of current switches, the direction of both the electric and magnetic fields change.", "start": 349.46, "duration": 5.52}, {"text": "And as the rods switch their charges, the waves generated by the initial charge distribution continue to propagate away from the antenna.", "start": 354.98, "duration": 6.44}, {"text": "So, if you were standing away from the antenna, you would be able to measure an electric field and magnetic field that are both constantly changing.", "start": 361.42, "duration": 6.6}, {"text": "Now, what would that look like?", "start": 368.02, "duration": 1.4}, {"text": "To grasp the effect of changing fields in motion, let’s model an electromagnetic wave as it travels through three-dimensional space.", "start": 369.42, "duration": 6.58}, {"text": "First, note the direction that the wave is\ntraveling, in the x-direction.", "start": 376.01, "duration": 4.19}, {"text": "Now plot the electric field, oscillating back\nand forth in the y-direction.", "start": 380.2, "duration": 3.5}, {"text": "The electric and magnetic fields always act perpendicular to one another, so the magnetic field will oscillate in the z-direction.", "start": 383.7, "duration": 6.7}, {"text": "Note that the electric and magnetic fields\nboth peak at the same time, so they’re in phase.", "start": 390.4, "duration": 4.08}, {"text": "These electromagnetic waves are a type of transverse wave, which means both fields, electric and magnetic, act in directions that are perpendicular to the direction in which the wave is moving.", "start": 394.48, "duration": 9.52}, {"text": "And how fast do these waves travel?", "start": 404.0, "duration": 1.76}, {"text": "Maxwell calculated that the speed of each wave is equal to the electric field’s magnitude divided by the magnetic field’s magnitude.", "start": 405.76, "duration": 6.2}, {"text": "This equation simplifies down to an equation with two constants, the permittivity of free space for electric fields, epsilon naught, and the permittivity of free space for magnetic fields, mu naught.", "start": 411.96, "duration": 10.42}, {"text": "And this speed works out to 3.00 times 10^8\nmeters per second.", "start": 422.38, "duration": 4.8}, {"text": "We write it simply as small c, and it’s the speed of\nevery electromagnetic wave, ever, at least in a vacuum.", "start": 427.18, "duration": 5.92}, {"text": "You may know it better as the speed of light.", "start": 433.1, "duration": 1.88}, {"text": "After all, light is an electromagnetic wave!", "start": 434.98, "duration": 2.66}, {"text": "Every electromagnetic wave carries energy through space, and can reflect off some material, while passing through others.", "start": 437.64, "duration": 5.34}, {"text": "But visible light is just one small part of\nwhat’s known as the electromagnetic spectrum.", "start": 442.99, "duration": 4.23}, {"text": "Like waves in the ocean, electromagnetic waves\ncan vary in their wavelength, amplitude, and source.", "start": 447.22, "duration": 5.52}, {"text": "The wavelength is the distance between the\npeaks of a wave.", "start": 452.74, "duration": 2.82}, {"text": "And the frequency is how many times a wave\npeaks in a given second.", "start": 455.56, "duration": 2.88}, {"text": "You might remember when we talked about traveling waves that a wave’s speed is equal to its frequency times its wavelength.", "start": 458.44, "duration": 5.66}, {"text": "And since the speed of light is constant, you can easily find the frequency if you know the wavelength, and vice versa.", "start": 464.1, "duration": 5.06}, {"text": "Now, in order to calculate the energy carried by any electromagnetic wave, you need to know the magnitude of the electric and magnetic fields that compose that wave.", "start": 469.16, "duration": 8.56}, {"text": "Specifically, you use these magnitudes to calculate what’s known as the energy density of each field, which is the amount of energy stored in a field per unit volume.", "start": 477.72, "duration": 7.78}, {"text": "Then, you can combine the energy density for both fields, solving for the total energy per unit volume within the wave overall.", "start": 485.5, "duration": 5.74}, {"text": "But since you know that strengths of the electric\nand magnetic fields are directly related,", "start": 491.24, "duration": 4.12}, {"text": "you can substitute the electric field magnitude\nfor the magnetic field magnitude, and vice versa.", "start": 495.36, "duration": 4.64}, {"text": "This lets you come up with the energy density terms that encapsulate the energy in both fields, with fewer variables.", "start": 500.0, "duration": 5.8}, {"text": "So, here’s the calculation of the speed of light that Maxwell found, and the constants that it simplified down to.", "start": 505.8, "duration": 5.26}, {"text": "You can take our energy density equation and substitute the magnetic field magnitude, B, with the electric field, times the square root of the permittivity constants.", "start": 511.06, "duration": 7.88}, {"text": "With this simplified energy density equation, you can then substitute the electric field magnitude for the speed of light and the magnetic field magnitude.", "start": 518.94, "duration": 7.24}, {"text": "These equations give the energy density of\nan EM wave at any point during its propagation.", "start": 526.18, "duration": 4.84}, {"text": "One last important measurement of delivering energy is intensity, which is the energy transported by a wave per unit time, per unit area.", "start": 531.02, "duration": 7.1}, {"text": "Mathematically, the energy delivered is equal to the energy density times the volume of space in which the energy is transported over a period of time.", "start": 538.12, "duration": 8.52}, {"text": "You can then replace energy density with one\nof the simplified equations we used earlier,", "start": 546.65, "duration": 3.84}, {"text": "so the volume of space encompassed by the wave is equal to the unit area times the distance traveled.", "start": 550.49, "duration": 5.52}, {"text": "And the distance traveled will be the speed\nof light multiplied by the time period.", "start": 556.01, "duration": 3.83}, {"text": "After cancelling out like terms, you’re left with an equation that tells you how much energy you have per unit area based on the strength of the electric field, which you can also replace with the magnetic field magnitude.", "start": 559.84, "duration": 10.02}, {"text": "A lot of math, I know.", "start": 569.86, "duration": 1.5}, {"text": "But the vast knowledge of electromagnetism that we have today, and the doors it has opened into the fields of relativity and quantum theory, are all based on the theories that Maxwell and his predecessors developed.", "start": 571.36, "duration": 10.04}, {"text": "Albert Einstein praised Maxwell specifically for his contributions, but it was the combined effort of revolutionary minds like Maxwell, Faraday, and Gauss that we have to thank for our understanding of the interaction between electric and magnetic fields.", "start": 581.4, "duration": 12.56}, {"text": "Today we learned about Maxwell’s equations\nand their unifying power in the field of electromagnetism.", "start": 593.96, "duration": 4.78}, {"text": "We discussed electromagnetic waves and how changing electric and magnetic fields propagate through space.", "start": 598.74, "duration": 5.34}, {"text": "We investigated the different types of waves on the electromagnetic spectrum as well as how to calculate the amount of energy they can carry.", "start": 604.08, "duration": 6.22}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 610.3, "duration": 4.04}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 614.34, "duration": 3.76}, {"text": "Shank’s FX, Physics Girl, and Deep Look.", "start": 618.1, "duration": 2.62}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 620.72, "duration": 3.92}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 624.64, "duration": 4.42}]