[{"text": "We’ve been talking a lot about the science\nof how things move -- you throw a ball in the air,", "start": 2.88, "duration": 4.3}, {"text": "and there are ways to predict exactly how it will fall.", "start": 7.18, "duration": 2.82}, {"text": "But there’s something we’ve been leaving\nout: forces, and why they make things accelerate.", "start": 10.01, "duration": 4.62}, {"text": "And for that, we’re going to turn to a physicist\nyou’ve probably heard of: Isaac Newton.", "start": 14.63, "duration": 5.93}, {"text": "With his three laws, published in 1687 in his book\nPrincipia, Newton outlined his understanding of motion", "start": 20.56, "duration": 6.3}, {"text": "-- and a lot of his ideas were\ntotally new.", "start": 26.86, "duration": 2.16}, {"text": "Today, more than 300 years later, if you’re\ntrying to describe the effects of forces on", "start": 29.029, "duration": 4.161}, {"text": "just about any everyday object -- a box on\nthe ground, a reindeer pulling a sleigh, or", "start": 33.19, "duration": 4.869}, {"text": "an elevator taking you up to your apartment\n-- then you’re going to want to use Newton’s Laws.", "start": 38.059, "duration": 4.1}, {"text": "And yes. I’ll explain the reindeer thing\nin a minute.", "start": 42.16, "duration": 3.18}, {"text": "[Theme Music]", "start": 45.34, "duration": 8.72}, {"text": "Newton’s first law is all about inertia,\nwhich is basically an object’s tendency", "start": 54.06, "duration": 4.619}, {"text": "to keep doing what it’s doing.", "start": 58.679, "duration": 1.52}, {"text": "It’s often stated as: “An object in motion\nwill remain in motion, and an object at rest", "start": 60.199, "duration": 4.521}, {"text": "will remain at rest, unless acted upon by\na force.”", "start": 64.72, "duration": 2.829}, {"text": "Which is just another way of saying that,\nto change the way something moves -- to give", "start": 67.549, "duration": 3.25}, {"text": "it ACCELERATION -- you need a net force.", "start": 70.799, "duration": 2.061}, {"text": "So, how do we measure inertia?", "start": 72.86, "duration": 1.5}, {"text": "Well, the most important thing to know is\nmass. Say you have two balls that are the", "start": 74.36, "duration": 4.25}, {"text": "same size, but one is an inflatable beach\nball and the other is a bowling ball.", "start": 78.61, "duration": 3.969}, {"text": "The bowling ball is going to be harder to\nmove, and harder to stop once it’s moving.", "start": 82.579, "duration": 4.241}, {"text": "It has more inertia because it has more mass.", "start": 86.82, "duration": 2.759}, {"text": "Makes sense, right? More mass means more STUFF,\nwith a tendency to keep doing what it was", "start": 89.579, "duration": 4.731}, {"text": "doing before your force came along, and interrupted\nit.", "start": 94.31, "duration": 2.809}, {"text": "And this idea connects nicely to Newton’s\nsecond law: net force is equal to mass x acceleration.", "start": 97.119, "duration": 5.831}, {"text": "Or, as an equation, F(net) = ma.", "start": 102.95, "duration": 3.57}, {"text": "It’s important to remember that we’re\ntalking about NET force here -- the amount", "start": 106.52, "duration": 3.059}, {"text": "of force left over, once you’ve added together\nall the forces that might cancel each other out.", "start": 109.579, "duration": 4.52}, {"text": "Let's say you have a hockey puck sitting on a perfectly\nfrictionless ice rink. And I know ice isn’t", "start": 114.1, "duration": 6.1}, {"text": "perfectly frictionless but stick with it.\nIf you’re pushing the puck along with", "start": 120.21, "duration": 4.149}, {"text": "a stick, that’s a force on it - that\nisn’t being canceled out by anything else.", "start": 124.359, "duration": 3.96}, {"text": "So the puck is experiencing acceleration.", "start": 128.319, "duration": 2.32}, {"text": "But when the puck is just sitting still, or\neven when it’s sliding across the ice after", "start": 130.64, "duration": 3.9}, {"text": "you’ve pushed it, then all the forces are\nbalanced out.", "start": 134.55, "duration": 2.63}, {"text": "That’s what’s known as equilibrium.", "start": 137.18, "duration": 1.75}, {"text": "An object that’s in equilibrium can still be MOVING, like the sliding puck, but its VELOCITY won’t be changing.", "start": 138.93, "duration": 5.08}, {"text": "It’s when the forces get UNbalanced, that\nyou start to see the exciting stuff happen.", "start": 144.01, "duration": 4.11}, {"text": "And probably the most common case of a net\nforce making something move is the gravitational force.", "start": 148.12, "duration": 4.96}, {"text": "Say you throw a 5 kg ball straight up in the\nair -- and then, yknow, get out of the way,", "start": 153.09, "duration": 3.819}, {"text": "because that could really hurt if it hits\nyou...", "start": 156.909, "duration": 1.491}, {"text": "But the force of gravity is pulling down on the ball, which is accelerating downward at a rate of 9.81 m/s^2.", "start": 158.4, "duration": 6.44}, {"text": "So the net force is equal to m a, but the\nonly force acting here is gravity.", "start": 164.84, "duration": 4.46}, {"text": "This means that, if we could measure the acceleration of the ball, we’d be able to calculate the force of gravity.", "start": 169.3, "duration": 5.14}, {"text": "And we CAN measure the acceleration -- it’s\n9.81 m/s^2, the value we’ve been calling small g.", "start": 174.44, "duration": 6.84}, {"text": "So the force of gravity on the ball must be 5 kg,\nwhich is the mass of the ball… times small g", "start": 181.28, "duration": 5.14}, {"text": "which comes to 49.05 kilograms\ntimes meters per second squared!", "start": 186.42, "duration": 4.68}, {"text": "We use this equation for gravity so much\nthat it’s often just written as F(g) = mg.", "start": 191.11, "duration": 5.58}, {"text": "That’s how you determine the force of\ngravity, otherwise known as weight.", "start": 196.69, "duration": 3.48}, {"text": "Now, those units can be a bit of a mouthful,\nso we just call them Newtons.", "start": 200.17, "duration": 3.73}, {"text": "That’s right! We measure weight in Newtons,\nin honor of Sir Isaac, and NOT kilograms!", "start": 203.9, "duration": 6.04}, {"text": "Kilograms are a measure of mass!", "start": 209.94, "duration": 1.88}, {"text": "But gravity often isn’t the only force\nacting on the object.", "start": 211.83, "duration": 3.5}, {"text": "So when we’re trying to calculate a NET force, we usually have to take into account more than just gravity.", "start": 215.33, "duration": 4.91}, {"text": "This is where we get into one of the forces that tends to show up a lot, which is explained by Newton’s third law.", "start": 220.24, "duration": 5.76}, {"text": "You probably know this law as “for every\naction, there’s an equal but opposite reaction.”", "start": 226.0, "duration": 4.299}, {"text": "Which just means that if you exert a force\non an object, it exerts an equal force back on you.", "start": 230.299, "duration": 5.36}, {"text": "And that’s what we call the normal force.", "start": 235.67, "duration": 1.959}, {"text": "“Normal” in this instance means “perpendicular”,\nand the normal force is always perpendicular", "start": 237.629, "duration": 5.211}, {"text": "to whatever surface your object is resting\non.", "start": 242.84, "duration": 2.42}, {"text": "At least, it is when you're pushing on something\nbig, and macroscopic, like a table.", "start": 245.26, "duration": 4.08}, {"text": "If you put a book down on a table, the normal\nforce is pushing -- and therefore pointing -- up.", "start": 249.34, "duration": 5.58}, {"text": "But if you put it on a ramp, then the normal\nforce is pointing perpendicular to the ramp.", "start": 254.92, "duration": 4.88}, {"text": "Now, the normal force isn’t like most other forces.\nIt’s special, because it changes its magnitude.", "start": 259.8, "duration": 5.14}, {"text": "Say you have a piece of aluminum foil stretched\ntightly across the top of a bowl, and then", "start": 264.94, "duration": 4.38}, {"text": "you put one lonely grape on top of it.", "start": 269.33, "duration": 2.46}, {"text": "Because of gravity, that grape is exerting\na little bit of force on the foil, and the", "start": 271.79, "duration": 4.42}, {"text": "normal force pushes right back, with the same\namount.", "start": 276.21, "duration": 2.82}, {"text": "But then you add another grape, which doubles the force on the foil -- in that case, the normal force doubles too.", "start": 279.03, "duration": 5.72}, {"text": "That’ll keep happening until eventually\nyou add enough grapes that they break through the foil.", "start": 284.75, "duration": 4.27}, {"text": "That’s what happens when the normal force\ncan’t match the force pushing against it.", "start": 289.02, "duration": 4.25}, {"text": "But, what does Newton’s famous third law\nreally mean, though?", "start": 293.27, "duration": 3.06}, {"text": "When I push on this desk with my finger\nright now, I’m applying a force to it.", "start": 296.33, "duration": 4.32}, {"text": "And it’s applying an equal force right back on my finger\n-- one that I can actually feel.", "start": 300.65, "duration": 5.35}, {"text": "But if that’s true -- and it is -- then\nwhy are we able to move things?", "start": 306.01, "duration": 3.96}, {"text": "How can I pick up this mug?\nOr how can a reindeer pull a sleigh?", "start": 309.97, "duration": 3.84}, {"text": "Basically, things can move because there’s\nmore going on, than just the action and reaction forces.", "start": 313.81, "duration": 5.27}, {"text": "For example, when a reindeer pulls on a sleigh,\nNewton’s third law tells us that the sleigh", "start": 319.09, "duration": 4.63}, {"text": "is pulling back on it with equal force.", "start": 323.72, "duration": 2.17}, {"text": "But the reindeer can still move the sleigh\nforward, because it’s standing on the ground.", "start": 325.89, "duration": 4.18}, {"text": "When it takes a step, it’s pushing backward on the ground with its foot -- & the ground is pushing it forward.", "start": 330.07, "duration": 5.41}, {"text": "Meanwhile, the reindeer is also pulling on\nthe sleigh, while the sleigh is pulling right back.", "start": 335.48, "duration": 5.04}, {"text": "But the force from the GROUND PUSHING\nthe reindeer forward is STRONGER than the", "start": 340.52, "duration": 4.3}, {"text": "force from the sleigh pulling it back. So\nthe animal accelerates forward, and so does the sleigh.", "start": 344.82, "duration": 5.32}, {"text": "So, one takeaway here is that: there would\nbe no Christmas without physics!", "start": 350.14, "duration": 3.69}, {"text": "But, now that we have an idea of some of the\nforces we might encounter, let’s describe", "start": 353.83, "duration": 4.05}, {"text": "what’s happening when a box is sitting on\nthe ground.", "start": 357.88, "duration": 2.25}, {"text": "The first thing to do -- which is the first\nthing you should ALWAYS do when you’re solving", "start": 360.13, "duration": 3.3}, {"text": "a problem like this -- is draw what’s known\nas a free body diagram.", "start": 363.43, "duration": 3.46}, {"text": "Basically, you draw a rough outline of the\nobject, put a dot in the middle, and then", "start": 366.89, "duration": 4.02}, {"text": "draw and label arrows, to represent all the\nforces.", "start": 370.91, "duration": 3.16}, {"text": "We also have to decide which direction is\npositive -- in this case, we’ll choose up to be positive.", "start": 374.07, "duration": 4.85}, {"text": "For our box, the free body diagram is pretty\nsimple. There’s an arrow pointing down,", "start": 378.92, "duration": 5.23}, {"text": "representing the force of gravity, and an\narrow pointing up, representing the force", "start": 384.15, "duration": 4.01}, {"text": "of the ground pushing back on the box.", "start": 388.16, "duration": 1.89}, {"text": "Since the box is staying still, we know that\nit’s not accelerating, which tells us that", "start": 390.05, "duration": 4.4}, {"text": "those forces are equal, so the net force is\nequal to 0.", "start": 394.45, "duration": 3.31}, {"text": "But what if you attach a rope to the top of\nthe box, then connect it to the ceiling so", "start": 397.76, "duration": 3.91}, {"text": "the box is suspended in the air?", "start": 401.67, "duration": 1.56}, {"text": "Your net force is still 0, because there’s\nno acceleration on the box. And gravity is", "start": 403.23, "duration": 4.34}, {"text": "still pulling down in the same way it was\nbefore.", "start": 407.57, "duration": 2.37}, {"text": "But now, the counteracting upward force comes from the rope acting on the box, in what we call the tension force.", "start": 409.94, "duration": 5.96}, {"text": "To make our examples simpler, we almost always\nassume that ropes have no mass and are completely", "start": 415.9, "duration": 5.44}, {"text": "unbreakable -- no matter how much you pull\non them, they’ll pull right back.", "start": 421.34, "duration": 4.02}, {"text": "Which means that the tension force isn’t\nfixed. If the box weighs 5 Newtons, then the", "start": 425.36, "duration": 4.83}, {"text": "tension in the rope is also 5 Newtons. But\nif we add another 5 Newtons of weight, the", "start": 430.19, "duration": 5.06}, {"text": "tension in the rope will become 10 Newtons.", "start": 435.25, "duration": 2.14}, {"text": "Kind of like how the normal force changes,\nwith the grapes on the foil. But in this case,", "start": 437.39, "duration": 4.41}, {"text": "it's in response to a pulling force instead\nof a push.", "start": 441.8, "duration": 2.87}, {"text": "The key is that no matter what, you can add\nthe forces together to give you a particular", "start": 444.67, "duration": 4.33}, {"text": "net force -- even though that net force might\nNOT always be 0. Like, in an elevator.", "start": 449.0, "duration": 5.0}, {"text": "So let’s say you’re in an elevator -- or\nas I call them, a lift.", "start": 454.0, "duration": 3.45}, {"text": "The total mass of the lift, including you,\nis 1000 kg. And its movement is controlled", "start": 457.45, "duration": 5.43}, {"text": "by a counterweight, attached to a pulley.", "start": 462.88, "duration": 2.11}, {"text": "The plan is to set up a counterweight of 850kg,\nand then let the lift go. Once you let go,", "start": 464.99, "duration": 7.1}, {"text": "the lift is going to start accelerating downward\n- because it’s HEAVIER than the counterweight.", "start": 472.09, "duration": 4.0}, {"text": "And the hope is that the counterweight will\nkeep it from accelerating TOO much.", "start": 476.09, "duration": 3.69}, {"text": "But how will we know if it’s safe? How quickly\nis the lift going to accelerate downward?", "start": 479.78, "duration": 4.59}, {"text": "To find out, first let’s draw a free body\ndiagram for the lift, making UP the positive direction.", "start": 484.37, "duration": 5.87}, {"text": "The force of gravity on the lift is pulling it down, and it’s equal to the mass of the lift x small g --", "start": 490.24, "duration": 5.94}, {"text": "9810 Newtons of force, in\nthe negative direction.", "start": 496.18, "duration": 4.82}, {"text": "And the force of tension is pulling the lift UP, in the positive direction.", "start": 501.0, "duration": 4.18}, {"text": "Which means that for the lift, the net force is equal to the tension force, minus the mass of the lift x small g.", "start": 505.18, "duration": 6.46}, {"text": "Now! Since Newton’s first law tells us that\nF(net) = ma, we can set all of that to be", "start": 511.64, "duration": 5.61}, {"text": "equal to the lift’s mass, times some downward\nacceleration, -a. That’s what we’re trying to solve for.", "start": 517.25, "duration": 6.19}, {"text": "So, let’s do the same thing for the counterweight.", "start": 523.44, "duration": 2.28}, {"text": "Gravity is pulling it down with 8338.5 N\nof force in the negative direction.", "start": 525.72, "duration": 7.12}, {"text": "And again, the force of tension is pulling\nit up, so that the net force is equal to the", "start": 532.84, "duration": 4.64}, {"text": "tension force, minus the mass of the counterweight\ntimes small g.", "start": 537.49, "duration": 4.13}, {"text": "And again, because of Newton’s second law,\nwe know that all of that is equal to the mass", "start": 541.62, "duration": 4.17}, {"text": "of the counterweight, times that same acceleration,\n“a” -- which is positive this time since", "start": 545.79, "duration": 5.16}, {"text": "the counterweight is moving upward.", "start": 550.95, "duration": 1.91}, {"text": "So! Putting that all together, we end up with\ntwo equations -- and two unknowns.", "start": 552.86, "duration": 4.96}, {"text": "We don’t have a value for the tension force,\nand we don’t have a value for acceleration.", "start": 557.82, "duration": 4.02}, {"text": "But what we’re trying to solve for is the\nacceleration. So we use algebra to do that.", "start": 561.84, "duration": 4.34}, {"text": "When you have a system of equations like this,\nyou can add or subtract all the terms on each", "start": 566.18, "duration": 4.52}, {"text": "side of the equals sign, to turn them into\none equation.", "start": 570.7, "duration": 3.06}, {"text": "For example, if you know that 1 + 2 = 3 and\nthat 4 + 2 = 6, you can subtract the first", "start": 573.76, "duration": 6.95}, {"text": "equation from the second to get 3 = 3.", "start": 580.71, "duration": 2.85}, {"text": "And in our case, with the lift, subtracting\nthe first equation from the second gets rid", "start": 583.56, "duration": 4.52}, {"text": "of the term that represents the tension force.", "start": 588.09, "duration": 2.14}, {"text": "We now just have to solve for acceleration -- meaning, we need to rearrange the equation to set everything equal to “a.”", "start": 590.23, "duration": 6.22}, {"text": "We end up with an equation that really just\nsays that “a” is equal to the difference", "start": 596.45, "duration": 3.85}, {"text": "between the weights -- or the net force on\nthe system -- divided by the total mass.", "start": 600.31, "duration": 4.94}, {"text": "Essentially, this is just a fancier version of F(net) = ma.", "start": 605.25, "duration": 3.94}, {"text": "And we can solve that for “a”,\nwhich turns out to be 0.795 m/s^2.", "start": 609.19, "duration": 5.59}, {"text": "Which is not that much acceleration at all!", "start": 614.79, "duration": 2.15}, {"text": "So, as long as you aren’t dropping too far\ndown, you should be fine.", "start": 616.94, "duration": 2.9}, {"text": "Even if the landing is a little bumpy.", "start": 619.84, "duration": 1.66}, {"text": "In this episode, you learned about Newton’s\nthree laws of motion: how inertia works, that", "start": 621.5, "duration": 5.28}, {"text": "net force is equal to mass x acceleration,\nhow physicists define equilibrium, and all", "start": 626.78, "duration": 4.99}, {"text": "about the “normal” force and the “tension”\nforce.", "start": 631.77, "duration": 2.3}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios. You can head over", "start": 634.07, "duration": 4.7}, {"text": "to their channel to check out amazing shows like: BrainCraft, It’s OK To Be Smart, and PBS Idea Channel.", "start": 638.77, "duration": 6.39}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 645.16, "duration": 4.64}, {"text": "with the help of these amazing people and\nour Graphics Team is Thought Cafe.", "start": 649.8, "duration": 3.96}]