[{"text": "Hi, I'm Carrie Anne and welcome to Crash Course Computer Science.", "start": 2.7, "duration": 3.12}, {"text": "Early in this series we covered computing history from roughly the dawn of civilization,", "start": 5.82, "duration": 4.02}, {"text": "up to the birth of electronic general purpose computers in the mid 1940s.", "start": 9.84, "duration": 5.06}, {"text": "A lot of the material we've discussed over the past 23 episodes", "start": 14.9, "duration": 2.66}, {"text": "like programming languages and compilers", "start": 17.56, "duration": 2.36}, {"text": "algorithms and integrated circuits", "start": 19.92, "duration": 1.52}, {"text": "Floppy disks and operating systems, telly types and screens", "start": 21.44, "duration": 3.36}, {"text": "all emerged over roughly a 30-year period, from the mid 1940s up to the mid 1970s", "start": 24.8, "duration": 5.2}, {"text": "This is the era of computing before companies like Apple and Microsoft existed", "start": 30.12, "duration": 4.76}, {"text": "and long before anyone tweeted, Googled or Uber-d.", "start": 34.88, "duration": 2.8}, {"text": "It was a formative period setting the stage for personal computers,", "start": 37.68, "duration": 3.46}, {"text": "worldwide web, self-driving cars virtual reality, and many other topics", "start": 41.14, "duration": 3.84}, {"text": "we'll get to in the second half of this series.", "start": 44.98, "duration": 2.4}, {"text": "Today we're going to step back from circuits and algorithms and review this influential period.", "start": 47.38, "duration": 3.66}, {"text": "We'll pay special attention to the historical backdrop of the cold war, the space race and the rise of globalization and consumerism.", "start": 51.04, "duration": 7.0}, {"text": "Pretty much immediately after World War II concluded in 1945,", "start": 67.0, "duration": 3.42}, {"text": "there was tension between the world's two new superpowers the United States and the USSR", "start": 70.42, "duration": 4.98}, {"text": "The Cold War had begun and with it, massive government spending on science and engineering.", "start": 75.4, "duration": 4.48}, {"text": "Computing which had already demonstrated its value in wartime efforts like the Manhattan Project", "start": 79.88, "duration": 4.42}, {"text": "and code breaking Nazi communications,", "start": 84.3, "duration": 1.84}, {"text": "was lavished with government funding. They enabled huge ambitious computing projects to be undertaken,", "start": 86.14, "duration": 5.22}, {"text": "like ENIAC, EDVAC, Atlas and Whirlwind all mentioned in previous episodes.", "start": 91.36, "duration": 4.04}, {"text": "This spurred rapid advances that simply weren't possible in the commercial sector alone,", "start": 95.4, "duration": 4.68}, {"text": "where projects were generally expected to recoup development costs through sales.", "start": 100.08, "duration": 3.4}, {"text": "This began to change in the early 1950s, especially with Eckert and Buckley's Univac 1,", "start": 103.48, "duration": 4.0}, {"text": "the first commercially successful computer.", "start": 107.48, "duration": 2.82}, {"text": "Unlike any Echo Atlas, this wasn't just one single computer.", "start": 110.3, "duration": 3.02}, {"text": "It was a model of computers, in total more than 40 were built.", "start": 113.32, "duration": 4.2}, {"text": "Most of these Univacs went to government offices or large companies.", "start": 117.52, "duration": 3.0}, {"text": "Which was part of the growing military industrial complex in the United States, with pockets deep enough to afford the cutting edge.", "start": 120.52, "duration": 6.24}, {"text": "Famously a Univac one built for the U.S atomic energy commission was used by CBS to predict the results of", "start": 126.86, "duration": 5.3}, {"text": "the 1952 U.S. presidential election. With just 1% of the vote the computer correctly predicted an Eisenhower landslide while pundits favored Stevenson.", "start": 132.16, "duration": 8.3}, {"text": "It was a media event that helped propel computing to the forefront of the public's imagination", "start": 140.46, "duration": 4.54}, {"text": "Computing was unlike machines of the past, which generally augmented human physical abilities.", "start": 145.0, "duration": 5.0}, {"text": "Trucks allowed us to carry more automatic looms whoa faster", "start": 150.0, "duration": 2.74}, {"text": "Machine tools were more precise and so on for a bunch of contraptions that typify the industrial revolution.", "start": 152.74, "duration": 5.4}, {"text": "But computers on the other hand could augment human intellect.", "start": 158.14, "duration": 3.66}, {"text": "This potential wasn't lost on Vannevar Bush, who in 1945 published an article", "start": 161.8, "duration": 4.52}, {"text": "on a hypothetical computing device he envisioned called the Memex.", "start": 166.32, "duration": 2.94}, {"text": "This was a device in which an individual stores all his books, records and communications", "start": 169.26, "duration": 3.84}, {"text": "and which is mechanized, so it may be consulted with exceeding speed and flexibility", "start": 173.1, "duration": 4.24}, {"text": "It is an enlarged intimate supplement to his memory.", "start": 177.34, "duration": 2.74}, {"text": "He also predicted that wholly new forms of encyclopedia will appear,", "start": 180.08, "duration": 3.6}, {"text": "ready-made, with a mesh of associative trails running through them. Sound familiar?", "start": 183.68, "duration": 4.3}, {"text": "Memex directly inspired several subsequent game-changing systems,", "start": 187.98, "duration": 3.48}, {"text": "like Ivan Sutherland Sketchpad, which we discussed last episode,", "start": 191.46, "duration": 2.8}, {"text": "and Dough Engelbart's online system, which we will cover soon.", "start": 194.26, "duration": 3.04}, {"text": "Vannevar Bush was the head of the U.S. office of Scientific Research and Development,", "start": 197.3, "duration": 3.72}, {"text": "which was responsible for funding and coordinating scientific research during World War Two.", "start": 201.02, "duration": 4.78}, {"text": "With the Cold War brewing, Bush lobbied for a creation of a peace time equivalent,", "start": 205.8, "duration": 4.04}, {"text": "the National Science Foundation, formed in 1950.", "start": 209.84, "duration": 3.04}, {"text": "To this day the NSF provides federal funding to support scientific research in the United States.", "start": 212.88, "duration": 5.44}, {"text": "And it is a major reason the U.S. has continued to be a leader in the technology sector.", "start": 218.32, "duration": 4.44}, {"text": "It was also in the 1950s that consumers started to buy transistor powered gadgets,", "start": 222.76, "duration": 4.52}, {"text": "notable among them was the transistor radio, which was small, durable and battery-powered.", "start": 227.28, "duration": 4.18}, {"text": "And it was portable, unlike the vacuum tube based radio sets from the 1940s and before.", "start": 231.46, "duration": 4.48}, {"text": "It was a runaway success, the furby or iphone of its day.", "start": 235.94, "duration": 3.6}, {"text": "The Japanese government looking for industrial opportunities, to bolster their post-war economy,", "start": 239.54, "duration": 4.3}, {"text": "soon got in on the action. Licensing the rights to Transistors from Bell Labs in 1952.", "start": 243.84, "duration": 4.74}, {"text": "Helping launch the Japanese semiconductor and electronics industry.", "start": 248.58, "duration": 3.82}, {"text": "In 1955, the first Sony product was released:", "start": 252.4, "duration": 2.86}, {"text": "The TR-55 Transistor Radio. Concentrating on quality and price,", "start": 255.3, "duration": 4.18}, {"text": "Japanese companies captured half of the U.S. Market for portable radios in just five years.", "start": 259.48, "duration": 5.2}, {"text": "This planted the first seeds of a major industrial rivalry in the decades to come.", "start": 264.76, "duration": 4.5}, {"text": "In 1953, there were only around 100 computers on the entire planet", "start": 269.3, "duration": 4.02}, {"text": "and at this point, the USSR was only a few years behind the West in computing technology,", "start": 273.32, "duration": 4.38}, {"text": "completing their first programmable electronic computer in 1950.", "start": 277.7, "duration": 3.84}, {"text": "But the Soviets were way ahead in the burgeoning space race. Let's go to the thought-bubble.", "start": 281.54, "duration": 4.24}, {"text": "The Soviets launched the world's first satellite into orbit, Sputnik one,", "start": 285.78, "duration": 3.74}, {"text": "in 1957 and a few years later in 1961.", "start": 289.52, "duration": 3.6}, {"text": "Soviet Cosmonaut, Yuri Gagarin became the first human in space.", "start": 293.14, "duration": 3.38}, {"text": "This didn't sit well with the American public", "start": 296.52, "duration": 1.9}, {"text": "and prompted President Kennedy, a month after Gagarin's mission,", "start": 298.42, "duration": 2.9}, {"text": "to encourage the nation to land a man on the moon within the decade. And it was expensive!", "start": 301.32, "duration": 4.82}, {"text": "Nasa's budget grew almost tenfold, peaking in 1966 at roughly 4.5 percent of the u.s. Federal budget today", "start": 306.14, "duration": 6.58}, {"text": "It's around half a percent", "start": 312.77, "duration": 1.58}, {"text": "Nasa used this funding to tackle a huge array of enormous challenges this culminated in the apollo program", "start": 314.35, "duration": 5.19}, {"text": "Which is peak employed roughly?", "start": 319.61, "duration": 2.09}, {"text": "400,000 people further supported by over 20,000 universities and companies one of these huge challenges was navigating in space", "start": 322.16, "duration": 6.92}, {"text": "Nasa needed a computer to process complex trajectories and issue Guidance commands to the spacecraft for this they built the apollo guidance computer", "start": 329.09, "duration": 7.609}, {"text": "There were three significant requirements first the computer had to be fast no surprise there second it has to be small and lightweight", "start": 336.979, "duration": 6.799}, {"text": "there's not a lot of room in a spacecraft and every ounce is precious when you're flying a quarter million miles to the moon and", "start": 343.819, "duration": 5.45}, {"text": "Finally it had to be really really ridiculously reliable", "start": 349.339, "duration": 3.14}, {"text": "This is super important in a spacecraft where there's lots of vibration radiation and temperature change", "start": 352.479, "duration": 4.769}, {"text": "And there's no running to best buy it something breaks the technology of the era of vacuum Tubes and discrete transistors", "start": 357.249, "duration": 5.55}, {"text": "Just weren't up to the task so Nasa turned to a brand-new technology integrated circuits", "start": 362.8, "duration": 5.279}, {"text": "Which we discussed a few episodes ago the apollo guidance computer was the first computer to use them a huge paradigm shift", "start": 368.08, "duration": 5.879}, {"text": "Nasa was also the only place that could afford them initially each chip cost around $50 and the guidance computer needed thousands of them", "start": 374.18, "duration": 7.549}, {"text": "But by paying that price the Americans were able to beat the soviets to the moon", "start": 381.729, "duration": 4.139}, {"text": "Thanks, thought-bubble although the apollo Guidance computer is credited with spurring the development and adoption of integrated circuits", "start": 386.08, "duration": 6.599}, {"text": "It was a low volume product there are only 17 apollo missions after all it was actually military applications", "start": 392.679, "duration": 6.3}, {"text": "Especially the minuteman and polaris nuclear missile systems that allowed integrated circuits to become a mass-produced", "start": 398.979, "duration": 5.489}, {"text": "Item this rapid Advancement was further accelerated by the u.s.", "start": 404.809, "duration": 3.47}, {"text": "Building and buying huge powerful computers often called supercomputers because they were frequently 10 times faster than any other computer on the planet", "start": 408.279, "duration": 7.049}, {"text": "Upon their release but these machines built by companies Like CDC cray", "start": 415.55, "duration": 3.859}, {"text": "And Ibm were also super in cost and pretty much only governments could afford to buy them in the us these machines went to government", "start": 419.409, "duration": 6.75}, {"text": "Agencies like the NSA and government research labs like Lawrence Livermore and Los Alamos National laboratories initially the u.s.", "start": 426.159, "duration": 6.779}, {"text": "semiconductor industry boomed buoyed by High profit government contracts", "start": 433.159, "duration": 3.589}, {"text": "However this meant that most us companies overlooked the consumer market where profit Margins were small the Japanese", "start": 436.879, "duration": 5.48}, {"text": "Semiconductor industry came to dominate this niche by having to operate with lean profit margins in the 1950s and 60s", "start": 442.61, "duration": 5.719}, {"text": "the Japanese had invested heavily in manufacturing capacity to achieve economies of scale in", "start": 448.61, "duration": 5.119}, {"text": "Research to improve quality and Yields and in automation to keep manufacturing costs low in the 1970s with the space Race and cold war subsiding", "start": 454.069, "duration": 7.489}, {"text": "previously juicy defense contracts began to dry up and", "start": 461.87, "duration": 2.779}, {"text": "Consumer conductor and electronics companies found it harder to compete it didn't help the many computing components had been commoditized", "start": 465.19, "duration": 5.94}, {"text": "Be around with Dram", "start": 471.29, "duration": 1.43}, {"text": "So why buy expensive intel memory when you could buy the same chip for less from Hitachi?", "start": 472.72, "duration": 4.019}, {"text": "Throughout the 1970s us companies began to downsize consolidate or outright fail intel had to lay off a third of its Workforce in", "start": 477.11, "duration": 7.819}, {"text": "1974 and even the storied Fairchild semiconductor was acquired in", "start": 485.33, "duration": 3.949}, {"text": "1979 after near bankruptcy to survive many of these companies began to outsource their manufacturing in a bid to reduce costs", "start": 489.65, "duration": 6.529}, {"text": "Intel weave drew from its main product category memory Ics and decided to refocus on processes", "start": 496.49, "duration": 5.36}, {"text": "Which ultimately saved the company this low and us?", "start": 501.85, "duration": 2.699}, {"text": "electronics industry allowed Japanese companies like Sharp and Casio to dominate the Breakout computing product of the", "start": 504.68, "duration": 5.809}, {"text": "1970s Handheld electronic calculators by using integrated circuits these could be made small and cheap they replaced", "start": 511.04, "duration": 7.67}, {"text": "Expensive desktop adding machines you find in offices", "start": 518.9, "duration": 2.539}, {"text": "For most people it was the first time they didn't have to do math on paper, or use a slide rule", "start": 521.57, "duration": 4.969}, {"text": "They were an instant hit selling by the millions", "start": 526.54, "duration": 2.46}, {"text": "This server drove down the cost of integrated circuits and led to the development and widespread use of micro processors like the intel", "start": 529.15, "duration": 6.449}, {"text": "4004 we've discussed previously", "start": 535.85, "duration": 2.0}, {"text": "This chip was built by intel in 1971 at the request of Japanese calculator company busy calm soon", "start": 538.01, "duration": 6.529}, {"text": "Japanese electronics were everywhere from televisions of VcRs to digital wristwatches and Walkmans the availability of inexpensive", "start": 544.7, "duration": 6.32}, {"text": "microprocessor Spawned in Highly new Products like video arcades the world got pong in 1972 and Breakout in", "start": 551.78, "duration": 6.409}, {"text": "1976 as cost continued to plummet soon it became possible for regular people to afford computing devices during this time", "start": 558.59, "duration": 6.5}, {"text": "we see the emergence of the first successful home computers like the", "start": 565.09, "duration": 3.509}, {"text": "1975 Altair 8800 and also the first home gaming consoles like the Atari 2600 in", "start": 569.12, "duration": 5.78}, {"text": "1977 home now, I repeat that home that seems like a small thing today", "start": 575.51, "duration": 4.52}, {"text": "But this was the dawn of a whole new era in computing in just three decades computers have evolved from machines where you could literally?", "start": 580.03, "duration": 6.329}, {"text": "Walk inside of the cPU assuming you had government clearance to the point where a child could play with a handheld toy", "start": 586.36, "duration": 6.239}, {"text": "Containing a microprocessor many times faster, critically this dramatic evolution would have been but without two powerful forces at play", "start": 592.82, "duration": 7.28}, {"text": "governments and consumers", "start": 600.77, "duration": 1.8}, {"text": "government funding like the United States provided during the cold war", "start": 602.57, "duration": 3.02}, {"text": "enabled early adoption of many nascent computing technologies this funding helped flow entire", "start": 605.99, "duration": 5.15}, {"text": "Industries relate into computing long enough for the technology to mature and become commercially feasible then businesses and ultimately consumers", "start": 611.27, "duration": 7.279}, {"text": "Provided the demand to take it mainstream the cold war may be over, but this relationship continues today", "start": 618.89, "duration": 5.059}, {"text": "Governments are still funding science research intelligence agencies are still buying supercomputers humans are still being launched into space", "start": 624.56, "duration": 6.739}, {"text": "And you're still buying TVs xboxes playstations laptops and smartphones and for these reasons", "start": 631.3, "duration": 5.55}, {"text": "Computing continues to Advance a lightning pace. I'll see you next week", "start": 637.37, "duration": 3.65}, {"text": "crash course computer science is produced in association with PBS digital studios", "start": 641.57, "duration": 3.83}, {"text": "At their channel you can check out a playlist of shows like Physics Goldie flicks", "start": 645.59, "duration": 4.13}, {"text": "And PBs space time this episode was filmed at the Chad and stacey ever thought studio in Indianapolis, Indiana", "start": 649.72, "duration": 5.489}, {"text": "And it was made with the help of all these nice people and our wonderful graphic scene thought cafe", "start": 655.21, "duration": 4.559}, {"text": "That's where we're going to have to halt and catch fire. See you next week", "start": 659.8, "duration": 3.12}, {"text": "you", "start": 676.24, "duration": 2.0}]