[{"text": "It’s Professor Dave, let’s learn the law\nof sines.", "start": 0.48, "duration": 3.1}, {"text": "We have learned a lot about trigonometric\nfunctions as they pertain to right triangles.", "start": 10.4, "duration": 5.879}, {"text": "But what about other types of triangles?", "start": 16.279, "duration": 2.441}, {"text": "Surely we can do something with these as well.", "start": 18.72, "duration": 2.879}, {"text": "As it happens, there is a law that will help\nus find the sides and angles of oblique triangles,", "start": 21.599, "duration": 5.93}, {"text": "as well.", "start": 27.529, "duration": 1.31}, {"text": "Oblique triangles are ones that don’t have\na right angle.", "start": 28.839, "duration": 3.151}, {"text": "For these, all the SOHCAHTOA stuff we learned\nwon’t work anymore.", "start": 31.99, "duration": 4.25}, {"text": "But there are other relationships we can use,\nand one of them is called the law of sines.", "start": 36.24, "duration": 7.19}, {"text": "This law says that for an oblique triangle\nwith angles A, B, and C, all capitalized,", "start": 43.43, "duration": 5.93}, {"text": "as well as sides A, B, and C, all lower case,\nwhere the sides are precisely opposite their", "start": 49.36, "duration": 6.21}, {"text": "corresponding angles, the relationship between\nall of these will be A over sine A equals", "start": 55.57, "duration": 6.809}, {"text": "B over sine B equals C over sine C.", "start": 62.379, "duration": 4.451}, {"text": "This is pretty easy to remember, and not too\nhard to apply.", "start": 66.83, "duration": 3.75}, {"text": "We just have to know a few of these values,\nand we will be able to solve for the rest.", "start": 70.58, "duration": 5.86}, {"text": "Let’s look at this side angle angle triangle.", "start": 76.44, "duration": 4.49}, {"text": "That means we know one side, and two of the\nangles.", "start": 80.93, "duration": 3.65}, {"text": "We can get the rest of the sides and angles\nusing the law of sines.", "start": 84.58, "duration": 4.54}, {"text": "First, given two angles, we can always get\nthe third, we just subtract these two angles", "start": 89.12, "duration": 5.49}, {"text": "from one eighty.", "start": 94.61, "duration": 1.98}, {"text": "Now, we have one angle-side pair, so we can\nuse its ratio to get the other two sides.", "start": 96.59, "duration": 8.66}, {"text": "Here’s one relationship, we just bring this\nangle up over here, and then evaluate.", "start": 105.25, "duration": 7.89}, {"text": "To get the third side, here’s the other\nrelationship, and we just do the same thing.", "start": 113.14, "duration": 6.96}, {"text": "When we use this technique, we will usually\nmeasure angles in degrees, and just plug things", "start": 120.1, "duration": 5.92}, {"text": "into a calculator to get approximate side\nlengths.", "start": 126.02, "duration": 6.38}, {"text": "Now that we’ve seen a side angle angle example,\nlet’s try angle side angle.", "start": 132.4, "duration": 5.49}, {"text": "This is where the side we know is specifically\nthe one in between the two known angles.", "start": 137.89, "duration": 5.51}, {"text": "In such a case, we will again subtract the\nknown angles from one eighty to get the third,", "start": 143.4, "duration": 6.3}, {"text": "and once we have that, we are ready to plug\nvalues into the law of sines.", "start": 149.7, "duration": 5.34}, {"text": "Let’s look at a slightly different scenario.", "start": 155.04, "duration": 3.22}, {"text": "Let’s say we know two side lengths and one\nangle, which means side side angle.", "start": 158.26, "duration": 6.699}, {"text": "Here, we have to first find the angle opposite\nthis side length.", "start": 164.959, "duration": 8.041}, {"text": "Once we have that, we can subtract these two\nangles from one eighty to get the third, and", "start": 173.0, "duration": 6.459}, {"text": "find the third side length if we need to.", "start": 179.459, "duration": 5.041}, {"text": "The interesting thing about this case, is\nthat sometimes, given two sides and an angle,", "start": 184.5, "duration": 5.68}, {"text": "the law of sines will prove that the third\nside can’t possibly connect the other two,", "start": 190.18, "duration": 5.5}, {"text": "and the triangle can’t exist.", "start": 195.68, "duration": 1.44}, {"text": "This would occur if we solve for the sine\nof another angle and this value exceeds one,", "start": 197.12, "duration": 6.66}, {"text": "which is impossible for the sine function.", "start": 203.78, "duration": 2.92}, {"text": "It is also possible that SSA triangles result\nin two solutions, if we get a value for sine", "start": 206.7, "duration": 6.869}, {"text": "that could correspond to two different angles.", "start": 213.569, "duration": 4.361}, {"text": "The last thing we want to look at is the formula\nfor calculating the area of an oblique triangle.", "start": 217.93, "duration": 6.779}, {"text": "We know that the area of any triangle is one\nhalf base times height, but if we don’t", "start": 224.709, "duration": 5.581}, {"text": "know the height, we can also use this formula,\nwhere the area is equal to the product of", "start": 230.29, "duration": 5.869}, {"text": "the lengths of two sides and the sine of the\nangle between them.", "start": 236.159, "duration": 5.291}, {"text": "Since there are three angles, there are three\nways to get this per triangle.", "start": 241.45, "duration": 5.27}, {"text": "That’s pretty much all we need to know regarding\nthe law of sines, so let’s check comprehension.", "start": 246.82, "duration": 4.68}]