[{"text": "Professor Dave again, let’s talk about cylindrical\nshells.", "start": 0.54, "duration": 2.78}, {"text": "We just learned how to find the volume of\na solid of revolution by integration. Just", "start": 10.5, "duration": 5.02}, {"text": "the way that we calculated the area under\na curve by running a line segment of varying", "start": 15.52, "duration": 4.89}, {"text": "length across the region and adding them all\nup, to get volume, we just ran some area across", "start": 20.41, "duration": 5.82}, {"text": "a shape and added all of those up. Sometimes\nthis was the area of a disk, sometimes the", "start": 26.23, "duration": 5.88}, {"text": "area of a washer. But whatever the situation,\nwe were able to calculate the area of a cross", "start": 32.11, "duration": 5.9}, {"text": "section rather easily given the functions\ninvolved. Sometimes it won’t be so easy", "start": 38.01, "duration": 5.31}, {"text": "to use this method, so let’s look at an\nexample where another method will be a better", "start": 43.32, "duration": 5.05}, {"text": "approach. Take for example y equals two x squared minus", "start": 48.37, "duration": 5.2}, {"text": "x cubed. The region between this function\nand the x axis looks like this. Let’s say", "start": 53.57, "duration": 7.29}, {"text": "we rotate this area around the y axis to get\nthis bundt cake looking thing, a solid of", "start": 60.86, "duration": 6.22}, {"text": "revolution. A cross section of this solid\nwill be a washer, given the empty middle region,", "start": 67.08, "duration": 6.74}, {"text": "which we can then push upwards from the base\nto the top of the solid. But the problem is", "start": 73.82, "duration": 5.43}, {"text": "this. When we did this before, the functions\nwere simple, like y equals x, or y equals", "start": 79.25, "duration": 5.61}, {"text": "x squared. And given that we are doing things\nin terms of y, with the previous method we", "start": 84.86, "duration": 6.71}, {"text": "would have to rewrite the functions in terms\nof y so that we can integrate. With the other", "start": 91.57, "duration": 5.2}, {"text": "examples, that ended up being no problem,\nand we were able to get expressions for the", "start": 96.77, "duration": 5.28}, {"text": "inner and outer radii of the washer that we\ncould integrate. Here it’s not so easy.", "start": 102.05, "duration": 6.25}, {"text": "Rather than one function per radius, here\nboth the radii depend on this same function,", "start": 108.3, "duration": 5.1}, {"text": "and furthermore, solving this function for\nx in terms of y is not a very appealing task.", "start": 113.4, "duration": 6.35}, {"text": "But there is another technique we can try,\nand it is called the method of cylindrical", "start": 119.75, "duration": 4.43}, {"text": "shells. Before we apply this to the problem\nat hand, let’s just look at this hollow", "start": 124.18, "duration": 6.4}, {"text": "cylinder. This has an inner radius, r one,\nwhich ends at the inner face of the solid,", "start": 130.58, "duration": 6.79}, {"text": "and an outer radius, r two, which ends at\nthe outer face. This cylinder also has a height,", "start": 137.37, "duration": 6.35}, {"text": "h. To get the volume of this figure, we can\ncalculate the volume of the cylinder using", "start": 143.72, "duration": 6.22}, {"text": "r two, pretending that it is solid all the\nway through, and then subtract from that the", "start": 149.94, "duration": 5.31}, {"text": "volume of the inner cylinder, using r one,\nsince that’s all empty space. The formula", "start": 155.25, "duration": 6.84}, {"text": "for the volume of a cylinder is pi r squared\nh, so let’s do [pi (r two) squared h] minus", "start": 162.09, "duration": 7.18}, {"text": "[pi (r one) squared h]. Factoring out pi and\nh, we can turn this into pi times the quantity", "start": 169.27, "duration": 7.32}, {"text": "(r two) squared minus (r one) squared, times\nh. If we remember how to expand a difference", "start": 176.59, "duration": 7.65}, {"text": "of squared terms from algebra, this term is\nequal to the quantity (r two) plus (r one),", "start": 184.24, "duration": 6.22}, {"text": "times the quantity of (r two) minus (r one).\nHere’s the clever bit. Let’s take this", "start": 190.46, "duration": 7.07}, {"text": "sum and turn it into an expression for the\naverage value for the radius. To do that,", "start": 197.53, "duration": 6.3}, {"text": "we just divide by two, but in order to keep\nthe same value for the equation, let’s put", "start": 203.83, "duration": 5.489}, {"text": "a two at the front. Since this is now the\naverage radius, let’s just call it r. Then", "start": 209.319, "duration": 8.561}, {"text": "over here, the difference between the radii\ngives us the thickness of the cylinder, so", "start": 217.88, "duration": 5.681}, {"text": "we can call that delta r if we like. And like\nthat, the volume of this cylindrical shell", "start": 223.561, "duration": 8.179}, {"text": "will be equal to two pi r h delta r. One easy\nway to remember this is to see that two pi", "start": 231.74, "duration": 7.64}, {"text": "r is the same as the circumference of the\ncylinder, so this is really just circumference", "start": 239.38, "duration": 5.469}, {"text": "times height times thickness. The reason this\nis useful is that we no longer have to solve", "start": 244.849, "duration": 7.871}, {"text": "for x in terms of y. If we picture one possible\ncylindrical shell, it will have a height that", "start": 252.72, "duration": 6.389}, {"text": "is equal to the function, f of x, and a circumference\nequal to two pi x. As this shell spans the", "start": 259.109, "duration": 9.3}, {"text": "volume, we then simply have to integrate (two\npi x) times f of x dx. In this case, f of", "start": 268.409, "duration": 7.26}, {"text": "x is (two x squared minus x cubed), as we\nsaid, so let’s plug that in for f of x,", "start": 275.669, "duration": 6.791}, {"text": "and then to simplify, we can take two pi out\nof the integral, but the x must stay, and", "start": 282.46, "duration": 5.871}, {"text": "it can be distributed across the other term.\nThat leaves us with two pi times the integral", "start": 288.331, "duration": 7.129}, {"text": "of (two x cubed minus x to the fourth), dx,\nevaluated from zero to two, since two is the", "start": 295.46, "duration": 7.299}, {"text": "maximum value of the function. We integrate\nto get two x to the fourth over four, or one", "start": 302.759, "duration": 6.52}, {"text": "half x to the fourth, minus one fifth x to\nthe fifth. We evaluate at two and we get eight", "start": 309.279, "duration": 8.07}, {"text": "minus thirty-two fifths, or forty minus thirty\ntwo over five, so we subtract and multiply", "start": 317.349, "duration": 8.03}, {"text": "by two pi to get sixteen fifths pi. So while\nthis may have seemed complex, part of that", "start": 325.379, "duration": 9.361}, {"text": "is because we derived the formula for the\nvolume of the cylinder. We won’t have to", "start": 334.74, "duration": 4.829}, {"text": "do that every time, we just need to know that\nthe volume of the solid with a cylindrical", "start": 339.569, "duration": 5.68}, {"text": "shell oriented vertically will be equal to\nthe integral of two pi x times f of x dx,", "start": 345.249, "duration": 8.121}, {"text": "over the interval that spans the solid.\nSo we can see that for this particular example,", "start": 353.37, "duration": 5.979}, {"text": "this method ended up being easier than the\nwasher method we used in the previous tutorial", "start": 359.349, "duration": 5.611}, {"text": "as our formula for the volume of the cylindrical\nshell was ready to go, which meant we didn’t", "start": 364.96, "duration": 6.179}, {"text": "have to do much to set things up. For any\nsolid of revolution you are looking at, whether", "start": 371.139, "duration": 5.541}, {"text": "the cross section is a disk or washer, you\nwill just have to think critically to figure", "start": 376.68, "duration": 5.22}, {"text": "out which approach is best, depending on whether\nit is easy to find the radius or radii of", "start": 381.9, "duration": 6.18}, {"text": "the cross section with the function or functions\nas given, or whether it is easier to express", "start": 388.08, "duration": 5.58}, {"text": "things another way. For a little practice\nwith this new method, let’s check comprehension.", "start": 393.66, "duration": 5.0}]