[{"text": "Sunlight, moonlight, torchlight, and flashlight.", "start": 3.07, "duration": 3.02}, {"text": "They all come from different places, but they’re\nthe all very same thing: light!", "start": 6.09, "duration": 4.05}, {"text": "It’s what makes it possible for us to see the world around us, so it’s worth a close, hard look.", "start": 10.14, "duration": 4.46}, {"text": "For instance, how does light travel?", "start": 14.6, "duration": 1.88}, {"text": "When you flip that switch in the bathroom to brush your teeth, how does light move from the light bulb, to the mirror, and into your eyes?", "start": 16.48, "duration": 5.56}, {"text": "And if you’re one of many people who wear glasses, how do those lenses turn a blurry world into a high-definition experience?", "start": 22.04, "duration": 5.999}, {"text": "Whether it’s glasses, microscopes, or telescopes,\nit’s all about bending light to our will.", "start": 28.039, "duration": 4.52}, {"text": "How do we go about this grand task of controlling\nthe very thing that helps us see?", "start": 32.56, "duration": 3.66}, {"text": "Well, let’s take a look!", "start": 36.22, "duration": 1.56}, {"text": "[Theme Music]", "start": 37.78, "duration": 12.78}, {"text": "No matter where light comes from, we generally talk about it in the same way, and make the same assumptions about how it travels.", "start": 50.56, "duration": 5.76}, {"text": "Say you’re lying on the beach, basking in\na ray of sunshine.", "start": 56.329, "duration": 2.631}, {"text": "One of the first assumptions we make is that the light is traveling from the sun to you, in a straight line.", "start": 58.96, "duration": 4.72}, {"text": "This way of thinking about light is called the ray model, and the core tenant of the model is that light travels in straight-line paths called rays.", "start": 63.68, "duration": 6.68}, {"text": "But each individual ray is really just a graphical\nrepresentation of actual light.", "start": 70.37, "duration": 4.21}, {"text": "A light source may be emitting an infinite number of rays, but we only draw a few to get the point across.", "start": 74.58, "duration": 5.2}, {"text": "Now, let’s say we have a flashlight that’s\nemitting rays of light.", "start": 79.79, "duration": 2.59}, {"text": "If we point the flashlight at a reflective surface, like a calm pool of water, we can trace the rays as lines that leave the flashlight, reflect off the water and continue on as a straight line.", "start": 82.38, "duration": 9.14}, {"text": "Note that the rays on top of the flashlight\nare now on the bottom, and vice versa.", "start": 91.52, "duration": 3.54}, {"text": "This makes sense, because if you’re viewing something in a reflection, you see its image reversed.", "start": 95.06, "duration": 4.7}, {"text": "Another important observation is that rays leave the reflected surface at the same angle at which they struck it.", "start": 99.76, "duration": 5.12}, {"text": "So if I point the flashlight at a 30 degree angle – an angle that we call the angle of incidence – it would leave at a 30 degree angle in the other direction.", "start": 104.88, "duration": 7.98}, {"text": "So, we’d say that the angle of reflection\nis equal to the angle of incidence.", "start": 112.86, "duration": 4.02}, {"text": "And the fact that these two angles equal each\nother is called the law of reflection.", "start": 116.88, "duration": 3.38}, {"text": "Now, the way I described the light hitting the\npool of water was oversimplified, wasn’t it?", "start": 120.26, "duration": 3.84}, {"text": "Because, in reality, some of the incident light will reflect off the water’s surface, while the rest of it will go into the water.", "start": 124.1, "duration": 5.58}, {"text": "And, an interesting phenomenon happens when light rays change from one medium to another, such as going from air into water.", "start": 129.68, "duration": 6.16}, {"text": "Have you ever looked at a straw sitting in a cup of water and noticed how the submerged part of the straw looks bent?", "start": 135.84, "duration": 5.46}, {"text": "Of course the straw itself isn’t bent, but the light is,\nwhen it passes between the water and the air.", "start": 141.3, "duration": 5.12}, {"text": "This phenomenon, of light rays changing direction\nat the interface between media, is called refraction.", "start": 146.42, "duration": 4.94}, {"text": "When a ray moves from air into water, the ray’s angle after passing into the water will be less than the incident angle.", "start": 151.36, "duration": 5.82}, {"text": "So, the straw looks bent because the rays coming from the straw into your eyes don't travel in a straight path.", "start": 157.18, "duration": 4.86}, {"text": "They become bent, so the bottom of the straw\nappears to be in a place where it’s not.", "start": 162.04, "duration": 3.7}, {"text": "The angle of a light ray after it passes from one medium to another is called the angle of refraction, and it’s related to the angle of incidence by Snell’s Law.", "start": 165.74, "duration": 7.68}, {"text": "Snell’s Law says that angles of refraction are determined by the index of refraction for each medium and the angle of incidence.", "start": 173.42, "duration": 6.74}, {"text": "The index of refraction for a certain medium is the ratio of the speed of light in a vacuum versus the speed in that medium.", "start": 180.16, "duration": 5.7}, {"text": "And when a ray enters a medium with an increased\nindex of refraction, the angle of refraction decreases.", "start": 185.86, "duration": 5.88}, {"text": "In other words, the higher the index of refraction,\nthe smaller the angle.", "start": 191.75, "duration": 3.81}, {"text": "And refraction occurs when light leaves a\nmedium, too.", "start": 195.56, "duration": 2.4}, {"text": "Say you have a flat piece of glass standing on end, and a light ray enters the glass at an incident angle of theta one.", "start": 197.96, "duration": 5.54}, {"text": "The angle of refraction inside the glass would be less than theta one, since the index of refraction of glass is greater.", "start": 203.5, "duration": 5.98}, {"text": "But once the ray reaches the interface between the glass and the air on the other side, it refracts again,", "start": 209.48, "duration": 4.78}, {"text": "and now the angle of refraction is equal to\nthat first incident angle.", "start": 214.26, "duration": 3.38}, {"text": "So, if you look from the right side of the glass, your eyes see an object that appears to be lower than it actually is.", "start": 217.64, "duration": 5.12}, {"text": "Now, when you observe an object through refracted light like this, what you’re seeing is an image, a visually reproduced copy of an object.", "start": 222.76, "duration": 6.5}, {"text": "And not all images are the same.", "start": 229.26, "duration": 1.74}, {"text": "An image is considered to be a real image if the rays from an object converge at some location, such as your eye or on some other surface, like film.", "start": 231.0, "duration": 6.9}, {"text": "Real images can be projected onto screens, because the light rays from an object are actually traveling there.", "start": 237.9, "duration": 4.82}, {"text": "But the alternative is a virtual image – an image where the light rays don’t actually converge, so your eyes construct an image as if the diverging rays originated from a single point.", "start": 242.72, "duration": 9.68}, {"text": "When you look in the mirror, for example, it looks like you’re standing on the other side of the mirror.", "start": 252.4, "duration": 4.02}, {"text": "But you aren’t.", "start": 256.42, "duration": 0.96}, {"text": "You’re seeing a virtual image, because the light rays that make up your reflection aren’t actually converging to form an image of you.", "start": 257.38, "duration": 6.14}, {"text": "Now, what if we take that plate of glass and\nre-form both sides so they’re no longer flat?", "start": 263.52, "duration": 4.68}, {"text": "How does that change the law of refraction?", "start": 268.2, "duration": 1.88}, {"text": "It doesn’t!\nRefraction still occurs.", "start": 270.08, "duration": 2.42}, {"text": "It’s just that the normal line, which is the imaginary line that the angles are relative to, changes.", "start": 272.5, "duration": 4.54}, {"text": "Warped pieces of material that form images of objects are lenses, and they’re the most critical tool in the field of optics.", "start": 277.04, "duration": 6.0}, {"text": "Say we have a lens that has a spherical face\non both sides, known as a convex lens.", "start": 283.04, "duration": 4.4}, {"text": "As light rays enter the lens, they turn slightly towards the axis of the lens, the imaginary line that runs through its center, perpendicular to its face.", "start": 287.44, "duration": 8.14}, {"text": "As they leave the lens and move back through the air, the rays are angled slightly more toward that central axis, due to the lens’s curvature.", "start": 295.58, "duration": 6.8}, {"text": "The rays on the very top and bottom of the lens are bent at a larger angle towards the central axis than the rays near the center, which stay almost parallel.", "start": 302.38, "duration": 8.54}, {"text": "And they all eventually converge at a single\npoint called the focal point.", "start": 310.92, "duration": 3.42}, {"text": "Think of a magnifying glass.", "start": 314.34, "duration": 1.68}, {"text": "If you hold it just right in the sunlight, you can concentrate the sun’s rays into a single, very hot point.", "start": 316.02, "duration": 5.3}, {"text": "That works because you’ve taken a bunch of incoming parallel rays, and placed your target of choice at the focal length of the magnifying glass.", "start": 321.32, "duration": 6.74}, {"text": "That’s the distance between the lens and\nits focal point.", "start": 328.07, "duration": 2.86}, {"text": "And one measure of a lens is its power, which is expressed simply as one over the focal length.", "start": 330.93, "duration": 5.11}, {"text": "But a lens that causes light rays to converge\nin this way is known as a converging lens.", "start": 336.04, "duration": 4.58}, {"text": "And when you look through a converging lens, you can see real images from objects that are beyond the focal point.", "start": 340.62, "duration": 5.32}, {"text": "This is because light rays from those objects\nactually converge after passing through the lens.", "start": 345.94, "duration": 4.66}, {"text": "And remember, when rays converge at a point,\nthat means a real image has been formed.", "start": 350.6, "duration": 4.48}, {"text": "Let’s show this using a ray diagram, which tells us about the position and size of images as seen through a lens.", "start": 355.08, "duration": 5.48}, {"text": "Let’s take a candle that's some distance from\nthe lens, which we’ll call the object distance.", "start": 360.56, "duration": 4.38}, {"text": "We will use the object distance and the focal\nlength of the lens to find the image distance,", "start": 364.94, "duration": 4.54}, {"text": "the location where the image forms on the\nother side of the lens.", "start": 369.49, "duration": 2.7}, {"text": "Lenses have the same focal length on both sides, so we’ll label the focal point on the side opposite of the object as F and the point on the same side as the object as F prime.", "start": 372.19, "duration": 8.9}, {"text": "Now, we know that the ray traveling parallel to the axis will pass through the focal point on the other side,", "start": 381.09, "duration": 4.93}, {"text": "so let’s draw a ray from the top of the candle, refracting through the lens, and then passing straight through the focal point F.", "start": 386.02, "duration": 6.1}, {"text": "Since the focal length is the same on both sides, we draw a second ray from the top of the candle, through the F prime focal point,", "start": 392.12, "duration": 6.26}, {"text": "which then refracts through the lens and travels\nparallel to the axis.", "start": 398.38, "duration": 3.0}, {"text": "The third ray travels straight through the\ncenter of the lens.", "start": 401.38, "duration": 3.14}, {"text": "We draw this line because if we assume a thin lens, then we can draw a straight line through the center and disregard the slight offset that would occur due to refraction.", "start": 404.52, "duration": 7.92}, {"text": "With these three rays in place, we see that they intersect at a single point, representing the top of the candle in the newly formed image.", "start": 412.44, "duration": 7.1}, {"text": "You might notice that the image is upside down, which will always be the case for convex lenses.", "start": 419.54, "duration": 4.34}, {"text": "And the image is formed by light rays that actually originated from the object, so a real image is formed.", "start": 423.88, "duration": 5.14}, {"text": "The distance between the image and the lens is the image distance and is related to the object distance and the focal length by a very important equation.", "start": 429.02, "duration": 7.36}, {"text": "This is the thin lens equation, which is derived\nfrom ray diagram geometry.", "start": 436.38, "duration": 3.5}, {"text": "For a single converging lens, the focal length\nand the object distance will always be positive.", "start": 439.88, "duration": 4.95}, {"text": "The image distance will be positive if the image\nis on the opposite side of the light source.", "start": 444.83, "duration": 3.98}, {"text": "This equation holds true for converging lenses\nas well as their opposite, diverging lenses.", "start": 448.81, "duration": 4.74}, {"text": "Diverging lenses have a concave shape and do the opposite of a converging lens, causing rays of light to diverge away from the lens’s axis.", "start": 453.55, "duration": 7.11}, {"text": "When we’re looking at an object through a diverging lens, our eyes imagine that the diverging rays originate from a location where the rays don’t actually begin, so the lens generates a virtual image.", "start": 460.66, "duration": 10.72}, {"text": "And when we construct a ray diagram for a\ndiverging lens, there are a few key differences.", "start": 471.38, "duration": 4.16}, {"text": "First of all, the focal point F is on the same side as the object and F prime is on the opposite side.", "start": 475.54, "duration": 5.4}, {"text": "While a single ray of light still goes through the very center of the lens, the other two rays take slightly different paths, resulting in a virtual image forming on the same side as the object itself.", "start": 480.94, "duration": 10.1}, {"text": "For a diverging lens, the thin lens equation is still\ntrue, but the focal length is now a negative value.", "start": 491.04, "duration": 5.38}, {"text": "Another important equation that’s true for both converging and diverging lenses is the magnification equation.", "start": 496.42, "duration": 5.66}, {"text": "Magnification is the ratio of the image height\nto the height of the actual object.", "start": 502.08, "duration": 4.18}, {"text": "When the image is upside down, like in our converging lens, then the height is a negative value.", "start": 506.26, "duration": 4.84}, {"text": "And the ratio of the image distance to the\nobject distance is also negative.", "start": 511.1, "duration": 3.76}, {"text": "But all of these ideas, taken whole, give you a good understanding of optics – the fundamental rules that explain how we can observe particles too small to see with our eyes, as well as objects that are millions of light-years away.", "start": 514.86, "duration": 11.9}, {"text": "Today we learned about the the ray model of\nlight and the laws of reflection and refraction.", "start": 526.76, "duration": 4.56}, {"text": "We learned about how refraction works with\nconverging and diverging lenses.", "start": 531.32, "duration": 3.44}, {"text": "Finally, we built ray diagrams to discover how objects are viewed through different kinds of lenses at different points.", "start": 534.76, "duration": 5.74}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 540.5, "duration": 4.08}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 544.58, "duration": 3.82}, {"text": "It’s Okay to be Smart, The Art Assignment,\nand Indi Alaska.", "start": 548.4, "duration": 3.56}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 551.96, "duration": 4.37}, {"text": "with the help of these amazing people and our\nequally amazing graphics team, is Thought Cafe.", "start": 556.33, "duration": 4.75}]