[{"text": "Think of all of the developments throughout history that led to the conveniences you enjoy today.", "start": 3.06, "duration": 4.08}, {"text": "If I had to pick the biggest game-changer in human technology, it would probably be the steam engine.", "start": 7.14, "duration": 5.46}, {"text": "During the industrial revolution, the steam\nengine powered machines in farms and factories.", "start": 12.61, "duration": 4.31}, {"text": "And, although it may not seem so, those advances eventually led to the technologies that you’re using to watch me, right now.", "start": 16.92, "duration": 6.66}, {"text": "So, the steam engine was a pretty big deal.", "start": 23.58, "duration": 2.44}, {"text": "Developing a practical steam engine involved a lot of time and a lot smart people, and about a hundred years, and three main inventors.", "start": 26.02, "duration": 6.1}, {"text": "And it took a solid understanding of thermodynamic processes – and heat engines – to make this world-changing technology, a reality.", "start": 32.12, "duration": 7.14}, {"text": "[Theme Music]", "start": 39.26, "duration": 11.9}, {"text": "Heat engines, like steam engines, turn thermal energy into mechanical work, and they do it in a repeating cycle.", "start": 51.16, "duration": 6.239}, {"text": "The process starts at a high operating temperature, which we label as T_H, and ends up at a lower operating temperature, T_L.", "start": 57.4, "duration": 6.46}, {"text": "In the process, the engine takes the input\nheat that was used to raise the temperature,", "start": 63.86, "duration": 3.5}, {"text": "known as Q_H, and turns some of it into work, while also releasing some heat – Q_L – as exhaust.", "start": 67.36, "duration": 6.08}, {"text": "Then the engine’s temperature is raised once more, so it can start the cycle all over again.", "start": 73.44, "duration": 4.52}, {"text": "OK, now think back to the first law of thermodynamics, which says that the change in the thermal energy of a system is equal to heat and work.", "start": 77.96, "duration": 7.68}, {"text": "In the case of a heat engine, the change in thermal energy is zero, because it always returns to the temperature it started from.", "start": 85.64, "duration": 5.78}, {"text": "So, the engine’s input heat must be equal\nto the work it does, plus the heat it releases.", "start": 91.43, "duration": 4.73}, {"text": "Now let’s see how this plays out in a steam\nengine.", "start": 96.16, "duration": 2.51}, {"text": "There are a few different types of steam engine, but we’ll focus on the basic reciprocating type.", "start": 98.67, "duration": 4.28}, {"text": "As long as you have something to \"heat\" the steam, like coal or oil, the engine keeps working.", "start": 102.95, "duration": 4.27}, {"text": "That’s the input heat.", "start": 107.22, "duration": 1.62}, {"text": "The input heat is used to heat a volume of\nwater, which turns to steam.", "start": 108.85, "duration": 3.52}, {"text": "Then, an intake valve opens, allowing the\nsteam into the engine.", "start": 112.37, "duration": 3.67}, {"text": "The steam expands and moves a piston outward\n– that’s the work done by the engine.", "start": 116.04, "duration": 3.92}, {"text": "Then the intake valve closes, and an exhaust\nvalve opens.", "start": 119.96, "duration": 3.51}, {"text": "The exhaust valve leads to a condenser, which\ncools the steam back into water.", "start": 123.47, "duration": 4.4}, {"text": "The lower temperature also lowers the pressure, creating a partial vacuum that makes the piston move back into its original position.", "start": 127.87, "duration": 6.75}, {"text": "Then the water gets heated back into steam,\nand the cycle starts over.", "start": 134.62, "duration": 3.34}, {"text": "As the engine runs, the motion of the piston can be translated into all kinds of different movement,", "start": 137.96, "duration": 4.92}, {"text": "which is how steam engines can do things like\nmove trains and boats, and run factory lines.", "start": 142.88, "duration": 4.4}, {"text": "But as the steam engine runs, it releases\nexhaust heat.", "start": 147.28, "duration": 3.459}, {"text": "The more exhaust heat it produces, the less efficient the engine is, and the more energy you have to put in for the same amount of work.", "start": 150.74, "duration": 6.16}, {"text": "Obviously, it’s important for engines to\nbe as efficient as possible to save energy.", "start": 156.91, "duration": 4.049}, {"text": "And to design an efficient engine, engineers\nhave to be able to calculate its efficiency.", "start": 160.959, "duration": 4.2}, {"text": "Like we said earlier, an engine’s input heat is equal to the work it does, plus its exhaust heat.", "start": 165.16, "duration": 4.94}, {"text": "And the more work – and therefore, the less exhaust heat – you get out of the input heat, the more efficient your engine is.", "start": 170.1, "duration": 5.0}, {"text": "So, efficiency is equal to the work done by\nan engine divided by its input heat.", "start": 175.1, "duration": 3.66}, {"text": "We can also put this just in terms of input\nheat and exhaust heat – pretty easily, actually.", "start": 178.77, "duration": 4.86}, {"text": "We know that work is equal to input heat minus\nexhaust heat.", "start": 183.63, "duration": 3.18}, {"text": "So efficiency is equal to input heat minus\nexhaust heat, divided by the input heat.", "start": 186.81, "duration": 4.53}, {"text": "Or, simplifying those terms: efficiency is\nequal to 1 - exhaust heat / input heat.", "start": 191.349, "duration": 4.86}, {"text": "If your engine produced no exhaust heat at all?", "start": 196.209, "duration": 2.462}, {"text": "We’d say that its efficiency was exactly 1.", "start": 198.68, "duration": 2.85}, {"text": "It would be perfectly efficient.", "start": 201.53, "duration": 2.6}, {"text": "But there’s no such thing as an engine that\nproduces no exhaust heat at all.", "start": 204.13, "duration": 3.49}, {"text": "It wouldn’t work, because the temperature needs to be lowered and then raised again for the engine to keep going.", "start": 207.62, "duration": 4.6}, {"text": "But we can imagine an ideal engine, where none of the exhaust energy is waste heat – where there’s no friction or anything like that.", "start": 212.22, "duration": 5.68}, {"text": "An ideal engine would also be reversible – meaning, you could run it backward, putting in work to transfer heat from something with a lower temperature to something with a higher temperature.", "start": 217.9, "duration": 8.26}, {"text": "This kind of hypothetical engine is called a Carnot engine, and we can use it to figure out the maximum possible efficiency of a real-life engine.", "start": 226.16, "duration": 7.58}, {"text": "Last time, we talked about the four types\nof basic thermodynamic processes.", "start": 233.74, "duration": 3.68}, {"text": "The Carnot engine combines two of those types\ninto what’s known as the Carnot cycle.", "start": 237.42, "duration": 4.44}, {"text": "But in the Carnot cycle, those processes don’t transfer heat between areas with different temperatures.", "start": 241.86, "duration": 4.82}, {"text": "Because, if an engine involves heat transfer from an area with a higher temperature to an area with a lower temperature, then reversing the engine would involve transferring heat from lower to higher.", "start": 246.68, "duration": 8.98}, {"text": "Which would violate the second law of thermodynamics!", "start": 255.66, "duration": 2.56}, {"text": "So, in the Carnot cycle, heat won’t flow between areas of different temperatures at all.", "start": 258.22, "duration": 4.4}, {"text": "Instead, the cycle goes through two adiabatic processes, where heat is held constant, and two isothermal processes, where heat is transferred.", "start": 262.62, "duration": 7.08}, {"text": "But the temperature is held constant, so the heat never flows between areas of different temperatures.", "start": 269.7, "duration": 5.16}, {"text": "Now, you might be wondering how heat gets transferred, if there’s no difference in temperature.", "start": 274.86, "duration": 4.1}, {"text": "Well, remember how we described isothermal\nprocesses last time:", "start": 278.96, "duration": 3.62}, {"text": "In those cases, there are only very tiny differences in temperature, and they’re immediately eliminated.", "start": 282.58, "duration": 5.18}, {"text": "So, practically speaking, there is no transfer\nof heat between areas of different temperatures.", "start": 287.76, "duration": 4.66}, {"text": "And this means, the process can still be reversed.", "start": 292.42, "duration": 2.6}, {"text": "With all that in mind, here’s how a Carnot engine works – at least in theory, because again: Carnot engines are totally hypothetical.", "start": 295.02, "duration": 6.94}, {"text": "The first process in the cycle is isothermal.", "start": 301.96, "duration": 2.8}, {"text": "The temperature is constant, but heat is slowly\nadded.", "start": 304.76, "duration": 2.84}, {"text": "That makes the gas’s volume expand and its\npressure decrease – path a-b on this diagram.", "start": 307.6, "duration": 4.78}, {"text": "The second process is adiabatic.", "start": 312.38, "duration": 2.33}, {"text": "The temperature drops while the heat stays constant, which also makes the volume expand and the pressure decrease.", "start": 314.71, "duration": 5.71}, {"text": "That’s path b-c on the diagram.", "start": 320.42, "duration": 1.88}, {"text": "The third process is the opposite of the first\none, and it’s also isothermal.", "start": 322.3, "duration": 3.58}, {"text": "The gas is compressed while the temperature is held constant, so it releases heat and its pressure increases while its volume decreases.", "start": 325.88, "duration": 7.5}, {"text": "That’s path c-d.", "start": 333.38, "duration": 1.3}, {"text": "The last process is the opposite of the second: it’s adiabatic, so the gas is compressed but its heat doesn’t change.", "start": 334.68, "duration": 6.72}, {"text": "That makes the gas’s volume decrease and\nits pressure increase, like in path d-a.", "start": 341.4, "duration": 4.76}, {"text": "Its temperature goes back up to the starting\npoint.", "start": 346.16, "duration": 2.32}, {"text": "The Carnot engine is the ideal engine, because it produces the most possible work from a given temperature difference.", "start": 348.48, "duration": 5.78}, {"text": "And because a Carnot engine is as efficient as possible, the high and low temperatures are proportional to the input and exhaust heat.", "start": 354.26, "duration": 6.58}, {"text": "Which is important, math-wise, because it\nmeans that in the equation for efficiency,", "start": 360.85, "duration": 3.439}, {"text": "you can replace Q_H and Q_L – the input and exhaust heat – with T_H and T_L – the higher and lower operating temperatures.", "start": 364.289, "duration": 6.431}, {"text": "Which can help if you don’t know an engine’s input and exhaust heats, but you know its operating temperatures.", "start": 370.72, "duration": 4.9}, {"text": "So! The ideal efficiency for an engine is equal\nto: 1 - its low temperature / its high temperature.", "start": 375.62, "duration": 5.76}, {"text": "The colder that lower operating temperature is, the more efficient the ideal version of the engine is.", "start": 381.38, "duration": 4.5}, {"text": "So, say you need an engine to power a life-size\nMario Kart that you’re building for yourself.", "start": 385.88, "duration": 4.32}, {"text": "You find an engine online, and you’re thinking about buying it, but first you want to know how efficient it is.", "start": 390.2, "duration": 4.42}, {"text": "The manufacturer’s website says that for every second, the engine’s input heat is 10 kilojoules at 500 Kelvin.", "start": 394.62, "duration": 5.82}, {"text": "Its exhaust heat is 2 kilojoules at 300 Kelvin.", "start": 400.44, "duration": 3.039}, {"text": "The efficiency equation says that the engine’s efficiency is equal to: 1 - its exhaust heat / its input heat – in this case, 0.8.", "start": 403.48, "duration": 8.42}, {"text": "That would be a very efficient engine, so\nyou should be a little suspicious.", "start": 411.9, "duration": 4.3}, {"text": "I mean, is that kind of efficiency even possible?", "start": 416.2, "duration": 2.66}, {"text": "You can find out, by checking the ideal efficiency\nof the engine – the Carnot efficiency.", "start": 418.87, "duration": 4.5}, {"text": "The ideal efficiency is equal to: 1 - its lower operating temperature / its higher operating temperature, which in this case is equal to 0.4.", "start": 423.37, "duration": 8.61}, {"text": "It’s impossible for this engine to have an efficiency higher than 0.4, so the manufacturer’s website is...well, just lying.", "start": 431.98, "duration": 7.04}, {"text": "So you probably shouldn’t buy anything from them anyway.", "start": 439.02, "duration": 2.52}, {"text": "And, actually, you probably wouldn’t want an engine that was close to the efficiency of a Carnot engine, because Carnot engines are very slow.", "start": 441.54, "duration": 6.52}, {"text": "During those isothermal processes, the temperature\nhas to be kept constant while heat is transferred", "start": 448.06, "duration": 4.599}, {"text": "– which only works if the heat is transferred\nsuper slowly.", "start": 452.659, "duration": 3.42}, {"text": "So the engine has to be really slow.", "start": 456.08, "duration": 2.0}, {"text": "If you had a Carnot engine in your car, for example, it would take you a whole day to get out of your driveway.", "start": 458.08, "duration": 5.22}, {"text": "Real-life heat engines are useful, because they use the flow of heat from something warmer to something cooler to produce work.", "start": 463.3, "duration": 5.46}, {"text": "But what if you want heat to flow from something\ncooler to something warmer?", "start": 468.76, "duration": 3.1}, {"text": "That’s what things like air conditioners and refrigerators do, and they were originally developed using the principles scientists had learned from creating steam engines.", "start": 471.86, "duration": 7.08}, {"text": "These cooling machines are a lot like the opposite of heat engines, in the sense that they use work to make heat flow in the opposite direction that it would normally go.", "start": 478.94, "duration": 7.36}, {"text": "The refrigerator, for example, passes a cool\nliquid through the inside of the fridge.", "start": 486.3, "duration": 3.74}, {"text": "The liquid absorbs heat – that’s Q_L – as\nit evaporates.", "start": 490.04, "duration": 3.02}, {"text": "Then, the fridge uses a motor to do work on the now-warmer fluid, which has turned into a gas.", "start": 493.06, "duration": 4.46}, {"text": "It’s passed through coils on the outside of the refrigerator, where it releases the exhaust heat – Q_H – and cools to become a liquid again.", "start": 497.52, "duration": 7.1}, {"text": "Then the cycle starts over.", "start": 504.62, "duration": 1.359}, {"text": "For heat engines, efficiency is measured by the work produced for a given amount of input heat.", "start": 505.98, "duration": 4.04}, {"text": "And there’s a similar concept for refrigerators: the coefficient of performance, or COP, which is equal to the amount of heat removed from the lower-temperature zone divided by work.", "start": 510.02, "duration": 9.22}, {"text": "The more heat the fridge removes for a given amount of work, the higher the coefficient of performance.", "start": 519.24, "duration": 4.66}, {"text": "Like we did with the efficiency equation, we can rewrite the COP equation just in terms of Q_L and Q_H.", "start": 523.9, "duration": 5.8}, {"text": "The coefficient of performance is equal to\nQ_L divided by Q_H minus Q_L.", "start": 529.7, "duration": 4.96}, {"text": "To find the coefficient of performance for an ideal refrigerator, we do the same thing we did with the ideal Carnot engine: replace Q_L with T_L and Q_H with T_H.", "start": 534.66, "duration": 9.64}, {"text": "So, for an ideal fridge, the coefficient of performance would be equal to: the lower operating temperature, divided by the higher operating temperature minus the lower operating temperature.", "start": 544.3, "duration": 9.18}, {"text": "And of course, a real-life refrigerator can’t have a higher coefficient of performance than an ideal refrigerator.", "start": 553.48, "duration": 5.16}, {"text": "Now, it may not be surprising that steam engines\nand refrigerators are total opposites.", "start": 558.64, "duration": 4.3}, {"text": "But! Fridges and freezers and air conditioning are all game-changing inventions that were only made possible by our knowledge of steam engines.", "start": 562.94, "duration": 7.699}, {"text": "Today, you learned about how engines turn thermal energy into work and how to calculate their efficiency.", "start": 570.64, "duration": 4.92}, {"text": "We also described the Carnot engine.", "start": 575.57, "duration": 1.84}, {"text": "And finally, we talked about cooling machines,\nlike refrigerators.", "start": 577.41, "duration": 3.39}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 580.8, "duration": 3.68}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 584.48, "duration": 4.8}, {"text": "PBS Space Time, Deep Look, and Blank on Blank.", "start": 589.28, "duration": 3.08}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 592.36, "duration": 4.3}, {"text": "with the help of these amazing people and our equally amazing graphics team, is Thought Cafe.", "start": 596.66, "duration": 4.78}]