[{"text": "This episode is supported by Prudential.", "start": 3.16, "duration": 2.64}, {"text": "So it’s Friday, April 21, 1820.", "start": 5.8, "duration": 3.12}, {"text": "A physics professor in Denmark named Hans Christian Oersted is in the middle of a lecture, and he’s using a compass and an electric wire for a demonstration.", "start": 8.92, "duration": 7.98}, {"text": "He turns on the current that runs through the wire, and he notices that the needle in the compass starts to move.", "start": 16.9, "duration": 4.94}, {"text": "And when he turns the current off, the needle\nmoves back to where it was.", "start": 21.84, "duration": 2.98}, {"text": "Then, he runs the current through the wire in the opposite direction, and sees the needle move the other way.", "start": 24.82, "duration": 4.64}, {"text": "What Oersted demonstrated that day was a fundamental discovery: the connection between electricity and magnetism.", "start": 29.46, "duration": 6.1}, {"text": "And it changed the field of physics forever.", "start": 35.56, "duration": 2.28}, {"text": "The relationship between electricity and magnetism not only explains what Oersted and his students witnessed in 1820.", "start": 37.84, "duration": 5.88}, {"text": "It also makes possible much of the technology that’s used today – from hydroelectric dams to your smartphone.", "start": 43.72, "duration": 5.14}, {"text": "It even explains why Earth’s magnetic field is essentially keeping you from being cooked alive right now.", "start": 48.86, "duration": 4.86}, {"text": "And all you really need to understand the basics of magnetism and electricity is this. [waves hand]", "start": 53.72, "duration": 5.04}, {"text": "[Theme Music]", "start": 58.76, "duration": 12.32}, {"text": "You’re probably familiar with the basics\nof magnets already:", "start": 71.08, "duration": 2.76}, {"text": "They have a north pole and south pole.", "start": 73.85, "duration": 1.53}, {"text": "Two of the same pole will repel each other,\nwhile opposites attract.", "start": 75.38, "duration": 3.32}, {"text": "Only certain materials, especially those that\ncontain iron, can be magnets.", "start": 78.71, "duration": 3.88}, {"text": "It depends on their molecular properties.", "start": 82.59, "duration": 1.87}, {"text": "And other metals, including cobalt, nickel, and iron, are attracted to magnets, even though they aren’t magnets themselves.", "start": 84.46, "duration": 5.8}, {"text": "Like the metal in your refrigerator door.", "start": 90.27, "duration": 1.73}, {"text": "And there’s a magnetic field around Earth, which is why you can use a compass to figure out which way is north.", "start": 92.0, "duration": 4.78}, {"text": "The magnet in the compass aligns itself with\nEarth’s magnetic field.", "start": 96.79, "duration": 3.71}, {"text": "Just as we use electric field lines to represent the electric field created by charges, we can draw magnetic field lines to represent the magnetic field created by magnets.", "start": 100.5, "duration": 9.32}, {"text": "And as with electric fields, the more crowded\nthe lines are, the stronger the magnetic field.", "start": 109.83, "duration": 4.31}, {"text": "The lines point from the north pole to the south pole – like how electric field lines point from the positive to the negative charge.", "start": 114.14, "duration": 5.62}, {"text": "But there’s a key difference: you can have an electric field spreading outward from a single electric charge.", "start": 119.76, "duration": 5.46}, {"text": "But that can’t happen with magnets because\nyou can’t isolate one magnetic pole.", "start": 125.22, "duration": 4.42}, {"text": "If you chop a bar magnet in half, you don’t end up with one north magnet and one south magnet – you end up with two magnets, each with its own north pole and south pole.", "start": 129.64, "duration": 8.4}, {"text": "This means that the magnetic field lines surrounding\na magnet always form closed loops.", "start": 138.04, "duration": 4.24}, {"text": "We measure magnetic fields using a unit called\nthe tesla, which is one Newton per Ampere-meter.", "start": 142.28, "duration": 4.8}, {"text": "And 1 tesla is a very strong magnetic field – the fields from some of the strongest superconducting magnets in the world are only 10 teslas.", "start": 147.08, "duration": 7.2}, {"text": "Now, when Oersted was doing his demonstration on that fateful day in 1820, he was using a regular compass magnet.", "start": 154.28, "duration": 5.46}, {"text": "But when he brought the magnet close to a wire carrying a current, the magnetic field from that current exerted a force on the needle, moving it to point in a different direction.", "start": 159.74, "duration": 8.46}, {"text": "Oersted had discovered one of the fundamental\nprinciples of electromagnetism:", "start": 168.209, "duration": 4.311}, {"text": "An electric current produces a magnetic field.", "start": 172.52, "duration": 2.59}, {"text": "After a few more months of experimenting, Oersted figured out that when a current runs through a wire, the magnetic field that it produces surrounds the wire.", "start": 175.11, "duration": 7.8}, {"text": "Expressed with field lines, the magnetic field would\nappear as circles, with the wire at their center.", "start": 182.91, "duration": 5.16}, {"text": "If the current was coming straight towards\nyou, the field lines would be pointing counterclockwise.", "start": 188.07, "duration": 4.39}, {"text": "And we use the vector B to represent the magnetic\nfield.", "start": 192.46, "duration": 3.62}, {"text": "The magnitude of the vector is the strength of the magnetic field, and the direction of the vector is the field’s direction.", "start": 196.08, "duration": 5.6}, {"text": "Now, there’s an easy way to remember how the direction of the electric current, and the direction of the magnetic field it produces, relate to each other.", "start": 201.68, "duration": 6.5}, {"text": "It’s called the first right-hand rule – because\nthere are actually three right-hand rules.", "start": 208.19, "duration": 4.13}, {"text": "Just take your right hand, and point your\nthumb in the direction of the electric current.", "start": 212.32, "duration": 3.68}, {"text": "Now curl your fingers.", "start": 216.0, "duration": 1.64}, {"text": "The direction your fingers are curling?", "start": 217.65, "duration": 1.69}, {"text": "That’s the way the magnetic field lines\nare pointing.", "start": 219.34, "duration": 2.24}, {"text": "And likewise, if you know the direction of the magnetic field lines, you can use the rule to figure out the direction of the current in the wire.", "start": 221.58, "duration": 6.42}, {"text": "It really comes in, uh, handy.", "start": 228.0, "duration": 2.64}, {"text": "Now, if a current running through a wire exerts a force on a magnet, you might expect the opposite to be true as well:", "start": 230.64, "duration": 5.66}, {"text": "That a magnet exerts a force on a current\nrunning through a wire.", "start": 236.31, "duration": 3.6}, {"text": "And it does!", "start": 239.91, "duration": 0.85}, {"text": "Which is good, because that’s what’s protecting us from harmful radiation from the Sun right now.", "start": 240.76, "duration": 3.72}, {"text": "The direction of the force from a magnetic field on a current running through a wire will be perpendicular to both the magnetic field and the current.", "start": 244.48, "duration": 7.5}, {"text": "Which brings us to the second right-hand rule!", "start": 251.98, "duration": 2.32}, {"text": "This one helps you keep track of three directions: the direction of the magnetic field, the current, and the force.", "start": 254.3, "duration": 6.06}, {"text": "Here’s how to use the second right-hand\nrule:", "start": 260.36, "duration": 2.04}, {"text": "Point your arm in the direction of the current.", "start": 262.4, "duration": 2.2}, {"text": "Then bend your fingers so they’re perpendicular\nto your palm.", "start": 264.6, "duration": 2.94}, {"text": "This represents the direction of the magnetic\nfield.", "start": 267.54, "duration": 3.94}, {"text": "Your thumb, which is perpendicular to your\nfingers, is the direction of the force on the wire.", "start": 271.48, "duration": 4.8}, {"text": "But what about the strength of that force?", "start": 276.28, "duration": 1.8}, {"text": "You can use your hands to figure this out,\ntoo!", "start": 278.08, "duration": 1.839}, {"text": "But you’ll have to use them to do math.", "start": 279.92, "duration": 2.2}, {"text": "Sorry.", "start": 282.12, "duration": 0.92}, {"text": "The magnitude of the force from a magnetic\nfield on a wire is equal to I l B sin theta.", "start": 283.04, "duration": 4.98}, {"text": "This equation tells us that there are four\nfactors that affect the magnitude of the force.", "start": 288.02, "duration": 3.72}, {"text": "First, there’s the current in the wire – that’s I –\nand the stronger it is, the stronger the force is.", "start": 291.74, "duration": 5.42}, {"text": "Second, there’s the length of the wire running\nthrough the magnetic field – that’s l", "start": 297.16, "duration": 4.42}, {"text": "– and the longer the wire is, the stronger\nthe force is.", "start": 301.58, "duration": 2.74}, {"text": "Third, there’s the magnetic field, B, and\nthe stronger B is, the stronger the force.", "start": 304.33, "duration": 4.74}, {"text": "Finally, the closer to perpendicular the current is with respect to the magnetic field’s direction, the stronger the force is.", "start": 309.07, "duration": 6.18}, {"text": "That’s where the sine theta comes in – its\nmaximum value is 1, when theta is 90 degrees.", "start": 315.25, "duration": 4.61}, {"text": "So the current is perpendicular to the magnetic\nfield lines.", "start": 319.86, "duration": 3.07}, {"text": "That’s when the force will be strongest.", "start": 322.93, "duration": 2.08}, {"text": "Similarly, the minimum value of sine theta is 0, when theta is 0 – so that means the current is parallel to the magnetic field lines.", "start": 325.01, "duration": 7.35}, {"text": "And in that case, there won’t be any force\non the wire at all.", "start": 332.36, "duration": 2.86}, {"text": "Now, all of this math can help us understand how we’re being protected right now from solar radiation!", "start": 335.22, "duration": 4.6}, {"text": "The Sun is constantly shooting radiation towards\nEarth, in the form of charged particles.", "start": 339.82, "duration": 4.3}, {"text": "But, luckily for us, Earth has a magnetic\nfield.", "start": 344.12, "duration": 2.7}, {"text": "Currents are made up of moving electric charges, so it makes sense that a magnetic field would also exert a force on single electric charges that pass through it.", "start": 346.82, "duration": 7.96}, {"text": "And this is exactly what the Earth’s magnetic field does to the charged particles coming from the Sun:", "start": 354.78, "duration": 5.44}, {"text": "it deflects them, sending them spiraling away\nand protecting us from the worst of the radiation.", "start": 360.22, "duration": 4.86}, {"text": "Let’s suppose you wanted to find the magnitude of the force of the magnetic field on a single charged particle from the Sun.", "start": 365.08, "duration": 5.44}, {"text": "All you’d have to do is change the equation we used for the force on the current, to account for the fact that we’re talking about a single charge.", "start": 370.52, "duration": 6.02}, {"text": "The equation for the force of a magnetic field\non a current says that:", "start": 376.54, "duration": 3.06}, {"text": "the strength of the force is equal to the current, times the length of the wire, times the strength of the magnetic field, times the sine of the angle between the current and the magnetic field.", "start": 379.6, "duration": 9.46}, {"text": "Now, two of those variables don’t apply to\na single charge: the current, I, and the length, l.", "start": 389.06, "duration": 5.76}, {"text": "But current is just equal to the number of charged particles passing a given point over a certain amount of time – which we'll call N – times their charge, q, divided by that time, t.", "start": 394.82, "duration": 9.68}, {"text": "For a single charge, N is just 1.", "start": 404.5, "duration": 1.82}, {"text": "And length is just equal to velocity, v, multiplied\nby time.", "start": 406.32, "duration": 3.29}, {"text": "So we can apply these two facts to our equation for force, which tells us that the force on an electric charge moving through a magnetic field, is equal to:", "start": 409.61, "duration": 7.6}, {"text": "q divided by time, multiplied by velocity times time, times the strength of the magnetic field, times the sine of theta.", "start": 417.21, "duration": 7.03}, {"text": "Those two t’s cancel each other out, so\nthe equation simplifies to F = qvBsintheta.", "start": 424.24, "duration": 5.64}, {"text": "That means that, like the force on a current running through a wire, the force on a single electric charge depends on four factors.", "start": 429.88, "duration": 5.92}, {"text": "One is the same as with a current: The stronger\nthe magnetic field, the stronger the force.", "start": 435.8, "duration": 4.08}, {"text": "The other three factors are slightly different\nfrom the case with a current:", "start": 439.88, "duration": 3.22}, {"text": "First, the force is stronger, the closer to perpendicular the charge’s velocity is to the magnetic field lines.", "start": 443.1, "duration": 5.5}, {"text": "Which means that if the charge’s velocity is parallel to the magnetic field lines, there won’t be any force on whatsoever.", "start": 448.6, "duration": 6.12}, {"text": "Second, the more charge the particle has,\nthe stronger the force.", "start": 454.72, "duration": 3.38}, {"text": "And third, the faster the particle is moving,\nthe stronger the force.", "start": 458.1, "duration": 3.4}, {"text": "Finding the direction of this force is where\nthe third right-hand rule comes in:", "start": 461.5, "duration": 4.1}, {"text": "So get your right hand out again!", "start": 465.6, "duration": 1.54}, {"text": "Straighten your fingers with your thumb stretched\noutward.", "start": 467.14, "duration": 2.36}, {"text": "Then point your arm in the direction of the\nparticle’s velocity.", "start": 469.509, "duration": 3.52}, {"text": "Then bend your fingers to make them point\nin the direction of the magnetic field lines.", "start": 473.029, "duration": 3.861}, {"text": "This is where things get a little tricky:", "start": 476.89, "duration": 1.65}, {"text": "If the charged particle is positive, your thumb is\npointing in the direction of the force.", "start": 478.54, "duration": 4.38}, {"text": "But if it’s negative, the force is pointing\nin the direction opposite your thumb.", "start": 482.92, "duration": 4.04}, {"text": "So, electric currents create magnetic fields, and magnetic fields exert forces on electric currents and charges.", "start": 486.96, "duration": 5.54}, {"text": "Oersted’s experiment was simple, but his discovery linked two major fields of physics, and inspired other scientists to do a lot more experimenting.", "start": 492.5, "duration": 7.08}, {"text": "Today, you learned about magnetism, and the magnetic field created by a current running through a wire.", "start": 499.58, "duration": 4.66}, {"text": "We also talked about the force from a magnetic\nfield on a current running through a wire,", "start": 504.24, "duration": 3.59}, {"text": "and on a single charge moving through a magnetic\nfield.", "start": 507.83, "duration": 3.02}, {"text": "And we went through the three right-hand rules.", "start": 510.85, "duration": 2.31}, {"text": "Thanks to Prudential for sponsoring this episode.", "start": 513.169, "duration": 2.66}, {"text": "Saving a little more today, even just 1% more of your annual income, can go a long way toward building a better retirement tomorrow.", "start": 515.829, "duration": 6.21}, {"text": "Let’s do a math equation.", "start": 522.039, "duration": 1.461}, {"text": "Say a 25 year old that earns $40,000 a year\nis planning on retiring at 70.", "start": 523.5, "duration": 4.74}, {"text": "If they save an additional 1% of their salary\nby deducting $33 from their monthly paycheck,", "start": 528.24, "duration": 5.14}, {"text": "and earn 6% compounding interest, they could increase their retirement savings by about $97,943.73.", "start": 533.38, "duration": 9.28}, {"text": "Math – it’s not just for physicists.", "start": 542.66, "duration": 1.9}, {"text": "Go to Raceforretirement.com for more information.", "start": 544.57, "duration": 3.28}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 547.85, "duration": 3.73}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 551.58, "duration": 4.04}, {"text": "First Person, PBS Game / Show, and The Good\nStuff.", "start": 555.62, "duration": 3.12}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 558.74, "duration": 4.14}, {"text": "with the help of these amazing people and\nour equally amazing graphics team, is Thought Cafe.", "start": 562.88, "duration": 4.7}]