[{"text": "This episode is supported by Prudential.", "start": 3.07, "duration": 2.47}, {"text": "Cameras!", "start": 5.54, "duration": 1.3}, {"text": "They’re the reason you can see me right now,\nand they’re also why so many precious moments are\nstashed away safely inside your smart phone.", "start": 6.84, "duration": 7.04}, {"text": "And, just like everything else, these visual\nmarvels are possible because of the laws of physics!", "start": 13.889, "duration": 5.171}, {"text": "To capture an image, a basic camera has a lens that\nlight passes through, and a lens opening behind that,\nwhich controls how much light enters the camera.", "start": 19.06, "duration": 7.74}, {"text": "Whatever light passes through when a picture is taken\nstrikes the film, or the digital sensor, in the back of the\ncamera to be recorded as a photograph.", "start": 26.8, "duration": 6.54}, {"text": "But whether or not you’re a photographer,\nevery day you’re dealing with lenses, images,\nand keeping objects in focus.", "start": 33.34, "duration": 5.48}, {"text": "Because, even if you’ve never even picked\nup a camera or a smartphone in your life,\nyou’re probably still using your eyes!", "start": 38.82, "duration": 5.08}, {"text": "[Theme Music]", "start": 43.91, "duration": 12.84}, {"text": "Your eyes function a lot like a camera does, adjusting\nin order to view the world up close and far away.", "start": 56.75, "duration": 5.65}, {"text": "The iris controls how much light enters your\neye, opening up while it’s dark and contracting\nin the presence of bright light.", "start": 62.4, "duration": 5.74}, {"text": "The lens in your eye is controlled by muscles\nthat change the focal length in order to focus\non objects at varying distances.", "start": 68.14, "duration": 6.519}, {"text": "The incoming rays then enter through the cornea\nand strike the retina at the back of the eye.", "start": 74.659, "duration": 4.141}, {"text": "The retina acts as the sensor that captures the image,\nsending it to the brain in the form of electrical signals.", "start": 78.8, "duration": 5.36}, {"text": "And the fovea is the very center of the retina,\nabout a quarter of a millimeter wide.", "start": 84.17, "duration": 4.42}, {"text": "This small area is the source of the sharp,\ncentral vision that you use while reading or\nfocusing on a single point.", "start": 88.59, "duration": 5.319}, {"text": "Let’s do a little demonstration to see just\nhow good your eyes are at producing a sharp image.", "start": 93.909, "duration": 4.691}, {"text": "Cover one of your eyes with one hand and with\nthe other hand, hold up something with writing on it,\nlike your physics textbook or a grocery list.", "start": 98.6, "duration": 7.22}, {"text": "Now, start with the text very close to your\neye so it’s blurry, and slowly move it farther\naway until it comes into sharp focus.", "start": 105.82, "duration": 6.28}, {"text": "Found that spot? Congratulations.", "start": 112.1, "duration": 2.2}, {"text": "You’ve located your near point, the closest\ndistance at which your eye can focus on an object.", "start": 114.3, "duration": 4.66}, {"text": "When someone has a near point that’s farther than the average, which is around 25 centimeters, they have hyperopia, more commonly known as being farsighted.", "start": 118.96, "duration": 7.64}, {"text": "Someone who’s farsighted can see distant\nobjects just fine, but when objects are too close,", "start": 126.6, "duration": 5.18}, {"text": "their eyes can’t make light rays converge at the retina,\nand instead the image forms beyond the retina.", "start": 131.78, "duration": 5.34}, {"text": "This can be corrected by eyeglasses with\nconverging lenses that bring light rays closer together\nto form a clear image on the back of the retina.", "start": 137.12, "duration": 7.4}, {"text": "Now, if you have the opposite problem, and\nhave a hard time focusing on distant objects,", "start": 144.52, "duration": 3.92}, {"text": "then you have myopia, also known as being\nnearsighted.", "start": 148.44, "duration": 3.36}, {"text": "In this case, the eyes make light rays converge\ntoo quickly, causing the image to form too\nfar in front of the retina.", "start": 151.8, "duration": 5.12}, {"text": "So nearsightedness can be corrected by diverging\nlenses, spreading out the light rays so a focused\nimage is formed at the proper distance.", "start": 156.92, "duration": 6.68}, {"text": "But lenses can not only correct problems you have with your vision, they can also produce images of things that would indecipherable to anyone, no matter how good their eyesight is.", "start": 163.6, "duration": 8.68}, {"text": "Let’s start small, and take a look through\na magnifying glass.", "start": 172.28, "duration": 2.84}, {"text": "Any simple magnifier consists of a single\nconverging lens, which produces a virtual\nimage that enlarges an object.", "start": 175.12, "duration": 6.24}, {"text": "And you can use a trusty ray diagram to show\nhow this image forms.", "start": 181.36, "duration": 3.42}, {"text": "If you had, say, a small leaf that you wanted\nto inspect, you’d just put the leaf inside\nthe focal point of the magnifier.", "start": 184.78, "duration": 6.12}, {"text": "Since the leaf is inside the focal point, the rays\ndiverge, and the lens forms a virtual image that’s\nmuch larger than the original object.", "start": 190.9, "duration": 6.9}, {"text": "And ideally, this virtual image forms just\npast your near point, because if it were closer,\nyou wouldn’t be able to focus on it.", "start": 197.8, "duration": 6.16}, {"text": "Now, you can measure a lens’ magnifying\npower by comparing the angles at which light\nrays enter your eyes.", "start": 203.96, "duration": 5.14}, {"text": "Every object takes up some amount of your\nfield of vision.", "start": 209.1, "duration": 3.08}, {"text": "And mathematically, you can express that in\nterms of how much that object subtends.", "start": 212.18, "duration": 4.16}, {"text": "An object is said to subtend a certain angle\nof your vision based on how close you are\nto it, and how big it is.", "start": 216.34, "duration": 6.0}, {"text": "For example, if you’re looking up at the moon, and you cover it with your thumb, then your thumb and the moon are both subtending the same angle to your eye, which we measure in degrees.", "start": 222.34, "duration": 8.8}, {"text": "So if you look at our tiny leaf, it may subtend only\ntwo degrees of your vision when it’s at your near point\n– say, 25 centimeters away.", "start": 231.14, "duration": 6.38}, {"text": "But when you look at the leaf through the lens,\nthe virtual image is larger than the actual object,\nso it subtends six degrees of your vision.", "start": 237.52, "duration": 6.16}, {"text": "In order to find the magnifying power of the lens,\nyou just divide the angle subtended by the virtual image\nby the angle subtended by your unaided eye.", "start": 243.68, "duration": 8.24}, {"text": "This equation, which holds true for all magnifiers,\ntells you that this particular lens has a magnifying\npower of three.", "start": 251.92, "duration": 6.2}, {"text": "So that’s how a lens can magnify something\nthat’s right in front of you.", "start": 258.13, "duration": 3.1}, {"text": "But what about an object that’s very far\naway? Like, VERY far away?", "start": 261.23, "duration": 4.28}, {"text": "In the early 17th century, telescopes were\ndeveloped in Holland that could magnify distant\nobjects by three or four times.", "start": 265.52, "duration": 5.98}, {"text": "Our friend Galileo heard about this, and in\n1609, he built his own telescope that magnified\nobjects thirty times!", "start": 271.5, "duration": 6.84}, {"text": "This was a refracting telescope.", "start": 278.34, "duration": 1.87}, {"text": "It consisted of an objective lens on the end closest to the object and an eyepiece at the other end, which magnified the image produced by the objective lens.", "start": 280.21, "duration": 7.95}, {"text": "While Galileo used a concave lens for his eyepiece, the standard refracting telescope uses a convex, converging lens for both the objective lens and the eyepiece.", "start": 288.16, "duration": 9.34}, {"text": "Here’s how it works:", "start": 297.5, "duration": 1.16}, {"text": "The objective lens takes incoming light rays\nfrom a distant source.", "start": 298.66, "duration": 3.55}, {"text": "Since the source is so far away, the incoming\nrays are considered parallel.", "start": 302.21, "duration": 3.71}, {"text": "The objective lens then converges the light rays\nto form a real, flipped image inside the telescope.", "start": 305.92, "duration": 4.74}, {"text": "This image is very small, but the eyepiece\nacts as a magnifier, forming a large, virtual\nimage for the observer to view.", "start": 310.66, "duration": 5.68}, {"text": "Note that the real image is positioned just\ninside the focal point of the eyepiece, maximizing\nthe size of the virtual image.", "start": 316.34, "duration": 6.18}, {"text": "And the resulting virtual image is still flipped,\nso any objects viewed through the refracting\ntelescope would be upside down.", "start": 322.52, "duration": 6.2}, {"text": "But that can be corrected by using a concave\nlens for an eyepiece, like Galileo did.", "start": 328.73, "duration": 3.98}, {"text": "Now, if you want to calculate the\nmagnifying power of the telescope,", "start": 332.71, "duration": 3.32}, {"text": "just start with the same equation you used\nfor the magnifying lens, but with a negative sign,\nbecause the image is flipped.", "start": 336.03, "duration": 5.97}, {"text": "The original subtended angle is the\nsubtended angle of the unaided eye –", "start": 342.0, "duration": 3.9}, {"text": "the angle between the center of the\nobjective lens and the height of the real image.", "start": 345.9, "duration": 3.7}, {"text": "And the newly subtended angle is the amount that the object subtends when viewed through the eyepiece –", "start": 349.6, "duration": 4.98}, {"text": "the angle between your eye\nand the rays from the eyepiece.", "start": 354.58, "duration": 3.0}, {"text": "Since the angles here are so small, you can\njust assume that the tangent of an angle is\nroughly equal to the angle itself.", "start": 357.58, "duration": 6.14}, {"text": "And in a ray diagram, you can see that the tangent\nof the first angle, theta, is the height of the real image\nover the focal length of the objective lens.", "start": 363.72, "duration": 7.8}, {"text": "That’s the distance at which parallel light rays\nconverge after passing through a converging lens.", "start": 371.52, "duration": 4.76}, {"text": "Likewise, the tangent of the second angle,\ntheta prime, is equal to the height of the real\nimage over the focal length of the eyepiece.", "start": 376.28, "duration": 6.6}, {"text": "You get maximum magnification when the real image\nis just barely inside the focal length of the eyepiece.", "start": 382.88, "duration": 5.4}, {"text": "In which case, all of the rays passing into\nyour eye from the eyepiece are almost parallel.", "start": 388.28, "duration": 4.82}, {"text": "Using your small-angle approximation, you can then replace the angles in the magnification equation with the new expressions in terms of image height and focal lengths.", "start": 393.1, "duration": 8.26}, {"text": "After all of the like terms cancel out, you’re left with\na magnification equation in terms of the focal lengths\nof the objective lens and the eyepiece.", "start": 401.36, "duration": 7.08}, {"text": "Galileo pioneered the use of refracting telescopes\nin astronomy.", "start": 408.44, "duration": 3.48}, {"text": "But today, many other types of telescopes\nare used for space research.", "start": 411.92, "duration": 3.34}, {"text": "Many, like the Hubble Space Telescope, are\nreflecting telescopes, using mirrors as the objective\nlens so that they can have huge openings,", "start": 415.28, "duration": 7.76}, {"text": "taking in as much light as possible in order\nto best capture images of distant objects.", "start": 423.04, "duration": 5.56}, {"text": "These mirrors are convex, causing rays to converge\ninto a real image, which is then magnified through an\neyepiece or projected directly onto a digital sensor.", "start": 428.6, "duration": 7.68}, {"text": "Now, let’s switch gears and shrink back\ndown to the small stuff.", "start": 436.28, "duration": 2.94}, {"text": "A simple magnifier isn’t enough to study\nobjects on the cellular scale,", "start": 439.22, "duration": 3.76}, {"text": "so we’ve developed compound microscopes,\nwhich like a telescope, use objective lenses\nand eyepieces to magnify objects.", "start": 442.98, "duration": 7.72}, {"text": "Only this time, the object distance to the\nobjective lens is much smaller.", "start": 450.7, "duration": 4.45}, {"text": "The object is placed just beyond the focal\npoint of the objective lens, so light rays again\nform a flipped real image on the other side.", "start": 455.15, "duration": 7.34}, {"text": "And just like with telescopes, the real image is\njust inside the focal point of the eyepiece, generating\na large virtual image for the observer to view.", "start": 462.49, "duration": 7.709}, {"text": "Now remember, for all of these optical instruments,\nour original optics equations still hold true!", "start": 470.199, "duration": 4.94}, {"text": "We have the magnification equation,\nexpressed in terms of subtended angles,", "start": 475.14, "duration": 4.16}, {"text": "but we can still use the equations in terms of\ndistance and height for both objects and images.", "start": 479.3, "duration": 4.82}, {"text": "Likewise, the thin lens equation is still\napplicable in most of our basic situations.", "start": 484.12, "duration": 4.42}, {"text": "Remember that?", "start": 488.54, "duration": 1.18}, {"text": "It’s the equation that relates the object distance\nand the image distance to the lens’s focal length.", "start": 489.72, "duration": 5.06}, {"text": "Now, as amazing as our technology has\nbecome for capturing images, we can’t escape the fundamental wave nature of light!", "start": 494.78, "duration": 6.16}, {"text": "When we first learned about how light travels as\na wave, we saw how light passing through a thin\nslit spreads beyond the edges of the slit.", "start": 500.94, "duration": 6.92}, {"text": "This diffraction, which is the reshaping of\nlight by obstacles, happens in lenses too.", "start": 507.86, "duration": 4.4}, {"text": "Since lenses have edges, the incoming rays will\nalways diffract and produce slightly blurred images,\neven if the lens is perfectly crafted.", "start": 512.26, "duration": 7.54}, {"text": "For instance, a single point of light, when captured by a camera, will appear as a central bright spot, known as a diffraction disk, with weakening circular rings of light spreading out from it.", "start": 519.8, "duration": 9.64}, {"text": "The ability of a camera to produce images\nof points very close together is called resolution,\na term that you’ve probably heard before.", "start": 529.44, "duration": 6.6}, {"text": "The higher the resolution, the clearer two\npoints that are close together will appear in an image.", "start": 536.04, "duration": 4.78}, {"text": "For telescopes and microscopes, the ability\nto resolve an image becomes more difficult\nas the magnification gets higher,", "start": 540.82, "duration": 6.24}, {"text": "because the diffraction patterns that they\ncreate are magnified, too.", "start": 547.06, "duration": 3.22}, {"text": "So, the magnifying power of optical tools is\nlimited, because light acts like the wave that it is.", "start": 550.28, "duration": 5.68}, {"text": "Today, we learned about the human eye functions\nlike a camera.", "start": 555.96, "duration": 2.84}, {"text": "We also studied simple magnifiers and how\nto generate an enlarged virtual image.", "start": 558.8, "duration": 4.2}, {"text": "Then, we analyzed how refracting\ntelescopes and compound microscopes\nfunction using the same principles.", "start": 563.0, "duration": 5.28}, {"text": "Finally, we discussed how the wave nature\nof light affects the resolution of images\nin cameras and all optical instruments.", "start": 568.28, "duration": 6.059}, {"text": "Thanks to Prudential for sponsoring this episode.", "start": 574.339, "duration": 2.8}, {"text": "What matters most to you today?", "start": 577.14, "duration": 1.92}, {"text": "Is it your travels?", "start": 579.06, "duration": 1.1}, {"text": "Dinner dates with your friends?", "start": 580.16, "duration": 1.44}, {"text": "Season tickets to see your favorite sports\nteam?", "start": 581.6, "duration": 2.51}, {"text": "Long weekend getaways?", "start": 584.11, "duration": 1.44}, {"text": "Or even buying gifts for your kids?", "start": 585.55, "duration": 1.65}, {"text": "According to a Prudential study, over half of Americans are not on track to be able to maintain their current standard of living in retirement.", "start": 587.2, "duration": 7.0}, {"text": "What would you prioritize if you couldn’t\nmaintain your current standard of living?", "start": 594.2, "duration": 3.68}, {"text": "Go to Raceforretirement.com and see how if\nyou start saving more today, you can continue\nto enjoy the things you love tomorrow.", "start": 597.88, "duration": 6.68}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 604.56, "duration": 3.67}, {"text": "You can head over to their channel to check\nout a playlist of their latest amazing shows like:", "start": 608.23, "duration": 4.85}, {"text": "Deep Look, PBS Idea Channel, and It’s Okay\nto be Smart.", "start": 613.08, "duration": 3.64}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 616.73, "duration": 3.68}, {"text": "with the help of these amazing people and\nour equally amazing graphics team, is Thought Cafe.", "start": 620.41, "duration": 5.14}]