[{"text": "Professor Dave here, let’s graph some lines.", "start": 0.42, "duration": 2.46}, {"text": "We just learned about the coordinate plane\nand how to represent equations graphically.", "start": 9.52, "duration": 5.82}, {"text": "Let’s continue with this topic by finding\nthe equation of a line given some data, and", "start": 15.34, "duration": 6.751}, {"text": "plotting that line graphically in the form\nof Y equals MX plus B. As we know, X and Y", "start": 22.091, "duration": 6.909}, {"text": "are variables, while M represents the slope\nof the line and B is the Y intercept, or the", "start": 29.0, "duration": 6.32}, {"text": "Y value for the point where the line crosses\nthe Y axis.", "start": 35.32, "duration": 5.05}, {"text": "Since any two points define a line, we could\nlist any two points, and find the equation", "start": 40.37, "duration": 6.34}, {"text": "that describes the line that passes through\nthese points.", "start": 46.71, "duration": 4.17}, {"text": "Let’s try (negative two, three), and (one,\nfive).", "start": 50.88, "duration": 4.269}, {"text": "First, we can calculate the slope.", "start": 55.149, "duration": 2.011}, {"text": "Again, that’s rise over run, which is five\nminus three over one minus negative two, or", "start": 57.16, "duration": 6.27}, {"text": "two thirds.", "start": 63.43, "duration": 1.129}, {"text": "Let’s plug that into our equation, giving\nus Y equals two thirds X plus B. Now how are", "start": 64.559, "duration": 7.361}, {"text": "we going to find B?", "start": 71.92, "duration": 1.78}, {"text": "Well, since this equation relates the X and\nY coordinates of any point on this line, we", "start": 73.7, "duration": 5.65}, {"text": "can simply plug in the coordinates for any\npoint on this line, and we should be able", "start": 79.35, "duration": 5.53}, {"text": "to solve for B. Let’s use one, five, as\nour X and Y values.", "start": 84.88, "duration": 6.489}, {"text": "We plug in one for X and five for Y, and we\nget five equals two thirds times one plus", "start": 91.369, "duration": 7.471}, {"text": "B. Let’s change five into fifteen thirds,\nand then subtract two thirds from both sides.", "start": 98.84, "duration": 7.77}, {"text": "That leaves us with thirteen thirds.", "start": 106.61, "duration": 4.049}, {"text": "Just to be thorough, let’s plug in the other\npoint, and verify that we get the same thing.", "start": 110.659, "duration": 5.431}, {"text": "Three, or nine thirds, equals negative four\nthirds plus B. Add four thirds to both sides,", "start": 116.09, "duration": 8.13}, {"text": "and we see that we get the same thing as before.", "start": 124.22, "duration": 4.009}, {"text": "And with that, we have our equation for this\nline, Y equals two thirds X plus thirteen", "start": 128.229, "duration": 6.931}, {"text": "thirds.", "start": 135.16, "duration": 2.07}, {"text": "So now we know how to find the equation of\na line given any two points on that line.", "start": 137.23, "duration": 7.479}, {"text": "If we are given one point and the slope, things\nare even easier, because then we just have", "start": 144.709, "duration": 5.581}, {"text": "to solve for B. Say the line goes through\nfour negative seven and it has a slope of", "start": 150.29, "duration": 6.429}, {"text": "negative one half.", "start": 156.719, "duration": 2.041}, {"text": "The equation must be Y equals negative one\nhalf X plus B. Then we just plug in the coordinates", "start": 158.76, "duration": 8.629}, {"text": "for the one point we have, and we get negative\nseven equals negative one half times four", "start": 167.389, "duration": 7.201}, {"text": "plus B. Negative seven equals negative two\nplus B, and B equals negative five.", "start": 174.59, "duration": 7.329}, {"text": "This allows us to write the entire equation.", "start": 181.919, "duration": 3.341}, {"text": "If we want to graph any of these lines, it’s\njust a matter of marking two points on the", "start": 185.26, "duration": 5.729}, {"text": "line and carefully drawing the line that passes\nthrough them, extending infinitely in either", "start": 190.989, "duration": 7.21}, {"text": "direction, which is what is meant by these\nlittle arrows on either side, that they continue", "start": 198.199, "duration": 6.76}, {"text": "forever.", "start": 204.959, "duration": 1.801}, {"text": "The two points can be ones that were given,\nthey could be an intercept and another point", "start": 206.76, "duration": 6.049}, {"text": "given by applying the slope in either direction,\nor if we just have the equation we could plug", "start": 212.809, "duration": 6.91}, {"text": "in any value for X to get the corresponding\nY value, and therefore an ordered pair representing", "start": 219.719, "duration": 8.01}, {"text": "a point on the line, and then do the same\nthing for another X value to get another point.", "start": 227.729, "duration": 7.22}, {"text": "Whatever we need to do to get two points will\nbe enough to draw the line that represents", "start": 234.949, "duration": 5.57}, {"text": "the linear equation.", "start": 240.519, "duration": 2.03}, {"text": "If that’s all clear, let’s check comprehension.", "start": 242.549, "duration": 2.051}]