[{"text": "The shock you get from a doorknob.", "start": 3.1, "duration": 1.64}, {"text": "That trick you used to do with a balloon,\nto make your hair stick up.", "start": 4.74, "duration": 2.82}, {"text": "Or, of course, a lightning strike.", "start": 7.56, "duration": 1.32}, {"text": "They’re all governed by the same principle:\nstatic electricity.", "start": 8.89, "duration": 3.4}, {"text": "Static electricity occurs when an object obtains a net amount of positive or negative electric charge, creating an imbalance that wants to be returned to equilibrium.", "start": 12.29, "duration": 8.579}, {"text": "Its effects aren’t always as dramatic as\nlightning, though.", "start": 20.869, "duration": 2.851}, {"text": "Let’s take two pieces of tape that are both\nstuck to a table.", "start": 23.72, "duration": 2.719}, {"text": "If you rip them both off the table and try to stick\nthem together, that should be easy enough, right?", "start": 26.44, "duration": 4.66}, {"text": "But it turns out that they repel one another.", "start": 31.1, "duration": 2.28}, {"text": "But try this: Stick one on top of the other, rip\nthe pair off the table, and then separate the pieces.", "start": 33.38, "duration": 5.28}, {"text": "They’re no longer repelled – now they’re\nattracted to one another!", "start": 38.66, "duration": 2.94}, {"text": "In the first scenario, both pieces of tape\nstole negative charges from the table.", "start": 41.6, "duration": 4.1}, {"text": "And since like-charges repel, the pieces moved\naway from one another.", "start": 45.71, "duration": 3.98}, {"text": "In the second scenario, one piece of tape stole negative charges from the other, leaving the pieces with opposite overall charges, making them attract.", "start": 49.69, "duration": 7.8}, {"text": "Our study of electricity begins here:", "start": 57.49, "duration": 2.22}, {"text": "with basic observations about electric charges that, hundreds of years ago, sparked the imagination and innovation that changed our world forever.", "start": 59.71, "duration": 7.62}, {"text": "[Theme Music]", "start": 67.33, "duration": 12.64}, {"text": "To understand electricity, you should\nstart with an atom.", "start": 79.97, "duration": 2.73}, {"text": "Atoms contain charged particles – positive protons and negative electrons.", "start": 82.7, "duration": 4.06}, {"text": "And generally there’s an equal number of each,\nmeaning the net electric charge of the atom is 0.", "start": 86.76, "duration": 4.9}, {"text": "It’s electrically neutral.", "start": 91.66, "duration": 1.51}, {"text": "In solid materials, protons stay fixed, but\nsome electrons are free to move around.", "start": 93.17, "duration": 4.26}, {"text": "These moving electrons are called free electrons.", "start": 97.43, "duration": 2.27}, {"text": "They reside in an atom’s outer shell as valence electrons and are easily plucked off and carried around, when acted upon by an outside force.", "start": 99.7, "duration": 7.46}, {"text": "How easy it is for electrons to move around\ndepends on the material.", "start": 107.16, "duration": 3.5}, {"text": "And we describe the materials in the same manner we do for heat transfer, with conductors and insulators.", "start": 110.66, "duration": 5.28}, {"text": "Materials that are conductors, like copper,\nlet free electrons move freely throughout the solid,", "start": 115.94, "duration": 5.64}, {"text": "while insulators, like wood, hold on to\nthem tightly, limiting their flow.", "start": 121.58, "duration": 4.52}, {"text": "So we’ve got insulators and conductors with\nfree electrons moving around in them.", "start": 126.1, "duration": 4.16}, {"text": "But what causes these charged particles to\nmove in the first place?", "start": 130.26, "duration": 3.22}, {"text": "The answer is an imbalance of electrical charge, when some part of an object has a different number of free electrons than another part.", "start": 133.48, "duration": 7.0}, {"text": "When we talk about an object having an overall negative charge, we mean that it has too many electrons.", "start": 140.48, "duration": 4.96}, {"text": "And when we talk about an object having an overall positive charge, we mean it’s missing free electrons.", "start": 145.44, "duration": 4.92}, {"text": "This imbalance can be created and resolved\nin lots of different ways.", "start": 150.36, "duration": 3.22}, {"text": "Say you have a glass rod that’s electrically\nneutral, and you rub it with a cloth.", "start": 153.59, "duration": 4.08}, {"text": "That physical interaction causes electrons to hop onto the cloth, leaving the rod with an overall positive charge.", "start": 157.67, "duration": 6.23}, {"text": "This is called charging by friction.", "start": 163.9, "duration": 2.02}, {"text": "Both the cloth and rod began with a neutral charge, but after friction, the rod has a net positive charge.", "start": 165.92, "duration": 5.36}, {"text": "But whether the rod ends up with a net positive or negative charge depends on the materials that you use.", "start": 171.28, "duration": 4.78}, {"text": "The ancient Greeks actually rubbed fur against amber, and discovered that the amber would then attract hair and feathers.", "start": 176.06, "duration": 5.72}, {"text": "Today, we understand that the fur stole electrons during the process, giving the amber an overall positive charge, just like the glass rod.", "start": 181.78, "duration": 7.24}, {"text": "Now, it’s important to note that no new\ncharges were created during this process.", "start": 189.03, "duration": 4.26}, {"text": "The overall charge between the two objects\nis still zero.", "start": 193.29, "duration": 2.91}, {"text": "This is known as the law of conservation of\nelectric charge.", "start": 196.2, "duration": 3.06}, {"text": "It says that you can never create\na net electric charge.", "start": 199.26, "duration": 3.24}, {"text": "Instead, charge can only move\nfrom one place to another.", "start": 202.5, "duration": 3.04}, {"text": "Now, if we bring our positively charged glass\nrod in contact with another, neutral rod,", "start": 205.54, "duration": 4.94}, {"text": "some of the negative charge – that is, some electrons – will jump from the neutral rod to the positive one, until both objects have the same distribution of charge.", "start": 210.48, "duration": 8.24}, {"text": "So now we have two rods that are both slightly\npositive.", "start": 218.73, "duration": 2.76}, {"text": "This is called charging by contact.", "start": 221.49, "duration": 2.2}, {"text": "When the two objects touched, charges moved\nbetween them.", "start": 223.69, "duration": 3.08}, {"text": "OK, so, charges can move when different materials touch each other, either through friction or simple contact.", "start": 226.77, "duration": 5.35}, {"text": "But materials don’t actually have to touch\nin order for their electrons to get all rearranged.", "start": 232.12, "duration": 4.3}, {"text": "Say you bring a positively charged rod close\nto a metal conductive rod.", "start": 236.42, "duration": 3.879}, {"text": "Then, the electrons in part of the metal rod\nwill be drawn towards the positive rod.", "start": 240.299, "duration": 4.511}, {"text": "Now, the side with more electrons has a negative charge, leaving the other side of the rod with fewer electrons and a positive charge.", "start": 244.81, "duration": 6.65}, {"text": "You know what we’ve done here?", "start": 251.46, "duration": 1.36}, {"text": "We’ve polarized the metal rod.", "start": 252.82, "duration": 1.64}, {"text": "We’ve redistributed the charge in order to create an imbalance of charge within an object an object that’s still electrically neutral.", "start": 254.46, "duration": 7.54}, {"text": "Now, imagine that we slice the metal rod right\ndown the center!", "start": 262.0, "duration": 3.03}, {"text": "It still hasn’t touched the positive rod, but since we split it while an imbalance was present, we’re left with one positive side and one negative side.", "start": 265.03, "duration": 7.68}, {"text": "This process is known as charging by induction – creating a net charge without contacting another object.", "start": 272.71, "duration": 4.89}, {"text": "Now, if a charged object is connected to a much larger neutral conducting object, then the net charge gets redistributed so that the smaller object loses most of its net charge.", "start": 277.6, "duration": 11.14}, {"text": "How large an object are we talking about,\nexactly?", "start": 288.74, "duration": 2.56}, {"text": "Well, how about Earth?", "start": 291.3, "duration": 1.74}, {"text": "The Earth’s surface is a fairly good conductor in most places, and, for our purposes, it can be considered neutral.", "start": 293.04, "duration": 5.64}, {"text": "So, connecting a charged object to the ground creates a way for the charge to leak into the Earth, rendering the object electrically neutral.", "start": 298.68, "duration": 6.92}, {"text": "This is known as grounding.", "start": 305.6, "duration": 1.5}, {"text": "So, let’s say we repeat the previous experiment, but we bring a negatively charged rod close to our neutral one.", "start": 307.1, "duration": 5.0}, {"text": "The neutral rod becomes polarized, with a net positive charge close to the charged rod and a negative charge on the opposite side.", "start": 312.1, "duration": 6.46}, {"text": "But if we ground the metal rod, the negative charges repelled by the charged rod now have a place to go:\nthe Earth!", "start": 318.56, "duration": 6.38}, {"text": "The negative charges scurry away, leaving\nthe metal rod with an overall positive charge.", "start": 324.94, "duration": 4.68}, {"text": "Now, if we sever the connection to the ground,\nour rod remains positively charged!", "start": 329.62, "duration": 4.52}, {"text": "This process required no contact between the\nrods, only a connection to the ground.", "start": 334.14, "duration": 3.82}, {"text": "OK, so we’ve talked about how opposite charges attract and like charges repel, but how do we quantify those interactions in terms of equations and units?", "start": 337.96, "duration": 8.34}, {"text": "Well, we’ll want to find the force on charged\nparticles in Newtons.", "start": 346.3, "duration": 3.34}, {"text": "But to calculate the number of Newtons, we’ll first need to measure the charge, denoted by “q”, in units called Coulombs.", "start": 349.64, "duration": 6.12}, {"text": "Since objects can be positively or negatively charged, “q” can have both positive and negative values.", "start": 355.76, "duration": 5.18}, {"text": "For example, one electron has a charge of negative 1.6 times 10 to the negative 19th Coulombs.", "start": 360.94, "duration": 5.78}, {"text": "That means there are 6.24 times 10 to the\n18th electrons for every negative Coulomb!", "start": 366.72, "duration": 5.42}, {"text": "This value – the charge of a single electron in Coulombs – is known as the elementary charge, and it’s denoted with a lowercase “e”.", "start": 372.14, "duration": 6.6}, {"text": "We’ll use this notation a lot when talking about protons and electrons, since protons have a charge of positive e and electrons of negative e.", "start": 378.74, "duration": 6.76}, {"text": "Now that we have a way to measure the charge,\nwe can calculate the force between particles.", "start": 385.51, "duration": 4.07}, {"text": "And the equation we use is very similar to the one we use with gravitation.", "start": 389.58, "duration": 3.62}, {"text": "It’s just that, instead of using kilograms to find Newtons,\nhere we’re using Coulombs to find Newtons.", "start": 393.2, "duration": 4.82}, {"text": "Our equation here states that the force between\ntwo charged particles is equal to the product", "start": 398.02, "duration": 4.36}, {"text": "of the two charges, divided by the distance\nbetween them squared.", "start": 402.39, "duration": 3.01}, {"text": "And the distance is squared because, just like gravitation, when the distance between objects doubles, the force between them reduces to a quarter of the original value.", "start": 405.4, "duration": 8.84}, {"text": "And, ALSO as with gravitation, this force\nhas its own proportionality constant.", "start": 414.25, "duration": 4.48}, {"text": "It’s labeled lower-case k, and its value depends\non the medium that surrounds the charges.", "start": 418.74, "duration": 4.34}, {"text": "The vast majority of the time, the medium you’ll be working with will just be the air, or possibly a vacuum.", "start": 423.08, "duration": 5.34}, {"text": "And in both cases the constant is 9 times\n10 to the ninth Coulombs.", "start": 428.42, "duration": 3.82}, {"text": "So when you multiply the rest of the expression\nby k, that gives the result in terms of Newtons.", "start": 432.25, "duration": 4.55}, {"text": "This whole expression is known as Coulomb’s\nLaw.", "start": 436.8, "duration": 2.78}, {"text": "And k is often known as the Coulomb’s Law\nconstant.", "start": 439.58, "duration": 2.49}, {"text": "Now, gravitation and electrostatic forces work in totally different ways, of course, so we have to express them differently, too.", "start": 442.07, "duration": 6.17}, {"text": "The force of gravity, after all, is always\nattractive.", "start": 448.24, "duration": 2.98}, {"text": "But the electrostatic forces can be either attractive or repulsive, depending on the signs of the charges.", "start": 451.22, "duration": 5.2}, {"text": "So the product of the two charges can be negative or positive, with the resulting sign of F being plus or minus, corresponding to either attraction or repulsion.", "start": 456.42, "duration": 8.28}, {"text": "Now, let’s put Coulomb’s Law to the test!", "start": 464.71, "duration": 1.92}, {"text": "Let's say there are two electrons that are\n1 nanometer apart.", "start": 466.63, "duration": 2.99}, {"text": "That’s 1 times 10 to the -9 meters.", "start": 469.62, "duration": 2.84}, {"text": "You can calculate the force between them by multiplying their charges, which are both -1.6 times 10 to the -19 Coulombs divided by the distance between them squared.", "start": 472.46, "duration": 10.1}, {"text": "You then multiply that by k, and the resulting force is positive 2.3 times 10 to the -10 Newtons.", "start": 482.56, "duration": 6.14}, {"text": "Now, notice that the answer is positive – that\nmeans the electrons repel one another.", "start": 488.7, "duration": 4.16}, {"text": "If we used a proton and an electron the same distance apart, we’d get -2.3 times 10 to the -10 Newtons, meaning they’d attract one another.", "start": 492.86, "duration": 8.58}, {"text": "And just like other forces, vector addition\nalso applies here, too.", "start": 501.44, "duration": 4.12}, {"text": "This means we can solve for the net force on a charge by using Coulomb’s law on each pair of charges in any situation.", "start": 505.56, "duration": 6.32}, {"text": "From Coulomb’s law, we can calculate the magnitude of the force and find the direction based on the sign of the result.", "start": 511.88, "duration": 5.8}, {"text": "So, from a simple trick with tape, and the help of a couple of animated rods, we’ve already uncovered the basics of electrostatic forces!", "start": 517.68, "duration": 7.16}, {"text": "Next time, we’ll learn about electric fields and\nhow to visualize their effect on neighboring objects.", "start": 524.84, "duration": 5.02}, {"text": "Today, we learned about electrostatic forces, and how electrical charge can be altered and rearranged.", "start": 529.86, "duration": 4.8}, {"text": "We also discussed Coulomb’s law and how the force between charged particles is calculated using vectors.", "start": 534.66, "duration": 5.42}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 540.08, "duration": 4.28}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like:", "start": 544.36, "duration": 4.7}, {"text": "PBS Idea Channel, Brain Craft, and Shank’s\nFX.", "start": 549.06, "duration": 3.12}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 552.18, "duration": 4.6}, {"text": "with the help of these amazing people, and\nour equally amazing graphics team is Thought Cafe.", "start": 556.79, "duration": 4.82}]