[{"text": "Here we have an ordinary piece of rope.", "start": 3.0, "duration": 1.74}, {"text": "It’s not one of those magician’s ropes that can mysteriously put itself back together once it's been cut it in half.", "start": 4.74, "duration": 4.64}, {"text": "And it’s not particularly strong or durable.", "start": 9.38, "duration": 2.22}, {"text": "But you might say that it does have special powers, because it’ll demonstrate for us the physics of traveling waves.", "start": 11.6, "duration": 5.76}, {"text": "Ropes and strings are really good for this kind of thing,", "start": 17.36, "duration": 2.7}, {"text": "because when you move them back and forth the movement of your hand travels through the rope as a wave.", "start": 20.06, "duration": 4.9}, {"text": "By observing what happens to this rope when we try different things with it, we’ll be able to see how waves behave.", "start": 24.96, "duration": 5.12}, {"text": "Including, how those waves sometimes disappear\ncompletely.", "start": 30.089, "duration": 2.921}, {"text": "How’s that for a magic trick?", "start": 33.01, "duration": 2.3}, {"text": "[Theme Music]", "start": 35.31, "duration": 12.32}, {"text": "This is a typical wave.", "start": 47.63, "duration": 1.19}, {"text": "And waves form whenever there’s a disturbance\nof some kind.", "start": 48.82, "duration": 2.84}, {"text": "Often, when something about the physical world changes, the information about that disturbance", "start": 51.66, "duration": 4.02}, {"text": "gradually moves outward, away from the source, in every direction.", "start": 55.68, "duration": 4.06}, {"text": "And as the information travels, it makes a\nwave shape.", "start": 59.74, "duration": 2.98}, {"text": "Think about all the disturbance you cause, for example, when you jump on a trampoline.", "start": 62.72, "duration": 3.84}, {"text": "When you hit the trampoline, the downward push that you create moves the material next to it down a little bit, too.", "start": 66.56, "duration": 5.4}, {"text": "And the same goes for the material next to\nthat, and so on.", "start": 71.96, "duration": 3.079}, {"text": "And while that information is traveling outward,\nthe spot where your feet first hit the trampoline", "start": 75.039, "duration": 4.58}, {"text": "is already recovering, moving upward again, because of the tension force in the trampoline.", "start": 79.619, "duration": 5.301}, {"text": "And that moves the area next to it upward, too.", "start": 84.92, "duration": 2.33}, {"text": "This up-and-down motion gradually ripples outward, covering more and more of the trampoline.", "start": 87.25, "duration": 4.359}, {"text": "And the ripples take the shape of a wave.", "start": 91.609, "duration": 2.19}, {"text": "Waves are made up of peaks, with crests -- the bumps on top -- and troughs -- the bumps on the bottom.", "start": 93.799, "duration": 5.42}, {"text": "They have an amplitude, which is the distance from the peaks to the middle of the wave.", "start": 99.219, "duration": 3.67}, {"text": "They also have a wavelength, which is the distance between crests -- a full cycle of the wave --", "start": 102.889, "duration": 4.691}, {"text": "and a frequency, which is how many of those cycles pass through a given point every second.", "start": 107.58, "duration": 5.18}, {"text": "Multiply the wavelength by the frequency,\nand you get the wave’s speed -- how fast it's going.", "start": 112.76, "duration": 4.22}, {"text": "And the wave’s speed only depends on the medium it’s traveling through.", "start": 116.98, "duration": 3.18}, {"text": "That’s why the speed of sound -- which is\na wave -- doesn’t depend on the sound itself.", "start": 120.16, "duration": 3.96}, {"text": "It doesn’t matter how loud or quiet it is.", "start": 124.13, "duration": 2.849}, {"text": "It just depends on whether the sound is traveling through, say, air or water.", "start": 126.979, "duration": 3.8}, {"text": "Now, there are four main kinds of waves, and we can use our rope to show the difference between some of them:", "start": 130.78, "duration": 5.04}, {"text": "A pulse wave is what happens when you move the end of the rope back and forth just one time.", "start": 135.83, "duration": 4.0}, {"text": "One lonely crest travels through the rope\n-- that’s the pulse.", "start": 139.83, "duration": 3.36}, {"text": "Then there’s a continuous wave, which is what happens when you keep moving the rope back and forth.", "start": 143.19, "duration": 4.53}, {"text": "In that case, your hand is acting as an oscillator.", "start": 147.72, "duration": 2.84}, {"text": "Anything that causes an oscillation or vibration can create a continuous wave.", "start": 150.56, "duration": 4.66}, {"text": "Now, things that cause simple harmonic oscillation move in such a way that they create sinusoidal waves --", "start": 155.22, "duration": 4.74}, {"text": "meaning that if you plotted the waves on a graph, they’d look a lot like the graph of sin(x).", "start": 159.96, "duration": 5.5}, {"text": "But the waves we’ve mainly been talking\nabout so far are transverse waves --", "start": 165.46, "duration": 3.96}, {"text": "ones in which the oscillation is perpendicular to the direction that the wave is traveling in.", "start": 169.42, "duration": 4.8}, {"text": "When a wave travels along this rope, for example,the peaks are perpendicular to the rope’s length.", "start": 174.22, "duration": 4.94}, {"text": "The same thing was mostly true for the waves that you made on the trampoline:", "start": 179.16, "duration": 3.24}, {"text": "the waves were traveling along its surface horizontally, but the peaks were vertical.", "start": 182.4, "duration": 4.08}, {"text": "But there are also longitudinal waves, where the oscillations happen in the same direction as the wave is moving.", "start": 186.48, "duration": 6.48}, {"text": "In the case of a longitudinal wave, the back-and-forth motion is more of a compression-and-expansion.", "start": 192.96, "duration": 5.02}, {"text": "These are the kinds of waves that you get\nby compressing and stretching a spring --", "start": 197.98, "duration": 3.5}, {"text": "and they’re also the kinds by which sound travels, which we’ll talk more about next time.", "start": 201.48, "duration": 4.01}, {"text": "But all waves -- no matter what kind they\nare -- have something in common:", "start": 205.49, "duration": 3.5}, {"text": "They transport energy as they travel.", "start": 208.99, "duration": 2.46}, {"text": "At a microscopic level, waves occur when the movement of one particle affects the particle next to it.", "start": 211.45, "duration": 5.08}, {"text": "And to make that next particle start moving, there has to be an energy transfer.", "start": 216.53, "duration": 3.85}, {"text": "But how can you tell how much energy a wave has?", "start": 220.38, "duration": 2.44}, {"text": "Well, remember that an object in simple harmonic motion has a total energy of one-half,", "start": 222.82, "duration": 4.66}, {"text": "times the spring constant, times the amplitude of the motion squared.", "start": 227.48, "duration": 3.64}, {"text": "Which means for a wave caused by\nsimple harmonic motion,", "start": 231.12, "duration": 2.84}, {"text": "every particle in the wave will also have that same total energy of (half k A squared).", "start": 233.97, "duration": 5.37}, {"text": "All of this together tells us that a wave’s\nenergy is proportional to its amplitude, squared.", "start": 239.35, "duration": 4.61}, {"text": "In other words, if you double the wave’s\namplitude, you get four times the energy.", "start": 243.97, "duration": 3.34}, {"text": "Triple the amplitude, you get nine times the energy.", "start": 247.31, "duration": 2.58}, {"text": "So why is the relationship between amplitude and energy transport so important?", "start": 249.89, "duration": 3.96}, {"text": "Well, the intensity of a wave is related to\nthe energy it transports.", "start": 253.85, "duration": 3.8}, {"text": "More specifically, its intensity is equal to its power, divided by the area it’s spread over and power is energy over time.", "start": 257.65, "duration": 7.35}, {"text": "So, changing the amplitude of a wave can change its energy -- and therefore its intensity", "start": 265.0, "duration": 4.11}, {"text": "-- by the square of the change in amplitude.", "start": 269.11, "duration": 2.16}, {"text": "And this relationship is extremely important for things like figuring out how much damage", "start": 271.27, "duration": 3.88}, {"text": "can be caused by the shockwaves from an earthquake.", "start": 275.15, "duration": 2.33}, {"text": "But waves also get weaker as they spread out, because they’re distributed over more area.", "start": 277.48, "duration": 4.46}, {"text": "A spherical wave, for example -- one that\nripples outward in all directions --", "start": 281.94, "duration": 4.0}, {"text": "will be spread over the surface area of a sphere that gets bigger and bigger, the farther the wave travels.", "start": 285.94, "duration": 4.84}, {"text": "The surface area of a sphere is equal\nto (4) times (pi) times (its radius squared).", "start": 290.78, "duration": 3.8}, {"text": "So, as a spherical wave moves farther from its source, its intensity will decrease by the square of the distance from it.", "start": 294.58, "duration": 6.28}, {"text": "Two meters away from the source, and the intensity of the wave will be 4 times less than if you were 1 meter away.", "start": 300.86, "duration": 5.54}, {"text": "Three meters away, and it’ll be 9 times\nless.", "start": 306.41, "duration": 2.34}, {"text": "That’s why being just a little bit farther away from the source of an earthquake can sometimes make a huge difference.", "start": 308.75, "duration": 5.13}, {"text": "Now, let’s go back to the waves we were\nmaking with the rope.", "start": 313.88, "duration": 2.18}, {"text": "Suppose you attach one end of the rope to a ring that’s free to move up and down on a rod.", "start": 316.06, "duration": 3.82}, {"text": "Then, with your hand, you send a pulse -- in the form of a crest, rippling along it.", "start": 319.88, "duration": 4.82}, {"text": "When the pulse gets to the end of the rope, the rope slides along the rod.", "start": 324.71, "duration": 3.7}, {"text": "But then, it slides back to where it was.", "start": 328.41, "duration": 2.51}, {"text": "That motion -- the sliding back -- reflects\nthe wave back along the rope, again as a crest.", "start": 330.93, "duration": 5.16}, {"text": "But something totally different happens, if you attach the end of the rope so it’s fixed, and can’t move.", "start": 336.09, "duration": 4.58}, {"text": "Now, if you send a pulse along the rope, it\nwill still be reflected -- but this time, as a trough.", "start": 340.67, "duration": 4.78}, {"text": "The wave was inverted.", "start": 345.45, "duration": 1.43}, {"text": "That’s because, when the pulse reached the fixed end of the rope, it was trying to slide the end of the rope upward.", "start": 346.88, "duration": 5.3}, {"text": "But it couldn’t, because the end of the\nrope was fixed.", "start": 352.18, "duration": 2.54}, {"text": "So, instead, the rope got yanked downward.", "start": 354.72, "duration": 2.16}, {"text": "And the momentum from that downward movement carried the rope below the fixed end, inverting the wave.", "start": 356.88, "duration": 5.42}, {"text": "Now sometimes, multiple waves can combine.", "start": 362.3, "duration": 2.36}, {"text": "For example: Say you send two identical pulses -- both crests -- along a rope, one from each end.", "start": 364.67, "duration": 6.04}, {"text": "When the two pulses overlap, they’ll combine to make one crest, with a higher amplitude than the original ones.", "start": 370.71, "duration": 6.25}, {"text": "That’s called constructive interference\n-- the waves build on each other.", "start": 376.96, "duration": 3.16}, {"text": "Now, let’s say you do the same thing again.", "start": 380.13, "duration": 2.1}, {"text": "This time, both waves have the same amplitude,\nbut one’s a crest and the other is a trough.", "start": 382.23, "duration": 4.66}, {"text": "And when they overlap, the rope will be flat.", "start": 386.89, "duration": 3.21}, {"text": "It looks like the waves just disappeared!", "start": 390.1, "duration": 2.08}, {"text": "That’s called destructive interference,\nwhen waves cancel each other out.", "start": 392.18, "duration": 3.66}, {"text": "Constructive and destructive interference\nhappen with all kinds of waves --", "start": 395.84, "duration": 3.74}, {"text": "pulse or continuous, transverse or longitudinal.", "start": 399.58, "duration": 2.839}, {"text": "And sometimes, we can use the effects to our advantage.", "start": 402.419, "duration": 2.6}, {"text": "Noise-canceling headphones, for example, work by analyzing the noise around you and generating", "start": 405.02, "duration": 4.74}, {"text": "a sound wave that destructively interferes\nwith the sound waves from that noise, canceling it out.", "start": 409.77, "duration": 5.26}, {"text": "There’s a lot more to talk about when it comes to the physics of sound, but we’ll save that for next time.", "start": 415.03, "duration": 4.419}, {"text": "Today, you learned about traveling waves, and how their frequency, wavelength, and speed are all connected.", "start": 419.449, "duration": 4.551}, {"text": "We also talked about different types of waves,\nincluding pulse, continuous, transverse, and", "start": 424.0, "duration": 4.83}, {"text": "longitudinal waves, and how they all transport\nenergy.", "start": 428.83, "duration": 2.55}, {"text": "Finally, we discussed reflection and interference.", "start": 431.38, "duration": 3.0}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 434.38, "duration": 3.53}, {"text": "You can head over to their channel to check\nout amazing shows like Physics Girl,", "start": 437.91, "duration": 4.92}, {"text": "Shank's FX, and PBS Space Time.", "start": 442.83, "duration": 2.95}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 445.79, "duration": 4.31}, {"text": "with the help of these amazing people and\nour equally amazing graphics team is Thought Cafe", "start": 450.1, "duration": 4.7}]