[{"text": "Have you ever thought about why we wear clothes?", "start": 3.1, "duration": 2.08}, {"text": "There are people who don't wear clothes,\nof course.", "start": 5.18, "duration": 2.46}, {"text": "But most of us do, and it’s not just because of modesty, or a fear of getting arrested for indecent exposure.", "start": 7.64, "duration": 4.8}, {"text": "You might be perfectly comfortable in just a T-shirt and shorts, but take them off, and eventually you’ll probably start to feel cold.", "start": 12.44, "duration": 5.94}, {"text": "Walk around your house naked for a while -- in the interest of physics, you understand -- and you’ll see what I mean.", "start": 18.38, "duration": 5.06}, {"text": "That chill you’ll start to feel is all because\nof the flow of heat.", "start": 23.44, "duration": 3.06}, {"text": "[Theme Music]", "start": 26.5, "duration": 12.34}, {"text": "In thermodynamics, there are a few different\nways to describe the kinetic energy of a system.", "start": 38.84, "duration": 4.039}, {"text": "We’ve already talked about one of them:", "start": 42.88, "duration": 1.7}, {"text": "temperature -- the measure of the average kinetic energy of each individual molecule in a substance.", "start": 44.58, "duration": 4.76}, {"text": "Another measure of the kinetic energy of a\nsystem is internal energy, also known as thermal energy, represented by the letter U.", "start": 49.34, "duration": 6.64}, {"text": "Thermal energy is the kinetic energy of all\nthe molecules in a system added together --", "start": 55.989, "duration": 4.54}, {"text": "as opposed to temperature, which was a measure\nof the average kinetic energy for each molecule.", "start": 60.529, "duration": 4.471}, {"text": "So to find the thermal energy in a system, you just multiply the average kinetic energy by the number of molecules.", "start": 65.0, "duration": 5.42}, {"text": "And last time, we learned that the equation for the average kinetic energy of an ideal gas was equal to 3/2 x (k) x the temperature.", "start": 70.42, "duration": 7.14}, {"text": "So the thermal energy of an ideal gas is equal to the number of molecules in the system multiplied by 3/2 x k x the temperature.", "start": 77.56, "duration": 7.9}, {"text": "Now, the amount of thermal energy that’s added to, or removed from, a system is what we call heat.", "start": 85.46, "duration": 5.24}, {"text": "If I asked you describe heat to someone who’d\nnever heard of it before, you might have some trouble.", "start": 90.7, "duration": 4.62}, {"text": "It’s hard to define what heat is, exactly,\njust based on our own perceptions.", "start": 95.32, "duration": 3.44}, {"text": "For a long time, scientists described heat as a kind of fluid, since it flows from one system to another.", "start": 98.76, "duration": 5.06}, {"text": "But these days, we know that heat isn’t\nactually a fluid.", "start": 103.82, "duration": 3.18}, {"text": "It’s the ‘energy’ that’s transferred between systems, when they’re at different temperatures.", "start": 107.0, "duration": 3.9}, {"text": "In equations, we represent heat using the\ncapital letter Q.", "start": 110.9, "duration": 3.08}, {"text": "And in our daily lives, we often measure heat\nin units called calories.", "start": 113.99, "duration": 3.19}, {"text": "The units you see on nutrition labels are\nactually kilocalories, or a thousand calories.", "start": 117.18, "duration": 4.26}, {"text": "But in the official International System of\nUnits, we use Joules.", "start": 121.44, "duration": 4.08}, {"text": "One calorie is defined as the amount of energy it takes to increase the temperature of one gram of water by one degree Celsius -- or one Kelvin.", "start": 125.52, "duration": 7.14}, {"text": "One calorie is equal to 4.186 Joules.\nSimple enough.", "start": 132.66, "duration": 4.32}, {"text": "So, the flow of heat changes the temperature\nof a system.", "start": 136.98, "duration": 2.3}, {"text": "But exactly how much it changes the temperature\ndepends on two things:", "start": 139.29, "duration": 3.98}, {"text": "The first is the system’s mass.", "start": 143.27, "duration": 2.199}, {"text": "The more mass a system has, the more heat\nit takes to change its temperature.", "start": 145.469, "duration": 3.42}, {"text": "More massive systems have more matter, after all, so it takes more energy to change its average kinetic energy.", "start": 148.889, "duration": 5.111}, {"text": "But a temperature change also depends on something\ncalled the specific heat.", "start": 154.0, "duration": 3.58}, {"text": "Specific heat is a measure of how well a substance stores heat.", "start": 157.58, "duration": 3.38}, {"text": "Every substance has its own specific heat,\nand the higher it is, the more energy transfer", "start": 160.97, "duration": 3.64}, {"text": "-- in the form of heat -- it takes to change\nits temperature.", "start": 164.61, "duration": 2.78}, {"text": "Water, for example, has a very high specific\nheat compared to, say, aluminum.", "start": 167.39, "duration": 5.21}, {"text": "That means it takes much more heat to change\nthe temperature of water compared to aluminum.", "start": 172.61, "duration": 3.83}, {"text": "In general, the amount of heat transferred\nto or from a substance is equal to the mass", "start": 176.44, "duration": 4.68}, {"text": "x the specific heat (which we designate\nwith a small c) x the change in temperature.", "start": 181.12, "duration": 4.949}, {"text": "And if Q -- which represents heat -- is positive,\nthat means heat is flowing into the system.", "start": 186.069, "duration": 4.66}, {"text": "If Q is negative, the heat is flowing out.", "start": 190.729, "duration": 2.271}, {"text": "But there’s another factor that affects\nthe way heat flow relates to temperature.", "start": 193.01, "duration": 3.46}, {"text": "And that is phase changes.", "start": 196.47, "duration": 1.41}, {"text": "Let’s say you have a kilogram of ice at\n-10 degrees Celsius and standard atmospheric pressure.", "start": 197.89, "duration": 5.42}, {"text": "Then you start adding heat to it.\nWhat happens?", "start": 203.31, "duration": 2.63}, {"text": "Well, we know that the ice’s temperature\nwill start to increase.", "start": 205.95, "duration": 2.409}, {"text": "But at a certain point -- when the temperature\nhits 0 Celsius -- it’ll stop increasing.", "start": 208.359, "duration": 5.12}, {"text": "Because the ice is melting.", "start": 213.48, "duration": 1.5}, {"text": "Then, instead of raising the ice’s temperature, the heat you add goes toward changing its phase from solid to liquid.", "start": 214.98, "duration": 5.66}, {"text": "And later, once it’s all melted, the temperature of the water increases again as you add more heat, until it gets to 100 degrees.", "start": 220.64, "duration": 6.42}, {"text": "And at that point, again -- the temperature\nstops changing.", "start": 227.06, "duration": 3.379}, {"text": "This time, because the water’s boiling.", "start": 230.439, "duration": 2.101}, {"text": "When all the water has been converted to steam, adding more heat will make the temperature rise once more.", "start": 232.54, "duration": 4.82}, {"text": "So we don’t use that earlier equation to\ndescribe the heat transfer while a substance’s phase is changing.", "start": 237.36, "duration": 5.22}, {"text": "Instead, the amount of heat that gets transferred during a phase change is equal to the mass times what’s known as the latent heat.", "start": 242.58, "duration": 6.14}, {"text": "Latent heat is the heat required to change the phase of a substance, and like specific heat, its value depends on the substance.", "start": 248.72, "duration": 6.46}, {"text": "The value also depends on the phase change.", "start": 255.18, "duration": 2.44}, {"text": "For a change from solid to liquid,\nfor example, it’s known as the heat of fusion.", "start": 257.62, "duration": 3.84}, {"text": "And for a change from liquid to gas it’s\ncalled the heat of vaporization.", "start": 261.46, "duration": 3.66}, {"text": "So that’s how heat affects phase changes.", "start": 265.12, "duration": 2.19}, {"text": "But what about how heat spreads?", "start": 267.31, "duration": 1.97}, {"text": "That’s the real key to figuring out why\nwearing clothes is so great.", "start": 269.28, "duration": 3.44}, {"text": "There are three main ways for heat to spread:\nconduction, convection, and radiation.", "start": 272.72, "duration": 4.789}, {"text": "They each occur depending on the circumstances, and heat can often spread in two, or even all three different ways at the same time.", "start": 277.509, "duration": 6.12}, {"text": "In conduction, heat flow depends on physical contact between molecules, which transfer their kinetic energy among each other.", "start": 283.629, "duration": 6.491}, {"text": "It’s like when the spoon you use to stir\nyour tea gets warm.", "start": 290.12, "duration": 3.48}, {"text": "Heat is conducted from your hot tea to your\nmetal spoon.", "start": 293.6, "duration": 2.93}, {"text": "And what determines how much heat will be\nconducted over time?", "start": 296.53, "duration": 2.96}, {"text": "Well, the bigger the temperature difference\nbetween molecules,", "start": 299.49, "duration": 2.82}, {"text": "and the bigger the cross-sectional area that the heat’s flowing through, the faster the heat flow.", "start": 302.31, "duration": 4.23}, {"text": "But the farther apart the molecules are, the\nslower it’ll flow.", "start": 306.55, "duration": 3.15}, {"text": "Conductivity also depends on the material -- metal, for example, conducts heat much faster than wood.", "start": 309.7, "duration": 5.46}, {"text": "In equations, we represent this inherent conductivity,\nknown as thermal conductivity, using the letter k.", "start": 315.16, "duration": 5.56}, {"text": "The higher the value for k is, the higher the thermal conductivity of the material, and the faster heat flows.", "start": 320.72, "duration": 5.0}, {"text": "And there’s an equation for heat conduction over time that puts together all of these different factors:", "start": 325.72, "duration": 4.56}, {"text": "It says that heat flow over time between two\npoints -- that’s Q over t -- is equal to", "start": 330.28, "duration": 4.639}, {"text": "k x the cross-sectional area x the temperature\ndifference between the two points,", "start": 334.92, "duration": 4.6}, {"text": "all divided by the distance between them.", "start": 339.52, "duration": 1.92}, {"text": "Another way that heat can spread is through\nconvection, which is kind of like conduction,", "start": 341.44, "duration": 3.62}, {"text": "in the sense that it still depends on contact\nbetween molecules.", "start": 345.069, "duration": 3.181}, {"text": "But in convection, the molecules aren’t just bumping into each other because they happen to be nearby -- instead, they travel much farther.", "start": 348.25, "duration": 6.43}, {"text": "It’s kind of like the molecules are being\nstirred.", "start": 354.68, "duration": 2.7}, {"text": "In convection, warmer molecules generally move away from the heat source and are replaced by cooler molecules which are then heated up.", "start": 357.38, "duration": 7.04}, {"text": "In a tea kettle, for example, the water is heated from the bottom, so the water at the bottom warms up first.", "start": 364.42, "duration": 6.0}, {"text": "That warmer water expands and rises, and is replaced by cooler water, which then also heats up.", "start": 370.42, "duration": 5.72}, {"text": "But convection only happens because the heat source is positioned in a way that makes the warmer water move away from it -- it’s at the bottom of the kettle.", "start": 376.14, "duration": 7.14}, {"text": "If the heat source were at the top of the kettle, the water at the top of the kettle would warm up first,", "start": 383.28, "duration": 4.42}, {"text": "and it would basically stay put, so the colder water wouldn’t be able to take its place.", "start": 387.7, "duration": 4.499}, {"text": "As a result, the warm and cold water wouldn’t get mixed around, so it wouldn’t be heated by convection.", "start": 392.2, "duration": 4.86}, {"text": "Finally, there’s radiation, which doesn't\ndepend on the movement of molecules.", "start": 397.06, "duration": 3.419}, {"text": "Instead, heat is transferred by electromagnetic\nwaves.", "start": 400.479, "duration": 3.44}, {"text": "We normally consider the infrared part of\nthe spectrum to be heat.", "start": 403.92, "duration": 3.44}, {"text": "And we can describe the way heat radiates\nfrom an object over time with an equation,", "start": 407.37, "duration": 3.68}, {"text": "just like we do for conduction, but this one\nworks a little differently.", "start": 411.05, "duration": 2.92}, {"text": "The bigger the object’s area, the faster\nit will radiate heat.", "start": 413.97, "duration": 2.909}, {"text": "And the same is true for temperature.", "start": 416.88, "duration": 1.8}, {"text": "Specifically, the amount of heat that an object radiates over time is proportional to its temperature raised to the fourth power.", "start": 418.68, "duration": 6.26}, {"text": "Meaning, if you double an object’s temperature,\nyou multiply the heat it radiates over time by sixteen.", "start": 424.94, "duration": 5.24}, {"text": "So temperature’s a big deal when it comes\nto radiation.", "start": 430.189, "duration": 2.491}, {"text": "But radiation also depends on what’s known as the emissivity constant, which is based on a material’s inherent ability to radiate heat.", "start": 432.68, "duration": 7.58}, {"text": "The higher the emissivity constant, the more\nit radiates.", "start": 440.26, "duration": 3.08}, {"text": "The equation that combines all these variables\ntogether to describe how much heat an object", "start": 443.34, "duration": 3.9}, {"text": "radiates over time is called the Stefan-Boltzmann\nequation.", "start": 447.24, "duration": 3.12}, {"text": "And it says that heat emitted over time is equal to the emissivity constant x a special number known as the Stefan-Boltzmann constant", "start": 450.36, "duration": 6.86}, {"text": "x the object’s area x temperature\nraised to the fourth power.", "start": 457.22, "duration": 3.78}, {"text": "Now that we’ve gone through all the different\nways that heat transfers, we can finally answer", "start": 461.0, "duration": 4.84}, {"text": "Why do we wear clothes?", "start": 465.84, "duration": 1.46}, {"text": "Well, it’s simple: Otherwise, we’d lose\na lot of heat.", "start": 467.3, "duration": 2.73}, {"text": "Your body loses heat in all kinds of ways.", "start": 470.03, "duration": 2.43}, {"text": "One of the main ones is convection -- if your skin is warmer than the surrounding air, then you’ll transfer heat to the air.", "start": 472.46, "duration": 5.88}, {"text": "And air moves around a lot, so pretty soon, the warmer air gets swept away and replaced by cooler air, and you lose more heat from heating up that replacement air.", "start": 478.34, "duration": 7.92}, {"text": "Clothes help by trapping air against your skin.", "start": 486.26, "duration": 2.28}, {"text": "Sure, you lose heat as you warm up that air, but then the warm air stays close to your body, so you don’t lose too much more.", "start": 488.54, "duration": 5.0}, {"text": "You can also lose heat through radiation.", "start": 493.54, "duration": 2.34}, {"text": "If the walls, floor, and ceiling of the room you’re in are colder than you, you’ll radiate more heat to them than they’ll radiate to you.", "start": 495.88, "duration": 7.0}, {"text": "Clothes don’t stop you from radiating heat, but they can keep you warm enough for the heat that your body produces to keep up with the heat you’re losing through radiation.", "start": 502.88, "duration": 8.279}, {"text": "Just another good reason to stay dressed,\nwhenever possible.", "start": 511.159, "duration": 3.121}, {"text": "Today, you learned about thermal energy, as\nwell as heat, and how much of it you need", "start": 514.28, "duration": 3.47}, {"text": "for both temperature changes and phase changes.", "start": 517.75, "duration": 2.46}, {"text": "We also talked about heat flow through conduction,\nconvection, and radiation.", "start": 520.21, "duration": 4.141}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 524.36, "duration": 3.7}, {"text": "You can head over to their channel to check\nout a playlist of the latest shows like It's Okay to Be Smart, Blank on Blank, and Gross Science.", "start": 528.06, "duration": 7.8}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 535.86, "duration": 4.5}, {"text": "with the help of these amazing people and\nour equally amazing graphics team, is Thought Cafe.", "start": 540.37, "duration": 4.8}]