[{"text": "This lecture is about the polarization of \nlight. I'll start with these summary slides  ", "start": 0.4, "duration": 3.6}, {"text": "displaying everything we'll be going \nover. This is most of the information,  ", "start": 4.0, "duration": 3.04}, {"text": "and we'll also be talking about \na few graphs of polarized light.", "start": 7.04, "duration": 3.52}, {"text": "To understand polarization you need to \nunderstand the difference between polarized  ", "start": 13.44, "duration": 3.52}, {"text": "and unpolarized light. In unpolarized light, \nthe electric field oscillates in every 2d plane  ", "start": 16.96, "duration": 5.92}, {"text": "along the direction of the light's motion. As \nan example, the red arrow I've drawn on the left  ", "start": 22.88, "duration": 4.56}, {"text": "shows light moving to the right. If i place \na two-dimensional surface along that line,  ", "start": 27.44, "duration": 4.16}, {"text": "if the light is unpolarized i know that no \nmatter what direction that 2d plane exists in,  ", "start": 32.48, "duration": 4.48}, {"text": "there's definitely an oscillation of an electric \nfield along that plane. That was a vertical plane.  ", "start": 36.96, "duration": 5.12}, {"text": "And if i make a horizontal plane I also know that \nthe electric field is oscillating along that plane  ", "start": 42.08, "duration": 4.56}, {"text": "because it oscillates along every possible \n2-dimensional plane along the line of the  ", "start": 46.64, "duration": 4.16}, {"text": "light's motion. If you look at the bottom, I \nhave a view of the light from the front. So you  ", "start": 50.8, "duration": 3.52}, {"text": "can see right now I have the electric field \noscillating up and down and left and right,  ", "start": 54.32, "duration": 3.92}, {"text": "but in unpolarized light that oscillation actually \nhappens along every possible 2-dimensional plane.  ", "start": 58.24, "duration": 5.04}, {"text": "So any line that I choose would have an \noscillation on it, so that's the definition  ", "start": 64.8, "duration": 4.48}, {"text": "of unpolarized light. In unpolarized light, the \nelectric field oscillates along every 2D plane  ", "start": 69.28, "duration": 5.68}, {"text": "along its axis of motion. In polarized light, \nthe electric field oscillates along just one  ", "start": 74.96, "duration": 4.72}, {"text": "2-dimensional plane along the direction of the \nlight's motion. So this is what polarized light  ", "start": 79.68, "duration": 4.56}, {"text": "would look like in comparison to unpolarized \nlight. If you look at the view from the front,  ", "start": 84.24, "duration": 3.68}, {"text": "you can see that it's only oscillating along \none plane. In this case it's only oscillating  ", "start": 87.92, "duration": 3.84}, {"text": "along that up-down line, which we can see is a \n2-dimensional plane if we look at the side view,  ", "start": 91.76, "duration": 4.56}, {"text": "but it's only oscillating in that one up-down \nway. It's not oscillating along any other plane.  ", "start": 96.32, "duration": 5.12}, {"text": "That's the difference between unpolarized and \npolarized light. This is the notation that we  ", "start": 101.44, "duration": 4.08}, {"text": "use for unpolarized and polarized light. \nYou can see that with unpolarized light  ", "start": 105.52, "duration": 3.28}, {"text": "it oscillates along every direction whereas with \npolarized light it only oscillates in one plane,  ", "start": 108.8, "duration": 4.24}, {"text": "so we use those arrows to show which direction \nthe light is oscillating as it moves forward.  ", "start": 113.76, "duration": 4.0}, {"text": "Just to put that in writing: the unpolarized \nlight notation symbolizes light oscillating  ", "start": 118.48, "duration": 3.84}, {"text": "along every possible plane. The view is as \nif the light is moving straight towards us,  ", "start": 122.32, "duration": 4.0}, {"text": "and the polarized light notation symbolizes light \noscillating along only one plane. The angle of the  ", "start": 126.32, "duration": 5.36}, {"text": "line shows the angle of the plane. The view is \nas if the light is moving straight toward us.  ", "start": 131.68, "duration": 4.48}, {"text": "You're now in a position where you can understand \npolarization, which is the process of changing  ", "start": 136.16, "duration": 4.08}, {"text": "unpolarized light into polarized light: changing \nfrom light with an oscillating electric field  ", "start": 140.24, "duration": 4.72}, {"text": "along every 2D plane to only one 2D plane. \nThere are two ways we can polarize light. The  ", "start": 144.96, "duration": 5.12}, {"text": "first way is to pass it through a polarizer, \nwhich is a filter that only opens along one  ", "start": 150.08, "duration": 4.24}, {"text": "axis and polarizes unpolarized light that \npasses through it along that one axis. So if  ", "start": 154.32, "duration": 4.96}, {"text": "this unpolarized light encounters that polarizer, \nthe polarizer polarizes the light along that axis.  ", "start": 159.28, "duration": 5.6}, {"text": "So that would be what the polarized light would \nlook like. It would specifically only oscillate  ", "start": 165.68, "duration": 3.76}, {"text": "along the plane opened up by the polarizer. The \nother way to polarize light is to reflect light  ", "start": 169.44, "duration": 4.96}, {"text": "off a surface. When unpolarized light is reflected \noff a surface, it leaves the surface as polarized  ", "start": 174.4, "duration": 4.96}, {"text": "light only oscillating along the 2D plane parallel \nto the surface itself. So if this unpolarized  ", "start": 179.36, "duration": 5.44}, {"text": "light encounters a horizontal surface, the only \npart of the light that will be reflected is the  ", "start": 184.8, "duration": 4.16}, {"text": "horizontal polarized component of the light. So it \nwould leave the surface as horizontally polarized  ", "start": 188.96, "duration": 5.6}, {"text": "light. When light is polarized its intensity is \ndivided by 2. One way to think of this is that all  ", "start": 194.56, "duration": 5.2}, {"text": "planes of the unpolarized light can be thought \nof as made up of 2 perpendicular components,  ", "start": 199.76, "duration": 4.64}, {"text": "like an x-axis and a y-axis, and if you take away \none of the components you lose 1/2 of the energy  ", "start": 204.4, "duration": 5.84}, {"text": "that the wave is carrying, so the oscillations of \nunpolarized light can ultimately be thought of as  ", "start": 210.24, "duration": 4.72}, {"text": "having components in 2 perpendicular directions \nwhereas polarized light only has components in  ", "start": 214.96, "duration": 4.72}, {"text": "one direction, so you basically took away half the \nlight, so you're left with half of the intensity.  ", "start": 219.68, "duration": 4.72}, {"text": "This is probably the most common thing students \nforget when doing polarization problems.  ", "start": 224.4, "duration": 4.4}, {"text": "If polarized light is passed through a second \nfilter, its intensity is reduced by a specific  ", "start": 228.8, "duration": 4.0}, {"text": "amount relative to the angle between the first and \nsecond filter. We call the second filter the light  ", "start": 232.8, "duration": 4.72}, {"text": "passes through an analyzer. The only part of the \npolarized light that can pass through the analyzer  ", "start": 237.52, "duration": 4.64}, {"text": "is the component parallel to the analyzer's \nopening. This means the light leaving the  ", "start": 242.16, "duration": 4.08}, {"text": "analyzer will have a smaller amplitude than the \nlight entering it, so we'll follow through this  ", "start": 246.24, "duration": 4.0}, {"text": "full process: unpolarized light encounters a \npolarizer and is then polarized along that one  ", "start": 250.24, "duration": 5.04}, {"text": "axis, and now exists as polarized light when \nit encounters the analyzer. The only component  ", "start": 255.28, "duration": 4.72}, {"text": "of it that can pass through the analyzer is the \ncomponent parallel to the opening of the analyzer,  ", "start": 260.0, "duration": 4.72}, {"text": "which is smaller than that original polarized \nlight. It has a reduced amplitude, so I remember  ", "start": 264.72, "duration": 4.96}, {"text": "the amplitude of a wave is the distance from \nthe center of a wave to the top of the wave,  ", "start": 269.68, "duration": 4.56}, {"text": "and I can see that the distance on this final \npolarized light from the center to the top is less  ", "start": 275.12, "duration": 4.88}, {"text": "than that distance in the original unpolarized \nlight. So after the light leaves the analyzer,  ", "start": 280.0, "duration": 4.64}, {"text": "if there's any angular difference \nbetween the analyzer and the polarizer,  ", "start": 284.64, "duration": 3.68}, {"text": "the light will have a reduced amplitude. Notice \nhere that passing unpolarized light through a  ", "start": 288.32, "duration": 4.88}, {"text": "polarizer cannot reduce the amplitude of the \nlight. No matter the angle, the final amplitude  ", "start": 293.2, "duration": 5.36}, {"text": "is the same as the original unpolarized light, so \nthe polarizer does not reduce the amplitude. It's  ", "start": 298.56, "duration": 5.44}, {"text": "the analyzer that does that later on in the second \npart of polarization. We call the specific angled  ", "start": 304.0, "duration": 5.04}, {"text": "lines of the polarizer or analyzer the \"axis \nof transmission\" or the \"transmission axis.\"  ", "start": 309.04, "duration": 4.72}, {"text": "As an example, the difference in angle between \nthe axes of transmission of this analyzer and  ", "start": 314.48, "duration": 4.16}, {"text": "polarizer is 30 degrees, because one is angled at \n120 and the other is angled at 90. We would say  ", "start": 318.64, "duration": 5.36}, {"text": "that the difference between their axes of \ntransmission is 30 degrees. We can determine the  ", "start": 324.0, "duration": 4.88}, {"text": "intensity of the light after it passes through the \nanalyzer using geometry. Remember from a previous  ", "start": 328.88, "duration": 4.64}, {"text": "lecture that light intensity is proportional to \nthe light's amplitude squared. This means that  ", "start": 333.52, "duration": 4.32}, {"text": "the intensity is equal to a constant times the \namplitude squared. We can use this to prove a new  ", "start": 337.84, "duration": 5.04}, {"text": "equation. So i'm going to imagine that we have \npolarized light and it encounters the analyzer,  ", "start": 342.88, "duration": 4.48}, {"text": "and I can see that the amplitude of the wave \nleaving the analyzer is smaller than the wave  ", "start": 349.04, "duration": 4.08}, {"text": "going in, but I want to understand exactly \nhow those 2 amplitudes compare to each other,  ", "start": 353.12, "duration": 4.56}, {"text": "so I'm going to break this down \nwith geometry. Just as a note,  ", "start": 357.68, "duration": 3.04}, {"text": "whenever I talk about theta in these problems, I \nmean the angle between the polarizer and analyzer,  ", "start": 360.72, "duration": 5.28}, {"text": "so if I just kind of erase this analyzer I can see \nthat this is the amplitude of the original light.  ", "start": 366.0, "duration": 5.44}, {"text": "This is the new amplitude of the light after \nit goes through the analyzer. Remember,  ", "start": 371.44, "duration": 3.84}, {"text": "amplitude is just the distance from the center \nof the wave to the highest point of the wave,  ", "start": 375.28, "duration": 4.24}, {"text": "and this is the angular difference between the \naxis of transmission of the polarizer and the  ", "start": 379.52, "duration": 4.48}, {"text": "axis of transmission of the analyzer. It's just \nthe angle difference in how the two things open.  ", "start": 384.0, "duration": 5.28}, {"text": "I can see that the original amplitude and the \nnew amplitude are connected by cosine. The new  ", "start": 389.28, "duration": 4.16}, {"text": "amplitude is equal to the original amplitude \ntimes cosine of theta. I want an equation for  ", "start": 393.44, "duration": 4.48}, {"text": "the light's intensity, so I'm going to get this in \nterms of amplitude squared by squaring both sides  ", "start": 397.92, "duration": 4.64}, {"text": "of the equation. I'll then pretend that I multiply \nboth sides of that equation by that constant C,  ", "start": 402.56, "duration": 4.24}, {"text": "and when I do that, because I have the new \namplitude on the left and the original amplitude  ", "start": 407.36, "duration": 3.76}, {"text": "on the right, those two things are equal to \nthe new intensity on the left and the original  ", "start": 411.12, "duration": 4.16}, {"text": "intensity on the right. This equation is more \ncommonly written like this: intensity is equal  ", "start": 415.28, "duration": 4.72}, {"text": "to original intensity times cosine squared. \nThis equation is usually called Malus's Law  ", "start": 420.0, "duration": 5.2}, {"text": "and it governs how the intensity of polarized \nlight changes when it passes through an analyzer.  ", "start": 425.2, "duration": 4.8}, {"text": "Just to put that in writing, the intensity \nof polarized light passed through an analyzer  ", "start": 430.0, "duration": 4.16}, {"text": "is equal to the intensity of the polarized \nlight before it passes through the analyzer  ", "start": 434.16, "duration": 4.0}, {"text": "multiplied by the cosine of the angle between the \nanalyzer and the polarizer, so this is the angle  ", "start": 438.16, "duration": 4.88}, {"text": "that I'm referring to if I redraw the opening \nof the analyzer over the polarizer. This is not  ", "start": 443.04, "duration": 5.44}, {"text": "the end of the lecture, but i'm going to pause \nand do some example problems with what we've  ", "start": 448.48, "duration": 3.2}, {"text": "covered so far. In Example 1: unpolarized light \nhas an intensity of 50.0 watts per meter squared.  ", "start": 451.68, "duration": 5.52}, {"text": "It passes through a vertical polarizer and then \nan analyzer at a 30 degree angle from each other.  ", "start": 457.2, "duration": 5.12}, {"text": "What is the intensity of the light leaving the \nanalyzer? So we'll just start to draw this out.  ", "start": 462.32, "duration": 4.0}, {"text": "Before going through the polarizer, the \nintensity is 50.0 watts per meter squared.  ", "start": 466.32, "duration": 4.0}, {"text": "After passing through the polarizer, I \nremember that unpolarized light being polarized  ", "start": 470.96, "duration": 4.72}, {"text": "is always multiplied by 0.5 (by one half) \nso the new intensity I is equal to 25.0  ", "start": 475.68, "duration": 6.32}, {"text": "watts per meter squared. The polarizer \nalways multiplies the intensity by 0.5,  ", "start": 482.0, "duration": 4.72}, {"text": "and that's probably the most common thing that \nstudents forget when they're doing these problems.  ", "start": 486.72, "duration": 3.76}, {"text": "They'll often just assume the light doesn't lose \nany intensity in the polarizer and record the  ", "start": 490.48, "duration": 3.84}, {"text": "intensity as the same before and after, but \nit's actually always multiplied by 0.5 when  ", "start": 494.32, "duration": 4.64}, {"text": "it goes from unpolarized light to polarized \nlight. After passing through the analyzer,  ", "start": 498.96, "duration": 4.32}, {"text": "the intensity before the analyzer is multiplied \nby cosine of 30 degrees squared because of Malus's  ", "start": 503.28, "duration": 5.52}, {"text": "Law. So multiplying that out, the new intensity I \nis equal to 18.8 watts per meter squared. Again,  ", "start": 508.8, "duration": 5.92}, {"text": "Malus's Law is telling us that the intensity \nof light after it passes through an analyzer  ", "start": 514.72, "duration": 4.48}, {"text": "is equal to the intensity of the polarized \nlight before it passes through the analyzer  ", "start": 519.2, "duration": 4.08}, {"text": "multiplied by cosine of the angle of difference \nbetween the polarizer and analyzer squared. When I  ", "start": 523.28, "duration": 5.44}, {"text": "plug in 25.0 by cosine of 30 degrees squared I get \na final answer of 18.8 watts per meter squared,  ", "start": 528.72, "duration": 5.84}, {"text": "so that's the intensity of the light leaving \nthe analyzer. I can also work backwards and say  ", "start": 535.2, "duration": 4.8}, {"text": "light leaving an analyzer has an intensity of 30 \nwatts per meter squared. If the analyzer makes a  ", "start": 540.0, "duration": 5.04}, {"text": "60 degree angle with the polarizer, what was the \nintensity of the unpolarized light entering the  ", "start": 545.04, "duration": 4.48}, {"text": "polarizer? So we have this light coming out, \nan intensity of 30.0 watts per meter squared,  ", "start": 549.52, "duration": 5.12}, {"text": "and because the analyzer multiplies the \nintensity by cosine of 60 degrees squared,  ", "start": 556.0, "duration": 4.16}, {"text": "the light before the analyzer has an \nintensity equal to the intensity after  ", "start": 560.16, "duration": 3.68}, {"text": "divided by cosine of 60 degrees squared. So \njust working backwards, if light going through  ", "start": 563.84, "duration": 5.04}, {"text": "the analyzer is multiplied by cosine of theta \nsquared, tracing our steps backwards would require  ", "start": 568.88, "duration": 4.96}, {"text": "us to divide by cosine of theta squared to get an \nintensity before of 120 watts per meter squared,  ", "start": 573.84, "duration": 6.08}, {"text": "and the polarizer multiplies the intensity by \n0.5, so the light before the polarizer's intensity  ", "start": 579.92, "duration": 5.36}, {"text": "equals the intensity after divided by 0.5. So \nwe're just working backwards here. Therefore,  ", "start": 585.28, "duration": 5.36}, {"text": "before going through the polarizer the light \nhad an intensity of 240 watts per meter squared.  ", "start": 590.64, "duration": 5.36}, {"text": "In Example Problem 3: polarized light leaves \na polarizer with an angle of transmission of  ", "start": 596.0, "duration": 4.32}, {"text": "90 degrees. The polarized light has an \nintensity of 10 watts per meter squared.  ", "start": 600.32, "duration": 4.64}, {"text": "It impacts an analyzer and leaves with an \nintensity of 6 watts per meter squared.  ", "start": 604.96, "duration": 4.48}, {"text": "What is the angle of transmission of the analyzer? \nSo we know that we have 10 watts per meter squared  ", "start": 609.44, "duration": 4.72}, {"text": "going in and 6 watts per meter squared going \nout, and I know that Malus's Law applies here,  ", "start": 614.16, "duration": 4.96}, {"text": "so I can plug in the numbers that I have \nfor the original and the new intensity  ", "start": 620.0, "duration": 3.28}, {"text": "and then isolate theta by itself, and I'm \nleft with 39.6 degrees and that's theta,  ", "start": 624.08, "duration": 5.36}, {"text": "so that's equal to the difference between the two \nangles of transmission. I remember that theta in  ", "start": 631.28, "duration": 4.48}, {"text": "Malus's Law is equal to the difference \nbetween the two angles of transmission  ", "start": 635.76, "duration": 3.76}, {"text": "so that means that 90 minus the angle of \nthe analyzer is equal to that difference,  ", "start": 640.32, "duration": 4.4}, {"text": "and that difference could be plus or minus. \nIt's just the difference between them,  ", "start": 645.52, "duration": 3.04}, {"text": "so it could be either positive or negative 39.6 \ndegrees. It has the same result in Malus's Law,  ", "start": 649.28, "duration": 5.12}, {"text": "so either one is an option. Isolating \nthe missing variable gets me that the  ", "start": 654.4, "duration": 4.8}, {"text": "angle of transmission of the analyzer \nis either 129.6 degrees or 50.4 degrees,  ", "start": 659.2, "duration": 5.76}, {"text": "so that's an important note: the angle in Malus's \nLaw is the difference between the two angles of  ", "start": 666.16, "duration": 5.12}, {"text": "transmission. It's not either one of the angles \nof transmission, it's the difference between them.  ", "start": 671.28, "duration": 4.72}, {"text": "Moving back into the concepts, sunglasses are \na common real-world example of polarization.  ", "start": 676.0, "duration": 4.72}, {"text": "Sunglasses are meant to reduce glare, so \nthe goal is to reduce the intensity of light  ", "start": 680.72, "duration": 3.92}, {"text": "passing through as much as possible, and because \nlight reflecting off of horizontal surfaces is  ", "start": 684.64, "duration": 4.8}, {"text": "polarized horizontally, vertically polarized \nglasses will reduce the intensity the most  ", "start": 689.44, "duration": 4.72}, {"text": "because cosine of 90 degrees is zero. Because \nmost surfaces that we look at are horizontal,  ", "start": 694.16, "duration": 5.36}, {"text": "it makes sense to polarize the glasses vertically \nbecause when light from the sun is polarized on  ", "start": 699.52, "duration": 4.72}, {"text": "the surface it's polarized horizontally, \nso when that horizontal light impacts the  ", "start": 704.24, "duration": 4.8}, {"text": "vertically polarized glasses the angle between \nthe polarized light and the opening of the glasses  ", "start": 709.04, "duration": 5.68}, {"text": "is 90 degrees, and we can use Malus's Law to show \nthat when you have cosine of 90 degrees there the  ", "start": 714.72, "duration": 6.08}, {"text": "final intensity passing through the sunglasses \nwill just be zero watts per meter squared.  ", "start": 720.8, "duration": 4.48}, {"text": "You can see this in this video that this actually \ndoes happen. When you put on polarized sunglasses,  ", "start": 725.28, "duration": 4.0}, {"text": "the intensity of the sunlight is very drastically \nreduced because it's bouncing off the horizontal  ", "start": 729.28, "duration": 4.56}, {"text": "water, and the sunglasses are vertically polarized \nso they cancel out the maximum amount of sunlight,  ", "start": 733.84, "duration": 5.36}, {"text": "and you're left with much less glare and can see \na lot more under the surface of the water as a  ", "start": 739.2, "duration": 4.08}, {"text": "result. This is the last part of the lecture \nwhere we'll talk about intensity versus angle  ", "start": 743.28, "duration": 4.16}, {"text": "graphs for polarized light. We can draw a graph of \nthe intensity of the transmitted light versus the  ", "start": 747.44, "duration": 4.8}, {"text": "angle of the polarizer or analyzer. You can see I \nhave the intensity of the transmitted light on the  ", "start": 752.24, "duration": 4.96}, {"text": "y-axis and the change in the angle of the analyzer \non the x-axis, and this is going to be a graph of  ", "start": 757.2, "duration": 5.44}, {"text": "light passing through this specific polarizer and \nanalyzer on the left and I'm going to be graphing  ", "start": 762.64, "duration": 5.92}, {"text": "the value of I with respect to I-0. Just an \nimportant note: the angle being graphed is not the  ", "start": 768.56, "duration": 6.48}, {"text": "angle in Malus's Law I =I0 times cosine of theta \nsquared. The angle in Malus's Law is the angle  ", "start": 775.04, "duration": 6.32}, {"text": "difference between the angles of transmission \nof the polarizer and analyzer. The angle being  ", "start": 781.36, "duration": 4.48}, {"text": "graphed is just the change in angle of the \nanalyzer from an arbitrary starting point. That  ", "start": 785.84, "duration": 4.88}, {"text": "was a long pretty complicated definition, so i'm \ngoing to also write down what I mean here. Malus's  ", "start": 790.72, "duration": 4.64}, {"text": "law says that the intensity will be equal to the \noriginal intensity times cosine of theta squared,  ", "start": 795.36, "duration": 4.48}, {"text": "and I'm going to rewrite that as the original \nintensity times cosine of this specific angle  ", "start": 800.56, "duration": 5.04}, {"text": "formula squared. I can see that the polarizer and \nanalyzer are starting with no angular difference,  ", "start": 805.6, "duration": 5.52}, {"text": "and then the additional angle between \nthem will just be any change I make in  ", "start": 811.12, "duration": 3.52}, {"text": "the angle of the analyzer, so purple theta there \nrepresents the change in angle of the analyzer  ", "start": 814.64, "duration": 5.36}, {"text": "and the analyzer is starting at 0 degrees and the \noriginal angle between the analyzer and polarizer  ", "start": 820.8, "duration": 4.8}, {"text": "is also 0 degrees. So this is starting at the \nvalue of I0 times cosine of zero squared and  ", "start": 825.6, "duration": 5.44}, {"text": "I know that cosine of 0 is 1, so this graph will \nphysically start at the position I0 and then take  ", "start": 831.04, "duration": 5.68}, {"text": "the shape of cosine of theta squared starting \nfrom an angle of 0. So you can see I'm turning  ", "start": 836.72, "duration": 6.64}, {"text": "the analyzer and this is the resulting intensity \nof the light coming out of the analyzer, so this  ", "start": 843.36, "duration": 6.16}, {"text": "graph shows the intensity of the transmitted \nlight on the y-axis and the change in the angle  ", "start": 849.52, "duration": 4.08}, {"text": "of the analyzer on the x-axis. I could start the \nanalyzer at a 90 degree angle to the polarizer,  ", "start": 853.6, "duration": 5.68}, {"text": "and in this case the difference in angle at \nthe beginning is 90 degrees, and I'm starting  ", "start": 860.24, "duration": 5.84}, {"text": "at a point where the analyzer hasn't been turned \nmore yet, so theta is going to start off at 0,  ", "start": 866.08, "duration": 5.28}, {"text": "and because the purple theta is starting off at \n0 I'm dealing with the original intensity times  ", "start": 871.36, "duration": 5.04}, {"text": "cosine of 90 degrees squared, and I know that \ncosine of 90 degrees is 0, so this whole thing  ", "start": 876.4, "duration": 4.48}, {"text": "will be 0 at the beginning and so now as I turn \nthe analyzer and increase the angle of cosine,  ", "start": 880.88, "duration": 5.52}, {"text": "this is going to take the form of a cosine squared \ngraph. Just starting at what would be 90 degrees  ", "start": 886.4, "duration": 5.28}, {"text": "instead of 0 degrees, so this is what that graph \nof intensity versus the change in the angle of  ", "start": 891.68, "duration": 5.2}, {"text": "the analyzer would look like. In example number 3 \nthe original light is now being passed through the  ", "start": 896.88, "duration": 5.52}, {"text": "polarizer, so it's starting off as unpolarized \nlight and emerging as polarized light and then  ", "start": 902.4, "duration": 4.96}, {"text": "going through the analyzer, and we're graphing \nthe light that comes out of the analyzer,  ", "start": 907.36, "duration": 4.8}, {"text": "so in this case the intensity is actually going \nto be multiplied by 0.5 as it goes through the  ", "start": 912.16, "duration": 4.64}, {"text": "polarizer and then be multiplied by cosine of \ntheta squared as it goes through the analyzer,  ", "start": 916.8, "duration": 4.72}, {"text": "so the full equation for the intensity will be \n1/2 of the original intensity times cosine of  ", "start": 922.88, "duration": 4.64}, {"text": "theta squared, and here we're starting at an \nangular difference of 0 degrees between the  ", "start": 927.52, "duration": 4.88}, {"text": "polarizer and analyzer. They're starting at \nthe same angle in comparison to each other,  ", "start": 932.4, "duration": 4.16}, {"text": "so if purple theta is also 0, cosine \nof 0 is 1, so the value at 0 degrees  ", "start": 936.56, "duration": 5.12}, {"text": "is going to be 1 times 0.5 times the original \nintensity, so that will be where it starts.  ", "start": 941.68, "duration": 5.92}, {"text": "This is then going to take the form of a cosine \nsquared graph that starts at 0 degrees so as the  ", "start": 949.44, "duration": 4.56}, {"text": "analyzer turns this is what that graph is going to \nlook like it's never going to get higher than 0.5  ", "start": 954.0, "duration": 4.96}, {"text": "times the original intensity, because that's the \nintensity of the light going into the analyzer,  ", "start": 958.96, "duration": 5.28}, {"text": "so it's never going higher than this line here. In \nexample number 4 I'm going to turn the polarizer  ", "start": 965.36, "duration": 4.96}, {"text": "instead of the analyzer. Everything is starting \nthe same, so this is going to start at the same  ", "start": 970.32, "duration": 4.32}, {"text": "position. I'm just doing this to show you that \nwhen I turn the polarizer instead of the analyzer,  ", "start": 974.64, "duration": 5.2}, {"text": "that actually doesn't make a difference because \nwhat's affecting this graph is the difference  ", "start": 979.84, "duration": 3.52}, {"text": "between the two angles, so whether I'm turning the \npolarizer or analyzer doesn't actually result in  ", "start": 983.36, "duration": 5.6}, {"text": "a different graph at the end because what matters \nis the difference in angle between the polarizer  ", "start": 988.96, "duration": 4.48}, {"text": "and analyzer if i'm using both and observing \nthe light that comes out of the analyzer.  ", "start": 993.44, "duration": 4.16}, {"text": "There's a common trick question that students are \ngiven where you have unpolarized light passing  ", "start": 998.4, "duration": 4.16}, {"text": "through a polarizer, but there's no analyzer \ninvolved. You're just asked: what would the  ", "start": 1002.56, "duration": 3.92}, {"text": "graph look like as the polarizer turns where the \nunpolarized light is the original intensity and  ", "start": 1006.48, "duration": 4.96}, {"text": "the intensity that you're graphing is the light \nleaving the polarizer? So remember that no matter  ", "start": 1011.44, "duration": 5.12}, {"text": "what angle the polarizer is at, it's always \ngoing to reduce the original intensity by 0.5.  ", "start": 1016.56, "duration": 4.96}, {"text": "There's no cosine squared involved because we're \nnot using the analyzer on the polarized light,  ", "start": 1021.52, "duration": 4.48}, {"text": "so no matter what the polarizer is just going \nto reduce the original intensity by 0.5,  ", "start": 1026.0, "duration": 4.4}, {"text": "so it's going to start here, and no matter how \nwe turn the polarizer it's always going to just  ", "start": 1031.28, "duration": 4.56}, {"text": "polarize the light and reduce its intensity by \none half, so that's kind of a trick question that  ", "start": 1035.84, "duration": 5.84}, {"text": "shows up every now and then. So a graph of just a \npolarizer turning where unpolarized light enters  ", "start": 1041.68, "duration": 5.68}, {"text": "and polarized light leaves is just 0.5 times \nthe original intensity. So this is the summary,  ", "start": 1047.36, "duration": 4.96}, {"text": "this is everything that we talked about. The \ndefinition of unpolarized and polarized light,  ", "start": 1052.32, "duration": 3.92}, {"text": "polarization, Malus's Law, and an everyday \nexample of polarization with sunglasses,  ", "start": 1056.24, "duration": 4.56}, {"text": "and the shapes of a few common graphs that \nappear in intensity versus angle graphs.", "start": 1061.68, "duration": 4.16}, {"text": "So that's what you need to know \nabout the polarization of light.", "start": 1068.72, "duration": 2.72}]