[{"text": "This episode is supported by Prudential.", "start": 3.24, "duration": 3.7}, {"text": "By now, thanks to our lesson on circuit analysis – and previous Crash Course Physics episodes – you know your way around a basic DC circuit.", "start": 6.94, "duration": 6.84}, {"text": "You’ve learned how to simplify circuits with resistors connected in series and parallel with a single battery source, which is great!", "start": 13.78, "duration": 5.2}, {"text": "But a lot of the real-world circuits that you encounter – and will have to describe – are much more complicated.", "start": 18.98, "duration": 5.28}, {"text": "For example, what happens when there are multiple\nbatteries, connected in parallel?", "start": 24.26, "duration": 4.16}, {"text": "And what happens when we add capacitors into\nthe mix, with resistors in our DC circuits?", "start": 28.42, "duration": 4.35}, {"text": "On this, our last go-round inside a DC circuit,\nwe’ll encounter junctions, loops, and capacitors!", "start": 32.77, "duration": 5.76}, {"text": "[Theme Music]", "start": 38.53, "duration": 12.35}, {"text": "Circuits aren’t always just a battery powering\na set of resistors.", "start": 50.88, "duration": 3.2}, {"text": "The design of a circuit depends on the needs of the system it operates, and we need tools to take any configuration into account.", "start": 54.08, "duration": 6.46}, {"text": "In the mid 19th century, a German physicist named Gustav Kirchhoff expanded on the principles of Ohm’s law to improve our ability to calculate current and voltage in complex electrical circuits.", "start": 60.54, "duration": 10.46}, {"text": "Kirchhoff took laws we already knew – the conservation of charge and of energy – and established two rules for circuit analysis.", "start": 71.0, "duration": 7.06}, {"text": "The first rule, which deals with conservation of charge, is something we’ve actually already discussed.", "start": 78.06, "duration": 4.46}, {"text": "It’s known as Kirchhoff’s Junction Rule, and it states that the sum of all currents entering into a junction is equal to the sum of all currents leaving the junction.", "start": 82.52, "duration": 7.72}, {"text": "Like I’ve been saying: What goes in must\ncome out!", "start": 90.24, "duration": 3.08}, {"text": "The second rule, based on the conservation of energy, is a little harder to grasp, but trust me, it works!", "start": 93.32, "duration": 4.9}, {"text": "It’s Kirchhoff’s Loop Rule, and it says that the sum of\nall changes in potential around a loop equals zero.", "start": 98.22, "duration": 5.78}, {"text": "So, why would you need to know that’s a\nthing?", "start": 104.0, "duration": 2.0}, {"text": "Well, remember, batteries supply potential, and then that potential, also called voltage, drops across resistors.", "start": 106.0, "duration": 6.18}, {"text": "It’s kind of like a ride on a roller coaster.", "start": 112.18, "duration": 1.96}, {"text": "You may climb up steep slopes and fly around the track, doing loop-da-loops to your heart’s content – and your stomach’s discontent – but you always start and end in the same place.", "start": 114.14, "duration": 8.68}, {"text": "Likewise, in a circuit, every battery is like a climb in height, gaining potential, and each resistor is a drop.", "start": 122.82, "duration": 5.96}, {"text": "But no matter which way you go in the circuit,\nyou’ll always end up where you started.", "start": 128.78, "duration": 3.68}, {"text": "So let’s put these rules to the test.", "start": 132.47, "duration": 1.86}, {"text": "Here’s a circuit that wouldn’t be easy\nto solve with only Ohm’s law.", "start": 134.33, "duration": 3.19}, {"text": "It has two batteries and four resistors, with a\ncombination of series and parallel connections.", "start": 137.52, "duration": 5.14}, {"text": "You can simplify the two resistors in series down to one, but after that, how do you tackle the rest?", "start": 142.66, "duration": 5.56}, {"text": "If you want to find the current through each branch, and the voltage drop across each resistor, you’re gonna need Gustav’s help!", "start": 148.22, "duration": 5.8}, {"text": "The first step of using the junction rule\nis to label all the junctions.", "start": 154.03, "duration": 3.57}, {"text": "Each junction is a point on a wire that’s\nconnected to two or more circuit elements.", "start": 157.6, "duration": 3.77}, {"text": "Then, you label all the different currents\nin the diagram.", "start": 161.37, "duration": 2.5}, {"text": "There are only three different wire branches,\nso there are three different currents in the circuit.", "start": 163.87, "duration": 4.25}, {"text": "Kirchhoff’s junction rule tells us that everything\nentering junction “a” must leave it too.", "start": 168.12, "duration": 4.34}, {"text": "Mathematically, this means that I2 is equal to the sum of I1 and I3, since it’s I2 that splits off into two branches.", "start": 172.46, "duration": 7.46}, {"text": "Notice, by the way, that we’ve assigned the current directions the way we have, because they make sense with the orientation of the batteries, going from the negative to positive terminal.", "start": 179.92, "duration": 8.32}, {"text": "But no matter which way you orient them, in your equations, all the values will work out the same way.", "start": 188.24, "duration": 5.18}, {"text": "If you’ve correctly chosen the direction of current, then their values will come out positive, like current should.", "start": 193.42, "duration": 4.88}, {"text": "But if you’ve chosen the wrong direction,\nthen the value will end up being negative!", "start": 198.31, "duration": 3.3}, {"text": "OK, back to the action.", "start": 201.61, "duration": 1.37}, {"text": "Let’s call the equation with the current values “equation one” and return to it later, when we need it.", "start": 202.98, "duration": 4.22}, {"text": "Now it’s time to try out Kirchhoff’s Loop\nRule!", "start": 207.2, "duration": 2.4}, {"text": "You can draw a loop around any part of the circuit where you can imagine a charged particle moving around the circuit in a circle, ending back where it started.", "start": 209.6, "duration": 7.1}, {"text": "To put it simply, wherever there’s a loop,\nwe can use the loop rule!", "start": 216.7, "duration": 3.16}, {"text": "We’ve got one loop in the top half of the circuit, and a second loop in the bottom half, and there’s actually a third loop here too.", "start": 219.86, "duration": 5.72}, {"text": "It’s the entire outside of the circuit!", "start": 225.58, "duration": 2.08}, {"text": "Now you’ve got your loops, and you’re going to use them to solve the three unknown current values.", "start": 227.66, "duration": 4.06}, {"text": "Let’s begin with loop number one.", "start": 231.72, "duration": 1.98}, {"text": "In this loop, you have one 20 Volt battery\nand two resistors, a 5 Ohm and a 40 Ohm one.", "start": 233.7, "duration": 5.379}, {"text": "You know that there’s a voltage gain across the battery and a voltage drop across both resistor 2 and resistor 1.", "start": 239.08, "duration": 5.46}, {"text": "The voltage gain across the battery is 20 Volts, but you don’t know the voltage drops across the resistors.", "start": 244.54, "duration": 5.58}, {"text": "Thanks to Ohm’s law, you can substitute the voltage drop across each resistor with the current times the resistance.", "start": 250.12, "duration": 5.9}, {"text": "Now you’ve got two unknowns in this equation,\nwhich we’ll call “equation two.”", "start": 256.03, "duration": 3.51}, {"text": "Let’s set that aside as well.", "start": 259.54, "duration": 1.52}, {"text": "Next, let’s look at loop two.", "start": 261.06, "duration": 1.78}, {"text": "In this loop, you’ve got two batteries and\nthree resistors.", "start": 262.84, "duration": 3.04}, {"text": "If you follow the direction of the loop, you see that both batteries add voltage, because the loop direction goes from their negative end through to the positive end.", "start": 265.88, "duration": 7.66}, {"text": "Additionally, all the resistors will subtract voltage, because the loop goes in the same direction as the current.", "start": 273.54, "duration": 5.26}, {"text": "So it’s important to draw your current directions\nfirst, in order to make this clear.", "start": 278.8, "duration": 3.92}, {"text": "Now, you want to do the same thing you did for the first loop, which is to sum up all the changes in voltage to 0.", "start": 282.72, "duration": 5.4}, {"text": "And then you just substitute Ohm’s law in for every resistor’s voltage, to get terms of current and resistance.", "start": 288.12, "duration": 5.26}, {"text": "Now you have this third equation, which we’ll\ncall “equation three.”", "start": 293.38, "duration": 2.88}, {"text": "While you could go on and create an equation for the third loop, you actually don’t need to, because the junction rule gives you an equation to use here.", "start": 296.26, "duration": 6.3}, {"text": "So at this point, you have the three equations\nyou need to solve everything!", "start": 302.56, "duration": 3.02}, {"text": "So let’s first revisit equation one and\nreplace I1 and I3 with equations two and three.", "start": 305.59, "duration": 6.02}, {"text": "Now you have an equation entirely in terms of I2, which you can solve to find that I2 is equal to 1 Ampere.", "start": 311.61, "duration": 6.07}, {"text": "Once you have this value, you can easily solve equations two and three by substituting in the new I2 solution.", "start": 317.68, "duration": 5.36}, {"text": "And there you go!", "start": 323.04, "duration": 1.14}, {"text": "If you wanted to know any of the voltage drops across the resistors, all you’d have to do is multiply the resistance in question by the current passing through that resistor.", "start": 324.18, "duration": 8.6}, {"text": "For instance, the voltage drop across resistor 2 would be the resistance, 5 Ohms, multiplied by the current passing through that resistor, which is 1 Ampere.", "start": 332.78, "duration": 8.6}, {"text": "That’s a total voltage drop of 5 Volts.", "start": 341.38, "duration": 2.61}, {"text": "And the drop across resistor 1 in the same loop would be the resistance, 40 Ohms, times the current through the resistor, which is 0.375 Amperes.", "start": 343.99, "duration": 8.18}, {"text": "That comes out to a voltage drop of 15 Volts, which makes sense, because then the sum of each drop in the loop is equal to the voltage supplied by the battery.", "start": 352.17, "duration": 7.69}, {"text": "And those are Kirchhoff’s Laws – the Junction Rule for current and the Loop Rule for voltage, with a little Ohm’s law utilization as well.", "start": 359.86, "duration": 6.48}, {"text": "Now it’s time to reintroduce our old friend,\nthe capacitor!", "start": 366.35, "duration": 2.87}, {"text": "In a DC circuit, a capacitor is useful for storing charge temporarily, then releasing it again later on.", "start": 369.22, "duration": 5.86}, {"text": "But so far we’ve been dealing with circuits that have a constant flow of charge, or those that have reached steady state.", "start": 375.08, "duration": 5.14}, {"text": "With capacitors, we deal with transient conditions,\nor circuit responses that change with time.", "start": 380.22, "duration": 5.1}, {"text": "From our earlier lessons, you know that the amount of charge stored in a capacitor is equal to the voltage across the capacitor times its capacitance.", "start": 385.32, "duration": 7.52}, {"text": "And you can store this charge by connecting a capacitor in series with a battery, letting current flow from the battery into the capacitor, until the capacitor’s voltage is equal to the battery's.", "start": 392.84, "duration": 9.4}, {"text": "But what happens when you connect multiple capacitors together, like we do with resistors, in series and in parallel?", "start": 402.24, "duration": 5.68}, {"text": "Well, if you have several capacitors connected in parallel, the overall capacitance of the circuit increases.", "start": 407.92, "duration": 5.4}, {"text": "In this circuit diagram, we have three capacitors\nconnected in parallel with a single battery.", "start": 413.32, "duration": 4.78}, {"text": "Current will flow into the capacitors, and will stop when each capacitor holds the maximum amount of charge.", "start": 418.1, "duration": 4.86}, {"text": "So, how can you describe the equivalent capacitance\nof a circuit like this?", "start": 422.96, "duration": 3.46}, {"text": "Easy: the total amount of charge is the sum\nof the charges held by each individual capacitor.", "start": 426.42, "duration": 4.72}, {"text": "And you know that the charge held by each capacitor is equal to the capacitance times the voltage across each one.", "start": 431.14, "duration": 5.78}, {"text": "And since every point of a conductor has the same potential, and all the conductors are connected, all devices connected in parallel will have the same voltage.", "start": 436.92, "duration": 7.86}, {"text": "So, you can simplify the charge equation to say that the equivalent capacitance of the circuit is equal to the sum of all the individual capacitances.", "start": 444.78, "duration": 7.5}, {"text": "Note that this is the not the same as the\nparallel equation for resistors!", "start": 452.28, "duration": 3.48}, {"text": "Capacitance is unique in this way.", "start": 455.76, "duration": 1.76}, {"text": "In fact, the convention is also reversed for capacitors connected in series, which will have a lower overall capacitance.", "start": 457.52, "duration": 5.94}, {"text": "For example, if you have a circuit with three capacitors connected in series with a single battery, then the current still stops flowing when the total voltage across the capacitors equals that of the battery.", "start": 463.46, "duration": 11.06}, {"text": "The charge contained by each capacitor is the same, because current can’t flow through the capacitors, only on either side of them.", "start": 474.52, "duration": 6.95}, {"text": "So if one plate of the first capacitor has a positive charge, then the other plate in that first capacitor has an equal and opposite negative charge.", "start": 481.48, "duration": 7.4}, {"text": "This leads the plate of the next capacitor\nto have an equal and opposite positive charge,", "start": 488.88, "duration": 4.2}, {"text": "since the amount of charge in the plates, and\nthe wire that connects them, hasn’t changed.", "start": 493.08, "duration": 4.22}, {"text": "But the nearby charged plate redistributes\nthe charge to compensate.", "start": 497.3, "duration": 3.4}, {"text": "This effect carries all the way through, until the last plate of the third capacitor has a negative charge equal and opposite to the first capacitor’s positive plate.", "start": 500.7, "duration": 7.82}, {"text": "So you can picture the entire set of capacitors\nas one big equivalent capacitor.", "start": 508.52, "duration": 4.959}, {"text": "For devices in series, the voltage drops across each element equal the voltage provided by the battery.", "start": 513.48, "duration": 5.04}, {"text": "So to find the equivalent capacitance in this case, just substitute in the charge equation (voltage-times-capacitance) for each voltage across the capacitors.", "start": 518.52, "duration": 8.84}, {"text": "The charge contained by each capacitor is still the same, since the charge on each positive and negative plate is the same for each capacitor.", "start": 527.36, "duration": 7.08}, {"text": "Therefore, you can factor out charge, and you’re left with the equation for equivalent capacitance of capacitors connected in series.", "start": 534.44, "duration": 5.82}, {"text": "So for series capacitors, the combined capacitance\nis less than the weakest individual capacitor.", "start": 540.26, "duration": 5.54}, {"text": "And guess what.", "start": 545.8, "duration": 1.28}, {"text": "This wraps up our review of electricity!", "start": 547.08, "duration": 2.71}, {"text": "Now all that’s left to learn about is the other side\nof this same force: the realm of magnetism!", "start": 549.79, "duration": 5.22}, {"text": "Today we learned about Kirchhoff’s Laws and how we can rework conservation of charge and of energy to analyze more complex  circuits.", "start": 555.01, "duration": 6.67}, {"text": "We also discussed how capacitors function in a typical DC circuit and the ways they behave when combined in series and parallel connections.", "start": 561.68, "duration": 7.74}, {"text": "Thanks to Prudential for sponsoring this episode.", "start": 569.42, "duration": 2.42}, {"text": "The time between when people think they should start saving for retirement and when they actually do is known as the Action Gap.", "start": 571.84, "duration": 5.59}, {"text": "According to a recent survey conducted by Prudential, the average American starts saving for retirement 7 years later than they think is best.", "start": 577.44, "duration": 7.66}, {"text": "That could cost you $410,675.92 in your lifetime.", "start": 585.1, "duration": 5.94}, {"text": "Another Prudential study found that 1 in 3\nAmericans is not saving enough for their retirement.", "start": 591.04, "duration": 4.44}, {"text": "Go to Raceforretirement.com and see how the\naction gap affects you.", "start": 595.48, "duration": 3.82}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 599.3, "duration": 4.1}, {"text": "You can head over to their channel to check out amazing shows like Indie America, Shanx FX, and Physics Girl.", "start": 603.4, "duration": 6.47}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 609.88, "duration": 4.28}, {"text": "with the help of these amazing people and our equally amazing graphics team is Thought Cafe.", "start": 614.16, "duration": 4.5}]