[{"text": "On November 14, 1971, NASA’s Mariner 9 probe, entered orbit around Mars, becoming the first spacecraft to orbit another planet.", "start": 3.06, "duration": 8.04}, {"text": "Its mission? Mainly, to take lots of pictures\nand map out the Martian surface.", "start": 11.1, "duration": 4.3}, {"text": "But mission engineers found themselves facing\na challenge that they’d never faced before on Earth.", "start": 15.41, "duration": 4.08}, {"text": "On our planet, we talk about altitude in terms\nof sea level.", "start": 19.49, "duration": 3.26}, {"text": "The highest point on Earth, for example, is at the top of Mount Everest, which is 8,850 meters above sea level.", "start": 22.75, "duration": 6.67}, {"text": "But Mars doesn’t have a sea.", "start": 29.42, "duration": 1.72}, {"text": "So the mission team had to pick something\nelse to use as a reference point.", "start": 31.15, "duration": 2.97}, {"text": "They chose the point where Mars’s atmospheric pressure was 6.105 millibars -- the minimum pressure that liquid water needs to exist.", "start": 34.12, "duration": 7.72}, {"text": "That’s right -- at very low pressures, liquid water just isn’t a thing, no matter the temperature.", "start": 41.84, "duration": 4.32}, {"text": "Why not?", "start": 46.16, "duration": 1.2}, {"text": "The answer lies in phase changes: what happens when molecules don’t quite live up to what we’d predict for an ideal gas.", "start": 47.36, "duration": 6.16}, {"text": "[Theme Music]", "start": 53.52, "duration": 12.8}, {"text": "We’ve talked before about temperature,\nand how it’s a measure of the kinetic energy\n-- the energy of motion -- of a substance.", "start": 66.32, "duration": 4.76}, {"text": "And we know that as temperature increases, so does kinetic energy, because of the kinetic theory of gases, which describes how ideal gas molecules behave.", "start": 71.08, "duration": 7.72}, {"text": "As you might remember from our last episode, a gas is considered ideal, if it fits a few basic assumptions:", "start": 78.8, "duration": 5.9}, {"text": "First, that the total volume of the gas molecules\nis much less than the volume of the container they’re in.", "start": 84.7, "duration": 4.66}, {"text": "Second, that these molecules only interact\nwith each other when they collide.", "start": 89.36, "duration": 3.5}, {"text": "And last, that the collisions are perfectly\nelastic, meaning that no energy is lost.", "start": 92.86, "duration": 4.34}, {"text": "The kinetic theory of gases is based on the idea that if you have all these gas molecules bouncing around, you can calculate the average kinetic energy of each particle.", "start": 97.2, "duration": 8.28}, {"text": "We’ve already talked about how, in general, the kinetic energy of an object is equal to half of its mass x its velocity squared.", "start": 105.48, "duration": 6.8}, {"text": "And the average kinetic energy of the ideal gas molecules in a container, is equal to half of a molecule’s mass x the average squared velocity of the molecules.", "start": 112.28, "duration": 8.14}, {"text": "And if you do the math, this average kinetic energy also turns out to be equal to 3/2 x a set constant k x the temperature.", "start": 120.42, "duration": 7.82}, {"text": "k is just equal to the constant R we talked about last time, divided by Avogadro’s number, 6.02 x 10^23, the number of molecules in a mole.", "start": 128.24, "duration": 8.92}, {"text": "This equation might not look like much, but it’s important because it tells you exactly how kinetic energy and temperature are related in an ideal gas", "start": 137.16, "duration": 7.48}, {"text": "As the kinetic energy of the gas increases,\ntemperature increases proportionally.", "start": 144.64, "duration": 4.24}, {"text": "We already knew that - but now we’ve done what we often have to do in physics which is back up our assumptions using math.", "start": 148.88, "duration": 4.939}, {"text": "Now, you may have noticed something a little unusual about the way we’ve been representing the velocity of these ideal gas molecules.", "start": 153.82, "duration": 5.38}, {"text": "We’ve been talking about their velocities\nin terms of averages, which makes sense,", "start": 159.2, "duration": 4.24}, {"text": "since we’re trying to describe the overall behavior\nof all the molecules, not individual ones.", "start": 163.44, "duration": 4.46}, {"text": "To get the average kinetic energy, we didn’t\njust take the average velocity and square it.", "start": 167.91, "duration": 3.92}, {"text": "Instead, we squared all the individual velocities, then used the average of those squared values.", "start": 171.83, "duration": 4.73}, {"text": "This whole average-squared-velocity thing, helps our math work out, and it’s important to remember when you’re analyzing an ideal gas.", "start": 176.56, "duration": 5.84}, {"text": "The square root of the average squared velocity\nis what we call the root mean square speed.", "start": 182.41, "duration": 3.7}, {"text": "We write it as v_RMS, and it’s a different\nnumber from the average speed.", "start": 186.11, "duration": 3.44}, {"text": "Say you know that a gas’s temperature is 300 Kelvin, and the mass of each molecule is 5.3 x 10^-26 kilograms.", "start": 189.55, "duration": 6.329}, {"text": "And you want to find the speed of a typical\nmolecule.", "start": 195.879, "duration": 3.06}, {"text": "Well, we have an equation for that!", "start": 198.94, "duration": 1.78}, {"text": "Half the mass x the average squared velocity\nis equal to 3/2 x k x the temperature.", "start": 200.72, "duration": 5.11}, {"text": "So, to get the typical speed of a gas molecule,\nyou’re going to want to find", "start": 205.83, "duration": 3.58}, {"text": "the square root of the average squared velocity, which\nis equal to the square root of 3 x k x the temperature divided by the mass.", "start": 209.41, "duration": 6.73}, {"text": "In this case, that works out to 484 m/s.", "start": 216.14, "duration": 2.92}, {"text": "But 484 m/s isn’t the average speed -- it’s\nthe root mean square speed.", "start": 219.06, "duration": 5.04}, {"text": "So, how does the root mean square speed compare\nto the actual speeds of the molecules in the gas?", "start": 224.1, "duration": 4.62}, {"text": "Well, back in 1859, Scottish physicist James Clerk Maxwell used statistical analysis to figure out the distribution of speeds in an ideal gas.", "start": 228.72, "duration": 8.24}, {"text": "And it looks like this.", "start": 236.96, "duration": 1.4}, {"text": "The top of the curve shows the speed that’s\nclose to the speed of the greatest number of molecules.", "start": 238.36, "duration": 3.74}, {"text": "And the root mean square speed is slightly\nto the right of that.", "start": 242.1, "duration": 3.02}, {"text": "So the molecules in an ideal gas can actually\nhave a whole range of different speeds.", "start": 245.13, "duration": 3.84}, {"text": "But most of them are pretty close to\nthe root mean square speed,", "start": 248.97, "duration": 2.99}, {"text": "so it’s a useful way to get a picture of\nhow fast a gas’s molecules are moving.", "start": 251.96, "duration": 3.62}, {"text": "Now, we’ve seen the smooth, even way pressure\nand volume change with temperature in an ideal gas.", "start": 255.58, "duration": 5.16}, {"text": "But gases aren’t always ideal.", "start": 260.74, "duration": 1.9}, {"text": "When the pressure gets too high, or the temperature\ntoo low, they start to act very strange.", "start": 262.64, "duration": 4.44}, {"text": "High pressure is a problem, because it forces molecules together to the point where they start to interact.", "start": 267.08, "duration": 4.86}, {"text": "Low temperature is an issue for similar reasons.", "start": 271.94, "duration": 2.66}, {"text": "The molecules have less kinetic energy -- they’re\nmoving around less energetically --", "start": 274.61, "duration": 3.9}, {"text": "so their attraction to each other starts to have an effect.", "start": 278.51, "duration": 2.809}, {"text": "And, remember, we said that one of our assumptions about ideal gases was that they don't have forces acting between molecules.", "start": 281.32, "duration": 5.86}, {"text": "They just bounce off of each other like ping\npong balls.", "start": 287.18, "duration": 2.0}, {"text": "So, at higher pressures and lower temperatures, real gases tend to have a bit less volume than ideal gases would.", "start": 289.18, "duration": 5.66}, {"text": "And at really high pressures and really low\ntemperatures, gases just start acting weird.", "start": 294.84, "duration": 5.64}, {"text": "And then eventually they aren’t even gases\nanymore.", "start": 300.48, "duration": 1.98}, {"text": "At a certain point, the attraction between the molecules takes over and stops them from bouncing around so much.", "start": 302.46, "duration": 5.34}, {"text": "They become slightly more ordered, and take\nthe form that we call a liquid.", "start": 307.8, "duration": 3.5}, {"text": "Like when water vapor from the air condenses on the outside of your nice cool glass of orange juice, kind of making it look like it’s sweating.", "start": 311.3, "duration": 7.139}, {"text": "Increase the pressure or lower the temperature even more, and the attraction between the molecules has even more of an effect.", "start": 318.44, "duration": 5.5}, {"text": "The liquid freezes into a solid.", "start": 323.949, "duration": 1.84}, {"text": "In the same way, lowering a solid’s pressure or raising its temperature will eventually make it melt into a liquid and then boil into a gas.", "start": 325.789, "duration": 7.44}, {"text": "Well … usually.", "start": 333.229, "duration": 1.22}, {"text": "Take a look at this diagram.", "start": 334.449, "duration": 1.55}, {"text": "It shows the different phases of water depending\non its pressure and temperature.", "start": 335.999, "duration": 3.431}, {"text": "The vertical axis shows pressure, so the higher\nup you go in the diagram, the more pressure there is.", "start": 339.43, "duration": 4.86}, {"text": "The horizontal axis shows temperature, so the farther you are to the right, the higher the temperature.", "start": 344.29, "duration": 4.85}, {"text": "Below the diagonal line (so, at low pressures\nand high temperatures) water takes the form of\nwater vapor: a gas.", "start": 349.14, "duration": 6.26}, {"text": "To the left of the line that’s nearly vertical,\nwater is ice: a solid.", "start": 355.409, "duration": 3.46}, {"text": "And at the pressures and temperatures represented\nby the triangle in the middle, water is a liquid.", "start": 358.869, "duration": 4.5}, {"text": "But you’ll notice that there’s a point\ntoward the top right labeled the critical point.", "start": 363.369, "duration": 4.16}, {"text": "On a phase diagram, the critical point represents the maximum temperature and pressure where the substance can be a liquid.", "start": 367.529, "duration": 6.042}, {"text": "For a gas to become a liquid, it has to be below a certain temperature known as the critical temperature.", "start": 373.58, "duration": 5.42}, {"text": "For water, the critical temperature is about\n647 Kelvin.", "start": 379.0, "duration": 3.74}, {"text": "Above the critical temperature, you can increase the pressure as much as you want, but the gas will never condense into a liquid.", "start": 382.74, "duration": 5.66}, {"text": "There’s a critical pressure, too, which\nfor water is about 22 megapascals.", "start": 388.409, "duration": 4.82}, {"text": "If the pressure is above the critical pressure, you can raise the temperature as much as you want, but the liquid will never boil.", "start": 393.229, "duration": 5.571}, {"text": "Then there’s the point toward the bottom\nleft, where the two lines intersect.", "start": 398.8, "duration": 3.449}, {"text": "That’s the triple point.\nAnd that's what Mariner 9 used to map out Mars!", "start": 402.249, "duration": 4.001}, {"text": "A triple point is the temperature and pressure at which a substance coexists as a solid, a liquid, and a gas.", "start": 406.26, "duration": 5.62}, {"text": "It’s also what we use to define the Kelvin\ntemperature scale.", "start": 411.88, "duration": 2.999}, {"text": "The triple point of water is 6.105 millibars\nand exactly 273.16 Kelvin.", "start": 414.879, "duration": 6.09}, {"text": "That pressure and temperature is special, because at thermal equilibrium, water can exist in three phases at once -- ice, liquid, and vapor.", "start": 420.969, "duration": 7.72}, {"text": "Now, you’ll notice on the diagram that at pressures and temperatures below the triple point, there’s only the gas phase and the solid phase.", "start": 428.689, "duration": 6.291}, {"text": "That’s because below its triple point, a\nsubstance can’t actually take a liquid form.", "start": 434.98, "duration": 4.219}, {"text": "Instead, it’s either a gas or a solid -- and\nit transitions directly from one to the other,", "start": 439.199, "duration": 4.48}, {"text": "a process that’s known as sublimation if it goes from solid to gas, and as deposition if it goes from gas to solid.", "start": 443.68, "duration": 6.12}, {"text": "That’s why dry ice, which is made of carbon\ndioxide, vaporizes directly to gas.", "start": 449.8, "duration": 5.199}, {"text": "The triple point of carbon dioxide is about 5 times atmospheric pressure, so liquid carbon dioxide can’t naturally exist on Earth.", "start": 455.0, "duration": 7.38}, {"text": "The triple point of water is used to define\nthe Kelvin temperature scale because it’s consistent:", "start": 462.38, "duration": 5.02}, {"text": "You just find the temperature\nwhere you get three phases of water at once", "start": 467.4, "duration": 3.66}, {"text": "-- which scientists have set to be 273.16\nKelvin by definition.", "start": 471.06, "duration": 4.92}, {"text": "It also made a lot of sense for the Mariner 9 mission to use the pressure of the triple point of water as the reference point for its Martian maps.", "start": 475.98, "duration": 6.54}, {"text": "One of our main goals in exploring Mars has always been to search for evidence of life, either now or in the past.", "start": 482.52, "duration": 5.379}, {"text": "And as far as we know, life needs liquid water.", "start": 487.899, "duration": 3.001}, {"text": "Since the reference point for Martian altitudes\nwas the triple point of water, liquid water", "start": 490.9, "duration": 4.6}, {"text": "couldn't exist at altitudes above the reference\npoint, where the pressure would be too low.", "start": 495.5, "duration": 4.36}, {"text": "That made it easy to see on a map all the\nplaces where liquid water could be --", "start": 499.869, "duration": 4.0}, {"text": "or have been -- and where life could possibly survive,\nor have survived.", "start": 503.869, "duration": 3.791}, {"text": "Today, you learned about the kinetic theory\nof gases, and how to calculate the root mean square speed.", "start": 507.669, "duration": 4.5}, {"text": "We also talked about phase changes, including the critical point, the triple point, and how that all applies on Mars.", "start": 512.169, "duration": 5.302}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 517.48, "duration": 4.2}, {"text": "You can head over to their channel and check out a playlist of the latest episodes from shows like", "start": 521.68, "duration": 4.06}, {"text": "PBS Idea Channel, Brain Craft, and Shank's FX.", "start": 525.74, "duration": 3.079}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 528.819, "duration": 4.56}, {"text": "with the help of these amazing people and\nour equally amazing graphics team is Thought Cafe.", "start": 533.379, "duration": 4.72}]