[{"text": "It’s Professor Dave, let’s define the\nderivative.", "start": 0.28, "duration": 2.5}, {"text": "From our earlier investigations with slopes\nof tangent lines and instantaneous velocities", "start": 9.64, "duration": 6.479}, {"text": "of falling objects, we gained a basic grasp\nof the concept of differentiation, so let’s", "start": 16.119, "duration": 6.361}, {"text": "move forward and expand upon our understanding\nof this operation.", "start": 22.48, "duration": 6.07}, {"text": "When we first introduced differentiation,\nwe looked at a method for calculating the", "start": 28.55, "duration": 4.55}, {"text": "slope of a tangent line. By using this method\nof exhaustion, we were performing differentiation,", "start": 33.1, "duration": 6.91}, {"text": "and in doing so, we found the derivative of\nthis function at this point. This derivative", "start": 40.01, "duration": 5.93}, {"text": "was defined to be the slope of the tangent\nline at this point, and the slope of the line", "start": 45.94, "duration": 5.829}, {"text": "was derived from the function. The derivative\nof a function tells us about the rate of change", "start": 51.769, "duration": 7.96}, {"text": "in that function at a particular input value.\nIf a function is increasing at a particular", "start": 59.729, "duration": 6.21}, {"text": "point, its derivative is positive at that\npoint, which is just a fancy way of saying", "start": 65.939, "duration": 5.331}, {"text": "that the slope of its tangent line is positive\nat that point. If a function is decreasing", "start": 71.27, "duration": 7.84}, {"text": "at a particular point, its derivative is negative\nat that point, and the slope of its tangent", "start": 79.11, "duration": 6.16}, {"text": "line will be negative.\nLet’s take a moment to note something here.", "start": 85.27, "duration": 6.33}, {"text": "It is crucial that we mentally separate the\nvalue of a function at some point from the", "start": 91.6, "duration": 5.729}, {"text": "change in that function at that point. If\nexamining position and speed, we could be", "start": 97.329, "duration": 5.861}, {"text": "located at the origin, meaning our position\nis zero, but with non-zero speed, meaning", "start": 103.19, "duration": 6.319}, {"text": "we aren’t standing there but just passing\nby. Or we could be at some other non-zero", "start": 109.509, "duration": 5.731}, {"text": "location, but standing still, with zero speed.\nWe can also think of stock prices. These can", "start": 115.24, "duration": 7.119}, {"text": "be high or low, but their values are typically\nunrelated to their rate of change. They could", "start": 122.359, "duration": 6.031}, {"text": "continue to climb, or plummet at any moment.\nNow looking at the tangent line again, let’s", "start": 128.39, "duration": 7.25}, {"text": "formalize this a little bit more. Remember\nthat our method involved choosing a second", "start": 135.64, "duration": 5.75}, {"text": "point on the curve. We can give the first\npoint the coordinates (a, f(a)), and the second", "start": 141.39, "duration": 6.87}, {"text": "point can be (x, f(x)). As we said, the slope\nof this line, which we can call the secant", "start": 148.26, "duration": 7.699}, {"text": "line, is rise over run, so f(x) minus f(a)\nover x minus A. Then we can allow point x", "start": 155.959, "duration": 11.151}, {"text": "to approach point A, and we said that the\nslope of the tangent line will be the slope", "start": 167.11, "duration": 5.769}, {"text": "of this secant line in the limit of x approaching\nA. We can express this another way, with the", "start": 172.879, "duration": 9.871}, {"text": "second point in terms of the first, by saying\nthat x is equal to A plus some other quantity,", "start": 182.75, "duration": 8.099}, {"text": "h, so h is the distance in the x direction\nfrom the first point to the next. That means", "start": 190.849, "duration": 7.691}, {"text": "this second point has the x coordinate A plus\nh, and the y coordinate f of (A plus h). Now", "start": 198.54, "duration": 9.201}, {"text": "to get rise over run, we find f of (A plus\nh) minus f of A, over h. This time, the slope", "start": 207.741, "duration": 12.189}, {"text": "of the tangent line is the limit of this expression\nas h approaches zero, meaning the distance", "start": 219.93, "duration": 6.95}, {"text": "between the points becomes zero, and the points\nbecome one. What we must understand is that", "start": 226.88, "duration": 9.419}, {"text": "we can just as easily refer to this value\nas the slope not just of the tangent line,", "start": 236.299, "duration": 6.431}, {"text": "but the slope of the curve itself, at this\nprecise point. If we were to zoom into the", "start": 242.73, "duration": 5.66}, {"text": "curve at this point, closer and closer, it\nwould eventually resemble a line with this", "start": 248.39, "duration": 6.599}, {"text": "slope. And in fact, combining this knowledge\nwith this expression will give us a better", "start": 254.989, "duration": 5.821}, {"text": "understanding of the definition of a derivative.\nThe derivative of some function, f, at some", "start": 260.81, "duration": 6.6}, {"text": "input value, A, which we can represent as\nf prime of A, is precisely this expression", "start": 267.41, "duration": 7.41}, {"text": "we just described. So to put it in words,\nthe derivative of a function at some input", "start": 274.82, "duration": 6.37}, {"text": "is equal to the slope of the tangent line\nat that point. Identically, the derivative", "start": 281.19, "duration": 7.819}, {"text": "of a function at some input is equal to the\nrate of change of the function at that point.", "start": 289.009, "duration": 7.0}, {"text": "These are two ways of saying precisely the\nsame thing, and that thing is the derivative", "start": 296.009, "duration": 5.66}, {"text": "of the function.\nLet’s use this expression to take the derivative", "start": 301.669, "duration": 4.461}, {"text": "of some different functions. Let’s start\nwith something easy. How about some constant", "start": 306.13, "duration": 5.62}, {"text": "function, like f(x) = 5. If we take the derivative\nof this, when we go to plug in values for", "start": 311.75, "duration": 7.78}, {"text": "f(x plus h) and f(x), these will both be 5,\nbecause no matter what point on the function", "start": 319.53, "duration": 6.58}, {"text": "we are talking about, it’s equal to five.\nFive minus five is zero, so as h approaches", "start": 326.11, "duration": 6.62}, {"text": "zero, f prime of x will become zero. This\nmakes sense, as the rate of change anywhere", "start": 332.73, "duration": 6.07}, {"text": "on this function is zero, because the value\nof the function never changes. So let’s", "start": 338.8, "duration": 8.94}, {"text": "make a note that when we take the derivative\nof a constant, any constant, it will always", "start": 347.74, "duration": 5.459}, {"text": "be zero. This should be reassuring, as it\nmeans that our precise math is aligning with", "start": 353.199, "duration": 6.541}, {"text": "the intuitive idea we wanted it to reflect.\nNow let’s try the function f(x) = x. If", "start": 359.74, "duration": 7.25}, {"text": "we try to find the derivative of this, for\nf(x plus h), we get (x plus h), and for f(x),", "start": 366.99, "duration": 7.62}, {"text": "we get x. So (x plus h) minus x means the\nx’s cancel, which gives us h, and h over", "start": 374.61, "duration": 8.52}, {"text": "h is one. So the derivative of x is one. Now\nlet’s try x squared. Up top, remember that", "start": 383.13, "duration": 10.439}, {"text": "we are plugging x plus h into the function\nfirst, so we have x plus h quantity squared,", "start": 393.569, "duration": 7.231}, {"text": "minus the function itself, or x squared. Now\nwe have to foil this first term on the top,", "start": 400.8, "duration": 7.3}, {"text": "and we get x squared plus two xh plus h squared,\nminus the x squared, and that leaves us with", "start": 408.1, "duration": 8.59}, {"text": "two xh plus h squared. Dividing both terms\non top by the h on the bottom, we get two", "start": 416.69, "duration": 9.189}, {"text": "x plus h, and when h goes to zero, that leaves\nus with two x. So the derivative of x squared", "start": 425.879, "duration": 8.141}, {"text": "is two x. Let’s do one more, x cubed. Now\nwe have x plus h quantity cubed minus x cubed.", "start": 434.02, "duration": 11.25}, {"text": "We should know how to cube this binomial,\nby foiling two of them and multiplying the", "start": 445.27, "duration": 5.12}, {"text": "result across the third binomial, but for\nthe sake of time, let’s just show that this", "start": 450.39, "duration": 5.33}, {"text": "will be x cubed plus (three x squared h) plus\n(three x h squared) plus h cubed. We subtract", "start": 455.72, "duration": 10.569}, {"text": "x cubed, and we get this. Dividing through\nby the h on the bottom, we get (three x squared)", "start": 466.289, "duration": 7.431}, {"text": "plus (three x h) plus h squared. As h approaches\nzero, we are left with three x squared, so", "start": 473.72, "duration": 7.961}, {"text": "the derivative of x cubed is three x squared.\nBy now we might be able to recognize a pattern.", "start": 481.681, "duration": 9.819}, {"text": "It seems that every time we take a derivative,\nwe are taking the exponent and bringing it", "start": 491.5, "duration": 5.05}, {"text": "down in front to become a coefficient, and\nthen reducing the exponent by one. This is", "start": 496.55, "duration": 7.47}, {"text": "called the power rule, and it works for any\nfunction where the exponent, n, is a positive", "start": 504.02, "duration": 5.97}, {"text": "integer. In this way, the derivative of x^n\nis equal to n times x^(n-1).", "start": 509.99, "duration": 7.04}, {"text": "The power rule is something that we will be\nusing day in and day out in order to take", "start": 517.03, "duration": 7.44}, {"text": "the derivative of various functions, so the\ngood news is that we don’t have to keep", "start": 524.47, "duration": 5.15}, {"text": "using the other more tedious expression. But\nhopefully in deriving this new one, we have", "start": 529.62, "duration": 6.47}, {"text": "developed an even better understanding of\nwhat it means to take the derivative of a", "start": 536.09, "duration": 4.94}, {"text": "function. Just as before, it does mean to\nfind the slope of the tangent line at a particular", "start": 541.03, "duration": 6.76}, {"text": "point. But with this new power rule in our\npockets, we can now safely learn how to find", "start": 547.79, "duration": 5.52}, {"text": "derivatives without having to draw graphs\nor think about tangent lines at all. Instead,", "start": 553.31, "duration": 5.9}, {"text": "we can simply apply the power rule, as long\nas we make sure to remember what’s really", "start": 559.21, "duration": 5.54}, {"text": "going on under the hood of this fancy machinery.\nSo let’s move forward and get some practice", "start": 564.75, "duration": 5.67}, {"text": "with the power rule.", "start": 570.42, "duration": 1.08}]