[{"text": "Captioning is on! To turn off, click CC button at bottom right!", "start": 0.0, "duration": 3.64}, {"text": "Follow the amoebas on Twitter (@AmoebaSisters) and on Facebook.", "start": 3.64, "duration": 5.18}, {"text": "I want you to think for a moment about your\nvery favorite food. What is it? Pizza? Macaroni", "start": 8.82, "duration": 6.18}, {"text": "and cheese? Chicken Salad? Sushi? Well we\nall have different food preferences, but food", "start": 15.009, "duration": 6.53}, {"text": "is a source of large molecules that are needed\nfor life called biomolecules. There are 4", "start": 21.539, "duration": 5.871}, {"text": "major biomolecules that make up all of life,\nand this will be the focus of this video.", "start": 27.41, "duration": 5.74}, {"text": "Before we get into details about the 4 biomolecules,\nwe need to talk about one very important vocabulary", "start": 33.15, "duration": 6.52}, {"text": "word. The word monomer. A monomer\nis a building block – if I had some large", "start": 39.67, "duration": 2.53}, {"text": "substance, the parts that make up that substance\nare called monomers. Just like building blocks.", "start": 42.2, "duration": 10.04}, {"text": "We're going to talk a lot about monomers today, because we need to understand what the biomolecules are made of.", "start": 52.24, "duration": 5.9}, {"text": "And we need to understand biomolecules, because they're building components of life.", "start": 58.22, "duration": 4.64}, {"text": "So let’s introduce the 4 biomolecules now and talk a little bit about their functions. We'll start with carbohydrates.", "start": 62.86, "duration": 8.24}, {"text": "Carbs. Well carbs are something you have\nprobably heard about when people are talking", "start": 71.1, "duration": 4.58}, {"text": "about diets. You know, they try to go low\ncarb or maybe they want a lot of carbs...diets", "start": 75.68, "duration": 5.579}, {"text": "always come and go. Pasta and breads are examples\nof foods heavy in carbohydrates. Carbs are", "start": 81.259, "duration": 6.331}, {"text": "actually a very important source of energy.\nIn fact, that's one big function of carbs.", "start": 87.59, "duration": 6.349}, {"text": "They are a great, fast source of energy. If\nyou were a marathon runner, you might want", "start": 93.939, "duration": 5.28}, {"text": "to eat a lot of carbs the night before a race. Lots of marathon runners do this. It's called", "start": 99.219, "duration": 5.531}, {"text": "pasta loading. They eat a big pasta dinner\nthe night before they go out on their marathon.", "start": 104.75, "duration": 5.75}, {"text": "Now carbs have a monomer- again, remember,\nmonomers are building blocks. The monomer", "start": 110.5, "duration": 5.25}, {"text": "for a carb is called a monosaccharide. I know\nthat's a big mouthful but monosaccharides", "start": 115.75, "duration": 6.039}, {"text": "make up carbohydrates.", "start": 121.789, "duration": 2.61}, {"text": "Next one up is a diverse group known as lipids. Lipids are better known as fats.", "start": 124.399, "duration": 6.58}, {"text": "They have 2 different types of building blocks. One type of building block is called a fatty acid and the other type is called a glycerol.", "start": 130.98, "duration": 9.04}, {"text": "Now examples of lipids include butter, oil, and cholesterol. Lipids, though, they have a lot of great functions. You", "start": 140.04, "duration": 8.5}, {"text": "may think well that's fat...how good can fat\nbe? Well it just depends when you put it into", "start": 148.54, "duration": 6.479}, {"text": "context. For example, you know those really\nadorable seals that you see on calendars?", "start": 155.019, "duration": 5.201}, {"text": "They have this fluffy white hair. They're\nactually called a harp seal. Well they", "start": 160.22, "duration": 4.81}, {"text": "actually only look like that when they're babies. When they get older, they're not quite", "start": 165.03, "duration": 4.629}, {"text": "as cute. But in their little baby stage, they\nactually have a lot of this hair that they're born", "start": 169.659, "duration": 4.521}, {"text": "with that help keep them warm. But over time,\nthey have to develop blubber. It's fat and", "start": 174.18, "duration": 6.32}, {"text": "it helps keep them warm. Lipids are great\nfor insulating. Also you might not think about", "start": 180.5, "duration": 6.11}, {"text": "fats as being related to energy, but fats\nare a great source of long term energy. They", "start": 186.61, "duration": 6.879}, {"text": "can store energy for a long, long time. Say\nfor example you wanted to swim the English", "start": 193.489, "duration": 6.511}, {"text": "Channel. That's like 21 miles of swimming.\nThe fastest swimmers might be able to do that", "start": 200.0, "duration": 6.06}, {"text": "in 7 or 8 hours but it might take a lot longer\nthan that for the average swimmer. More like", "start": 206.06, "duration": 6.239}, {"text": "25 hours, and that's a lot of swimming. Well\nyou would want to make sure that your body", "start": 212.299, "duration": 5.071}, {"text": "has enough lipids- enough stored fat- that\nit can pull upon. Because after you burn off those", "start": 217.37, "duration": 6.619}, {"text": "carbohydrates (remember carbs are the fast source of energy), you might not have enough energy", "start": 223.989, "duration": 5.53}, {"text": "storage unless you have some lipids on hand.\nLipids also make up cell membranes so they", "start": 229.519, "duration": 6.44}, {"text": "are very important for life because all living things are made of cells. Of course an\nexcessive amount of lipids could be a bad", "start": 235.959, "duration": 8.011}, {"text": "thing for your health. Remember it's all about\nmoderation.", "start": 243.97, "duration": 3.87}, {"text": "Ok, next, proteins! When you hear about proteins,\na lot of times you might think about protein", "start": 247.84, "duration": 7.42}, {"text": "bars. They say they have lots of protein in\nthem and that they help with muscle building.", "start": 255.26, "duration": 5.729}, {"text": "Well protein is great for muscle building. Examples\nof foods that are high in protein include", "start": 260.989, "duration": 4.61}, {"text": "meats and many types of beans. The monomers\nof protein are amino acids. So sometimes you", "start": 265.599, "duration": 7.361}, {"text": "see these labels that say, \"This has 20 amino\nacids in this food.\" Really they're just trying", "start": 272.96, "duration": 5.439}, {"text": "to say that it has protein, and proteins are\nmade up of amino acids so that's just some", "start": 278.399, "duration": 5.28}, {"text": "fancy advertising for you. But in addition to it being important for muscle development, protein", "start": 283.68, "duration": 5.5}, {"text": "is also very important in other functions such as working in the immune system and acting", "start": 289.18, "duration": 5.45}, {"text": "as enzymes. Remember enzymes are made of proteins\nso proteins are important for the body.", "start": 294.63, "duration": 6.64}, {"text": "Now when we start talking about genes - the DNA genes not the jeans you wear- the DNA codes", "start": 301.27, "duration": 6.449}, {"text": "for proteins that are very important for structure and function in the body.", "start": 307.719, "duration": 5.68}, {"text": "The last big biomolecule is known as a nucleic\nacid. Nucleic acids include DNA and RNA, which", "start": 313.399, "duration": 7.0}, {"text": "we'll get to when we get to genetics. They\nhave a monomer called a nucleotide. That's", "start": 320.399, "duration": 5.45}, {"text": "going to be an easy one for you to remember\nbecause nucleotide sounds a lot like nucleic acid.", "start": 325.849, "duration": 6.24}, {"text": "If considering DNA and RNA, both of these\nare involved in genetic information for the", "start": 332.089, "duration": 5.221}, {"text": "coding of your traits. They are found in a\nlot of your food, because whenever you eat", "start": 337.31, "duration": 5.99}, {"text": "something that came from something once living,\nit can still contain the DNA. For example,", "start": 343.3, "duration": 6.539}, {"text": "when you eat a strawberry, you're actually\nconsuming all the cells that make up that", "start": 349.839, "duration": 5.25}, {"text": "strawberry. In the nucleus of all of those\nstrawberry cells is DNA. Plants and animals", "start": 355.089, "duration": 6.991}, {"text": "both have DNA. In fact, any type of life must contain nucleic acids like DNA to direct the cells'", "start": 362.08, "duration": 5.97}, {"text": "activities.", "start": 368.05, "duration": 1.39}, {"text": "So we just powered through introducing the\n4 biomolecules by providing examples, exploring", "start": 369.44, "duration": 5.44}, {"text": "their monomers, and giving some general functions.\nOne last very important part to mention is", "start": 374.9, "duration": 7.199}, {"text": "the structure of these biomolecules. Understanding\nthe structure can help with predicting their", "start": 382.099, "duration": 5.771}, {"text": "properties and easily being able to identify\nthem. One thing I like to tell students to", "start": 387.87, "duration": 5.409}, {"text": "do is to write the 4 biomolecules in this\nsame order we went through: carbs, lipids,", "start": 393.279, "duration": 6.341}, {"text": "proteins, and nucleic acids. Then remember\nthis mnemonic device that goes with these", "start": 399.62, "duration": 6.469}, {"text": "4 biomolecules. CHO, CHO, CHON, CHONP. Instead\nof chomp at the end with a \"m,\" it's chomp with an \"n.”", "start": 406.089, "duration": 11.89}, {"text": "The c stands for carbon, the h stands for\nhydrogen, the o for oxygen. So carbs, lipids,", "start": 417.979, "duration": 8.091}, {"text": "proteins, and nucleic acids all have that\nCHO in there. It's just that proteins and", "start": 426.07, "duration": 7.3}, {"text": "nucleic acids also have an N which is nitrogen\nand nucleic acids additionally have a P which", "start": 433.37, "duration": 7.87}, {"text": "is for phosphorous. So again CHO, CHO, CHON,\nCHONP---the major elements in the 4 biomolecules.", "start": 441.24, "duration": 9.58}, {"text": "Now these elements are arranged differently in the 4 biomolecules---such as a ring arrangement", "start": 450.82, "duration": 3.99}, {"text": "or a chain arrangement. It’s important to\nexplore the arrangement of the elements in", "start": 454.81, "duration": 3.94}, {"text": "biomolecules, because the structure of that\narrangement greatly impacts the biomolecule", "start": 458.75, "duration": 5.789}, {"text": "function. So to the Google to discover some\nbiomolecule arrangement illustrations. Well", "start": 464.539, "duration": 6.591}, {"text": "that's it for the Amoeba Sisters and we remind\nyou to stay curious.", "start": 471.13, "duration": 2.999}]