[{"text": "Happy Monday everyone! How you all doing? You \nknow it's good because it's a goodie bag day  ", "start": 17.266, "duration": 6.15}, {"text": "and so I'll get to what you have in your hands in \nthis lecture. Today-- So we've been talking about  ", "start": 24.933, "duration": 9.767}, {"text": "these things for a while now, right? We've built \nup an understanding of the stamp and the basis,  ", "start": 34.7, "duration": 5.6}, {"text": "and then we understood how to talk about it \nlike in terms of the planes and the symmetries,  ", "start": 41.016, "duration": 5.05}, {"text": "and then we shined x-rays on it, and now we're \ngoing to start taking them all apart. And so don't  ", "start": 46.616, "duration": 7.117}, {"text": "be sad, don't be sad, because actually that's more \nreal-- that's more real. And that's what we'll  ", "start": 53.733, "duration": 6.8}, {"text": "talk about today. So what our plan is-- you know-- \nSo today we're going to start creating defects  ", "start": 60.533, "duration": 5.933}, {"text": "in the perfect order that we've had so far. And \nin your goody bag you have a defect generation  ", "start": 67.1, "duration": 7.683}, {"text": "machine, which we'll talk about. And then on-- \nAnd so today we're gonna talk about one kind  ", "start": 74.783, "duration": 6.15}, {"text": "of defect, that's a point defect, and then \non Wednesday we'll talk about line defects,  ", "start": 80.933, "duration": 3.85}, {"text": "and then we'll just mess the whole thing up, \nand we're going to make it amorphous. So that's  ", "start": 85.333, "duration": 4.65}, {"text": "where we're going. And beyond that if you \nwant to know more about where we're going,  ", "start": 90.7, "duration": 3.833}, {"text": "there's the concept map up there for exam 3. \nWhich again, you know we don't pick these dates,  ", "start": 95.265, "duration": 6.318}, {"text": "so this date came later in the semester that \nwe wanted but it's that's what it is. I think  ", "start": 101.583, "duration": 5.35}, {"text": "it's all the way up in early December. But-- \nBecause of the fact that there's a Thanksgiving  ", "start": 106.933, "duration": 6.8}, {"text": "holiday in between and there's one topic here \nwe have to start before the exam. It's not here  ", "start": 115.1, "duration": 6.083}, {"text": "because it won't be on the exam but we're going to \nstart polymers but won't be on the exam. I'm going  ", "start": 121.183, "duration": 4.317}, {"text": "to spend the whole lecture before exam three just \nreviewing for exam three, because we're gonna have  ", "start": 125.5, "duration": 6.083}, {"text": "that Thanksgiving break and all that. So that's \nwhat's not listed here these are just the topics  ", "start": 131.583, "duration": 4.0}, {"text": "that are covered on exam three. Okay. Good. If \nanyone has any questions please do let me know.  ", "start": 135.583, "duration": 5.35}, {"text": "The concept map. Now the thesis of 3.091 \nyou have seen in multiple different ways.  ", "start": 141.983, "duration": 6.633}, {"text": "I have tried to convey to you that \nthe electronic structure of atoms  ", "start": 148.616, "duration": 4.717}, {"text": "is the key to life. It's the key to chemistry. \nIt's the key to understanding and within that  ", "start": 153.333, "duration": 5.6}, {"text": "you get things like this which is what we've \nbeen talking about recently like composition  ", "start": 158.933, "duration": 3.367}, {"text": "and arrangement. Right? That's these crystals \nthat's these different-- BCC FCC. Okay.  ", "start": 162.866, "duration": 6.867}, {"text": "And then the chemistry you put inside. But \nyou see the other thing about it is defects.  ", "start": 170.7, "duration": 3.366}, {"text": "Because the thing is that defects, which is the \ntopic of today and Wednesday, they are absolutely  ", "start": 174.866, "duration": 7.034}, {"text": "crucial for understanding the properties. \nIf they're there and I just told you they're  ", "start": 181.9, "duration": 5.6}, {"text": "always there. The question is how much are they \nthere? And so if you don't know about defects--  ", "start": 187.5, "duration": 8.0}, {"text": "if you don't know about defects then you \nreally cannot fully understand properties.", "start": 195.5, "duration": 6.8}, {"text": "There is a very strong correlation between the \ntwo and that's why we have to talk about them.  ", "start": 205.266, "duration": 5.517}, {"text": "We have to understand them. Now I love \nthis quote from Colin Humphreys he said,  ", "start": 211.333, "duration": 5.933}, {"text": "\"Crystals are like people, it is the defects \nin them which tend to make them interesting.\"  ", "start": 217.266, "duration": 5.117}, {"text": "Yeah. And that's actually really true because \ndefects, right, defects sound you know... 'I  ", "start": 223.1, "duration": 5.116}, {"text": "don't want to defect.' No, actually oftentimes \nyou do want defects. Sometimes you don't. So  ", "start": 228.216, "duration": 6.8}, {"text": "there are some kinds that are kind of like \nmaybe not things you want in your crystal  ", "start": 235.016, "duration": 3.517}, {"text": "and then there are other kinds that actually you \nare engineering purposefully to be there. Either  ", "start": 238.533, "duration": 5.367}, {"text": "way you got to understand them. Right? And that's \nwhat we're doing today because --Gesundheit-- so  ", "start": 243.9, "duration": 4.8}, {"text": "you know if you take this three layer-- We talk \nabout graphene. It's a one atom thick material.  ", "start": 248.7, "duration": 5.433}, {"text": "Pretty cool-- every atom's on the surface. Here's \nanother example of what's called a 2D material.  ", "start": 254.133, "duration": 5.85}, {"text": "Why? It's not 2D but it's called a 2D material \nbecause it gets you like... you know more  ", "start": 259.983, "duration": 4.317}, {"text": "publicity on your work. This is molybdenum-- \nthis is molybdenum disulfide it's really cool  ", "start": 264.3, "duration": 4.4}, {"text": "material. It's three atoms thick. So it's kind of \nlike 2D-ish, right? Yeah but see that's the model.  ", "start": 268.7, "duration": 5.766}, {"text": "That's the model. This is reality. This is real-- \nHow do you see-- How do we see atoms like this?  ", "start": 274.466, "duration": 6.317}, {"text": "That's a real picture. Do we use x-rays? \nNo? What do we use to see atoms that well?  ", "start": 281.5, "duration": 7.683}, {"text": "Electrons. Electrons are our light, right? That's \nwhat we're using. This is an electron picture,  ", "start": 290.7, "duration": 6.8}, {"text": "electron. And if you do that you can \nsee individual atoms and look at that  ", "start": 297.5, "duration": 4.0}, {"text": "there's there's places where atoms are missing all \nover the place. That's reality. That's reality.  ", "start": 301.5, "duration": 7.6}, {"text": "And those where you have one atom missing or \nwhere you have one thing that is localized and  ", "start": 309.1, "duration": 7.516}, {"text": "disruptive to the regularity of the lattice... \nthat's called a point defect. So let's write that  ", "start": 316.616, "duration": 5.45}, {"text": "down. That's the one that we're talking about \ntoday. So the point defect, 'point defect', is  ", "start": 322.066, "duration": 8.467}, {"text": "where you have a localized... \nlocalized disruption...  ", "start": 331.983, "duration": 6.717}, {"text": "in the regularity, 'regularity'.", "start": 343.816, "duration": 4.0}, {"text": "The periodicity the repeating of the lattice.", "start": 349.016, "duration": 3.684}, {"text": "And it could be on or between, \nwe'll see this, on or between  ", "start": 356.066, "duration": 4.717}, {"text": "sites. Right? It could be a defect that is, like \nyou see here, there's an actual atom missing. What  ", "start": 362.3, "duration": 7.283}, {"text": "could be something that maybe you've got in there \nin between sites? But either way it's a disruption  ", "start": 369.583, "duration": 6.233}, {"text": "that's localized to a point or almost a point. \nAnd so it is --Gesundheit-- that you can see that  ", "start": 376.383, "duration": 6.8}, {"text": "if we just make these disruptions in something. \nAlumina. We talk about alumina, right? Remember  ", "start": 383.183, "duration": 4.883}, {"text": "alumina's really strong lattice energies? So \nit's like sandpaper. Oh, it's also toothpaste.  ", "start": 388.066, "duration": 6.0}, {"text": "It's in a lot of stuff. Alumina is a great-- \nBut look at this. That's alumina with almost  ", "start": 395.266, "duration": 4.55}, {"text": "no defects. It's still got some. You can never get \nrid of them all! But here it is when I purposely  ", "start": 399.816, "duration": 7.2}, {"text": "engineer the defects in alumina and I put a \nlittle titanium or iron. Or here's it when  ", "start": 407.016, "duration": 4.566}, {"text": "I put chromium. So you can-- There's one property \nwhere the localized disruption, and it's not a lot  ", "start": 411.582, "duration": 6.951}, {"text": "as we'll see, the localized disruption changes \nthe properties. That is key. That's just color.  ", "start": 418.533, "duration": 7.283}, {"text": "Right? This applies to most properties of \nmaterials. And so this first one, the point  ", "start": 426.383, "duration": 7.283}, {"text": "defects that we're talking about today, you can \nkind of think of those as zero dimensional because  ", "start": 433.666, "duration": 5.35}, {"text": "they're they're localized. You know. They \ndon't really go off in a line. They don't  ", "start": 439.016, "duration": 3.517}, {"text": "go off in a plane or a volume. And you can \nhave defects that are that cover all of those  ", "start": 442.533, "duration": 5.683}, {"text": "possibilities. But these are points. Alright? \nThis is what the word localized means here, okay?  ", "start": 448.216, "duration": 7.116}, {"text": "Okay. Now in this class, we're not going to cover \nall of them, but we will cover these two. Today:  ", "start": 456.216, "duration": 5.85}, {"text": "this one. On Wednesday: that one. And that'll \ngive you enough of a sense of the role of defects  ", "start": 462.066, "duration": 5.434}, {"text": "and how to think about defects and crystals. \nRight? So this is how we think and classify  ", "start": 467.5, "duration": 6.316}, {"text": "defects. Okay. Now the four-- so now we're \ngoing to point defects-- now the four,  ", "start": 473.816, "duration": 5.367}, {"text": "there are different types of point defects that \ncan happen. The one that you saw here is a certain  ", "start": 479.183, "duration": 6.483}, {"text": "one. That's called a vacancy. It's because there's \nan atom that's vacant. So you literally just lost  ", "start": 485.666, "duration": 5.667}, {"text": "an atom somewhere in there. Okay? Now that's a \nvacancy and that always exists. But you could also  ", "start": 491.333, "duration": 7.85}, {"text": "have taken something like one of the atoms that's \nalready in there, maybe an aluminum or an oxygen  ", "start": 499.183, "duration": 4.55}, {"text": "that's in the lattice, and you could substitute \nsomething in place of that. That's another-- Why  ", "start": 503.733, "duration": 4.8}, {"text": "is that a point defect? Because I didn't like \ntear something out. But no, but you changed the  ", "start": 508.533, "duration": 5.283}, {"text": "regularity. Localized disruption and regularity. \nSo if I put something else in for aluminum  ", "start": 513.816, "duration": 6.084}, {"text": "that's a point defect. Right? And again, now go \nback to here. You can see it here. So we classify  ", "start": 519.9, "duration": 5.433}, {"text": "these, right? There's a vacancy, which is an atom \nmissing. There's what's called an interstitial,  ", "start": 525.333, "duration": 5.85}, {"text": "which is an atom that goes in between the other \natoms. Here it's a self interstitial so it's the  ", "start": 531.183, "duration": 5.033}, {"text": "same type of atom. And these are-- This is where \nyou have a different type of atom in between and  ", "start": 536.216, "duration": 5.6}, {"text": "this is where you have a different type of atom \nas well. Those are both called impurities and I  ", "start": 541.816, "duration": 4.4}, {"text": "will talk about those all today. We're gonna start \nand focus a lot of our attention on the vacancy.  ", "start": 546.216, "duration": 6.25}, {"text": "And that's what I want you to use this goodie bag \nto understand, is the vacancies. Okay. Vacancies.  ", "start": 553.5, "duration": 5.2}, {"text": "Why do vacancies happen? What are vacancies? To \nunderstand vacancies in crystals we have to talk  ", "start": 558.7, "duration": 8.083}, {"text": "about this guy. And oh... this guy was brilliant. \nThis-- I'm sure you know his name is Svante. Yeah,  ", "start": 566.783, "duration": 9.517}, {"text": "it's written right there. Svante Arrhenius. \nArrhenius studied in the late 1800s so many  ", "start": 576.3, "duration": 6.8}, {"text": "different things and made so many contributions \nthat it's almost hard to catalog. He was  ", "start": 583.1, "duration": 5.916}, {"text": "brilliant. And you know he won the nobel prize \nin chemistry for his work on electrolytes.  ", "start": 589.016, "duration": 4.967}, {"text": "But he also worked on immunology. He was the very \nfirst person in the late 1800s to come up with a  ", "start": 595.333, "duration": 6.333}, {"text": "model for global warming and the role of CO2 in \nthe temperature change of the planet. And his  ", "start": 601.666, "duration": 6.0}, {"text": "predictions were actually pretty darn good. He \nwas brilliant. And one of the things that he did  ", "start": 607.666, "duration": 6.867}, {"text": "is, he observed what it were called activated \nprocesses, and how they depended on temperature.  ", "start": 614.533, "duration": 7.283}, {"text": "And so we have this equation that I need to \ntalk about today and it's going to come back.  ", "start": 622.933, "duration": 4.8}, {"text": "So we're going to talk about this equation, \nwhich is the Arrhenius equation, that relates  ", "start": 628.533, "duration": 5.132}, {"text": "the rate of some process to the temperature. And \nthe activation energy for that process. So we got  ", "start": 633.665, "duration": 8.635}, {"text": "to talk about what all that means, alright? Now \nwe will be using this. Today we're going to use  ", "start": 642.3, "duration": 7.033}, {"text": "it to think about concentrations of vacancies in \na crystal which follow Arrhenius-like behavior.  ", "start": 649.333, "duration": 6.483}, {"text": "Right? But then we're going to come back to it \nwhen we go into reaction kinetics in a couple  ", "start": 657.333, "duration": 5.45}, {"text": "of weeks. Where we talk about reaction rates. So \nwe'll be using Arrhenius multiple times throughout  ", "start": 662.783, "duration": 5.2}, {"text": "the rest of the semester. So what is it? So the \nArrhenius-- So the general Arrhenius equation can  ", "start": 667.983, "duration": 8.4}, {"text": "be written like this. Arrhenius, he was not in \nthe army but this is just the general equation.  ", "start": 676.383, "duration": 7.283}, {"text": "Okay. So let's put equation there. And so we have \nk, which is some rate, equals A. I'll talk about  ", "start": 684.383, "duration": 7.433}, {"text": "each of these. Times e the exponential of e to \nthe minus Ea over RT. What are these things?  ", "start": 691.816, "duration": 10.4}, {"text": "So this is the general equation for the rate of \nsome process. As we're going to see this applies  ", "start": 702.216, "duration": 6.0}, {"text": "to many, many processes including vacancies. \nOkay. But this is sort of the rate. So you can  ", "start": 708.216, "duration": 6.8}, {"text": "think of this as-- Okay. Let's just-- That's the \nrate of a process rate. The rate of some process.  ", "start": 715.016, "duration": 7.6}, {"text": "Okay. I mean you could think about it as the \nnumber of times something happens per second.  ", "start": 722.616, "duration": 5.45}, {"text": "That's a rate. Right? It doesn't have to be those \nunits, but that's like a rate. Right? How often  ", "start": 728.066, "duration": 5.267}, {"text": "does this happen. The rate-- But now so that's \ndependent on something called the pre-exponential,  ", "start": 733.333, "duration": 8.967}, {"text": "that I will talk about. 'Pre-exponential-- \nexponential'. That is a factor that is a constant.", "start": 742.3, "duration": 8.883}, {"text": "And here we have this exponent-- and this \nis such a beautiful expression. So this is  ", "start": 754.7, "duration": 5.433}, {"text": "the average thermal energy. 'average kinetic \nenergy, average thermal energy' Right? It's  ", "start": 762.133, "duration": 9.133}, {"text": "taking temperature and it's making an energy out \nof it. Now remember we've already talked about  ", "start": 771.266, "duration": 4.467}, {"text": "this before. That you know you don't get what you \nget are distributions. So you know this would be T  ", "start": 775.733, "duration": 8.167}, {"text": "high-- remember I've drawn this exact thing and \nthis might be T low and this might be-- You know,  ", "start": 784.7, "duration": 5.683}, {"text": "this might be the you know the probability of \nsomething happening. Probability of occurring.  ", "start": 792.383, "duration": 7.683}, {"text": "And then in this case we talked about this \nas the kinetic energy of the molecules.  ", "start": 800.616, "duration": 4.317}, {"text": "That's a graph we showed already. But so the-- \nBut this RT is an average. But so I just want  ", "start": 804.933, "duration": 6.4}, {"text": "to make sure you don't forget. This is a number. \nThis is a number. You've got at 300 degrees, at a  ", "start": 811.333, "duration": 6.332}, {"text": "thousand degrees, you calculate a number here. \nBut whenever you're talking about temperature,  ", "start": 817.665, "duration": 4.0}, {"text": "you're talking about distributions. There's some \naverage of the distribution but you're always  ", "start": 821.665, "duration": 5.201}, {"text": "talking about distributions. That's important for \nunderstanding Arrhenius. Okay. Now this thing here  ", "start": 826.866, "duration": 8.0}, {"text": "is called the activation energy. Activation \nenergy. And that is the energy that you have  ", "start": 835.983, "duration": 14.083}, {"text": "to get over for something to happen. For \nthe thing to happen. Let's take-- I love  ", "start": 850.066, "duration": 5.034}, {"text": "this analogy of the bookcase. I'm going to draw \nthat now. So let's suppose that you have energy,  ", "start": 855.1, "duration": 6.083}, {"text": "like that. Okay. So maybe this is like potential \nenergy. Yeah, let's go ahead and say potential  ", "start": 862.133, "duration": 4.883}, {"text": "energy. Then if I've got a bookcase and it's very \nvery heavy. And I try-- and I want to push it over  ", "start": 867.666, "duration": 8.55}, {"text": "on this hinge. So I want to rotate it and push \nover. Then you could imagine that at some point  ", "start": 876.216, "duration": 6.0}, {"text": "it's going to look like this. And then \nat another point, it's going to look  ", "start": 882.933, "duration": 4.8}, {"text": "like this. Right? So this is like step one, \nand that's step two, and that's step three.  ", "start": 887.733, "duration": 4.967}, {"text": "And now I'm pushing this thing over. Well this is \nthe activated state. Why? Because it's where I've  ", "start": 893.983, "duration": 9.283}, {"text": "gotten to the highest energy, and that's where \nthis energy graph is important. This energy axis,  ", "start": 903.266, "duration": 4.95}, {"text": "this is the activated state of the bookcase. \nRight? So if I plot the the energies.", "start": 908.216, "duration": 6.484}, {"text": "Right? You can say one, two, three. You \ncan think about it like that. Right?  ", "start": 916.783, "duration": 6.0}, {"text": "I've literally-- So because it's a potential \nenergy, right? So it's like here's the  ", "start": 923.666, "duration": 3.434}, {"text": "gravitational pull, here it went up a little bit. \nRight? So you can think about it just like that.  ", "start": 927.1, "duration": 4.566}, {"text": "And here it came back down. That's why I like \nthis analogy because it really gives you intuitive  ", "start": 932.3, "duration": 5.6}, {"text": "feeling for what's happening here. There's a \nprocess. The process is pushing the bookcase over.  ", "start": 937.9, "duration": 5.765}, {"text": "That bookcase has some energy associated \nwith it. Here and here. Potential energy.  ", "start": 944.616, "duration": 6.567}, {"text": "And it's got some energy I gotta put into \nit to activate it to go from here to here.  ", "start": 951.183, "duration": 5.2}, {"text": "Right? That's why that's called the activation \nenergy. That's what this Ea means for the general  ", "start": 957.5, "duration": 6.316}, {"text": "Arrhenius equation. You're pushing the bookcase \nover. Yeah but how are you going to push it over?  ", "start": 963.816, "duration": 5.767}, {"text": "Well clearly you're going to run \naround the room and accidentally  ", "start": 970.133, "duration": 3.133}, {"text": "knock into it because that's temperature. \nMaybe that's not a good-- But if you had a  ", "start": 973.266, "duration": 4.8}, {"text": "lot of people running around a bookcase maybe \nonce in a while they'd kind of bang into it.  ", "start": 978.066, "duration": 4.717}, {"text": "Thermal energy. Right? And then maybe another \ntime, you increase how fast everyone's running,  ", "start": 983.416, "duration": 6.484}, {"text": "and you give them more energy. So now not only \nare they hitting it more frequently but they're  ", "start": 991.333, "duration": 6.483}, {"text": "they're actually hitting it with more energy. \nThey're able to give it more energy. Now you make  ", "start": 997.816, "duration": 5.05}, {"text": "everyone run really fast. And the chances that \nthis thing goes through that process are higher.  ", "start": 1002.866, "duration": 5.434}, {"text": "That's what that is. That's a probability, \nright? This is what this exponential is. That  ", "start": 1010.066, "duration": 5.917}, {"text": "was the brilliance of what he did right. \nSo this thermal energy is like, you know,  ", "start": 1015.983, "duration": 6.8}, {"text": "it's how much-- It's like a probability but that's \nwhy it goes into an exponential. Because when you  ", "start": 1022.783, "duration": 5.833}, {"text": "increase temperature, again it's not just that \nyou're increasing how much energy over here,  ", "start": 1028.616, "duration": 5.45}, {"text": "Right? How this is get like kinetic energy of \nsome molecules. Maybe how much energy those  ", "start": 1035.183, "duration": 3.916}, {"text": "molecules have but you're increasing how many of \nthem are above some threshold. So your chances  ", "start": 1039.099, "duration": 7.517}, {"text": "go exponentially higher. Well you think if \nit was harder and harder to push. But this  ", "start": 1048.133, "duration": 4.8}, {"text": "is going to go the other way too. You could have \nsometimes somebody might knock it the other way.  ", "start": 1052.933, "duration": 5.6}, {"text": "It looks kind of hard from this picture. \nBut there's a chance. It's just that  ", "start": 1058.533, "duration": 4.8}, {"text": "the activation energy going this way, right? \nGoing this way, the activation energy is here.  ", "start": 1063.333, "duration": 5.6}, {"text": "'Ea' and going this way the activation \nenergy would be here. So this would be 'Ea'  ", "start": 1069.816, "duration": 7.284}, {"text": "for, let's see, three to one. And this \nwould be 'Ea' for one to three. Now again,  ", "start": 1078.133, "duration": 12.483}, {"text": "I am giving you the general Arrhenius. We will \nbe coming back to this when we do reaction rates.  ", "start": 1091.583, "duration": 5.683}, {"text": "We will be coming back to this picture, and we \nwill be talking about reactions, and then we'll  ", "start": 1098.3, "duration": 4.083}, {"text": "be using that, and going to equilibrium. Today, \nI want to give you a sense for what Arrhenius is  ", "start": 1102.383, "duration": 5.033}, {"text": "because this is where the equation comes from. And \nbecause if you think about now defect formation.  ", "start": 1107.416, "duration": 8.484}, {"text": "Defect formation is an activated-- it's a \nthermally activated process. But that's exactly  ", "start": 1117.416, "duration": 7.45}, {"text": "the point. So that's why if we write this down-- \nI've said this now multiple times the vacancy...", "start": 1124.866, "duration": 7.434}, {"text": "'vacany'. No. Vacancy is \nalways present. Always present!", "start": 1134.7, "duration": 8.4}, {"text": "Why? Because it's thermally activated. So unless \nI can get to T equals zero-- thermally activated.", "start": 1145.9, "duration": 8.483}, {"text": "There's always a chance that I \npush a vacancy into the material.  ", "start": 1156.866, "duration": 4.234}, {"text": "There's also always a chance \nthat the vacancy gets pushed out.  ", "start": 1161.816, "duration": 2.717}, {"text": "So those are happening because of temperature. \nYou can think about that. It kind of makes sense,  ", "start": 1165.666, "duration": 5.434}, {"text": "right? Atoms are moving. Those are the people-- \nright-- there's the people in the room.  ", "start": 1171.1, "duration": 4.4}, {"text": "And now all of a sudden, something happens \nsomewhere that allows an atom to come out.  ", "start": 1176.783, "duration": 7.033}, {"text": "We'll talk about that in a second. And create \na vacancy. Now there's a chance that it can go  ", "start": 1184.383, "duration": 5.917}, {"text": "back too, right? And so there's at some point \nthere's an equilibrium concentration. Both of  ", "start": 1190.3, "duration": 5.833}, {"text": "those are thermally activated processes that have \nan Arrhenius like behavior. And so you get to...", "start": 1196.133, "duration": 6.8}, {"text": "the very nice expression for concentration. \nSo you can get-- can get? Yeah,  ", "start": 1205.583, "duration": 11.517}, {"text": "why not-- get concentration. So \nthe concentration at equilibrium.", "start": 1217.1, "duration": 7.683}, {"text": "Since vacancy formation is thermally activated \nand it's thermally deactivated. There's some--  ", "start": 1227.183, "duration": 5.517}, {"text": "you know, you can say well when it's activated \nand deactivated in the same rates you're in  ", "start": 1232.7, "duration": 4.316}, {"text": "equilibrium. That's how you get a concentration. \nAnd I don't need you to know the math  ", "start": 1237.016, "duration": 5.05}, {"text": "but I need-- This is where it comes from. The \nnumber of vacancies divided by the total number  ", "start": 1242.066, "duration": 6.15}, {"text": "of sites is equal to e to the minus E vacancy-- \nI will talk about this-- vacancy divided by,  ", "start": 1248.216, "duration": 9.117}, {"text": "let's use RT still. RT. Now here's the thing \nabout RT. Let's write this down because this  ", "start": 1259.583, "duration": 5.75}, {"text": "is really important, right? If-- we talked about \nthis before-- if I'm using RT then it's per mole.", "start": 1265.333, "duration": 7.85}, {"text": "Per mole use RT. This is the ideal \ngas constant, right? That's not just  ", "start": 1275.816, "duration": 5.85}, {"text": "used for ideal gases. This is used for a \nlot of things. That's the gas constant.", "start": 1281.666, "duration": 3.834}, {"text": "Gas constant. That's equal to-- let's see if i \nhave down here-- 8.314 joules per mole Kelvin.  ", "start": 1287.816, "duration": 8.884}, {"text": "So you see if I'm working in per mole, then I use \nR. This is-- the energy unit the-- those energy  ", "start": 1298.133, "duration": 7.367}, {"text": "units have to be the same. They got to cancel. So \nif my activation energy is in per mole, fine, use  ", "start": 1305.5, "duration": 8.233}, {"text": "the gas constant. If the activation energy is in \nper atom then we just use the Boltzmann constant:  ", "start": 1313.733, "duration": 7.683}, {"text": "kBT. Where the Boltzmann constant \nis something we have seen,  ", "start": 1322.933, "duration": 6.733}, {"text": "it is equal to the ideal gas constant divided by \nAvogadro's number. Remember that Avogadro's number  ", "start": 1329.666, "duration": 8.4}, {"text": "goes in and out atomic macroscopic worlds \nso R and kB same thing. Okay. One thing--  ", "start": 1338.066, "duration": 11.667}, {"text": "notice that's per Kelvin. Whenever you have \nequations like this that come from thermodynamics,  ", "start": 1349.733, "duration": 6.967}, {"text": "which is where these things come from. \nThere is only one temperature unit. There  ", "start": 1356.7, "duration": 5.433}, {"text": "is no other. And it is Kelvin. You have to be \naware of that. If you see something in Celsius,  ", "start": 1362.133, "duration": 6.0}, {"text": "it's not going to work. It's got to be Kelvin. \nAll of these equations have to use Kelvin. Okay.  ", "start": 1368.133, "duration": 6.567}, {"text": "So that now-- you can see at any \ntime, you know, any time you see", "start": 1376.066, "duration": 4.4}, {"text": "an equation with an exponential. \nWhat's the first thing you want to do?  ", "start": 1384.066, "duration": 4.0}, {"text": "I mean it's like an-- it's almost like an \ninstinctual reaction. You see an exponential. Take  ", "start": 1389.666, "duration": 5.267}, {"text": "a log. Don't say anything until you take a log. \nRight? So that's an-- so that-- so we're talking  ", "start": 1394.933, "duration": 5.933}, {"text": "about energy of the vacancy in a minute. But if \nyou take a log of this. Then you get that the log  ", "start": 1400.866, "duration": 5.517}, {"text": "of what '|n(Nv)'. Well I'll talk \nabout that. Equals log of N.  ", "start": 1407.733, "duration": 8.333}, {"text": "Let's do it this way. Minus \nlog of n equals E vacancy.", "start": 1417.733, "duration": 6.4}, {"text": "Okay. Divided by RT. That's just taking an \nexponential, a logarithm of this equation. And  ", "start": 1427.016, "duration": 8.084}, {"text": "now I can talk about these Nv and N. So Nv is-- \nthis is literally a concentration. This is the  ", "start": 1435.1, "duration": 6.316}, {"text": "concentration of vacancies that are forming in my \ncrystal. Why did i get this expression and notice  ", "start": 1441.416, "duration": 5.917}, {"text": "the constant cancelled. This pre-exponential \nfactor cancelled. It canceled because  ", "start": 1447.333, "duration": 5.05}, {"text": "I'm taking a concentration. I'm looking at the \nrate going one way and the rate going the other.  ", "start": 1452.383, "duration": 3.917}, {"text": "And I get to take a ratio of those. That leads \nme to this expression. That's how you get from  ", "start": 1457.183, "duration": 6.4}, {"text": "Arrhenius rates to some concentration. Okay. But \nyou still-- but notice it's still-- we call this  ", "start": 1463.583, "duration": 8.717}, {"text": "Arrhenius-like because it's still an exponential \ndependence. It's not a rate, it's a concentration.  ", "start": 1472.3, "duration": 5.833}, {"text": "It's okay. It's a concentration in equilibrium. \nSo this would be like the number of vacancies,  ", "start": 1478.133, "duration": 4.883}, {"text": "number of vacancies. And this one here \n'n' would be like the number of sites,  ", "start": 1484.383, "duration": 7.117}, {"text": "number of lattice sites. So it's like you \nknow concentration. Lattice sites. Right?", "start": 1491.5, "duration": 5.033}, {"text": "And what is this? This is exactly here, here we \ngo. I have my crystal. Okay. Here's my crystal and  ", "start": 1498.933, "duration": 8.8}, {"text": "here it is... I think I'll \nstop here. And now I did this.  ", "start": 1508.616, "duration": 3.284}, {"text": "We're going to go graphical and this and this.", "start": 1512.933, "duration": 4.25}, {"text": "That energy is literally the energy difference. \nIt's literally the energy difference between  ", "start": 1520.066, "duration": 8.234}, {"text": "having a vacancy and not having \na vacancy. How much energy--  ", "start": 1528.3, "duration": 3.683}, {"text": "Question? [STUDENT:] Isn't there supposed to \nbe a negative sign in front of the E vacancy?", "start": 1532.7, "duration": 3.5}, {"text": "[PROFESSOR:] Yes there is. Oh yes there \nis. Yes there is. Thank you very much.  ", "start": 1536.2, "duration": 4.183}, {"text": "Yes. So that's-- Okay. So now the energy \ndifference between having a vacancy and not,  ", "start": 1541.016, "duration": 8.167}, {"text": "is the vacancy formation energy. E vacancy. Now \nsometimes, and this is unfortunate, but sometimes  ", "start": 1549.183, "duration": 8.883}, {"text": "you will see the vacancy formation energy written \nas the activation energy. That's fine. I mean it  ", "start": 1558.7, "duration": 7.2}, {"text": "just it's written that way to get across the \npoint that it's an Arrhenius-like behavior.  ", "start": 1565.9, "duration": 5.433}, {"text": "But actually the act-- but \nif you're clear about it.  ", "start": 1572.616, "duration": 2.567}, {"text": "And that's why I want to go through the bookcase \nexample, right? The formation energy which is this  ", "start": 1576.133, "duration": 6.8}, {"text": "energy of the vacancy forming is the difference \nbetween here and here. The activation energy  ", "start": 1582.933, "duration": 6.0}, {"text": "is this hill that you got to get over to go back \nand forth. Okay? So the formation energy between  ", "start": 1589.5, "duration": 6.883}, {"text": "having a vacancy and not is what goes into our our \nequation. Alright. Now we're going to use this.  ", "start": 1596.383, "duration": 6.55}, {"text": "So we will see how this works in just a few \nminutes. But again there are so many processes  ", "start": 1602.933, "duration": 6.4}, {"text": "that are thermally activated. There are so many \nprocesses that have Arrhenius-like behavior.  ", "start": 1609.98, "duration": 6.636}, {"text": "That are Arrhenius-like. And if you go to \nDartmouth then they'll give you goodie bags  ", "start": 1617.183, "duration": 5.117}, {"text": "with live crickets. And actually I really \nhope not. But this is one of the labs that  ", "start": 1622.3, "duration": 4.966}, {"text": "they have where they take crickets and they \nmeasure the number of times a cricket chirps.  ", "start": 1627.266, "duration": 5.117}, {"text": "And they're like, well okay. Let's measure the \ncricket chirp over 13 seconds. We're gonna cool  ", "start": 1633.183, "duration": 5.683}, {"text": "them down, hopefully not too cold, and then we're \ngoing to heat them up, hopefully not too hot.  ", "start": 1638.866, "duration": 4.867}, {"text": "Because crickets are nice, right? And so \nthen-- and they ca-- but look at that. And  ", "start": 1645.1, "duration": 5.033}, {"text": "they count it. And then what do they do? Well they \ndidn't know about Arrhenius yet until somebody  ", "start": 1650.133, "duration": 5.367}, {"text": "from MIT went and visited. So the first thing \nthey did is they plotted the data. Look at that.  ", "start": 1655.5, "duration": 5.833}, {"text": "Chirps per 13 seconds plotted. And they're all \nsitting there trying to fit a straight line to  ", "start": 1661.333, "duration": 5.533}, {"text": "it. And then someone from this class is up \nthere visiting. They're like, you know what  ", "start": 1666.866, "duration": 4.867}, {"text": "i think, this looks like a thermally activated \nprocess. So i think it's probably exponential.  ", "start": 1671.733, "duration": 4.65}, {"text": "And then they fit this nice exponential and \nit fits the the cricket tripping beautifully.  ", "start": 1677.183, "duration": 5.6}, {"text": "And you can go even further because you see \nif you got this far. Well now you see this  ", "start": 1683.816, "duration": 8.65}, {"text": "is a line. This is a line and we're going to do \nthat a lot when we go into reaction kinetics.  ", "start": 1692.466, "duration": 4.95}, {"text": "If you have a exponential and you take a log, \nthat's a line versus 1 over T. Right? That's a  ", "start": 1698.383, "duration": 6.883}, {"text": "line versus 1 over T. And so that's another way \nyou could look at data. They didn't do it there.  ", "start": 1705.266, "duration": 4.8}, {"text": "But, you know, you could plot for example-- \nyou could plot 1 over T versus the log of  ", "start": 1710.7, "duration": 10.8}, {"text": "the number of vacancies. But the lattice-- the \nnumber of vacancies is what we want. That ratio  ", "start": 1722.216, "duration": 8.084}, {"text": "is the concentration. That concentration \nis in equilibrium at some temperature.  ", "start": 1730.3, "duration": 4.166}, {"text": "Okay. The lattice-- the number of lattice sites \nis simply how many lattice sites you have,  ", "start": 1735.183, "duration": 5.683}, {"text": "in whatever volume you have, for whatever crystal \nstructure you have, for whatever element you have.  ", "start": 1740.866, "duration": 4.8}, {"text": "We'll see that in a few examples. So that's just \na concert-- it's the number of sites you have in  ", "start": 1746.216, "duration": 4.484}, {"text": "the chunk of material. And then instead of-- The \nquestion this equation tells you the answer to,  ", "start": 1750.7, "duration": 4.633}, {"text": "is how many of those have a vacancy? \nBecause it's a thermally activated process.  ", "start": 1755.333, "duration": 4.883}, {"text": "And if you plot that log in Nv versus \ntemperature you get this really nice  ", "start": 1761.183, "duration": 7.2}, {"text": "linear line. And the slope of that \nline is equal to minus E vacancy", "start": 1768.383, "duration": 8.483}, {"text": "divided by R or it could be kB. R. \nLet's write this again per mole.", "start": 1779.183, "duration": 7.833}, {"text": "Or it could be kB if it's \nper atom. You will see both.  ", "start": 1790.533, "duration": 5.683}, {"text": "You will see both. And this \nintercept-- intercept--", "start": 1796.933, "duration": 5.133}, {"text": "is equal to the-- let's see-- the intercept \nis equal-- what do i have here? The  ", "start": 1805.183, "duration": 6.4}, {"text": "log of n. Did i write it right? Log of n.", "start": 1812.533, "duration": 3.367}, {"text": "Okay. Alright.", "start": 1820.066, "duration": 2.0}, {"text": "Now, okay. Oh yeah. What else can you \ndo? Well before we go on to the defects,  ", "start": 1824.783, "duration": 5.35}, {"text": "this explains the doping. I kept calling \nthe doping in semiconductors a thermally  ", "start": 1830.133, "duration": 5.767}, {"text": "activated process. But look at what happens. \nThis is the carrier concentration in that  ", "start": 1835.9, "duration": 7.6}, {"text": "conduction band. The thing you've \nbeen you've been learning about,  ", "start": 1843.5, "duration": 2.8}, {"text": "right? And thinking about. But look at it \nnow versus temperature. It's a straight line.  ", "start": 1846.3, "duration": 4.8}, {"text": "It's a straight line. This is-- this \nis experimentally what you observe.  ", "start": 1852.3, "duration": 3.683}, {"text": "And the reason is because it's a thermally \nactivated process. And in fact, in this case,  ", "start": 1856.933, "duration": 4.083}, {"text": "what is the activation energy? Right? The \nactivation energy for getting an electron into  ", "start": 1862.066, "duration": 6.067}, {"text": "the conduction band is the gap. Right? And so now \nyou say germanium has a smaller gap than silicon,  ", "start": 1868.133, "duration": 7.85}, {"text": "which has a smaller gap than gallium arsenide. \nThe slopes are different. The slopes are different  ", "start": 1875.983, "duration": 6.317}, {"text": "because the energy that it takes in that activated \nprocess is the gap. That's why the slopes are  ", "start": 1883.266, "duration": 6.4}, {"text": "different. Right? Okay. Alright. Now on to-- \noh no i didn't-- I did want to mention this  ", "start": 1889.666, "duration": 6.55}, {"text": "because it's so cool. Where are these vacancies \ngoing? Did you actually just take an atom from  ", "start": 1896.216, "duration": 7.684}, {"text": "the middle of a crystal and remove it? No. \nBecause that would cost way too much energy,  ", "start": 1903.9, "duration": 5.116}, {"text": "right? And so instead they have \nto-- you call out to the surface.  ", "start": 1909.583, "duration": 4.317}, {"text": "It's a call out to the surface. Or, \nyou know, maybe the surface calls in.  ", "start": 1914.7, "duration": 4.233}, {"text": "It all has to happen on the surface. So what \nends up happening is a surface atom may go away  ", "start": 1918.933, "duration": 4.883}, {"text": "and then another one may take its place, right? \nAnd then the next one, and then the next one,  ", "start": 1925.266, "duration": 5.35}, {"text": "and that's literally how you can rip \nan atom out from somewhere inside.  ", "start": 1930.616, "duration": 3.45}, {"text": "But by the same-- that's literally pushing the \nbookcase over. Right? And now you can push it  ", "start": 1935.416, "duration": 6.167}, {"text": "the other way and the surface atom could go \nin to the crystal so that some atom inside is  ", "start": 1941.583, "duration": 7.75}, {"text": "able to fill a vacancy. It all comes to \nthe surface. This is a beautiful paper,  ", "start": 1949.333, "duration": 4.25}, {"text": "where they're showing how you get these rings. \nThis was published almost 20 years ago now. But  ", "start": 1954.383, "duration": 5.917}, {"text": "how-- they're studying how do vacancies actually \npull atoms from the surface specifically.  ", "start": 1960.3, "duration": 6.566}, {"text": "And what they did is they change the temperature \nand they see islands growing and shrinking. Where  ", "start": 1966.866, "duration": 5.117}, {"text": "are those islands going and where are they coming \nfrom? Vacancies. It's all about the vacancies,  ", "start": 1971.983, "duration": 6.0}, {"text": "right? And one of the things I loved about \nthis, is this is the abstract of this paper.  ", "start": 1977.983, "duration": 3.917}, {"text": "Look at this. Here we show the vacancy generation \nand annihilation, right? Both ways on the 1-1-0  ", "start": 1981.9, "duration": 6.716}, {"text": "surface of an ordered nickel aluminum \ninter-metallic alloy. Oh, I love reading  ", "start": 1988.616, "duration": 5.85}, {"text": "that because you guys all are experts in this \nnow. You know what that means. You know what that  ", "start": 1994.466, "duration": 4.867}, {"text": "means. Where do vacancies come from? Okay. And \nnow we got to make vacancies. Right? And so this  ", "start": 1999.333, "duration": 6.25}, {"text": "is the kind of problem you might get. How many \nvacancies are in a centimeter cubed of copper?  ", "start": 2005.583, "duration": 4.483}, {"text": "How many vacancies are in a centimeter cubed \nof copper? Well, now you know how to do it.  ", "start": 2011.1, "duration": 4.633}, {"text": "You're just going to apply this Arrhenius-like \nbehavior. You're going to apply this equation to  ", "start": 2015.733, "duration": 7.85}, {"text": "figure that out. And i won't go through \nall the math but i do want to just  ", "start": 2025.016, "duration": 3.6}, {"text": "give you a sense of the types of questions \nthat you can now answer; that you know", "start": 2028.616, "duration": 3.85}, {"text": "how to think about vacancy formation. \nSo for example, in this one you've got  ", "start": 2035.016, "duration": 5.85}, {"text": "step one. Step one: you would find N.", "start": 2041.983, "duration": 4.55}, {"text": "Step one: you'd find N. How many sites do I \nhave? Because remember this equation is about  ", "start": 2049.333, "duration": 6.0}, {"text": "a concentration between the number of vacancies \nand the number of available sites for vacancies.  ", "start": 2055.333, "duration": 4.967}, {"text": "And so step one-- well-- so step one you'd say N \nequals Avogadro's number times 8.4 grams per mole.  ", "start": 2060.3, "duration": 11.6}, {"text": "Right? Divided by all this-- is such old-school \nstuff right now, right? Grams per mole. Then you  ", "start": 2072.783, "duration": 5.833}, {"text": "look that up in the periodic table and it's 8 \ntimes 10 to the 22nd sites per centimeter cubed.", "start": 2078.616, "duration": 11.85}, {"text": "Why am I using centimeter cubed? Well because \nthat's what i was given the density in. So I'm  ", "start": 2093.815, "duration": 3.918}, {"text": "just leaving it in those units for now. \nRight? And then step two you can find Nv.  ", "start": 2097.733, "duration": 7.283}, {"text": "So now we can apply our our equation. \nNv equals N, I won't repeat it, times  ", "start": 2106.216, "duration": 10.717}, {"text": "e. Now I've got my kB instead of R. So it's 9.9 \nelectron volts divided by and then this is kBT.  ", "start": 2116.933, "duration": 13.133}, {"text": "Now I get-- so I'm given that it's a thousand-- \nwait a second. What's the term, oh a thousand  ", "start": 2130.783, "duration": 6.317}, {"text": "degrees. So do I put T equals a thousand. No! \nNo! You never use-- you only use Kelvin. 1273,  ", "start": 2137.1, "duration": 9.833}, {"text": "right? T is always in Kelvin \nfor any of these thermodynamic  ", "start": 2147.733, "duration": 3.2}, {"text": "equations. And I won't go through the math but \nit goes something like 2.2 times 10 to the 19th", "start": 2151.983, "duration": 7.917}, {"text": "vacancies. I'll write the units here just for \ncompleteness. Vacancies per centimeter cubed.  ", "start": 2162.216, "duration": 6.25}, {"text": "Now that seems like a lot but it's actually \nnot. You say it's like one in a thousand or  ", "start": 2170.383, "duration": 3.683}, {"text": "one in ten thousand atoms are missing and I'm at \na really high temperature. If I were at-- then  ", "start": 2174.066, "duration": 5.667}, {"text": "this is the power of what Arrhenius gave us. \nIf-- Because it's exponential. It's all about  ", "start": 2179.733, "duration": 6.083}, {"text": "probabilities and sampling and how many times \ndid i bump into that bookcase. If I'm down at  ", "start": 2185.816, "duration": 5.85}, {"text": "room temperature I've got so much less energy, \nand so many more chances-- so many fewer chances  ", "start": 2191.666, "duration": 6.4}, {"text": "to deliver that energy. Right? Where the surface \nis taking atoms in and out to create vacancies.  ", "start": 2198.066, "duration": 5.917}, {"text": "That at room temperature the number of vacancies \nis 10 to the seventh instead of 10 to the 19th.  ", "start": 2203.983, "duration": 6.883}, {"text": "Right? So that's the power of that exponential. \nThat's the power of the exponential. You might  ", "start": 2211.733, "duration": 4.733}, {"text": "also be asked questions like this one. Right? So \n--oh no like-- let me do this one. Then I'll talk  ", "start": 2216.466, "duration": 4.95}, {"text": "about your goodie bag. Where instead of now-- \nOkay. What-- Example two. What is the vacancy  ", "start": 2221.416, "duration": 4.967}, {"text": "formation energy in aluminum? And now notice, \ninstead of giving you the vacancy formation energy  ", "start": 2226.383, "duration": 6.0}, {"text": "per atom, I'm giving you other stuff. I'm \nactually giving you how many vacancies you got,  ", "start": 2232.933, "duration": 5.683}, {"text": "at some temperature. Well that's-- This just going \nin a different direction but it's using the same  ", "start": 2239.983, "duration": 6.15}, {"text": "math. So you can go in different ways, arrive at \nthe same kinds of equations, and get all of these  ", "start": 2246.133, "duration": 7.367}, {"text": "things, and I won't go through the details. \nBut in this case you get that Ea equals minus  ", "start": 2253.5, "duration": 9.283}, {"text": "kBT. I'm using kB because look at that... \nthe formation energy I'm asking is what is  ", "start": 2263.416, "duration": 7.117}, {"text": "the vacancy formation energy-- Okay, well actually \nlook at that. No, I just want to do it per atom.  ", "start": 2270.533, "duration": 4.967}, {"text": "It didn't say per atom but if I wanted to do a per \natom, I'd use kBT times log Nv over N. And so you  ", "start": 2276.383, "duration": 8.8}, {"text": "see 0.75 eV per atom. Now what's interesting, \ncopper was-- copper was 0.9, aluminum .75.  ", "start": 2285.183, "duration": 13.833}, {"text": "You're going to have a lot more vacancies \nbecause it's exponential. This seems like-- 0.9,  ", "start": 2300.866, "duration": 6.834}, {"text": ".75 is kind of the same. No. It's going into an \nexponential, so it has a really big difference  ", "start": 2307.7, "duration": 6.516}, {"text": "on how many vacancies you have at any given \ntemperature. Aluminum is going to have a lot  ", "start": 2314.216, "duration": 4.25}, {"text": "more because it's easier to get them in there. \nRight? Notice I did the thing that I said other  ", "start": 2318.466, "duration": 8.317}, {"text": "people do and I don't really like. That's the \nenergy of the vacancy. The vacancy formation.", "start": 2326.783, "duration": 5.833}, {"text": "People call it activation \nenergy all over the place.  ", "start": 2336.866, "duration": 3.2}, {"text": "Okay. Now this is your goodie bag. \nNow why am I giving to you? Because  ", "start": 2340.783, "duration": 3.117}, {"text": "first of all, this is the most sophisticated \nvacancy generation machine you'll ever find.  ", "start": 2345.183, "duration": 6.233}, {"text": "There are exactly 500 beads in this. Exactly. \nThere are not 501. There are not 499. And you know  ", "start": 2351.983, "duration": 6.483}, {"text": "why? Because Laura has spent 7,000 hours counting \nbeads in every single one of these. So you have  ", "start": 2358.466, "duration": 7.35}, {"text": "exactly the right number. Then there's precision \ntape and polycarbonate films maybe. And what you  ", "start": 2365.816, "duration": 6.967}, {"text": "guys can do is build your own crystal. It's a 2d \ncrystal. Here's what's so cool about this. Try to  ", "start": 2372.783, "duration": 5.433}, {"text": "get those vacancies out. Look at this! Dude-- None \nof you can see what I'm talking about. [LAUGHTER]", "start": 2378.216, "duration": 7.084}, {"text": "There's a big vacancy there, I've literally \nmade this right in front of me. This is here.  ", "start": 2385.816, "duration": 5.45}, {"text": "And now I'm gonna say-- \nokay, I'll use temperature.", "start": 2393.333, "duration": 2.733}, {"text": "There's so many more. There's so many more because \nI use temperature. This is temperature. You are  ", "start": 2400.216, "duration": 7.367}, {"text": "temperature. And you can run around, and you can \nshake it, and all you bring it to the dance floor,  ", "start": 2407.583, "duration": 6.083}, {"text": "and on. Then you're like how can I get-- Whoa, \nwait a second. I'll just quietly go down in  ", "start": 2413.666, "duration": 6.15}, {"text": "temperature and I'll get rid of them. Yeah, \ntell that to your friends down the street. See  ", "start": 2419.816, "duration": 5.45}, {"text": "how long they go until they stop trying because \nyou guys know not to try because you'll never get  ", "start": 2425.266, "duration": 4.867}, {"text": "rid of them. You'll never get rid of them. You'll \nalways have vacancies and this is proof that you  ", "start": 2430.133, "duration": 6.167}, {"text": "will always have vacancies. You can try to tap it \nlike that. See if you can get rid of the defects.  ", "start": 2436.3, "duration": 6.0}, {"text": "You can't. Luckily that's a good thing because \ndefects are what make everything interesting.  ", "start": 2442.3, "duration": 4.566}, {"text": "Everything. This is your goodie bag. So you \ncan touch and feel-- Oh, but we got to cover  ", "start": 2447.733, "duration": 6.333}, {"text": "the other case. Because-- See I could have had \nnot just a metal, where every atom is the same,  ", "start": 2454.066, "duration": 7.517}, {"text": "but i could have had an ionic solid. You can \nmake point defects in ionic solids as well.  ", "start": 2462.466, "duration": 4.467}, {"text": "Right? So yeah. So if I had a defect in an ionic \nsolid-- well now you got to consider the charge.  ", "start": 2467.816, "duration": 7.684}, {"text": "I can't just keep pulling-- If this is sodium \nchloride, I can't just keep pulling out  ", "start": 2475.5, "duration": 3.433}, {"text": "like one type of atom. If I take a sodium \natom out. Like imagine that's a plus,  ", "start": 2479.583, "duration": 6.0}, {"text": "minus, plus, minus. Right? The size-- if I take a \nsodium atom out then it becomes charged. Because  ", "start": 2485.583, "duration": 6.55}, {"text": "remember the ionic bond is one of them, grabbed \nit and it has it. And so if I take one out,  ", "start": 2492.133, "duration": 5.367}, {"text": "I've charged the crystal. You can't do that. It \nwon't let you. So if I take a sodium atom out,  ", "start": 2497.5, "duration": 5.916}, {"text": "a chlorine is going to come too. It's got to \ncome too. You got to keep it charged neutral,  ", "start": 2503.416, "duration": 4.65}, {"text": "if it starts charging neutral. So these \nhave special names because of that.  ", "start": 2508.783, "duration": 5.117}, {"text": "And there are two types of defects in ionic \npoint defects. We're still with point defects.  ", "start": 2515.016, "duration": 7.2}, {"text": "Local disruption in the regularity. One is called \nthe shocky defect, right? So in the shocky defect", "start": 2522.216, "duration": 8.084}, {"text": "you got both an anion and a cation are removed. \nCation. Now here's the thing- I should have put  ", "start": 2532.383, "duration": 13.517}, {"text": "'s' because you may need to take \nmore than one out. Alright? Removed--  ", "start": 2545.9, "duration": 6.966}, {"text": "and because you got to ensure--", "start": 2554.466, "duration": 1.517}, {"text": "ensure charge neutrality. Charge neutrality. So \nlike you know-- If I had so inquiry that's fine.  ", "start": 2558.616, "duration": 11.117}, {"text": "But what if I had you know something else. \nWhat if I had instead of sodium chloride.  ", "start": 2569.733, "duration": 4.883}, {"text": "What if I had like calcium chloride. So now what \nif I had calcium chloride. Well that looks like  ", "start": 2574.616, "duration": 6.084}, {"text": "that. Because calcium goes to two plus. We \nknow this. Right? But chlorine is only minus  ", "start": 2580.7, "duration": 6.966}, {"text": "one so that ionic crystal is different. And \nwhat it means is that if I remove-- if I remove", "start": 2587.666, "duration": 8.067}, {"text": "a calcium it's going to come out \nas Ca2 plus but that means i need", "start": 2598.466, "duration": 4.317}, {"text": "to remove two Cl minus atoms.", "start": 2605.416, "duration": 5.05}, {"text": "That's the thing about shocking defects. You \ngot to keep the charge balanced. So now you--  ", "start": 2612.783, "duration": 3.917}, {"text": "It's not just a one for one. This could actually \nbe a way to take atoms out. Or if I want to take  ", "start": 2616.7, "duration": 6.316}, {"text": "chlorine out of this, we'll take some calcium out.  ", "start": 2623.816, "duration": 2.484}, {"text": "Chlorine will come out too. Right? \nCould be a way to engineer it.", "start": 2626.933, "duration": 3.367}, {"text": "So that's a that's a shocking defect. But \nthe simpler thing that could have happened  ", "start": 2632.383, "duration": 3.2}, {"text": "is just that one of these atoms kind of moved \nover. So now I didn't remove it from the crystal  ", "start": 2636.3, "duration": 5.6}, {"text": "but it just kind of wandered over into some site. \nSo like you know... here's BCC. I can have like  ", "start": 2643.333, "duration": 7.767}, {"text": "an atom-- so this doesn't look like an ionic solid \nbut suppose-- it doesn't matter. I could have an  ", "start": 2651.1, "duration": 6.883}, {"text": "atom leave a site and go-- Notice that there \nare these voids, right? They're these spaces in  ", "start": 2657.983, "duration": 6.083}, {"text": "between other atoms. Well those spaces are places \nwhere atoms can go. They're not-- It's not part  ", "start": 2664.066, "duration": 8.0}, {"text": "of the regular lattice but it's just-- it's like \na hole, right? Remember the packing fractions.  ", "start": 2672.066, "duration": 6.067}, {"text": "We never got above about three quarters. We \nnever got about three-- that means there's  ", "start": 2678.783, "duration": 5.2}, {"text": "still a bunch of volume in there that's free \nvolume. Right? Where is it? Well this kind of  ", "start": 2683.983, "duration": 5.6}, {"text": "defect will find it. Right? So you could have \nthe smaller ion migrate over, create a vacancy,  ", "start": 2689.583, "duration": 7.6}, {"text": "and it's going to find a place where it likes \nto go. Ah. Okay. Yeah, we'll do this. And so--", "start": 2698.216, "duration": 8.4}, {"text": "so that's called a Frenkel defect.", "start": 2709.5, "duration": 2.083}, {"text": "So Frenkel defect is the other kind of special \nname we give to a vacancy in an ionic solid, and  ", "start": 2715.333, "duration": 7.933}, {"text": "it's where one ion-- right-- anion \nor cation. Anion or cation. Moves", "start": 2724.133, "duration": 10.0}, {"text": "to some open space. Open space in the lattice. \nAnd you can already kind of feel where this  ", "start": 2737.733, "duration": 11.45}, {"text": "might be kind of common. It might be common in \nsituations where you've got a big size difference,  ", "start": 2749.183, "duration": 6.95}, {"text": "right? So like the silver halides are a \ngood example. Like silver chloride, silver  ", "start": 2756.7, "duration": 6.566}, {"text": "bromide, silver iodide. Those \nare all good examples because  ", "start": 2764.466, "duration": 5.917}, {"text": "what happens there is this ionic structure has \na very big mismatch between the atom sizes.  ", "start": 2771.266, "duration": 5.434}, {"text": "And so you can see. Let's blow up a picture of \nthis is silver iodide, a cartoon. Look at that.  ", "start": 2777.816, "duration": 5.517}, {"text": "So those are the silver atoms and what you see \nis because there's such a big difference in size,  ", "start": 2783.333, "duration": 4.25}, {"text": "you're going to have these pretty big voids. \nAnd one of the atoms is small enough that it  ", "start": 2787.583, "duration": 4.317}, {"text": "actually doesn't mind-- it's actually pretty \neasy to move it. Ah now, if you think about it.  ", "start": 2791.9, "duration": 6.716}, {"text": "Well if you have enough vacancies in there, then \nmaybe those ions can actually move really freely.  ", "start": 2799.983, "duration": 6.317}, {"text": "Because they're so small and the voids \nare all kind of nearby. And you actually  ", "start": 2806.933, "duration": 4.8}, {"text": "can get a conductor, a good conductor, this \nway. You're creating vacancies on purpose  ", "start": 2811.733, "duration": 6.0}, {"text": "so that one of the ions can move around. The \nsmaller one, right? That's what we do. We make  ", "start": 2818.383, "duration": 5.283}, {"text": "these solid-state ionic conductors. You need \nthe vacancies. You need the vacancies. Okay.  ", "start": 2823.666, "duration": 6.8}, {"text": "Now, I told you that we got this map here. We've \ntalked about literally just one. Luckily I don't  ", "start": 2830.466, "duration": 9.667}, {"text": "have nearly the same amount of material to talk \nabout these others. The vacancy is clearly the one  ", "start": 2840.133, "duration": 5.85}, {"text": "that I'm very interested in. The substi-- the \nself-interstitial is actually pretty easy to  ", "start": 2845.983, "duration": 6.15}, {"text": "understand. The self-interstitial is actually \npretty easy to understand because it simply  ", "start": 2852.133, "duration": 4.25}, {"text": "doesn't really happen much. And the reason is, if \nyou look at this. Here's a picture of is basically  ", "start": 2856.383, "duration": 7.433}, {"text": "what i drew on the board, right? But now I've \nput-- so these are-- this is not a vacancy,  ", "start": 2863.816, "duration": 5.284}, {"text": "right? This is a kind of point defect but it's \nnot a vacancy. I've actually added an atom into  ", "start": 2870.3, "duration": 5.433}, {"text": "the lattice and I've squeezed it in between all \nthe others. You can just feel how much energy,  ", "start": 2875.733, "duration": 5.683}, {"text": "how much strain, those other atoms are gonna \nhave to make and how much energy that's going  ", "start": 2881.416, "duration": 4.167}, {"text": "to cost. Those are high energy defect. So \na self-interstitial-- a self-interstitial--  ", "start": 2885.583, "duration": 6.633}, {"text": "self just means it's the same atom as the rest of \nthem, is very infrequent. Is very infrequent. The  ", "start": 2892.216, "duration": 7.2}, {"text": "self-interstitial-- let's see-- I'll just use this \none again. The self-interstitial has an energy of  ", "start": 2899.416, "duration": 8.8}, {"text": "formation of something like you know five electron \nvolts. And you think but-- five electron volts.", "start": 2908.216, "duration": 7.85}, {"text": "Self-interstitial. Self-interstitial.", "start": 2918.3, "duration": 4.8}, {"text": "It went in between, so it's not substitutional  ", "start": 2925.5, "duration": 3.283}, {"text": "it's interstitial and itself because it's the \nsame atom type. The energy energy of formation", "start": 2928.783, "duration": 7.117}, {"text": "is 5ev. I think 5ev doesn't even sound that much \nhigher than like the one ev you had for copper,  ", "start": 2939.583, "duration": 6.95}, {"text": "right? 0.9 ev. But it goes into the exponential, \nright? So it's like one per centimeter cubed.  ", "start": 2946.533, "duration": 8.483}, {"text": "Literally. You get like one of these happening \nper centimeter cubed instead of 10 to the 20th,  ", "start": 2955.016, "duration": 5.917}, {"text": "or 10 to the 10th, or you know many many orders \nof magnitude higher. So the self-interstitial is  ", "start": 2960.933, "duration": 5.45}, {"text": "actually not very interesting. It's actually \nnot very interesting. Now because we have  ", "start": 2966.383, "duration": 6.0}, {"text": "like half a minute left, I'm not gonna \ntalk about these. We'll have a very brief  ", "start": 2972.383, "duration": 4.4}, {"text": "discussion about these last two types of \npoint defects and then we're gonna make  ", "start": 2976.783, "duration": 3.433}, {"text": "line defects on Wednesday. And my why this \nmatters, I'll give you on Wednesday for this.", "start": 2980.216, "duration": 6.85}]