[{"text": "Professor Dave again, let’s learn to integrate by parts.", "start": 0.5, "duration": 3.14}, {"text": "As we attempt to evaluate more complex integrals,\nwe need to learn a few tricks. Most of these", "start": 10.74, "duration": 6.4}, {"text": "are rules of integration that correspond to\nparticular rules of differentiation. The substitution", "start": 17.15, "duration": 6.84}, {"text": "rule, which we just learned, works kind of\nlike the chain rule for differentiation. The", "start": 23.99, "duration": 5.731}, {"text": "product rule for differentiation also has\na corresponding technique for integration,", "start": 29.721, "duration": 5.389}, {"text": "and it is called integration by parts, so\nlet’s learn this technique now.", "start": 35.11, "duration": 4.719}, {"text": "Let’s quickly recall the product rule. It\nsays that the derivative of a product of two", "start": 39.829, "duration": 5.361}, {"text": "functions is equal to the first times the\nderivative of the second, plus the derivative", "start": 45.19, "duration": 5.369}, {"text": "of the first times the second. Well we know\nthat we can always go backwards by integrating,", "start": 50.559, "duration": 5.5}, {"text": "so the integral of this derivative must be\nthe product of the two functions that we started", "start": 56.059, "duration": 5.27}, {"text": "with. Now let’s work with this expression\na little bit to get something more useful.", "start": 61.329, "duration": 7.351}, {"text": "We know that the integral of a sum is equal\nto the sum of integrals, so let’s split", "start": 68.68, "duration": 5.09}, {"text": "this integral up into two separate ones. And\nthen, let’s bring the second integral over", "start": 73.77, "duration": 6.57}, {"text": "to the other side of the equation by subtraction.\nAnd there we have the formula for integration", "start": 80.34, "duration": 7.31}, {"text": "by parts. It may look like we haven’t done\nmuch, but this is actually quite powerful,", "start": 87.65, "duration": 8.039}, {"text": "because up until now we haven’t had any\nway to integrate a product of two functions,", "start": 95.689, "duration": 5.011}, {"text": "other than the substitution rule if we were\nlucky enough that one part was the derivative", "start": 100.7, "duration": 5.16}, {"text": "of the other. But here, we can see that if\nwe have the product of two functions, to integrate,", "start": 105.86, "duration": 7.079}, {"text": "we simply list the first function times the\nantiderivative of the second function, since", "start": 112.939, "duration": 5.051}, {"text": "the antiderivative of g prime is simply g,\nand subtract from that the integral of the", "start": 117.99, "duration": 7.07}, {"text": "antiderivative of the second function times\nthe derivative of the first function. An easier", "start": 125.06, "duration": 5.44}, {"text": "way to remember all this is to represent f\nof x as u, and g of x as v. Then the first", "start": 130.5, "duration": 7.04}, {"text": "integral becomes u dv, and then we have uv,\nminus the integral of v du. The thing to keep", "start": 137.54, "duration": 14.65}, {"text": "in mind here is that while we can apply the\ntechnique to any integrand that is a product", "start": 152.19, "duration": 5.299}, {"text": "of functions, sometimes this will make things\nsimpler, and sometimes it won’t. You’ll", "start": 157.489, "duration": 6.921}, {"text": "notice that the technique leaves us with a\ndifferent integral to evaluate, and if this", "start": 164.41, "duration": 4.74}, {"text": "one is no simpler than what we started with,\nthen this technique is not very useful. But", "start": 169.15, "duration": 5.12}, {"text": "let’s look at some examples where this approach\nworks like a charm, and you’ll get a better", "start": 174.27, "duration": 4.31}, {"text": "sense of exactly when to use it.\nLet’s try to integrate x sine x dx. Before", "start": 178.58, "duration": 8.871}, {"text": "we start getting used to u’s and v’s,\nlet’s just use the first formula, with f", "start": 187.451, "duration": 4.389}, {"text": "and g. Here’s a hint. We know that between\nthese two functions, x, and sine x, one of", "start": 191.84, "duration": 7.31}, {"text": "them will be f and the other will be g prime.\nThe trick is that we want the function that", "start": 199.15, "duration": 7.619}, {"text": "becomes much simpler when differentiated to\nbe f, because f prime will remain in the integral", "start": 206.769, "duration": 7.11}, {"text": "over here, and we will want to be able to\nevaluate this integral easily. So let’s", "start": 213.879, "duration": 5.89}, {"text": "use x as f of x, because its derivative is\none, which is as simple as it gets. So in", "start": 219.769, "duration": 8.041}, {"text": "the first integral, x will be f of x, and\nsine x will be g prime of x. Then to see what", "start": 227.81, "duration": 9.069}, {"text": "this integral is equal to, the first term\nwill be f of x times g of x, so it’s x times", "start": 236.879, "duration": 8.411}, {"text": "the antiderivative of sine x, which we know\nis negative cosine x. So that’s negative", "start": 245.29, "duration": 6.979}, {"text": "x cosine x. Now to evaluate the other integral.\nWe know that g of x is negative cosine x,", "start": 252.269, "duration": 8.481}, {"text": "as we just said, but here’s the best part.\nF prime of x is one. So this second integral", "start": 260.75, "duration": 6.77}, {"text": "is simply negative cosine x. We can take out\nthe negative sign to cancel out the first", "start": 267.52, "duration": 7.369}, {"text": "one. Cosine x is trivial to integrate, it’s\nsine x. So we are left with negative x cosine", "start": 274.889, "duration": 8.831}, {"text": "x plus sine x, plus C. So bear in mind that\nthe reason this worked is because we chose", "start": 283.72, "duration": 7.94}, {"text": "the function for f of x that would yield an\nf prime function that would make this second", "start": 291.66, "duration": 6.24}, {"text": "integral much easier to evaluate than the\nfirst. In this case that was x, because its", "start": 297.9, "duration": 6.32}, {"text": "derivative is one. Choosing sine x would have\nbeen a bad idea, because its derivative is", "start": 304.22, "duration": 5.69}, {"text": "just another trig function, cosine, and the\nother integral wouldn’t have been any easier", "start": 309.91, "duration": 5.24}, {"text": "to evaluate, so this method wouldn’t work.\nLet’s now just explain the other notation", "start": 315.15, "duration": 6.28}, {"text": "we will have to learn, using the same example.\nWe could also have written this with a u in", "start": 321.43, "duration": 5.35}, {"text": "the first integral instead of x, and then\ndv instead of sine x dx. That’s because", "start": 326.78, "duration": 5.83}, {"text": "dv is the derivative of v, which is the g\nof x that was found by taking the antiderivative.", "start": 332.61, "duration": 7.21}, {"text": "So always make sure the dx is part of the\ndv. Then this ended up equaling uv, minus", "start": 339.82, "duration": 9.62}, {"text": "the integral of v du. The reason this is useful\nis because if we set up these relationships", "start": 349.44, "duration": 7.4}, {"text": "for which function represents what, then we\ncan just write out the answer this simpler", "start": 356.84, "duration": 5.22}, {"text": "way, and plug everything back in according\nto our assignments to evaluate. Let’s try", "start": 362.06, "duration": 5.32}, {"text": "another and you’ll see what I mean.\nSay we want to integrate the natural log of", "start": 367.38, "duration": 5.96}, {"text": "x dx. This is not a common integral, and it\nalso doesn’t appear to be a product. But", "start": 373.34, "duration": 5.73}, {"text": "let’s see how we actually can integrate\nby parts. We have to assign u and dv first,", "start": 379.07, "duration": 8.099}, {"text": "and here there is only one option, as there\nis only one function. Natural log of x will", "start": 387.169, "duration": 4.711}, {"text": "become u, and dx will become dv. When we write\nout the answer we will also need du, which", "start": 391.88, "duration": 7.22}, {"text": "is the derivative of u, and that’s one over\nx dx. And we need v, which is the antiderivative", "start": 399.1, "duration": 6.659}, {"text": "of dv, so from dx we get x. Now we just use\nthe formula. The product uv will be the natural", "start": 405.759, "duration": 8.111}, {"text": "log of x times x, or x LN x. Then we subtract\nfrom that the integral of v du. V is x and", "start": 413.87, "duration": 12.359}, {"text": "du is one over x dx, so the x’s cancel,\nleaving us with simply dx. Integrating dx", "start": 426.229, "duration": 10.641}, {"text": "gives us x, and our final answer is x LN x\nminus x plus C. So once again, we took an", "start": 436.87, "duration": 10.609}, {"text": "integral that we couldn’t evaluate, and\nturned it into a different expression with", "start": 447.479, "duration": 4.991}, {"text": "a different integral in it, that happened\nto be much easier to evaluate. This won’t", "start": 452.47, "duration": 5.96}, {"text": "always work, but when it does, it certainly\nis useful.", "start": 458.43, "duration": 3.489}, {"text": "Let’s do a few examples that are slightly\nmore difficult, just to make sure we understand.", "start": 461.919, "duration": 5.72}, {"text": "First, let’s integrate the natural log of\nx over x squared, dx. Here we have to choose", "start": 467.639, "duration": 7.661}, {"text": "which is u and which is dv. Let’s try natural\nlog of x for u. So u equals natural log of", "start": 475.3, "duration": 7.399}, {"text": "x, and dv is the rest, or dx over x squared.\nThat means du is one over x dx, or dx over", "start": 482.699, "duration": 11.551}, {"text": "x, which does look simpler, like we intended,\nand for v, we realize that integrating x to", "start": 494.25, "duration": 5.85}, {"text": "the negative two gives us x to the negative\none over negative one, which is negative one", "start": 500.1, "duration": 5.51}, {"text": "over x. So to evaluate this, we write uv,\nwhich here will be LN x times negative one", "start": 505.61, "duration": 8.84}, {"text": "over x, or negative LN x over x. Then we subtract\nthe integral of v du, which will be negative", "start": 514.45, "duration": 9.319}, {"text": "one over x times one over x dx. We can take\nthe negative out to cancel out the first,", "start": 523.769, "duration": 8.26}, {"text": "making this a plus sign, and inside the integral\nwe have one over x squared, dx, or x to the", "start": 532.029, "duration": 6.891}, {"text": "negative two dx. We can integrate this to\nget negative one over x once more, so we end", "start": 538.92, "duration": 8.69}, {"text": "up with negative LN x over x, minus one over\nx. We can combine those fractions, and that’s", "start": 547.61, "duration": 7.89}, {"text": "the answer, remembering to add plus C, as\nwe always do when dealing with indefinite", "start": 555.5, "duration": 5.04}, {"text": "integrals. It may not look great, but if that’s\nwhat we get, then that’s what it is, no", "start": 560.54, "duration": 6.12}, {"text": "matter how pretty or ugly.\nHow about one more for good measure. Let’s", "start": 566.66, "duration": 5.4}, {"text": "evaluate the integral of the natural log of\nx, quantity squared, dx. Here we have only", "start": 572.06, "duration": 6.29}, {"text": "one choice, u will be this term, and dv will\nsimply be dx. So getting du will require the", "start": 578.35, "duration": 8.06}, {"text": "chain rule, and we get two times LN x, times\nthe derivative of LN x, which is one over", "start": 586.41, "duration": 7.21}, {"text": "x, so that gives us two LN x over x, dx. Getting\nv is no problem, from dx we just get x. So", "start": 593.62, "duration": 12.29}, {"text": "plugging things in, uv will be x times LN\nx quantity squared, then we subtract from", "start": 605.91, "duration": 8.31}, {"text": "that the integral of x times two LN x over\nx. The x’s cancel, leaving us with two LN", "start": 614.22, "duration": 8.88}, {"text": "x. Let’s take out the two to get simply\nLN x. Well we can’t integrate this normally,", "start": 623.1, "duration": 7.93}, {"text": "but as we saw in an earlier example, we can\nintegrate this by parts, so we just repeat", "start": 631.03, "duration": 6.52}, {"text": "this process. It may seem unfair to have to\ndo this twice, but in performing this technique", "start": 637.55, "duration": 6.19}, {"text": "we produce a new integral, and if that second\nintegral must be integrated by parts, then", "start": 643.74, "duration": 6.711}, {"text": "that’s just what we have to do. Let’s\nput some brackets around this integral so", "start": 650.451, "duration": 5.049}, {"text": "that we don’t make any careless arithmetic\nerrors. Just as before, u will be LN x, dv", "start": 655.5, "duration": 6.829}, {"text": "will be dx, and that makes du equal to dx\nover x, and v equal to x. So all still within", "start": 662.329, "duration": 7.991}, {"text": "these brackets, we can rewrite this integral\nas x LN x minus the integral of dx. That integral", "start": 670.32, "duration": 9.52}, {"text": "becomes x, so it’s x LN x minus x, and then\nwe can distribute this two from before across", "start": 679.84, "duration": 9.21}, {"text": "this term, which will all together give us\nx LN x quantity squared minus two x LN x,", "start": 689.05, "duration": 8.67}, {"text": "plus two x, plus C.\nSo integration by parts is just another technique", "start": 697.72, "duration": 8.19}, {"text": "in our bag of tricks that we can use to evaluate\nintegrals. The substitution rule works well", "start": 705.91, "duration": 5.76}, {"text": "when the integrand is the product of a function\nand its derivative, or close to it. Integration", "start": 711.67, "duration": 5.84}, {"text": "by parts works when the two functions are\nnot related at all, but one of them becomes", "start": 717.51, "duration": 5.23}, {"text": "much simpler when differentiated, which makes\nthe new integral easier to solve than the", "start": 722.74, "duration": 5.53}, {"text": "original one. We have one more trick to learn\nregarding integration, but before we move", "start": 728.27, "duration": 4.819}, {"text": "on to that, let’s check comprehension.", "start": 733.089, "duration": 1.891}]