[{"text": "You've probably seen it on TV a bunch of times.", "start": 3.06, "duration": 2.42}, {"text": "A person collapses in a hospital, and a doctor rushes over with a couple of paddles, puts them on the patient’s chest and then shouts \"Clear!\"", "start": 5.48, "duration": 6.9}, {"text": "After a jolt, the patient is saved.", "start": 12.38, "duration": 2.16}, {"text": "That life-saving technology is real.", "start": 14.54, "duration": 1.7}, {"text": "And it works because of two main electrical principles: electric potential energy and capacitance.", "start": 16.24, "duration": 4.96}, {"text": "Those paddles are parts of a defibrillator,\nwhich is basically just a really big capacitor.", "start": 21.2, "duration": 5.04}, {"text": "It uses electric charge to store energy, which\nis then discharged into the patient’s body.", "start": 26.25, "duration": 5.12}, {"text": "The current stops the irregular contractions of the cardiac muscle, and gives the heart a chance to start beating normally.", "start": 31.37, "duration": 5.49}, {"text": "Get ready, because this lesson has the potential\nto save lives!", "start": 36.86, "duration": 3.68}, {"text": "[Theme Music]", "start": 40.54, "duration": 11.88}, {"text": "To understand how a capacitor can save someone’s life, let’s review what capacitors are, and how they work.", "start": 52.42, "duration": 5.22}, {"text": "A capacitor consists of two parallel conductive plates of opposite charge, with an electric field between them.", "start": 57.64, "duration": 5.24}, {"text": "This set-up allows a capacitor to store energy\nas electric potential energy.", "start": 62.88, "duration": 4.32}, {"text": "In the same way that an object has ‘gravitational’ potential energy when you hold it above the ground,", "start": 67.2, "duration": 4.18}, {"text": "a charged object can have ‘electric’ potential energy when it’s held in an electric field.", "start": 71.38, "duration": 4.68}, {"text": "And in either case, potential energy can be used to perform work – when a force is applied over a distance.", "start": 76.06, "duration": 5.52}, {"text": "But how can you determine how much electric potential energy a system has, and how much work it can do?", "start": 81.58, "duration": 5.18}, {"text": "Like, in the case of a defibrillator, you just want enough potential energy to stop an irregular heartbeat, but not so much that it causes harm.", "start": 86.76, "duration": 7.08}, {"text": "To measure potential energy in an electric field, let’s imagine a positive test charge that’s moving between a capacitor’s plates.", "start": 93.84, "duration": 6.32}, {"text": "When we place the positive charge between the plates, the uniform electric field generates a constant force on it, in the direction of the negative plate.", "start": 100.16, "duration": 7.459}, {"text": "If the test charge starts on the positive plate and travels in the direction of the electric force, we can calculate the work done on it, by multiplying the electric force by the distance between the plates.", "start": 107.62, "duration": 9.7}, {"text": "We also know that this force is equal to the\nvalue of the test charge times the electric field.", "start": 117.32, "duration": 4.62}, {"text": "We can apply an equal and opposite force to the charged particle and move it across the capacitor as slowly as we like, so that the kinetic energy of the particle is negligible.", "start": 121.94, "duration": 8.38}, {"text": "And because of what we know about the work-energy theorem and the law of conservation of energy,", "start": 130.32, "duration": 4.919}, {"text": "we know that a change of potential energy is equal to the work done by the external force, or the negative work done by the electric force.", "start": 135.24, "duration": 7.06}, {"text": "So, we’ve found the potential energy decrease of a single point charge in a uniform electric field.", "start": 142.3, "duration": 5.28}, {"text": "And this drop in potential energy, divided by the test charge's magnitude, gives us the electric potential energy difference per unit charge, also known as the electric potential.", "start": 147.58, "duration": 9.22}, {"text": "The electric potential depends on the electric field and the position, but it does not depend on the charge of the test charge.", "start": 156.8, "duration": 6.44}, {"text": "Now, the units of electric potential are Joules\nover Coulombs, more commonly known as Volts.", "start": 163.25, "duration": 4.959}, {"text": "And the electric potential difference is also called voltage, which is another way of describing a drop in electric potential.", "start": 168.209, "duration": 6.211}, {"text": "When we express it mathematically, voltage is equal to the negative electric field times the distance between the capacitor plates.", "start": 174.42, "duration": 6.76}, {"text": "OK, we’ve used our hypothetical positive test charge to describe how much voltage is present across the charged capacitor.", "start": 181.18, "duration": 6.26}, {"text": "Now let’s put our new expressions to the test and find the electric potential difference in a real scenario.", "start": 187.44, "duration": 5.2}, {"text": "Let’s say we have a capacitor with plates one millimeter apart and an electric field of 1000 Newtons per Coulomb – which is the same as 1000 Volts per meter.", "start": 192.64, "duration": 8.599}, {"text": "The electric field can be found by dividing force by charge, or, for that matter, Newtons over Coulombs, as well as Voltage over distance, or Volts per meter.", "start": 201.24, "duration": 8.74}, {"text": "They all represent the same value.", "start": 209.98, "duration": 1.56}, {"text": "So, say we multiply 1000 volts per meter by\n1mm.", "start": 211.54, "duration": 3.94}, {"text": "We find that the capacitor has a voltage of one volt.", "start": 215.48, "duration": 2.92}, {"text": "Now, since a capacitor creates a uniform electric field, we can assume the electric force is constant, and that it acts in the direction in which the test charge moves.", "start": 218.4, "duration": 8.28}, {"text": "And as it moves, the potential will decrease\nmore and more.", "start": 226.68, "duration": 3.0}, {"text": "We can represent this voltage drop visually, by drawing lines along the locations where all the test charges have the same voltage.", "start": 229.68, "duration": 6.5}, {"text": "These are known as equipotential lines.", "start": 236.18, "duration": 2.26}, {"text": "In a capacitor, these lines run parallel to the plates, and each line that’s closer to the negative plate has a lower electric potential, or a lower voltage.", "start": 238.44, "duration": 8.12}, {"text": "And these equipotential lines are always perpendicular\nto the electric field.", "start": 246.56, "duration": 3.86}, {"text": "So far, we’ve learned how to calculate electric potential for capacitors – but can we apply the same ideas to point charges?", "start": 250.42, "duration": 6.08}, {"text": "Well, we know the equation for the electric\nfield generated by a point charge.", "start": 256.51, "duration": 3.16}, {"text": "But since there’s no uniform field, like there would be with a capacitor, we can’t use all of the equations that we’ve been using so far.", "start": 259.67, "duration": 5.87}, {"text": "Finding the electric potential created by a point charge is like finding the difference in potential energy per unit charge, between the spot right next to the point charge and somewhere infinitely far away.", "start": 265.54, "duration": 9.599}, {"text": "If a small charged object with the same sign was next to our point charge Q, it would start with a high electric potential while it was close by, and have a very low electric potential as it got farther away.", "start": 275.14, "duration": 9.86}, {"text": "So we can calculate the total electric potential possible, by integrating the negative electric field from to infinity to zero.", "start": 285.06, "duration": 6.34}, {"text": "We’re left with an equation that describes the electric potential generated by any point charge.", "start": 291.4, "duration": 5.06}, {"text": "And we can map equipotential lines for point\ncharges in the same way we did for the capacitor.", "start": 296.46, "duration": 4.579}, {"text": "For a point charge, the equipotential lines look like circles of increasing size around the charged particle.", "start": 301.04, "duration": 5.62}, {"text": "The farther away from the point charge, the\nlower the voltage.", "start": 306.66, "duration": 2.62}, {"text": "And for an electric dipole – which is one positive point charge and one negative point charge – the electric potentials from individual charges can be added together.", "start": 309.28, "duration": 7.6}, {"text": "Here, you’ll see that each equipotential line is not a constant distance from a point charge.", "start": 316.88, "duration": 4.16}, {"text": "That’s because you’ve got two point charges\nwith their own electric fields.", "start": 321.04, "duration": 3.38}, {"text": "So a test charge on the right side of the positive point charge won’t have the same potential as one the same distance away on the opposite side.", "start": 324.42, "duration": 6.96}, {"text": "Now let’s go back to potential energy in\ncapacitors.", "start": 331.389, "duration": 2.531}, {"text": "Because it’s largely why capacitors are so incredibly useful – from defibrillators to electronic components:", "start": 333.92, "duration": 5.9}, {"text": "When a capacitor’s plates store electric\ncharge, they’re actually storing energy!", "start": 339.82, "duration": 3.94}, {"text": "If you connect a battery to a basic circuit that contains only a capacitor, the battery causes charge to move from one plate to the other, through the conductive wire.", "start": 343.76, "duration": 7.32}, {"text": "This results in one positively charged plate\nand one negatively charged plate.", "start": 351.08, "duration": 3.319}, {"text": "But the capacitor hasn’t gained any net charge – there’s just as much positive charge on the positive plate as there is negative charge on the negative one.", "start": 354.4, "duration": 6.919}, {"text": "So, the battery uses its own electric potential to generate a current that transfers voltage in the battery to voltage in the capacitor, giving the capacitor a certain amount of potential energy.", "start": 361.32, "duration": 9.44}, {"text": "For our defibrillator, this energy is quickly turned from potential energy into a jolt of electricity through the human body.", "start": 370.76, "duration": 5.6}, {"text": "Now if you’re trying to save a life, you want to make sure you’re getting just the right amount of energy out of the capacitor.", "start": 376.36, "duration": 4.419}, {"text": "So to measure how much charge a capacitor can store, we can use a battery in our circuit to create a voltage between the plates, and then divide the charge in each plate by that voltage.", "start": 380.78, "duration": 9.1}, {"text": "This value is known as capacitance – how\nmuch charge a capacitor is able to hold.", "start": 389.88, "duration": 4.66}, {"text": "Capacitance uses units of Farads, with one\nFarad equal to one Coulomb per Volt.", "start": 394.54, "duration": 4.84}, {"text": "Typically, capacitance values are very small, so we often talk about capacitors in terms of microFarads or nanoFarads.", "start": 399.38, "duration": 7.08}, {"text": "And capacitance is actually determined by\nthe size and shape of a capacitor.", "start": 406.469, "duration": 3.7}, {"text": "One way to express capacitance is to divide the area of each plate by the distance between them, and multiply that by a constant – known as the permittivity of free space – denoted by epsilon naught.", "start": 410.169, "duration": 10.66}, {"text": "Make the plates larger, or move them closer together, then there’s room to fit more charge, creating a stronger electric field.", "start": 420.829, "duration": 5.691}, {"text": "And once you’ve established the geometry\nof the plates, the capacitance does not change", "start": 426.52, "duration": 4.1}, {"text": "– unless you stick something between them,\nwhich actually increases the capacitance.", "start": 430.629, "duration": 3.74}, {"text": "And this something is called a dielectric – typically an insulating material like plastic or glass.", "start": 434.369, "duration": 4.98}, {"text": "A dielectric is used to increase capacitance while preventing any charge from jumping from plate to plate.", "start": 439.349, "duration": 4.82}, {"text": "Sometimes, as the plates get hotter or the voltage gets higher, some electrons naturally jump between the plates, decreasing the amount of stored charge.", "start": 444.169, "duration": 7.831}, {"text": "So an insulator prevents electrons from crossing\nthe gap.", "start": 452.0, "duration": 2.979}, {"text": "And you usually want the plates to be as close together as possible without touching, since a smaller distance equals a larger capacitance.", "start": 454.98, "duration": 6.9}, {"text": "So, by using a very thin dielectric, the distance\nis decreased while the plates remain separate.", "start": 461.88, "duration": 5.02}, {"text": "And the molecules that make up dielectrics are polar, which means one side of the molecule is slightly positive while the other side is slightly negative.", "start": 466.9, "duration": 6.8}, {"text": "The molecules align themselves with the electric field and generate their own field in the opposite direction, resulting in an overall weaker electric field, while the plates retain the same amount of charge.", "start": 473.7, "duration": 10.12}, {"text": "So by inserting an insulating material into our capacitor, we’ve increased capacitance and can hold more charge, and thus energy, for the same amount of voltage.", "start": 483.82, "duration": 9.38}, {"text": "And that’s why the full equation for capacitance\nincludes a dielectric constant, K.", "start": 493.2, "duration": 3.919}, {"text": "So dielectrics can help capacitors hold even\nmore energy.", "start": 497.119, "duration": 3.3}, {"text": "And that potential energy is actually stored within the electric field between a capacitor’s charged plates.", "start": 500.42, "duration": 5.36}, {"text": "We can calculate the potential energy stored in this field by integrating the voltage over the charge in the plates, which reduces down to one half charge time voltage.", "start": 505.78, "duration": 8.6}, {"text": "But when using a capacitor, it’s useful to know how much energy is stored in an electric field per unit volume.", "start": 514.38, "duration": 5.879}, {"text": "We often want to know how much energy is in a certain location, like between capacitor plates, so we use energy density, or the amount of energy stored in the electric field per unit volume.", "start": 520.26, "duration": 9.86}, {"text": "And we can calculate the energy density associated with an electric field – at any point in space – by dividing the potential energy by the volume between the plates.", "start": 530.12, "duration": 8.78}, {"text": "With some algebra, we find that this boils down to one half epsilon naught times the electric field squared.", "start": 538.9, "duration": 5.72}, {"text": "And this relation holds true for any space\nwith an electric field.", "start": 544.62, "duration": 3.2}, {"text": "Now that we know all this, a medic can make sure those defibrillator paddles have the right capacitance, have been given enough charge to create a high voltage, and then CLEAR!", "start": 547.82, "duration": 8.78}, {"text": "Physics to the rescue.", "start": 556.6, "duration": 1.12}, {"text": "Today we learned a lot!", "start": 557.72, "duration": 2.32}, {"text": "We talked about electric potential energy and how it differs from electric potential, or voltage.", "start": 560.04, "duration": 4.3}, {"text": "We discussed how capacitors function and the factors that determine how much charge they hold.", "start": 564.34, "duration": 4.22}, {"text": "We also learned how to maximize energy storage and how to calculate the potential energy held by any capacitor.", "start": 568.56, "duration": 5.46}, {"text": "Crash Course Physics is produced in association\nwith PBS Digital Studios.", "start": 574.02, "duration": 3.98}, {"text": "You can head over to their channel out a playlist\nof the latest episode from shows like:", "start": 578.0, "duration": 4.32}, {"text": "First Person, PBS OffBook, and PBS Game/Show.", "start": 582.32, "duration": 3.4}, {"text": "This episode of Crash Course was filmed in\nthe Doctor Cheryl C. Kinney Crash Course Studio", "start": 585.72, "duration": 4.04}, {"text": "with the help of these amazing people and\nour equally amazing graphics team, is Thought Cafe.", "start": 589.769, "duration": 4.651}]