[{"text": "Professor Dave here, let’s learn about higher\nderivatives.", "start": 0.52, "duration": 3.0}, {"text": "We’ve learned how to take the derivative\nof a variety of functions, and we know that", "start": 10.66, "duration": 4.38}, {"text": "the derivative of a function is itself a function.\nBut if the derivative is a function, what", "start": 15.049, "duration": 6.102}, {"text": "is to stop us from taking the derivative of\nthe derivative? Well, nothing, in fact. We", "start": 21.151, "duration": 4.869}, {"text": "can do this, and we call it the second derivative,\nwith respect to the original function. So", "start": 26.02, "duration": 6.34}, {"text": "if we have some function f, and we take the\nderivative, we get f prime. And if we try", "start": 32.36, "duration": 6.019}, {"text": "to get f prime, prime, or f double prime,\nwhich is the derivative of the derivative", "start": 38.379, "duration": 5.991}, {"text": "of f, we must call this the second derivative\nof f. In Leibniz notation, if we take the", "start": 44.37, "duration": 6.86}, {"text": "derivative of some function y equals f of\nx, that would be dy over dx, so if we take", "start": 51.23, "duration": 6.84}, {"text": "the derivative of that, by placing d over\ndx out here, that can be represented as d", "start": 58.07, "duration": 5.829}, {"text": "squared y over dx squared. So this notation\nalso indicates a second derivative, just like", "start": 63.899, "duration": 7.491}, {"text": "f double prime.\nFor simple polynomials, finding the second", "start": 71.39, "duration": 5.24}, {"text": "derivative is not hard to do at all. Take\nthree x squared plus four x minus five. Taking", "start": 76.63, "duration": 7.161}, {"text": "the derivative of this by using the power\nrule, we get six x plus four as the first", "start": 83.791, "duration": 5.779}, {"text": "derivative, and then we just take the derivative\nof this to get six as the second derivative.", "start": 89.57, "duration": 6.6}, {"text": "All we did was take the derivative twice.\nOf course this could get a little trickier.", "start": 96.17, "duration": 7.58}, {"text": "Take x sine x. To get the first derivative\nwe need the product rule, so remembering how", "start": 103.75, "duration": 6.869}, {"text": "that works from a previous tutorial, let’s\nput the functions where they go and take these", "start": 110.619, "duration": 5.381}, {"text": "two derivatives. We should get x cosine x\nplus sine x. Then to get the second derivative,", "start": 116.0, "duration": 9.399}, {"text": "we just take the derivative of this new function.\nFor the first term, again we need the product", "start": 125.399, "duration": 5.101}, {"text": "rule, so we set it up just as we are used\nto, and evaluate the derivatives. That should", "start": 130.5, "duration": 6.98}, {"text": "give us negative x sine x plus cosine x, and\nthen we can’t forget this other term here,", "start": 137.48, "duration": 7.229}, {"text": "which simply becomes cosine x. So that gives\nus negative x sine x plus two cosine x as", "start": 144.709, "duration": 9.011}, {"text": "our answer.\nSo why is this useful? Well let’s recall", "start": 153.72, "duration": 6.18}, {"text": "that a derivative represents the rate of change\nof a function. This means that a second derivative", "start": 159.9, "duration": 5.75}, {"text": "represents the rate of change of the rate\nof change of the function. That may sound", "start": 165.65, "duration": 5.89}, {"text": "confusing, but there is an extremely good\nuse for this in kinematics, the study of motion,", "start": 171.54, "duration": 5.41}, {"text": "which we covered in the classical physics\ncourse. We can make a graph of the position", "start": 176.95, "duration": 5.209}, {"text": "of an object versus time. This could be a\nfalling object, a speeding car, pretty much", "start": 182.159, "duration": 6.061}, {"text": "anything. As we’ve mentioned before, the\nderivative of this position function will", "start": 188.22, "duration": 5.5}, {"text": "be the rate of change in this function, or\nthe change in position with respect to time,", "start": 193.72, "duration": 6.21}, {"text": "and that’s velocity. So velocity is the\nderivative of position. But the derivative", "start": 199.93, "duration": 7.19}, {"text": "of this velocity function will be the change\nin velocity with respect to time, and that’s", "start": 207.12, "duration": 6.35}, {"text": "acceleration. Position is meters, velocity\nis meters per second, and acceleration is", "start": 213.47, "duration": 5.579}, {"text": "meters per second, per second, or meters per\nsecond squared. That means that acceleration", "start": 219.049, "duration": 6.5}, {"text": "is the second derivative of position, and\nthat A of t equals v prime of t equals s double", "start": 225.549, "duration": 7.671}, {"text": "prime of t. This is one way of understanding\nthe acceleration due to gravity on earth as", "start": 233.22, "duration": 7.97}, {"text": "it relates to Galileo’s law for the position\nof an object in freefall. He derived the equation", "start": 241.19, "duration": 7.129}, {"text": "4.9 t squared by observation, and if we take\nthe derivative of this, we get 9.8 t, and", "start": 248.319, "duration": 7.621}, {"text": "if we take the derivative of that, we get\n9.8, and this is why acceleration due to gravity", "start": 255.94, "duration": 5.96}, {"text": "on earth is a constant equal to 9.8 meters\nper second squared. This understanding makes", "start": 261.9, "duration": 7.25}, {"text": "it extremely simple to answer questions in\nphysics that would be tedious without calculus.", "start": 269.15, "duration": 8.25}, {"text": "For example, say we have this function, s\nof t, that represents the position of an object,", "start": 277.4, "duration": 6.4}, {"text": "t cubed minus five t squared plus eight t\nminus one. What will be the acceleration of", "start": 283.8, "duration": 7.45}, {"text": "the object after five seconds? Without calculus,\nthis would be very cumbersome to solve. But", "start": 291.25, "duration": 6.271}, {"text": "it’s easy for us now, because we just find\nthe second derivative, and plug in the number", "start": 297.521, "duration": 5.539}, {"text": "five. The first derivative, v of t, will be\nthree t squared minus ten t plus eight. Then", "start": 303.06, "duration": 11.0}, {"text": "the second derivative, A of t, must be six\nt minus ten. Since this represents the acceleration", "start": 314.06, "duration": 8.31}, {"text": "at any time t, then to find the acceleration\nat precisely five seconds, we just plug in", "start": 322.37, "duration": 5.68}, {"text": "five. A of five will be six times five, or\nthirty, minus ten, which is twenty meters", "start": 328.05, "duration": 6.76}, {"text": "per second squared.\nNow although we won’t go beyond the second", "start": 334.81, "duration": 6.75}, {"text": "derivative all that often, there is nothing\nstopping us from taking a third derivative,", "start": 341.56, "duration": 4.85}, {"text": "or a fourth, or as many as we like. The third\nderivative will simply be the derivative of", "start": 346.41, "duration": 6.2}, {"text": "the second derivative, which we can write\nas f triple prime, or as d cubed y over d", "start": 352.61, "duration": 6.47}, {"text": "x cubed. For the fourth derivative, it’s\ngetting to be too many primes, so we just", "start": 359.08, "duration": 5.769}, {"text": "write f and then the number 4 in parentheses\nas a superscript. From there, taking the nth", "start": 364.849, "duration": 6.32}, {"text": "derivative will look like this, with the n\nup here, and we can get it by differentiating", "start": 371.169, "duration": 4.951}, {"text": "a function n times. So that’s all there\nis to higher derivatives. These will return", "start": 376.12, "duration": 6.699}, {"text": "later when we go back to graphing functions,\nbut for now let’s check comprehension.", "start": 382.82, "duration": 4.6}]