[{"vid": "-c-X8zk0ywo", "cid": "UgxD3jvRYxJIFHJVhQR4AaABAg", "comment": "Any jee aspirant", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgxmkWLMxHfhwgKIk0B4AaABAg", "comment": "Why are these two professors beautiful. Such combinations are not common.", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgyiLJwBGnPjwrw7bWh4AaABAg", "comment": "🎓", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugz4Ky-EunuYeuRWASB4AaABAg", "comment": "I'm in university", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugz0rTNeawi8X5Yn3Mt4AaABAg", "comment": "You can skip this it's just them talking about irrelevant things...", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgyVni34Yn0mjKFxkU94AaABAg", "comment": "Chemistry is the study of matter.  *But I prefer to see it as the study of change.*", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugxge7E2QcuAgQthUI54AaABAg", "comment": "8:17", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgxZ-HgsPJzLwSVESA54AaABAg", "comment": "i love this professor", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwvzjHLfctnTFc87fZ4AaABAg", "comment": "In high school we didn't make mathematical equation to model reality didn't we", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgyLCqf-fVr30jfkpXx4AaABAg", "comment": "Wow! What an inspiring introduction. Cathy for telling us about her father's amazing pathway from Nazi Germany, and Elizabeth for explaining how her quest for knowledge changed her path from pre-med to chemistry. Fascinating!", "votes": "3", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugwz64CKzHQIjDhIDPN4AaABAg", "comment": "I hate chemistry", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzoqElAN-daz24WKYZ4AaABAg", "comment": "is that a good idea to use it to review IGCSE? or maybe i can tell after the IGCSE chemistry 2022", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwK66F-DU-cqIbvbBl4AaABAg", "comment": "It's been 12 years, but I must say that I thought Emilia Clarke was giving the lecture. Prob because of the cam quality", "votes": "5", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzG7v3k83pMP0hCLxp4AaABAg", "comment": "Dont convince me! I study as a hobby! Chemistry rocks :)", "votes": "10", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugy4gbAbrgr_1T-MQpB4AaABAg", "comment": "I don't know if those MIT chemists are able to time travel, but sure as heck they look like 1970s hippies.", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgyosxbihB-R4HNN72J4AaABAg", "comment": "Chemistry: stealing Hollywood hopefuls for 600 years", "votes": "3", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugz3vulp0900Xaoylsl4AaABAg", "comment": "Thank you for providing this resource!", "votes": "2", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgxYEvWZKwL8IPUngup4AaABAg", "comment": "There’s a timeline somewhere where Lisa Kudrow is giving this lecture.", "votes": "41", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzkNXPsw3GrtxH60Q14AaABAg", "comment": "are there recommended homework questions for the text book? Couldn't find any on the actual website.", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwpC27GA5SLcwwd8E14AaABAg", "comment": "Take a shot every time she says \"uh\".", "votes": "0", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwpC27GA5SLcwwd8E14AaABAg.8s1-TMEdFUL8uX1DoeYBfG", "comment": "UH", "votes": "0", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgwU56ctS8w8JkM9ygh4AaABAg", "comment": "I went into a daydream when the lecturer was talking about herself. Missed the lecture .", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugw0tOkrP2s8frnRWY54AaABAg", "comment": "i realy lovve  the chemistry and plus techer", "votes": "4", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugx3N4qGbfFzucLCy654AaABAg", "comment": "Where can I get mit graduate or bsc course lectures?@mit", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwkkpZ9BvIEy6_P4NV4AaABAg", "comment": "We live in a chemical world dealing with atoms, molecules, subatomic particles, reactions involving reactants and products, and energy. We are all concerned about: (one) public health,  (two) occupational safety and health, and (three) one’s individual health and well-being: and chemistry is involved in all three of these areas.      School students are concerned with getting an education to prepare them for post-high school life and that involves an understanding of English, basic mathematics, science, history and personal survival skills.  Today pre-calculus, biology and chemistry are studied by most high school students planning on continuing their education for an associate or baccalaureate degrees.      Chemistry many decades ago had been broken down into the following disciplines: general chemistry, inorganic, organic, analytical, physical, biochemistry. Following the Manhattan Project in WW II, radio or nuclear chemistry became an important component of physical chemistry.  Nuclear chemistry now plays an important role in nuclear medicine – witness positron emission tomography used to map out certain cancer tumors in humans.     The two introductory MIT courses in chemistry 5111 and 5112 augmented by the thermodynamics and kinetics 5600 course are foundation courses for university students in chemistry, molecular biology, physics, and engineering.  The 5112 course is a little more advanced that the 5111 course and includes more physical chemistry. The thermodynamics course – involving the interplay of energy, work and heat - requires an understanding of simple calculus.       These courses in chemistry presume that a student has some prior background in elementary chemistry, simple calculus, and elementary physics.  That these top notch courses have been videotaped and posted on You Tube are great gifts by MIT to the whole world.  Each course costs about $5,000 to videotape and merits financial support by those viewers who are capable of doing so.      These three courses allow viewers in the world to refresh their understanding of chemistry and to continue their education whether it be in chemistry, physics, modern biology, engineering or technology, environment or public health.     Those who are weak in mathematics and want to acquire a basic background in calculus at the AP level can do so with the most elementary and shortest text [194 pages in length] written in the 20th Century by W. L. Ferrar from Oxford University entitled “Calculus for Beginners” or they may view Richard Delaware’s two courses posted on You Tube “College Algebra” and “Calculus” [University of Missouri at Kansas City]. Professor Delaware’s two elementary courses prepare one well for MIT’s video taped course – “Single Variable Calculus.”     Since the early times most humans have been involved in counting, measuring, and interacting with their environment. The sun, moon, planets and stars generated much curiosity.      The world of humans, plants, animals, microbes have depended upon elements such as hydrogen, carbon, nitrogen, sulfur, sodium, chlorine, iron, copper, lead, calcium, helium, neon, lithium, iodine, magnesium, etc.      Elements are the basic building blocks of matter that can undergo reactions to produce water, carbon dioxide, urea, etc.  Prior to 1938 with the discovery of nuclear fission elements were thought to be indivisible even though natural radioactivity had been detected in 1896 by Henri Becquerel.       The radiant energy from the sun provided warmth to support life.  It also produced the driving energy to allow certain plants to undergo photosynthesis. The processes taking place in the Sun to generate solar involved fusion reactions of elements in the CNO cycle.     Since the mid 1600’s science - thanks to the Gutenberg press - and creative individuals made great progress. The framework for the development of quantitative science is coordinate geometry and that involves directed numbers, ordered pairs, ordered triples, etc.      A Science has three distinguishing features: (one) it has and organized body of knowledge, (two) a language and notation, and (three) a set of tools.  So calculus one of the branches of mathematics, astronomy, chemistry, biology, physics, metallurgy, economics, psychology, etc are sciences.  Some sciences are logical disciplines which may or may not apply to the real world.       All the molecular sciences beyond the introductory ones and statistics are calculus based An introduction to molecular cell biology involves lots of chemical bonding concepts but little mathematics unless one addresses population growth or thermodynamics – the interplay between energy, heat and work for a system with boundaries.      All the molecular sciences involve three basic entities: (1) Matter [material that occupies a definite volume], Force or Torque [that drives motion], (2) Force [that leads to motion or static equilibrium] and (3) Energy [the ability to do work].      Force is a vector quantity – it has coordinate components, magnitude and obeys two algebraic laws.  The tool for dealing with motion is calculus. There are many different forms of energy – mechanical, chemical, electrical, electromagnetic, and nuclear.  Electromagnetic energy involves two vectors – one electric and the other magnetic – and the scalar and vector products in terms of the divergence and curl both of which are studied in the second calculus course called multivariable calculus.       The standard university text on calculus is that by James Stewart, “Calculus - the Early Transcendentals” printed in nine different and currently in the 8th edition.  It is used in many different countries in the world.      Chemistry has many flavors – descriptive or practical, theoretical or industrial.  Since 2000 we have been living in the Century of Biology which involves considerable biochemistry. Within an animal cell there are over a hundred thousand reactions taking place.       The world of biology changed in 1973 with the discovery by Crick and Watson of the double helical structure of DNA – a sophisticated structure in biochemistry – through the X-ray diffraction of crystalline DNA and application of group theory from mathematics that capitalized on symmetry of crystalline DNA.       If one feels the need to have a help book to accompany these video taped MIT basic chemistry courses, a popular one is that by Neal Jespersen,“Chemistry,”1997,published in the Barron’s College Review Series.", "votes": "6", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzqDGB0q7abVp73Dtd4AaABAg", "comment": "saludos desde México, what i need to do for take class in that incredible school and with this amazing teacher", "votes": "1", "replies": "2", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgjnE8OC8hqwt3gCoAEC", "comment": "thank you very much for the open course and i will be glad if you can develop a email id and provide it to us where we can ask our problems and get them sorted", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UghIzLRfDRamingCoAEC", "comment": "Спасибо, MIT !", "votes": "6", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgjA4SqqxuLe3HgCoAEC", "comment": "I hate these lecturers who tell you \"their story\" get on with lady!!! These students have worked their butts off to get in, and are paying a fortune to hear you give your little story.", "votes": "2", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgiahJfyLKG0tXgCoAEC", "comment": "I am glad that I do not have to study from her.", "votes": "6", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgiMwFdJl1TPN3gCoAEC", "comment": "Fair Use should remove the copyright restriction and MIT should know that. I believe the Images were removed for some other reason, but stating the reason of copyright restriction is a quick way to silence questions. ALWAYS CALL BULL SH_T; it's better to be wrong and question the why than to assume correctness and be silent.", "votes": "1", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgisUYsCdHUcnHgCoAEC", "comment": "I hated real estate and accounting and now I am working as a controller in a real estate firm.  I still hate them :(", "votes": "13", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgiJya58ekhNrXgCoAEC", "comment": "SO, AH.. PLEASE PAY ATTENTION TO THE LECTURES ANYWAY.. AHHH", "votes": "1", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugjaf9CZdc5Mu3gCoAEC", "comment": "can you upload a new one with working visual guides?", "votes": "12", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UggJxJF0h4vkWHgCoAEC", "comment": "Walter White approve this course.", "votes": "52", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgiVGM1x8GURungCoAEC", "comment": "you know those tremendously useful ocw courses? Like Walter Lewin's and Dennis Auroux's? This is not one of them.", "votes": "4", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgjTYyjT-2NkKHgCoAEC", "comment": "Thank you and thank you so much, we are in Indonesia, English is our second language, we learn a lot because we can listen to them and read what they are saying. They are very good teacher and we love chemistry", "votes": "29", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwJon5PbZ3nks02-b94AaABAg", "comment": "Larks' tongues in aspic", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzRNcWuRHHZSK1veh54AaABAg", "comment": "Why are the slides censored??", "votes": "5", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzhHOyyJtlHVUQs_ph4AaABAg", "comment": "They were trying to sell chemistry in a broad overview - it was the first class. That's what the first classes are all about... In every area of study.", "votes": "10", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzzhYtKOODBIqkspdB4AaABAg", "comment": " Lec 1 MIT 5.111 sylvia ceyer", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgwkkpZ9BvIEy6_P4NV4AaABAg.8c84WvUNKGq8rKocOIKx3z", "comment": "i wish i was ur friend for lifetime.. so much information in one comment .. will be so glad if i could get your email id.", "votes": "1", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgzqDGB0q7abVp73Dtd4AaABAg.8YHkuT_dAMV9C4zcNSQN_6", "comment": "buena suerte! saludos desde los ángeles california", "votes": "0", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgzqDGB0q7abVp73Dtd4AaABAg.8YHkuT_dAMV9b1fAblCswN", "comment": "Hey, Como te fue, lo lograste?", "votes": "1", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgiahJfyLKG0tXgCoAEC.8JuYjxAXwMm8MkSfiry4j2", "comment": "I agree with you. The general Chemistry from missouri is available online as well as UCI's full class and they both cover the same requirement topics to pass the MIT test. This professor seems to over complicate everything. Being an engineer myself I can see how first time students wouldn't know how to discern what is the needed material or not.", "votes": "0", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgiMwFdJl1TPN3gCoAEC.8GngIWVEj0_8GqSOOr1XOz", "comment": "All of our work published before 2009 was under a Creative Commons license (BY-NC-SA) and no exceptions were made for works that could be under Fair Use. If we couldn't secure permission to publish it under our CC license, we removed it. Some of the works removed were replaced by commissioned work that could be published under our license. In this case, this course has a number of commissions in the lecture notes. See the course on MIT OpenCourseWare for the full materials: http://ocw.mit.edu/5-111F08 As of 2009, we now allow for works under Fair Use.", "votes": "1", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgiJya58ekhNrXgCoAEC.88CHhyXcxU38TBdPhWb_wr", "comment": "Shinrah123 what an interesting way to start class", "votes": "0", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgjTYyjT-2NkKHgCoAEC.7-H0Z7-3uGE8GiGpy0PGk5", "comment": "You sound like a hostage", "votes": "17", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "Ugzo4I49-Dln79M0IqV4AaABAg", "comment": "Wow... I like the video so far, but Ms. Drennan completely messed up on her Vassar-schoolmate Lisa Kudrow's history and background.  For want of a better term I guess I'd have to call it \"academic cattiness.\"  Well, whatever.  Good thing the course is about chemistry and not accurate stories about famous people. :P", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugw_Z6YjNKoqgcav5K14AaABAg", "comment": "Probably copyrighted by the company that shot  the year book. It's her face, but it's their picture.", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugx-PLTd-sXbIssKA854AaABAg", "comment": "can someone give me the link of the lecture talking about history of alchmy and modern chemistry for p-Sofia plz???", "votes": "2", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgxmYKUy3VJZDki_ypp4AaABAg", "comment": "Cómo me hubiera gustado tener a esa maestra de química. No hubiera aprendido nada por estarla viendo. Es muy linda!!.", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgxaiBweBdyJScgQnmt4AaABAg", "comment": "@heiwashin But she is shown all the video and hidden within 10 seconds because of copyright. Is it right? I think we should watch MIT 6.912 Introduction to Copyright Law.", "votes": "2", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugxo-HN8f4-6_mBEhCx4AaABAg", "comment": "Wish we had this at Georgia Tech... nice room and women ", "votes": "1", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgzPRGuKq-EZyD9tv-Z4AaABAg", "comment": "She is wearing a skirt that has a fractal pattern. Interesting choice of clothes. Sort of subdued at least in colors. Would like someone like to comment on the pattern of the skirt", "votes": "1", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugxb9T3UMgjYQBt5kV94AaABAg", "comment": "I know it's been months, but a person owns all the rights to their own image unless they sign them away. She probably simply did not give them permission to show her, which even the students had to do by sitting in the designated area, so she can not be shown.", "votes": "0", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgyubNw-b-kMIXRKb8J4AaABAg", "comment": "Her own face is copyrighted? that doesn't seem right..", "votes": "3", "replies": "", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "UgxFCiz-0ZdzOPbLhR94AaABAg", "comment": "First! Thanks for this class MIT I'm using it to get ready for ap chem next year", "votes": "0", "replies": "1", "reply": false}, {"vid": "-c-X8zk0ywo", "cid": "Ugxo-HN8f4-6_mBEhCx4AaABAg.8GcixKqo5r08xJTYoZzJzn", "comment": "Midtown Funk I am from the future", "votes": "0", "replies": "", "reply": true}, {"vid": "-c-X8zk0ywo", "cid": "UgxFCiz-0ZdzOPbLhR94AaABAg.8Gc8NHTXPvN8xJTXPjd_pq", "comment": "MelloMushroom91 i am from the future.", "votes": "0", "replies": "", "reply": true}]