[{"vid": "-DPthKuQGyQ", "cid": "Ugx7xIFyD72SKEgFmHh4AaABAg", "comment": "Physics PDF Worksheets:        https://www.video-tutor.net/physics-basic-introduction.html\r Full-Length Videos & Exams:   https://www.patreon.com/MathScienceTutor/collections Next Video:  https://www.youtube.com/watch?v=WzjIMuf-yuo&list=PL0o_zxa4K1BU6wPPLDsoTj1_wEf0LSNeR&index=123", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgwpFgAp6S9Ls2VGF1d4AaABAg", "comment": "THANKSS", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgyKkFYi8fTmeGYfo_R4AaABAg", "comment": "holy fuck I'm late and these ads keeping me from finishing my final in time", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgzeQtCkS_FOooafh1p4AaABAg", "comment": "Question, on the example at 3:30...if you increase the torque by increasing the meters in this example, your work increases. How would one go about describing where that extra work comes from. You have the same force and same angle, but a greater arc length. Is that where the extra work comes from? Same force applied over more distance?", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "Ugw2Ilphsb3aNGyl4T14AaABAg", "comment": "Thank you ❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "Ugy1yBo3q-fWvRbcpIh4AaABAg", "comment": "Impressive, thanks for the video, I was getting crazy how can the moment can do a work, thanks", "votes": "1", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgxBzvE9ftVj5EPGTph4AaABAg", "comment": "In 3:27, the final answer should be 12,566.37 right?", "votes": "1", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgzLcI_j6Re6dKEda394AaABAg", "comment": "The flat belt has a speeed of 22m.s and is lifted tow pulley with a diameter of 380mm ..if the effective pull is 210N  Calculate power transmitted by the belt", "votes": "0", "replies": "1", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgytpmSpLPO35CFlevx4AaABAg", "comment": "Great video. Question: 1  i have the following parameters: - RPM - Speed - wheel Radius  From this parameter can i calculate the power ?", "votes": "3", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgwH-iH6xqanLHB4nad4AaABAg", "comment": "very simply explained", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgyZaPL8rU9rSRShlPd4AaABAg", "comment": "Hi, I am busy with a personal projects. I am busy with special gearing which allows me to use a driver gear which is 50mm in diamater that drives the follower gear which is 100mm in diameter. I have them running the same rpm. Now I just want to know if there will still be more torque on the follower gear (100mm) than there would be on the driver gear (50mm). Remember that all my tests the system is the same rpm. Does the follwer gear consume less energy as the rpm is not 2:1 as it should be for a equal system?", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgxR2E8lf7sRlNbiYbF4AaABAg", "comment": "find the equation if at the end you put a power and therefore a pair for an angular displacement ......... you will be able to justify a moment of power that if it is reduced on a shorter radius you will get a perfect power multiplier ..... mechanical free energy - www.turbinaperfezionataccs.it", "votes": "0", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgzI1H1KeUqFr4RTOfF4AaABAg", "comment": "At 2:02 The d in the work equation represents distance, not displacement.", "votes": "1", "replies": "", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg", "comment": "I have a question - \"The unit of a turning moment is Nm. The joule, which is the unit of work, can also be written as Nm. Explain why a turning moment is never described as a joule.\" I'm afraid my teacher is awful, and it's homework set for us. I'll be grateful for any help!", "votes": "0", "replies": "6", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgxKtcD--sMkBoUSiGV4AaABAg", "comment": "Have you explained about pyridine part ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgxaNiO_vgxJSyDZi-h4AaABAg", "comment": "What is the empirical formula of Strontium Phosphide with a mass of 80.9g of Strontium and 19.1g of phosphide ??", "votes": "0", "replies": "1", "reply": false}, {"vid": "-DPthKuQGyQ", "cid": "UgzLcI_j6Re6dKEda394AaABAg.9V2L_ohY7zL9kLTKxssnGd", "comment": "P=F*S", "votes": "0", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg.8lcnpInknjt9LTA3zkocxX", "comment": "I'm currently searching for the answer, did you manage to find it??", "votes": "0", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg.8lcnpInknjt9LT_dZLQ-Hz", "comment": " @brandonhughes645  I'm studying physics at uni now :) Work done is a scalar quantity, and if you use vectors, you would use the dot product of force and distance, to get the force acting in the direction of motion. This all makes sense as energies are scalar quantities and so are dot products. If you were to express work done as an integral it would be: ΔW = S F • d s Where S indicates the integral sign, F is the force vector and d s is an infinitesimal distance vector. If you're not already aware, vectors are often expressed in bold or underlined.  Feel free to ignore that if it's a bit technical, but it will be really helpful if you plan to continue studying physics or a similar discipline.   Moments, however, are like shorthand torques. They are vectors, unlike energy. If you consider the right hand rule for electromagnetism, it's basically the method for working out a cross product, (in this case your thumb denoting the direction of the torque vector, index finger r, middle finger F) In vector form, the cross product formula for torque is: τ = r x F Where they're all vectors, (r is distance). I recommend looking up a diagram of torques or watching a video to get an idea of how this cross product works if you aren't already familiar with it. (If this video isn't helpful enough on its own). A little extra for you is that a torque is a circular force, which can do work. However, since the motion is circular, it can't do work in a given direction, but in a circular path, over an angular displacement which is measured in radians. Radians don't have their own dimension. So while torques have the dimension (unit) Nm, it's also kind of accurate to say they have the unit Nm/radian. (I don't recommend answering this in an exam setting, it's probably not what they're looking for, but hopefully helps your understanding).  Essentially, if you've got an exam question on this, the answer you're looking for is to basically say that a moment/torque is a vector and behaves like a circular force. However, work done is a scalar and is defined as the force that acts over a given distance, in the direction of that motion.  (They are defined differently. There is a difference between an algebraic formula, and the more accurate vector formula. The units are only algebraic Nm and Joules are used for the sake of making this distinction clear. Work is force through a distance, torque is force at a distance.)  I hope this helps you, good luck", "votes": "2", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg.8lcnpInknjt9MGX3zLqqKh", "comment": " @SamdGG  managed to get the answer. Anyway nice on going for the degree! Seems like you have a solid understanding so I'm sure you will smash it.", "votes": "1", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg.8lcnpInknjt9MGY04SXJQ8", "comment": " @SamdGG  I have a degree in physics, there are just some things you will forget with time. I tutor with the PhD students and they all seem to forget basic stuff aswell. Especially since no one thinks about this stuff anymore.  Ive had to make myself look like an idiot asking dumb stuff all year haha.", "votes": "1", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg.8lcnpInknjt9iujPbbQy65", "comment": " @SamdGG  big W", "votes": "0", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgzEFlLSOwou3pu6pOd4AaABAg.8lcnpInknjtA1dEGh4lvZy", "comment": "Simple brother , Torque is a vector quantity whereas energy is a scalar quantity  Thus , Torque is represented through Nm(as it signifies tbe force in there which itself is a vector)so as to distinguish it from Joule​ @SamdGG ", "votes": "0", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgxKtcD--sMkBoUSiGV4AaABAg.8ZYJM_t3ZI88oRkH2AWpF3", "comment": "Hey! I know the question was asked a year ago but I still wanted to answer - the \"pyridine\" part is actually a special unit or a number in maths. A simple mistake, Pi is confusing.  The radians system that he uses(you can see him writing \"251.33 rad\") is used for measuring rotations. In this radian system, 1 rad is connected to the radius so that it doesn't really matter how big the wheel is, the number will always represent the same amount of rotation. Due to using the radius, the numbers get all weird and 'inaccurate' with the decimals(251.33) so mathematicians use the trick of having a multiple of Pi. The measure of rotation 251.33 is equal to 80 Pi's. And so he calculates @2:32 that if 1 full rotation(or a 'revolution') is 2*Pi then 40 revolutions is equal to 80*Pi. (Pi is a number approximated to 3.14 in easy examples). If it's still a bit unclear, I recommend watching this simple video https://www.youtube.com/watch?v=HACNCy0clO0. :)", "votes": "2", "replies": "", "reply": true}, {"vid": "-DPthKuQGyQ", "cid": "UgxaNiO_vgxJSyDZi-h4AaABAg.8ZY9n-WN7c99JGhGg7fKhH", "comment": "LOL WHAT", "votes": "0", "replies": "", "reply": true}]