[{"vid": "-jJz5OMmuP0", "cid": "Ugxk8fi8Qf3uBq8Mq4d4AaABAg", "comment": "The best teacher！！！！", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgyMAX3uqnTNeYndx2h4AaABAg", "comment": "I used to watch these videos when I was preparing for my medical college entrance exams….now I am at the end of my second year of medical college and found these again ….felt so nice to watch her again ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugzixej-TiWcC1fhdHJ4AaABAg", "comment": "From India ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgzdqXvkax67TSaiEOh4AaABAg", "comment": "From the way she talks, you can know that she encodes this stuff in her brain by rote learning, not understanding. I'm so disappointed.", "votes": "2", "replies": "1", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugw664p6K6TdlaHcf7J4AaABAg", "comment": "Tell your stupid students that are coughing loudly to shut up", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgxGSS5wZ3aRg8k5Lgp4AaABAg", "comment": "I think this series is awesome!", "votes": "3", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgwoKWS0ayTbZJAJ1_l4AaABAg", "comment": "all her obsesion to see the function of a thing except discepting frogs never had chem class in my life only math physics", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgxQ1dEWiVq4Y63sOr14AaABAg", "comment": "WELL YOUR ENTIRE LECTURES WAS LIKE A CRASH COARSE IN THEHUMANITIES TO REMEMBER BE NICER AND KINDER TO ALL PEOPLE AS THEY OFTEN HAVE NOT A clue wow i learned so much just chill and be emulsified patience is the greatest gift we can learn even in adversity is as alchemical gold  of natural bonsai forest  pathos of things or then remember what tesla mean generator/r said i want it now3,69 i want it now know it all could you imagine energetic system phase4 shifted frequency unknown still. by me than silly einstien off the un  ironed cuff cusped imagination being the most important so in summary it is a romance in 4 dimensions Catherine blest valentines to you sorry i was late laying an egg head all the maths i have solved previously thanks for the trip down memory lane", "votes": "1", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugw_sSJhmgzqiLNHsvN4AaABAg", "comment": "コンプリートしたら進化論早くしろ！💢", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgwQRRJzDsVklxvi9RN4AaABAg", "comment": "You really sweet mame...💐💐💐🍋🍋🍋🍋☝️☝️", "votes": "1", "replies": "1", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugw2UUuyp-Ic_nbcdLZ4AaABAg", "comment": "Why every human not think& become like Albert Einstein,Elon Musk,Tesla,Sundar Pichai Google, Newton ? EINSTEIN use it's brain 0.003% in all life time. But now we all know how to achieve a New born baby kid 100 % active brain. Intelligence come from birth 1day to 6 month baby kid age time science subjects sounds listening 10 hours per day by New born baby's child from near environment before 2 year age baby kids. Brain neurone cells myelin sheaths making only in birth 1 day to 6 month age 85% + then 15% make 6 month to 2 year = 100%🧠 myelin sheaths make.After 2 year age New myelin sheaths,brain cells activation not possible.Human Intelligence level is actually active, working brain cells number in human brain, about 2 trillion  brain neurone cell myelin sheaths. New born  baby kid only 1 need in day  time is science subjects sounds, music, baby kids not need day time sleep. Baby kid catch every sound in only this critical age and start activation of brain cells,myelin sheaths only in baby kids before 2 year age time. This is New brain research on human kid brain. So you share with newspaper,science community, teachers,friends,kids.Yes extreme sleep is big mistake for New born baby kid before 2 year age  time. before 2 year age baby kids only 1 need in day time is science subject Sounds listening . All human 100% & 2 trillion brain commanding neurone cells active, working ,it means  super great genius scientist,honesty, happy,peace. No war,no greedy. Why a couple 4 kid different in intelligence level❓Why we all human defferent in intelligence level❓= I solved this mistry in this massage., read this message again and again.This is a pure science research on human new born kid brain cells activation, working. Why all students not interested in  fundamental subject,  necessary for life, biology, human body functioning, cells,organs , physics, chemistry, Math ❓in human brain commanding neurone cell 2 trillion but in we all , all brain neurone cells not active,not working,, because we not listen sounds before 2 year age baby kid age time. Every stupid human done only sleep before 2 year age baby kids age time. With this new brain research now we change everything globally. In near future every human New born baby kids think and become genius scientist with simple scientific process 100% active brain cells & working brain commanding neurone cells.👉🔊🧠🤱🤱🧠💯💯🚀🛰️📡💉📲🛰️🖥️💻🌱🌳🌎 live example. 👉This 3 year little genius girl expert of biology science name=Brielle and this 11 year genius boy  in math,physics. name Sarim Khan. Genius math girl Apurva. and lots of little genius kids example available online.", "votes": "1", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgwG9p5r9xkBkuXCSVJ4AaABAg", "comment": "Yes queen", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgwHXHe5MJYLuOzfhfx4AaABAg", "comment": "I just love her...❤❤😍😘😘😘❤😘😘😘😘😍😍😍😘😘😘...Love you.", "votes": "1", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgxOWyEps1pDXvZQqKF4AaABAg", "comment": "Thanks Mam", "votes": "1", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg", "comment": "Wait u get a periodic table for exams??!!!!!!  Oh my! If that's true.. Idk what to say..  We here in India learn the table the properties n it's expected of us that we have it memorize!!!", "votes": "9", "replies": "6", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugw5i3SH_Y3TaqUsSvd4AaABAg", "comment": "She's selling shirts on the side.", "votes": "4", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgxZpVgKHwETa7OB8tp4AaABAg", "comment": "15:20", "votes": "2", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgzPAdBDWEGUZA1iD054AaABAg", "comment": "thank you", "votes": "3", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugy5s_XL736NflPphK54AaABAg", "comment": "Why isn't it that the total energy of an electron is just the potential energy + kinetic energy - potential energy from the sheilding electrons?", "votes": "0", "replies": "2", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgyChtV-27G5NycBzex4AaABAg", "comment": "Really Impressed by your way of teaching dear prof. catherine", "votes": "17", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgzdqXvkax67TSaiEOh4AaABAg.9z2aD0xuK0o9z2aKz268KU", "comment": "Most OCW courses are still awesome though!", "votes": "1", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgwQRRJzDsVklxvi9RN4AaABAg.9_hp7sJfzpt9zSm9JWLwBJ", "comment": "😂😂", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg.9JDAQsDyrjC9SCysEb07qu", "comment": "wow.... that the first time I hear they make you memorize the periodic table....", "votes": "2", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg.9JDAQsDyrjC9ScjVF_cBoR", "comment": " @carlasouza5194  at high school level", "votes": "2", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg.9JDAQsDyrjC9VtWXML2ZRv", "comment": " @carlasouza5194  Yeah! For us its the first 30 - 40 elements on the periodic table, we also have to remember all constants from planck to Rydberg and every small detail.", "votes": "1", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg.9JDAQsDyrjC9u6W88CQks_", "comment": " @carlasouza5194   They really want to keep you dumb there in America, don't they? :q Memorizing the periodic table, or at least some portions of it that are relevant to organic chemistry isn't really that hard if you learn it piece by piece. E.g. the last column is the noble gases: He, Ne, Ar, Kr, Xe, Rn.  Then right before it are the the halogens, so another nice column: F, Cl, Br, I At (they all end in \"-ine\", and it's good to order them by size, because it will become useful later anyway, for studying alkyl halides and substitution reactions). Another nice part is the first and second column of the alkali metals (\"s\" orbitals): Li, Na, K (all +1 spectator ions that form strong bases with -OH hydronium ions), and their 2+ counterparts: Be, Mg, Ca. (You can memorize the remaining three heavier elements in each of these columns if you want to, or if you work in a firework factory ;) because they usually give nice colors when burned in a flame, so it is good to associate them with those colors when memorizing them.)  Then there's the non-metals and semi-metals part (for \"p\" orbitals). The first row is easy, because it's the basis for organic chemistry and life: B, C, N, O (sorted by electronegativity, and by the number of valence electrons: 3, 4, 5, 6), boron being the odd ball with incomplete octet, which makes it useful for those borohydrides that you will learn about in ochem as being good reducing agents and sources of nucleophilic hydrogens, a.k.a. hydride ions. They have their heavier cousins in the next row: Al, Si, P, S. And again, aluminum works pretty much the same as boron with that incomplete octet and hydrides (sodium borohydride, lithium aluminium hydride). Silicon is just heavier carbon, and phosphorus is just heavier nitrogen, and sulfur is just heavier oxygen, but they all have this extra ability of extending their octet if needed. You can also remember that selenium is under sulfur, if you already know that the amino acid \"cysteine\" contains sulfur, and its cousin \"selenocysteine\" contains selenium instead, because these two atoms are interchangeable due to their similar chemical properties. As for Al and Si, these are the two most abundant elements in Earth's crust, so you can group them by that. If you need the next row too, then you probably work with semiconductors ;) because here are the metals and SEMI-metals used for SEMIconductors (both start with \"semi-\", so there's your hint right there ;) ). Gallium is that metal that melts in your hand, used for P-type semiconductors, because it has 1 electron less than silicon or germanium; germanium is what diodes are made of, because it's just below silicon (also a semi-conductor); and arsenic is for N-type semiconductors, because it has 1 electron more than silicon or germanium. So that's a pretty big part of the periodic table (and most useful) memorized! :> If you need transition metals (with \"d\" orbitals) too, then again, look for patterns. All the \"precious\" metals (copper, silver, gold) are in one column, and it is this column that is the \"exception\" for the \"d\" orbitals (the penultimate one). Other interesting metals are flanking it: Pd and Pt on the left are the well-known catalysts; on the right: cadmium is for batteries, and mercury is the \"quicksilver\" liquid metal that is used in gold mining because it makes amalgams with gold. Nickel and zinc are flanking copper. Now try filling up the first row of the \"d\" block yourself, because this will be the most useful one. If you need more, again: learn them in columns, with \"heavier cousins\" of the ones from the first row, having the same chemical properties as them.", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg.9JDAQsDyrjCA--Ji2H8YwR", "comment": "College in the US is a joke. Here in latin america its exactly the same.  5 years of education, and we go deeply with the math in our first year of chemistry. But here the math is anything but deep.  No way so many people graduate from college without studying that much.", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgxuW1Bs0_pcXbzTqnV4AaABAg.9JDAQsDyrjCA4f4xti5eSF", "comment": "Professor D. Sadoway from MIT does the same", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "Ugy5s_XL736NflPphK54AaABAg.9AyPz0K4Z7q9CcNgps12-k", "comment": "what?", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "Ugy5s_XL736NflPphK54AaABAg.9AyPz0K4Z7q9EeajhwJItf", "comment": "Quantum Mechanical Nature of Reality", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgwDkGyKXhIldni4jjp4AaABAg", "comment": "What an easy course😂", "votes": "0", "replies": "3", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "Ugw-y5GysUDmxD1FFhZ4AaABAg", "comment": "Wow", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgywC4hAC7aTO_SybyF4AaABAg", "comment": "oh my good", "votes": "0", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgzZo6yM5Otp9uvu_lt4AaABAg", "comment": ".🇪🇬. thank you very much 💗💗👀", "votes": "4", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgyaoPicF191fIOha8x4AaABAg", "comment": "Can u make vedio in hindi", "votes": "3", "replies": "3", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgwCXxQzc5geaBqEh7d4AaABAg", "comment": "YEAH!!!!!!!!!!!!!!!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "-jJz5OMmuP0", "cid": "UgwDkGyKXhIldni4jjp4AaABAg.96-06CS5lxv97XMW10UaSC", "comment": "It's only a principles course. First year intro to chem essentially. Not meant to be difficult", "votes": "6", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgwDkGyKXhIldni4jjp4AaABAg.96-06CS5lxv9CcNs_E8SB_", "comment": "this video isn't tackling ALL of what's knowable in this particular topic.", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgwDkGyKXhIldni4jjp4AaABAg.96-06CS5lxv9u6RoFnB41K", "comment": " @hetaeramancer  Can you recommend a different video then?", "votes": "1", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgyaoPicF191fIOha8x4AaABAg.8e-q3NADXOE8g3oitQZFTG", "comment": "You can use the auto translate mode for Hindi subtitles.", "votes": "2", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgyaoPicF191fIOha8x4AaABAg.8e-q3NADXOE9Hb4Xt7JxuV", "comment": "Really??", "votes": "0", "replies": "", "reply": true}, {"vid": "-jJz5OMmuP0", "cid": "UgyaoPicF191fIOha8x4AaABAg.8e-q3NADXOE9Scjth0Z-Mw", "comment": "Watch physics wallah how many channel do u want to be in hindhi", "votes": "1", "replies": "", "reply": true}]