[{"vid": "0BAMQmT-tf0", "cid": "UgxHLct-EpGFw9PPktp4AaABAg", "comment": "Gravity force not considered..", "votes": "0", "replies": "1", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "UgzrWYrZayAJVBPR-q14AaABAg", "comment": "dear friends of MIT of the computational science and engineering OpenCourse, regarding the nature of the physical universe, i can think that it is the result of a simulation of a holographic matrix. starting from some studies that relate Judaism, the Hebrew language, the ancient religions and the ancient religious philosophies etc etc I can argue that the dark matter that would be the glue that holds the whole universe together would actually be light energy, the same that is described in the Qabbalistic tree of life and which light descends directly from beyond, or divine higher world, or otherworldly paradise or celestial eden. even if this hypothesis may appear anti-scientific, heretical for contemporary science, and however crazy in general I ask you to have an open mind and to consider this hypothesis plausible without discarding it at the start even if it can also be false.", "votes": "0", "replies": "", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "UgzfvwzLzjtjR2j6KAB4AaABAg", "comment": "For the second order derivative he points at U_n+1 and calls it implicit, which afaik is the other name for backward Euler, then when he chooses for backward Euler he chooses U_n, which is confusing. I think that's a mistake since using \"n\" to refer to the next value means we have two unknowns in the approximation, U_n, and U_n+1, which won't work with initial conditions.", "votes": "0", "replies": "", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "UggkUSGYM-4MCngCoAEC", "comment": "Play at 0.5 speed. Enjoy.", "votes": "3", "replies": "", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "UgzmYQaB6K-cCtYPcpJ4AaABAg", "comment": "how do i know the a's and the b's from the initial conditions ", "votes": "1", "replies": "1", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "UgxcQSkwaA-peuWHDGp4AaABAg", "comment": "@CognoscenteSkills it is the displacement", "votes": "1", "replies": "", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "Ugz64H_aemgfwL-gIWd4AaABAg", "comment": "@CognoscenteSkills it must be the velocity. it is represented with a v in some countries like in greece, from where i am, but some teachers represent it as a u as well here...", "votes": "0", "replies": "1", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "Ugxp66Rk0eX8TKM_Y7p4AaABAg", "comment": "wat is u? ", "votes": "0", "replies": "1", "reply": false}, {"vid": "0BAMQmT-tf0", "cid": "UgxHLct-EpGFw9PPktp4AaABAg.9Ii0i7IKzSJ9aTxFR0qyX8", "comment": "it is implicitly considered in the term M d2u/dt2", "votes": "0", "replies": "", "reply": true}, {"vid": "0BAMQmT-tf0", "cid": "UgzmYQaB6K-cCtYPcpJ4AaABAg.8GbeLR4GoOu9aTxRaFdirX", "comment": "* year old comment!  hey i think u must have got the idea by now how to compute a and b from the initial conditions. And i hope that these lectures really helped you wherever you are today.", "votes": "0", "replies": "", "reply": true}, {"vid": "0BAMQmT-tf0", "cid": "Ugz64H_aemgfwL-gIWd4AaABAg.8GcCyVR8Xk78z5lzzU7bBS", "comment": "That's in fluid mechanics", "votes": "0", "replies": "", "reply": true}, {"vid": "0BAMQmT-tf0", "cid": "Ugxp66Rk0eX8TKM_Y7p4AaABAg.8Gb_4lqB8CB8mLToOnO8Zq", "comment": "u is the displacement. The equation at the beginning of the lecture is the expression of the second law of Newton's factoring in friction. Friction is expressed by K, a matrix which results from a product of a diagonal of coefficients C with a matrix of differences A.", "votes": "3", "replies": "", "reply": true}]