[{"vid": "0hWNRPHd93U", "cid": "UgxPcTdmXuR2mySa6bh4AaABAg", "comment": "Sir,While solving the first qn you added 29 at the end but 29 means 30 ,right because The address starts from 0", "votes": "0", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "UgzXooZMG17nt6SqxOx4AaABAg", "comment": "There are two surfaces per platter and 20 surfaces each cylinder, according to the interpretation of the phrase \"Depends on what you said here teacher, If we consider a platter, all tracks will be a surface.\" The outcome was accurate since we used cylinders in our computation. This is because we have two recording surfaces, a front track, and a back track, and one cylinder holds all platter tracks from platter 1 to platter 10. One cylinder is made up of all the tracks arranged vertically. Last but not least, the first cylinder has 20 front and back tracks with 63 sectors each. For this reason, the number of sectors per cylinder is 10x2x63. :planet-orange-purple-ring:", "votes": "1", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "UgzBjnqEgQzFJWzTa954AaABAg", "comment": "The actual address is <0,1,0> to <0,1,62> which gives the other 63 sectors in the second surface with index 1 of the first platter. :learning:", "votes": "0", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "UgxzSm4RuFqxi-KhQDh4AaABAg", "comment": "Sir please upload bus system please and difference between RISC and CISC .....  AND thankyou sooooooooooooo muchhhhhhhhhhhhh sir your videos helps me a lot even I can say Since I have started taking your lectures, I am addicted to reading", "votes": "3", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "Ugx5eBNvUp5aOgobbXJ4AaABAg", "comment": "Sir it is very very humble request please complete the playlist it is going very slow sir and exams are very close after comming to this much way i can't switch the resource for now you are only 1 sir pls🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "Ugy361ZsIyMGUN1-EuF4AaABAg", "comment": "Hellow sir. please solve us this problem statement and make a video if it's possible. all teachers failed to solve it.  ###########  The ministry of labour of the FGS is decided to build a system where all the civilians has to pass through a testing process before applying to any job. The process depends on the type of the job an applicant  can apply, If the applicant applies for a job that requires an experience of (5-10) years ,he/she has to provide NIC, Master degree, Bachelor degree, high school or equivalent ,medical healthy and non-criminal record certificate and has to be older than 27 years , if the applicant applies  for a job that doesn’t require any experience he/she must have NIC, medical health and non-criminal record certificates ,high school/bachelor certificates.   Hint: Master degree holder can apply to any job as long as it requires experiences less than 10 years while a person with no experience ,no masters and no bachelors  can only apply for a job that requires high schools certificate or equivalent  Problem: From the problem statement given above build the system where:  a) The applicants have to have at least three documents for the system to be functional (NIC, high school and Non-criminal record certificate)  b) Based on the assessments above who can apply for this job  c) If the applicants don’t possess one of the three documents mentioned generate a message that informs the applicant that he/she can’t apply for this job and his/her application will not proceed further  d) Find and simplify the Boolean equation of the system  e) Find the minterm and maxterm  f) Draw the logic circuit", "votes": "0", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "Ugxx-dcvtTDE2rT20Yl4AaABAg", "comment": "2nd comment", "votes": "0", "replies": "", "reply": false}, {"vid": "0hWNRPHd93U", "cid": "Ugyak3E17uhyDBnTIB54AaABAg", "comment": "1 s", "votes": "0", "replies": "", "reply": false}]