[{"vid": "0m25oTKMv1Y", "cid": "UgyQ4wR0BGFsaPzztit4AaABAg", "comment": "Final Exams and Video Playlists:        https://www.video-tutor.net/\r Full-Length Math & Science Videos:   https://www.patreon.com/mathsciencetutor/collections", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzBKrBkKZCDCxe-AXh4AaABAg", "comment": "wouldnt it be 5/2 not 3/2 because N2 is diatomic?", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzNIlPjPYqOuNcOdch4AaABAg", "comment": "This man is gonna save my life 😭😭😭😭😭 thank you", "votes": "5", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgxjU7pKsT1M3xWbiNt4AaABAg", "comment": "Totally in love with ur videos, there are awesome... thanks!!", "votes": "1", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzcY-XN6bXcNc-fHaJ4AaABAg", "comment": "I have no clue how to enter the problem into my calculator. I have a TI-83. I understand the equation fine, I'm just stuck at entering it into my calculator. If anyone can help, that would be most appreciated, thank you.", "votes": "0", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgwNlfHvX7SySG5VJYJ4AaABAg", "comment": "what is the 1,66 x 10^27 ?", "votes": "0", "replies": "2", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "Ugx7PHK18d8Wsa8VXJJ4AaABAg", "comment": "Thanks  i understood every concept  ❤", "votes": "1", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgxW1QAKVWh0RMd1QId4AaABAg", "comment": "Too op", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzBc_jceWdtL4kJTed4AaABAg", "comment": "You are a legend", "votes": "1", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgyJlAlL1Bnsl9Wpn854AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "Ugx80644Czq0voFizjx4AaABAg", "comment": "Maxwell distribution of particles", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgwyQsmjhlEIWL8-dXJ4AaABAg", "comment": "My life be easier with you 😘I love u", "votes": "0", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgwizHrFSkVYs4-dcIF4AaABAg", "comment": "thx sir wish would give u infinite likes", "votes": "3", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgwQsHdo438byOc2p4l4AaABAg", "comment": "can you show how the units end up \" meters/sec \"?", "votes": "4", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzhaV_HkkogR5COg_x4AaABAg", "comment": "wut, I always thought the atomic mass unit and molar mass is the same. I was ALWAYS confused when it comes to ideal gas law. Big thanks to this video <3", "votes": "13", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgyUA4i6GvUsbMD5mDF4AaABAg", "comment": "Nah man in the last example if we take molar mass, i now has a per mole unit with it. When we used just mass it was just kg and it got cancelled out. But molar mass has a per mole unit with kg. So Vrms will not be m/s. There's a per mole this time too.", "votes": "0", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzfuLoDTqAX_0Ix4Xd4AaABAg", "comment": "Calculate root mean square velocity of A. Nitrogen molecule at 633 Kelvin B. Oxygen molecules at 800 Kelvin  Can any one help me to solve this question please☺️☺️", "votes": "1", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgwYqYam5OTLvyKuwFZ4AaABAg", "comment": "What if i have rms speed but want to know what the fastest molecule's speed is?", "votes": "1", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "Ugz5NaHClIF0sedXuvN4AaABAg", "comment": "Of course I was being a smart-alek. And continuing on that theme...  ----------------------  Electrical engineers commonly know root mean square (rms) as the area under a sine wave as graphically depicted.   For someone who is satisfied with some sort of mathematical result without much concern or interest of the mechanism for it, the calculations in the video are probably...good enough.  But, the mathematical answer doesn't make sense. Yes, it can be shown that air is mostly nitrogen and even as N<sub>2</sub>. And, yes, there is math that can come up with a number that is said to represent the speed of that particle (molecule). And, that speed comes out to about 500 m/s at standard temperature.  I don't think YouTube comments allow HTML tags but, if you know aa little about HTML, you'll recognize the <sub></sub> tags...for whatever that's worth.  ----------------------  We can pretty easily measure the speed of sound these days, using a variety of methods, and find that the speed of sound is about 340 m/s. And, sound travels through the air which is mostly nitrogen.  The question is: If sound is traveling about 68% as fast as the nitrogen particles, what significant change in their interaction happens between when an object is traveling subsonically (at perhaps 65%) and supersonically (at perhaps 70%)/?  There's three possible answers. 1) the right one. 2) the wrong one and 3) the \"I neither know or care\" one. it's most likely that both you and the author of the video will say it's #3.  But, you could surprise me...especially if you come up with a #1 answer that makes good sense or even a #2 answer that's at least thought provoking.", "votes": "0", "replies": "4", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgxOIwzi91pHjghsvZV4AaABAg", "comment": "@0:06, what the heck is the \"rootloot\" square of mleclr speed of match 2 gas?", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzcY-XN6bXcNc-fHaJ4AaABAg.9rykBF5W6299tyAavejWuf", "comment": "Same here", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgwNlfHvX7SySG5VJYJ4AaABAg.9rVUB0Xbx6J9tX5kujrygW", "comment": "1 atomic mass unit is equal to 1,66*10^27 kg, you use this equation to convert amu to kg", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgwNlfHvX7SySG5VJYJ4AaABAg.9rVUB0Xbx6J9zWGtEq1wYW", "comment": "u", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgwyQsmjhlEIWL8-dXJ4AaABAg.9VH-WUaOap09W6dgbffQb1", "comment": "mwah", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgwQsHdo438byOc2p4l4AaABAg.9KbV5R0Sp9C9_luhQBgpR4", "comment": "Didn't you know that the square root of a Joule per kg is meter per second? 😛 Anyway, kinetic energy in Joules is kg * (m/s)^2 / 2. Here (m/s)^2 = 2 * J / kg, hence J / kg = (m/s)^2 / 2 and after squarerooting: m/s = sqrt(J/kg * 2). In his superequation, there's 3 instead of 2.", "votes": "3", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgzhaV_HkkogR5COg_x4AaABAg.9G7StAII6UH9_lu0pQKuM0", "comment": "They are the same. You can also calculate the mass of a molecule by multiplying molar mass in g / mol by the mass of one atom which is the average of the mass of a proton and a neutron. Or you can divide the number in amu's by 1000 and multiply by the number of moles and get the mass of the substance. If you divide the mass of the substance by the mass of a molecule you get the number of molecules. If you divide the number of molecules by Avogadro's favourite number you get the number of moles. And if you turn the mass of an atom upside down you get the named Avogadro's number. I spent an hour for figuring it all out.", "votes": "2", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgyUA4i6GvUsbMD5mDF4AaABAg.9C_bTbivcgW9FrREHUBK1a", "comment": "the mols are canceled out with the use of the constant R", "votes": "2", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgzfuLoDTqAX_0Ix4Xd4AaABAg.9C7tuP0Kyrz9Vx3Fi66pmy", "comment": "no", "votes": "1", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "UgwYqYam5OTLvyKuwFZ4AaABAg.9Aj5PYZe3dC9zVcemx814a", "comment": "Divide your rms speed by the square root of one half, or multiply by the square root of two, and you end up with peak velocity.", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "Ugz5NaHClIF0sedXuvN4AaABAg.94Mf6sb83wJ9BH2j7WrKMH", "comment": "Dude what's ur problem", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "Ugz5NaHClIF0sedXuvN4AaABAg.94Mf6sb83wJ9BHArj4LTP-", "comment": " @dudeb.5254  Well, Dood Bee, of the 3 answers I suggested that either make sense or express a disinterest in the topic, \"Dude what's ur problem\" adds NOTHING to the discussion but, the \"ur\" does kind of remind me of a 12 yo airhead girl texting her Best Friends Forever (forever probably meaning, til the end of middle school). Like to tryk again with a little more thought on the topic? No?", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "Ugz5NaHClIF0sedXuvN4AaABAg.94Mf6sb83wJ9FrSPu3bPxV", "comment": "the answer to your question comes from the concept of the density of gases (at least, i think so)  the speed of sound is slowed by the density of the air. in any given \"container\", any and every gas occupies the same volume. but, all gases do not have the same molar mass. given that density is the relationship between mass and volume, it's safe to assume that gases with a higher molar mass will have a comparatively higher density than compared to one with a smaller molar mass.  the density of a gas impacts how much sound (or particles traveling at the speed of sound) can travel in any given unit of time. the higher the density of a gas, the less able something is to travel through it.", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "Ugz5NaHClIF0sedXuvN4AaABAg.94Mf6sb83wJ9FrzQrgmX4Z", "comment": " @dingamabob7807  - ...Except that the density of the gas (assuming the gas to be the propagation medium for a sound) doesn't materially affect the speed of sound. But, the speed of the gas particles at any specified temperature does have an impact.  \r Just looking at the mathematically derived answers you can see that only the temperature is shown (once the gas(es) has/have been determined.\r \r This is a tricky subject as the whole concept of sound is so poorly understood by, unfortunately, arrogant mathematicians who cannot conceive of being wrong about...anything. Even when (especially when) they are wrong.\r \r But, since this video is on the speed of nitrogen particles as N2, let's stick with that for now.\r \r The presenter immediatley launches into some mathematics that he memorized while taking some physics class and assumes the result to be as it was told to him to be so. And, anyone who does that math will end up with the same numbers he does.\r \r You mentioned the speed of sound.\r \r Thee are a number of issues that need to be addressed and sorted out. Here's one: In the mixture of gasses that is the air (mostly nigrogen as N2) it is said that the speed of air particles is about 500 m/s (meters per second, about 1100 mph). But, the speed of sound thoufh the air, at the same temperature is about 340 m/s or 760 mph. Somehow we need to come up with a cogent explanation of how sound can travel through air particles traveling at about 1100 mph when sound is traveling through the air at 760 mph.\r \r Figuring that out is a big step in getting the core concept of sound right.\r \r It's interesting that well over 100 years ago (in the 1880s) people were questioning the explanation of the mathematical physicists regarding the nature of sound. This link is to a Scientific American supplement of a lecture published at that time on this very subject:\r \r https://chestofbooks.com/crafts/scientific-american/sup3/The-Fallacy-Of-The-Present-Theory-Of-Sound.html\r \r They knew that there was something different between air with sound and air without sound and they guessed it was some sort of \"agitation of the air\". Not a bad guess but, an incorrect one. But, certainly no more wrong than anything you can see or read these days on the subject.\r \r Keep in mind that this was before the age of electronics and even the Edison grammophone was still in it's early stages of being developed. A time when accurate measurements of high-speed events (like sound) could not be easily made like they are now. So, they had an excuse for getting it wrong. We (plural \"we\") can't use that excuse.\r \r And, there is a LOT more to say about this but, I don't want to go into information overload so will stop here.\r \r salaphysics.com\r 110920", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "Ugwa3b0nlINwO7yKXA94AaABAg", "comment": "didn't get the 1st one", "votes": "2", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgwjOEnR4Qqr2P8n-LF4AaABAg", "comment": "I don't get this one", "votes": "2", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "Ugyk0Kjy-J9W2ooPwB94AaABAg", "comment": "Would u please post a video lecture on Maxwell Bolzmann Distribution of Molecular speeds", "votes": "18", "replies": "1", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgxOSd23E4ItPMu8qUt4AaABAg", "comment": "Thank you!!", "votes": "1", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "UgzmI4X5oJDbc3MH4Rp4AaABAg", "comment": "Nice", "votes": "0", "replies": "", "reply": false}, {"vid": "0m25oTKMv1Y", "cid": "Ugwa3b0nlINwO7yKXA94AaABAg.92O0wHo7F-a93OAhCHV595", "comment": "You need to watch the 2 hour gases video ... I recommend watching it all", "votes": "0", "replies": "", "reply": true}, {"vid": "0m25oTKMv1Y", "cid": "Ugyk0Kjy-J9W2ooPwB94AaABAg.8z7rS8n8K149aKyVybOS8r", "comment": "Was  it posted?", "votes": "1", "replies": "", "reply": true}]