[{"vid": "0rt2CsEQv6U", "cid": "UgwJxx7zNqhlukgSajt4AaABAg", "comment": "Andrew didnt talk about what kind of values should we take for U and V in cost/reward function. Does anyone want to comment some advice", "votes": "3", "replies": "", "reply": false}, {"vid": "0rt2CsEQv6U", "cid": "UgxqeF3ab_BwwaD5YPJ4AaABAg", "comment": "I really do not see how he can have a minus un front of the Trace term, and why there is no minus in the expression of Lt (at around 1:09:00).", "votes": "1", "replies": "", "reply": false}, {"vid": "0rt2CsEQv6U", "cid": "UgwUKqYZ_h3_CHbUGCZ4AaABAg", "comment": "At 1:06:15, shouldn't the \"Big Quadratic Function\" include the second term because a_t is there as well?", "votes": "2", "replies": "1", "reply": false}, {"vid": "0rt2CsEQv6U", "cid": "Ugzi64aunN0N_ZW8Aw94AaABAg", "comment": "Well, I've watched this entire course as  part of my continuing education requirement with my employer.  It's a good course and I feel I've learned some things.  There is one thing that I think needs to be said, though.   Often when popular coverage of this arena is circulated, the material is talked about as though it's some kind of black magic - as though computers doing this stuff are \"really smart.\"  But honestly they're not.  Most of these algorithms are completely straightforward and are not too different from what I might have come up with working from a blank piece of paper.  All the computer is doing, really, is doing arithmetic really quickly.  There is no magic here - nothing \"special.\"  Grind grind grind, get an answer.  Probability theory has been known for going on a century now - it's not magic either.  I think that rather than call this \"machine learning,\" (and \"artificial intelligence\" is an even worse name) a better name would be \"Advanced Probabilistic Algorithms.\"  That name captures the flavor of what it's all about better than the more \"mystique laden\" names.     This said, I wouldn't want to question the value of these methods at all - clearly we can do some useful stuff with them.  But they really should just be part of the toolkit that \"any decent programmer\" can pull out and use.  It's just not stuff that we should be all \"Ohhhhh.... Fancy!\" over.  It's just programming.  The only parties I'd criticize here is the media - they  keep sending this \"Wow - computers will soon be running the world\" message, and I just see nothing in this material that really supports that idea.", "votes": "23", "replies": "3", "reply": false}, {"vid": "0rt2CsEQv6U", "cid": "UgzFpQMliSz4fMao8OF4AaABAg", "comment": "1st cmnt", "votes": "0", "replies": "", "reply": false}, {"vid": "0rt2CsEQv6U", "cid": "UgwUKqYZ_h3_CHbUGCZ4AaABAg.9hgrIvKBJlE9r_YrUcDHJn", "comment": "max is applied for both the terms and to understand what expectation of quadratic function turns out be it is considered separately leaving out the first term. But it is true that he did not mentioned the 1st term when solved for a_t , but ig the result is when it is included", "votes": "0", "replies": "", "reply": true}, {"vid": "0rt2CsEQv6U", "cid": "Ugzi64aunN0N_ZW8Aw94AaABAg.9fijmo02K1n9ggrjcoLZAu", "comment": "these are the things I tell people they don't believe me what you stated is exactly correct many techniques in statistic like linear regression have existed for over some decades but we are noticing them when we have power to computer them", "votes": "4", "replies": "", "reply": true}, {"vid": "0rt2CsEQv6U", "cid": "Ugzi64aunN0N_ZW8Aw94AaABAg.9fijmo02K1n9ulvZz2Ilu6", "comment": "Very correct 💯", "votes": "0", "replies": "", "reply": true}, {"vid": "0rt2CsEQv6U", "cid": "Ugzi64aunN0N_ZW8Aw94AaABAg.9fijmo02K1n9y6e9wT2BMr", "comment": "For reals, right? A really, really (potentially REALLY) long string of pretty basic math. A lot fun to go through, for sure. Sounds like you and I found ourselves on this journey for roughly the same reason. I sincerely hope it worked out for you. All the best, friend (and t-1 classmate :D )", "votes": "0", "replies": "", "reply": true}]