[{"vid": "0ZxeQqtAVl0", "cid": "UgzcLvUCH58_P5ZMH714AaABAg", "comment": "This pyruvate has carbon with 5 bonds?", "votes": "0", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgwX3W_yT2qBYUqWGJp4AaABAg", "comment": "Thank you very much professor", "votes": "2", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgzkY-lKNnYMlkZKiQN4AaABAg", "comment": "05:55 Where does this graph come from? Is it calculated in some way or measured experimentally? Also, how do we know all those steps? How have they been discovered? (proper molecules, enzymes, their correct sequence etc.)", "votes": "1", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgwpLK-n94RYUjSsXFt4AaABAg", "comment": "La molécula del piruvato está mal", "votes": "0", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgzjFBoPWId5hE8KDON4AaABAg", "comment": "this is heaven. metabolism was a subject that bored me. but this just made metabolism to come back into my brain game.", "votes": "0", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgwT20RTs6WNabR0eUx4AaABAg", "comment": "If you want to see a video that better explains this process, refer to the YouTube channel “dirty medicine”", "votes": "0", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgxNKdLqF0_fUzt394t4AaABAg", "comment": "me hand up. Hi prof. you drew a 5 bonds carbon in pyruvate.", "votes": "1", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgzQ70a0ADk8n9YbVB94AaABAg", "comment": "Thank you so much!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgzEVyEUbicmTu_rYVV4AaABAg", "comment": "Damn, I didn't know Edward Norton was a biologist, and he aged really well too.", "votes": "2", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgysJr_Nh8TUGqr5kjt4AaABAg", "comment": "This topic is so confusing", "votes": "1", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgwlV9HYUVu88NpvpvR4AaABAg", "comment": "Holy crap, what an excellent Prof! Cheers MIT", "votes": "3", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UghXKQfsQ3aaYXgCoAEC", "comment": "this is my second day of MIT open course ware schooling.... i'm following the fundamentals of biology course of MIT.. So much gratitude for this professor and MIT Staff.. i'm learning a lot..", "votes": "11", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgicJZsuPkdmZHgCoAEC", "comment": "Thanks for this lesson, it was very helpful. Teacher is very cute, by the way.", "votes": "3", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgitOJBUcLOml3gCoAEC", "comment": "i thought it was pretty well established for years now that it is in fact NOT lactic acid that causes DOMS (delayed onset muscle soreness), but micro-tears in the muscle fibres?", "votes": "6", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UghA5Xr2D_p91HgCoAEC", "comment": "Cant even draw a pyruvate molecule?", "votes": "2", "replies": "1", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgjaCW0oZ-3Nm3gCoAEC", "comment": "31:50 if anyone wants to see an animation of the ATP synthase machine in action (which obviously also turns ADP into ATP, but does not explain how the ADP suddenly popped into existence), search youtube for:  XI8m6o0gXDY  (my comments are not shown if I link directly)", "votes": "1", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UghJDfh7iw2LKngCoAEC", "comment": "12:30 lol, that first question, I love those students (repeated for emphasis), stating the obvious, which I just stated below as well, but not having the fortitude to challenge the answer, which was exactly what I expected; what a nice dodge from the professor, he's basicly saying \"let's imagine for a moment\" Mother Nature did it/invented it but I don't have evidence/a clue how (unverified hypothesis, just-so story or maybe-so story), I just want to believe it evolved by natural processes without any inteligent guidance or purpose in mind (or foresight, planning) = wishful thinking/illogical bias. Even though the observations of the functional arrangement of parts (designs, machines) are staring him in the face he still needs to pretend they're not really there, it's just an illusion as Dawkins said in \"The Blind Watchmaker\", yeah sure (or the other version, pretend that machines haven't been designed by a designer or designers, warping language, playing the 'it's just a concept' game). Switch the subject please, he doesn't like that question....", "votes": "2", "replies": "2", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgjYCprdSdyPGngCoAEC", "comment": "10:09 these other mythological organisms that couldn't make energy (didn't have the required machines/enzymes to make ATP), how did they survive and pass on their genes to the next generation in order to evolve this system bit by bit? Oh wait, it was poof, punctuated equilibrium, right? Magic? Whatever, we don't know (but Mother Nature did it anyway)?  Thanks for sharing all this information on the internet but could you just please tone down a bit on the evolutionary philosophies, just-so stories and maybe-so stories? I feel so sorry for the students that are paying to be taught impossibilities; where did the ATP that gets put into the reaction came from again the first time? Oh, that part wasn't important right? Or we'll just assume without evidence that Mother Nature somehow invented or figured out (by an impossible unsurvivable trial and error imaginary mechanism often called evolution when it's allowed or when nobody is paying attention to when it's used as a verb) how to make the ATP before this entire system (all 10 enzymes/machines) supposedly evolved/poofed into existence in 1 asexual reproducing organism (let's not make it too hard on the myth, since he doesn't fill in the blanks); with or without the required DNA > RNA > protein transcription and translation machines/enzymes to make these particular 10 machines/enzymes that only contribute to a much larger system of interdependent machinery?  “As in Mathematicks, so in Natural Philosophy, the Investigation of difficult Things by the Method of Analysis, ought ever to precede the Method of Composition. This Analysis consists in making Experiments and Observations, and in drawing general Conclusions from them by Induction, and admitting of no Objections against the Conclusions, but such as are taken from Experiments, or other certain Truths. For Hypotheses are not to be regarded in experimental Philosophy.” - Isaac Newton  from wiki:  Until the late 19th or early 20th century, scientists were called \"natural philosophers\" or \"men of science\".  The Encyclopedia Britannica on inductive reasoning:  \"When a person uses a number of established facts to draw a general conclusion, he uses inductive reasoning. THIS IS THE KIND OF LOGIC NORMALLY USED IN THE SCIENCES. ...\"  “He who thinks half-heartedly will not believe in God; but he who really thinks has to believe in God.” - Isaac Newton  \"Later Philosophers banish the Consideration of such a Cause out of natural Philosophy, feigning Hypotheses for explaining all things mechanically, and referring other Causes to Metaphysicks: Whereas the main Business of natural Philosophy is to argue from Phaenomena without feigning Hypotheses, and to deduce Causes from Effects, till we come to the very first Cause, which certainly is not mechanical;... Whence is it that Nature doth nothing in vain; and whence arises all that Order and Beauty which we see in the World? ... And these things being rightly dispatch'd, does it not appear from phaenomena that there is a Being incorporeal, living, intelligent, omnipresent, who in infinite space, as it were in his Sensory, sees the things themselves intimately, and thoroughly perceives them, and comprehends them wholly by their immediate presence to himself: Of which things the images only carried through the organs of sense into our little sensoriums are there seen and beheld by that which in us perceives and thinks. And though every true step made in this philosophy brings us not immediately to the knowledge of the first cause, yet it brings us nearer to it... were men and beast made by fortuitous jumblings of the atoms, there would be many parts useless in them. Here a lump of flesh, there a member too much. Some kinds of beasts might have had but one eye, some more than two. Atoms, mechanical laws, are nothing compared to the knowledge and wisdom of the Creator.\" - Isaac Newton  again bringing us back to:  \"And these things [eyes, organs, parts, biomolecular machines like enzymes] being rightly dispatch'd, does it not appear from phaenomena that there is a Being ..., living, intelligent...\"? [someone responsible for these designs who knows what he/she/it is doing. When considering this question nowadays, one would have to consider/add the observations and established facts of biomolecular machinery and their designs in the DNA code/blueprint, which Newton was unaware of at the time, also as a reminder, our designs and machines have errors too, require maintenance because of entropy and may sometimes fail completely, especially if you throw the figurative wrench in them, this is normal for designs and machines]  \"If these were legopieces you wouldn't have such issues with the certain reality/truth of Newton's first Cause being at least a capable engineer and designer, or more than 1.\" -Uenbg (talking about all biological molecules: proteins, enzymes, nucleic acids, amino acids, ATP, etc., the biomolecular machines and their parts/components or other requirements)", "votes": "1", "replies": "1", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UghWauLxJs-8MngCoAEC", "comment": "As we increase our oxygen intake it thereby increases the mitochondria count in our cells (fission). Disease and illness has no life in a high oxygen environment. Aging (oxidation) is impossible with increasing mitochondria. Utube Theta Brainwaves to Nirvana.", "votes": "1", "replies": "1", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgiOC5nHQD3r23gCoAEC", "comment": "Great Lecture, Superb Professor! Thank you MIT!", "votes": "2", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UghA5Xr2D_p91HgCoAEC.7-H0Z7-6vDV9HXPNuLB5Ed", "comment": "Así es , está mal la molécula del piruvato", "votes": "1", "replies": "", "reply": true}, {"vid": "0ZxeQqtAVl0", "cid": "UghJDfh7iw2LKngCoAEC.7-H0Z7-Arqr79HblfVJomJ", "comment": "Do you not think you're also subject to bias too?  Sorry, but I do not see design in biology. If it was designed, the designer was a poor engineer. So many aspects of our anatomy, molecular biology and biochemistry is inefficient / unnecessarily complex or even useless as a design. Sure, there are things we don't fully understand related to the structure and function of things, but I wouldn't just assume because I don't understand it's formation or purpose that it's designed. That's your own bias. I look for the answers. I assume looking at your comment regarding atp synthase that a couple examples you are hinting at are the appearance of designed machinery of atp synthase and bacterium motors...  Both of which have layers / parts which individually wouldn't complete it's function without the other parts. Yet, there are videos even on YouTube which explain the possible evolutionary adaptions of such components which had prior functions before it became what it is today.", "votes": "2", "replies": "", "reply": true}, {"vid": "0ZxeQqtAVl0", "cid": "UghJDfh7iw2LKngCoAEC.7-H0Z7-Arqr79HuTns5RnI", "comment": "+Sheldon Pooper 1 quote: \" If it was designed, the designer was a poor engineer. So many aspects of our anatomy, molecular biology and biochemistry is inefficient / unnecessarily complex or even useless as a design.\"  And yet here we are, a reproducing intelligent self-repairing and self-correcting \"survival machine\" (quoting Dawkins) capable of so much more than just what I mentioned in this sentence. Such as love and art, a wide range of emotions. I don't see you making a self-reproducing machine made up of smaller interacting nanoscale machines like that as efficient as that at these capabilities (try talking to some Japanese scientists building robots designed to imitate humans to see what some of the engineering difficulties are to overcome, especially regarding the intelligence part, but so much more). I think you have a poor judgement of good engineering, especially nanoscale engineering, perhaps if you watch the video called:  The Central Dogma synra edition  you'll get a different appreciation for it. Otherwise you could search youtube for the phrase:  so-called unintelligent design  To see where you might be arguing from ignorance regarding what you call \"inefficient / unnecessarily complex or even useless\". Which aren't even qualifiers for determining whether something is a machine and thus designed or not (a machine does not have to be perfectly efficient to still be able to tell that it is a machine, our machines aren't, they also often contain a certain amount of complexity that may not be understood by everyone why it is there or functions that way). Which in turn requires a designer or designers, a conclusion one can draw by inductive reasoning on what we know, established facts and the meaning of language. One can tell by observation of the functional arrangement of parts if something is designed or not and this is quantitative (the more parts, the more sophisticated and fitting their arrangement and the more functional their interactions, the easier it is to tell if one is looking at a machine or just an illusion/the appearance of a machine, check out the examples given by Behe in his presentation about this subject if you can find it, 'the Old Man in the Mountain' and 'Mount Rushmore'). The conclusions a person draws from this process is the method of scientific enquiry that Newton encouraged and it is superior than putting videos on youtube with just-so stories and maybe-so stories that don't work logically if you think a bit longer about them with a bit more skepticism and a bit less wishful thinking that natural causes can make machines come into existence and can arrange parts together in such a functional way that it produces a living reproducing organism. Those you described when you said:  \"there are videos even on YouTube which explain the possible evolutionary adaptions of such components which had prior functions before it became what it is today.\"  There is no evolution in the sense that these videos mean without reproduction. All of what I spoke of are minimum components required for reproduction that we know of, not imagining or hypothesizing some fantasy single-celled animal precursor to life that can't reproduce and doesn't have any ATP to run anything on. It works the way we are observing it now, all these other suggestions are hypotheses unless you can demonstrate it working and transitioning (evolving) from one machine into the other in a related chain of living organisms at least (over multiple generations, but how are you gonna start evolving without ATP? And the machines involved in the synthesis of ATP? Since that was the main subject that I was discussing. Plenty of stories about the bacterial flagellum on youtube that don't work but it doesn't seem people like talking about the ATP synthesis machine, the DNA Polymerase machine, the Ribosome machine, and way more to mention). And people really don't need to call them enzymes all the time to cover up the truth every layman can see once they actually look at how it functions in a good accurate animation. It's really in your face that this is nanoscale machinery at work.", "votes": "1", "replies": "", "reply": true}, {"vid": "0ZxeQqtAVl0", "cid": "UgjYCprdSdyPGngCoAEC.7-H0Z7-CEYt93psEOpoezx", "comment": "Uenbg that’s abiogenesis, it is briefly covered in the fundamentals course, but you will find much more detail on it in further biology courses and textbooks offered or recommended by mit OpenCourseWare", "votes": "0", "replies": "", "reply": true}, {"vid": "0ZxeQqtAVl0", "cid": "UghWauLxJs-8MngCoAEC.7-H0Z7-IY959RYUHbK-FrZ", "comment": "thats why our wisdom says deep breathing, pranayams", "votes": "0", "replies": "", "reply": true}, {"vid": "0ZxeQqtAVl0", "cid": "Ughxtgz4kqIzDngCoAEC", "comment": "Thank you to MIT to have a lecture video like this plz keep going  Making me understand this subject so much ", "votes": "12", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgzyYVKb4TtTPvpaFsd4AaABAg", "comment": "Honestly (no offend to the MIT and Mr. Walker), we've got better lectures on biochemistry on our faculty (fundamental medicine, Lomonosov's MSU). Our professor really rules. And thats sad, despite the fact we have talented scientists and professors russian education is on its way to the shithole.", "votes": "0", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgzO4C4W14ABqwiSlgp4AaABAg", "comment": "Fermentation and putrification is nature`s dance between life and death, health and illness, preserving and destroying. See YouTube video \"Fermentation, Simplified\". ", "votes": "1", "replies": "", "reply": false}, {"vid": "0ZxeQqtAVl0", "cid": "UgyNWCo-XMMk--eZjKN4AaABAg", "comment": "please keep the lectures coming MIT. ", "votes": "2", "replies": "", "reply": false}]