[{"vid": "2Ola674-PPw", "cid": "UgzSbgNSX3z09fpnlA54AaABAg", "comment": "He looks goofy 😂", "votes": "1", "replies": "", "reply": false}, {"vid": "2Ola674-PPw", "cid": "Ugwz6fCzYxyoE_aklFZ4AaABAg", "comment": "At 21.23 when he says for a K matrix, Qt Q = I , then shouldn't he mention that Q is the matrix of unit eigen vectors and not actual eigen vectors?", "votes": "0", "replies": "", "reply": false}, {"vid": "2Ola674-PPw", "cid": "UgxB1oDUY9xliRBFgZ54AaABAg", "comment": "I'm really happy to take this lecture. Thank you for everything ! - From Korea", "votes": "2", "replies": "", "reply": false}, {"vid": "2Ola674-PPw", "cid": "UghRE-vMxJ82WXgCoAEC", "comment": "In the book, for the case of the circulant matrix, Prof. Strang shows (correctly) how to find the eigenvectors, in a form involving complex exponentials.  As a result, the eigenvalues are real (as expected from a symmetric matrix), but the eigenvectors have complex entries.  What he does not do, which I think is a major omission, is to show (it's very simple) that if y=a+bi is a complex eigenvector for a real eigenvalue, then Re(y) and Im(y) are also eigenvectors, but Re(y) is a real eigenvector.  So, if we were hoping for our eigenvectors to form the basis of some real space, this is what we want.  Furthermore, if people are playing along at home and using Matlab to verify various things they try, Matlab returns the real eigenvectors, so it would be nice if the text were better at facilitating this helpful learning device.", "votes": "0", "replies": "1", "reply": false}, {"vid": "2Ola674-PPw", "cid": "Ugg8Qb_PEOqFw3gCoAEC", "comment": "At 38:00, be careful.  He says pi^2, etc. are the eigenvalues of the matrix.  This is not quite true.  The book explains why, in the discrete fixed-fixed case, the eigenvalue is 2-2cos(k*pi*h), and why this makes sense, and how it connects to (k*pi)^2, including the h^2 that is supposed to be included with the 2nd difference matrix K.  The same steps can be followed to determine the eigenvalues of the discrete problems with other boundary conditions.", "votes": "1", "replies": "1", "reply": false}, {"vid": "2Ola674-PPw", "cid": "UgzY42Jmv47LJ4Qjkmd4AaABAg", "comment": "we have 2 eigenvectors in the end but we must have 4 (n=4), where are the others 2? thank you for your answer ", "votes": "0", "replies": "1", "reply": false}, {"vid": "2Ola674-PPw", "cid": "Ugw25GoZtQd1khzhhqN4AaABAg", "comment": "hey. thanks for your follow-up. now it comes to me how zero eigenvalue can be nontrivial; while zero eigenvector is trivial case.", "votes": "0", "replies": "1", "reply": false}, {"vid": "2Ola674-PPw", "cid": "UgyumS1EcVu-ojNPhJR4AaABAg", "comment": "@bamboopoem1989  no, we can have an eigenvalue equal to 0 even for non zero eigenvector for singular matrices as the prof said. Ex:  1  -1  *  1 = 0 * 1 1  -1     1           1", "votes": "0", "replies": "", "reply": false}, {"vid": "2Ola674-PPw", "cid": "UgyK65h7XljpKBNw3BB4AaABAg", "comment": "something about around 11:00. I thought it's convention that zero vector cant be eigenvector, thus corresponding eigenvalue cant be zero. He might not really have explained why lamda's are non-zeros - A being invertible.", "votes": "0", "replies": "1", "reply": false}, {"vid": "2Ola674-PPw", "cid": "UghRE-vMxJ82WXgCoAEC.8S-DTi8jzJZ9r5NMN6Gyh3", "comment": "And what book is this class based on?", "votes": "0", "replies": "", "reply": true}, {"vid": "2Ola674-PPw", "cid": "Ugg8Qb_PEOqFw3gCoAEC.8Rkpz2gE3yA8prAK9vIBGO", "comment": "Is this book part of the course materials online?", "votes": "0", "replies": "", "reply": true}, {"vid": "2Ola674-PPw", "cid": "UgzY42Jmv47LJ4Qjkmd4AaABAg.8GcABvazMXe8S-BE3eaBWG", "comment": "He did sin k*pi*x and sin k*2*pi*x.  There are also sin k*3*pi*x and sin k*4*pi*x.  You might ask, if those work, why not sin k*5*pi*x, sin k*6*pi*x, etc.  Well, sin k*5*pi*x is the zero vector, since n=4.  For 6 through 9, you get negatives of eigenvectors you already had, so they're not new eigenvectors.  From 10 on, since there's a shift of 2*pi involved, you get duplicates of what you already had.  The point is, once you have 4 perpendicular eigenvectors in 4-dimensional space, there's nothing more to find.", "votes": "1", "replies": "", "reply": true}, {"vid": "2Ola674-PPw", "cid": "Ugw25GoZtQd1khzhhqN4AaABAg.8GbY8JnhHdh8RiX6Bp-JmI", "comment": "zero eigenvector isn't \"trivial\".  It is nonexistent.  A0=0 always.  Only non-zero vectors are candidates for eigenvectors.  In order to preserve direction, one must have direction in the first place.", "votes": "1", "replies": "", "reply": true}, {"vid": "2Ola674-PPw", "cid": "UgyK65h7XljpKBNw3BB4AaABAg.8Gcagddw_hI8RkZNta7eUN", "comment": "There are no zero eigenvectors.  Eigenvectors are defined to be non-zero vectors whose image under the linear transformation is some scalar multiple of themselves.  Eigenvalues, however, CAN be zero, and there is at least one zero eigenvalue for every singular matrix.  The eigenvectors (non-zero) associated with those zero eigenvalues form a basis for the null space of the matrix.", "votes": "0", "replies": "", "reply": true}]