[{"vid": "3AVSORIJJJY", "cid": "UgwsB0sQC0ZErbRO-Qt4AaABAg", "comment": "These are the best lectures on introductory chemistry I've seen (online & offline)! everything is so well explained and structured, thank you very much.", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugym4-CzifoMjumr61d4AaABAg", "comment": "20:32", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgyN1LND5-mz1BTjM8d4AaABAg", "comment": "Does anyone know the geometry of phosphorus with 5 bonds? Is the hybridization sp2d for sigma bonds and a “p” orbital for the pi bond or is it sp3 hybridization for the sigma bonds and “d” orbital for the pi bond? Thank you.", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugz1d1rBGkWD2fldet94AaABAg", "comment": "Dear Mam: I didn't get that14_8=6 from where 6 being come", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgzJsGL1JDBE7Tr7-md4AaABAg", "comment": "EEXELLENT", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugw3kYACO7DU5HXpLLJ4AaABAg", "comment": "Keep it uppp", "votes": "1", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgyzYpyD2JoWRVrJrBl4AaABAg", "comment": "Thank you soo much 😊☺☺this is an excellent lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgyeRbuf0eEOBt95IiJ4AaABAg", "comment": "ph3 is 90 degrees they did was wrong or what btw lectures are pretty usefull", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgjYsYYor7G1xXgCoAEC", "comment": "Thanks to MIT for giving chance to become clear on this topic...and hope your upcoming lectures will help us too...", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgjPPE5VRMMOKngCoAEC", "comment": "Same situation in NTU", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugwat-csYzO3ZGjXEKN4AaABAg", "comment": "The Humanity! the upward inflection virus is spreading even among professors and scientists! Almost every video on youtube has it. It really really gets on my nerves. Makes my ears bleed. What happened to Richard Feynman, Leonard Bernstein, I could listen to them talk all day long.", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugihzd2QsKRui3gCoAEC", "comment": "Second question. When explained for SP hybridization, why does it have 3 C2p electrons while the orbital of lower energy level, C2s, is not fully filled? Thanks for any help.", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgiAevqqX5rinngCoAEC", "comment": "Could anybody explain that why sp2 hybridization is axisymmetric to Z axis?  I am confused by the two hybridization orbitals that are on both side of Z axis.", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgjUVkFG83EWEHgCoAEC", "comment": "there will be no hybridazation in PH3 AS IT is the drago compound so angle must be near to 90 degree", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UggUSE9oNlOPQngCoAEC", "comment": "I wish the beginning portion that covered heteronuclear diatomic molecules was not cut off. I wanted to see the process fully.", "votes": "8", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UggY-c03McshdXgCoAEC", "comment": "I just didn't understand how to determine how many orbitals hybridize until I watched this video. It makes perfect sense now, thank you!!", "votes": "3", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgidiZUGOgDHEHgCoAEC", "comment": "Very helpful :)  Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UggF9NUlKv-FgHgCoAEC", "comment": "Thank you for these videos.  Your interaction with the students is fantastic.  I was a HS teacher and I need those TAs in my class. lol!", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgjJMwqrsrBll3gCoAEC", "comment": "she is so much better than our regular teachers.really helped me in my +2 science.", "votes": "2", "replies": "2", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugg9caZNtmmmE3gCoAEC", "comment": "why 14 was considered i didnt get that?", "votes": "6", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgyN1LND5-mz1BTjM8d4AaABAg.9F4lDpy0XBa9x99rVt5woW", "comment": "It's sp3d trigonal bipyramidal. It was a practice problem I've done before", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugz1d1rBGkWD2fldet94AaABAg.94cFnJ6_Jqn9x9A7kURUIk", "comment": "It's the total total of valent e- involved in bonds between the P and H atoms. 3 from each. With p lone pair being left over.", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UgyeRbuf0eEOBt95IiJ4AaABAg.8Wc85Ec6g7w9x9ADCcm5tX", "comment": "The question and answer was less than 109.5.. which is a true statement.", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugwat-csYzO3ZGjXEKN4AaABAg.8QWmw_NvrLp8VIi9mv_iZN", "comment": "haha makes it hard to concentrate. I totally agree. Yet i keep watching.", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UggUSE9oNlOPQngCoAEC.8K1FEKBoMUA8T_WdPeSa0o", "comment": "Yeah,me too", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UgjJMwqrsrBll3gCoAEC.8CHKq7w4Gl58j7W0nQvA4U", "comment": "Ya true but cant believe they are this topic in University which we Indians learn in 11th and 12th IIT", "votes": "1", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UgjJMwqrsrBll3gCoAEC.8CHKq7w4Gl591lATlHrGll", "comment": "Sahi ho mam ! Mit is what famous for 🤓🤓", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugicn1IxbmglcXgCoAEC", "comment": "Great class. Thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Uggt58jyHH3r6HgCoAEC", "comment": "Why was the CO example omitted from this video? There is like 2 mins of explanations missing from this video. See 3:43", "votes": "1", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgiNySLS7KGAZHgCoAEC", "comment": "Thanks, MIT, for OpenCourseWare.  Th", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UggegJXqTiGeangCoAEC", "comment": "I watch these lectures during my chem lectures because these are so much better!", "votes": "27", "replies": "3", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Uggxair35LNkgHgCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgiaysPfrEhA1ngCoAEC", "comment": "The best classes ever. Thanks for sharing this for us. :)", "votes": "5", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Uggujt0jx5beQXgCoAEC", "comment": "Where did she get 109.5° from? If you divide 360 by 4 it's 90 so obviously that isn't the correct way to execute this problem...", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UghSXgmgJ3XBb3gCoAEC", "comment": "Great lecture, but The MO Diagram for Carbon Monoxide is incorrect the sigma should above the two pi's-- mixed orbitals ", "votes": "2", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UggIVKlydPz4kHgCoAEC", "comment": "Nice Lecture ! Very Effective Teaching !  Also compare the following animation about VBT :Valence & Hybridization of Carbon (Methane)-Dr.Amal K Kumar", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugis9jtGLJBxuXgCoAEC", "comment": "Does anyone understand how you know which orbitals are left un-hybridized? In some of the examples not all the orbitals are hybridized. Some are left over", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UghiH-RPA2Ye-XgCoAEC", "comment": "Can someone explain the molecular orbitals of carbon monoxide? For some reason the video cuts that and skips directly to the electron configuration of the bonds (with the pi bonds of x and y orbitals initially having two bonding electrons each and then being reduced to only one….) ", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugj5C66_TNKmfngCoAEC", "comment": "One thing I didn't quite get was that question in the beginning and why suddenly she subtracted 8 from 14 to get 6. Could someone help please ?", "votes": "0", "replies": "4", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugi_tPYUqZO4UngCoAEC", "comment": "Benzene is not a combination of two versions of cyclohexatriene.  That would mean that all three pi orbitals are at the same energy level (and the three empty anti-bonding orbitals would also be at the same energy level).  It has one strongly bonding molecular orbital that results from combining all six 2p orbitals in the same direction, two bonding MOs from combining four in the same direction and two in the opposite direction, and three anti-bonding orbitals (which are empty in the ground state).  http://www.chemtube3d.com/BenzeneMOs.html", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgikUBbYcUh_fXgCoAEC", "comment": "The schematic drawings of hybrid orbitals seem to show a node at the nucleus.  The nucleus is really inside the large lobe, right?", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgiHZV9WM3drsHgCoAEC", "comment": "uhh..... This is so much better than the UC system... Professors actually prepare for their lectures...", "votes": "8", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC", "comment": "This is so unfair, because I have to learn this in school, and you lucky americans only have to learn it in college. :( God, I hate India soooo  much! !!!!", "votes": "5", "replies": "12", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgzuIHeoXc0yBq7C_rZ4AaABAg", "comment": "yeah this is general chemistry so you'd be taking this freshmen year of college most likely.", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugzlb5P29RQOFLFKTFd4AaABAg", "comment": "As a Cornellian, I thank you. BUT, that being said, their chem teachers aren't as good as MIT's. But, come on. It's MIT. No one is better than MIT, man.", "votes": "0", "replies": "1", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgwvQXD5aBQ1hfB8AAl4AaABAg", "comment": "are you kidding me?  Cornell prof made no sense when I was taking gen chem... They don't know a thing about teaching. ", "votes": "1", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugxpn4bCXYgyWwehVbt4AaABAg", "comment": " I don't want to go to college. I am a junior in high school doing the IB exams and we are doing this in class right now o.0 THe lecture is extremely fast and stupid.. and cannot even explain anything", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UggegJXqTiGeangCoAEC.85LJPhUVjuE7-g9N72Q0z5", "comment": "I know that feeling. My classes were so bored and unclear. Thank you, MIT. haha", "votes": "1", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UggegJXqTiGeangCoAEC.85LJPhUVjuE7-i7cI4ArAU", "comment": "+Joel Oliveira I believe there is a typo in your comment. I think you meant your classes were so nuclear, not unclear. Ha ha ha.... oh, such bad jokes.", "votes": "9", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UggegJXqTiGeangCoAEC.85LJPhUVjuE8Xwh00ZR1V9", "comment": "The best comment ever! :)", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Uggujt0jx5beQXgCoAEC.7zNISa6kTBC7-hQUKg2eP-", "comment": "Clearest Lyrics Tetrahedral geometry the bonds are orientated @ 109.5 degrees apart because this maximizes the distance between each region of electron density. Remember it is a 3D structure, not flat.", "votes": "7", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UghSXgmgJ3XBb3gCoAEC.7-H0Z7-U1VK8CUTCPHulAb", "comment": "why?", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UghiH-RPA2Ye-XgCoAEC.7-H0Z7-QZgU70QbA6ZXXEO", "comment": "By looking at the blackboard it seems to me that the CO molecule has the pi x and y orbitals with 2 electrons each, they become just 1 electron for each pi orbital for the cation CO(2+)", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugj5C66_TNKmfngCoAEC.7-H0Z7-DOHr7-z7DyRWVv3", "comment": "well, phosphorus has 5 valence electrons and hydrogen has 1 each so you get a total of 8 valence electrons. Since you need 14 to get full shells, cause phosphorus needs 8 to be full and Hydrogen needs 2, you subtract the original number of electrons, which is 8, from the number that you need, which is 14, to see how many electrons you need for the bonding, which is 6.", "votes": "3", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugj5C66_TNKmfngCoAEC.7-H0Z7-DOHr709HcJ--R_2", "comment": "The phosphorous wants 8 electrons to gain a full octet (i.e. full valence shell) and the hydrogens want 2 electrons to gain a full valence shell. 8 electron for phosphorous and 3x2=6 electrons for all the hydrogens = 14 electrons. This is the amount of electrons needed for all atoms to have full valence shells. We have 8 valence electrons for all atoms. The 14-8=6 is giving us the number of bonding electrons.", "votes": "1", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugj5C66_TNKmfngCoAEC.7-H0Z7-DOHr709fziMmvOE", "comment": "David Méry saral123456789  Well, thank you for your answers. They really helped. What my question really was, is that WHY do all that to find the number of bonding electrons ? In PH3, for example Hydrogen can only make single bonds and hence it is evident that there will be 3 phosphorous - hydrogen bonds and thus 2 x 3 = 6 bonding electrons. I really don't understand the purpose of doing all that calculation for this result. More over I guess you both used octet and duplet rules to find out the number of bonding electrons. Actually octet rule doesn't hold in all cases --> what I mean by that is 'there are many compounds which violate octet rule' for example SF6, XeF6, ... and the list goes on. Thus, I think using something that isn't ALWAYS true is not very very good. This method would fail in cases like XeF6. The only way in which you can find the number of bonding electrons is this ;- F makes single bonds thus 6 F atoms would make 6 bonds and thus there would be 12 bonding electrons. Anyway, thanks for your replies. :)", "votes": "1", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugj5C66_TNKmfngCoAEC.7-H0Z7-DOHr8j7VW4-8fgq", "comment": "Aritra Das hi r u IIT student", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz758ESfVB06g", "comment": "Guess what? We learn it in school too.", "votes": "7", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz76fbYbrtHoJ", "comment": "Erhm I'm learning it in high school in the US...", "votes": "2", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz78UlOgzCxXB", "comment": "Why do you hate being educated?", "votes": "19", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz78mZKBp1u71", "comment": "Adam Wojtczak guess i never looked at it that way, now i feel guilty :(  Well thanks, i guess :)", "votes": "3", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz79tohqANTZ1", "comment": "Well, you should be proud that what you learnt in school, others are learning in college. From my own experience most of the MIT OCW videos cover topics (in physics and chemistry only) that are usually done in the 11th and 12th standards in India.", "votes": "6", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7G98dagDtbr", "comment": "Aritra Das  This is also taught in American High school but not in detail and not to everyone as people have choice not to take it. Thus, college would teach this from beginning. They are super effective. The things I learned in Computer programming in two years in Indian high school, American college taught that things in less than 4 months and went beyond the indian education circle. Also OK I know how they teach in INDIA.They teach science like facts and not like concepts. I've Never heard anyone say anything about wave equation in India.", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7G9Dfx9paB2", "comment": "riken maharjan I don't know really much about the Indian education system. However I know that Indian Education System is not really something I am proud of AND I also know, that because it's the system that's not perfect, most Indian school-goers have resorted to other means of education - coaching, online courses, .... the list goes on. And this is why though the school teaching doesn't delve into depths of any of these fields, the students do. As an example, I learnt NOTHING new from watching ALL of 8.01 physics lectures and I'm only halfway through the 11th standard. Almost the same for chemistry. Unfortunately computer is not one of the subjects that is taught awesomely before college in most of India. And about wave equation, are you talking about the Schrodinger one ? Well, I learnt about that in atomic structure and bonding classes. And about facts and concepts ? Try solving JEE Advanced papers. Physics Chem Maths. They are meant to be solved by 12th graders. Cheers !", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7G9It7DrjZL", "comment": "Aritra Das These are freshmen courses which finish in first 4-8 months of the American college. They teach advance subjects from second year. I see indians talking about how their education is far ahead of American. I totally disagree with that. They teach advance topic like quantum mechanics after these introductory courses. I took 11-12 class from the Indian board. Whole modern chemistry is based on wave equation but not a single time was taught about the wave equation.  Don't lie that you knew Schrodinger's equation before watching MIT's video. They teach these things in IIT(bachelors) in India. For my case, Indian Teacher, with 40 years, experiences were able to perplexed everybody. Even books and syllabus are totally different in India.   AS I said American high school also teach this but some opt out. So, they have to re-teach everybody again from the beginning.", "votes": "2", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7GBv83yXcC9", "comment": "riken maharjan Hahhhh. You can't imagine how hard I laughed after reading your reply. Yes, it was that hilarious! Yes, our education is far ahead of the American system as far as concepts are concerned. End of discussion. Again, I am not talking of \"Board\" Education. That, in all respects, is backward. And if you didn't hear of the wave equation, sorry pal, you just didn't study enough.  I learnt about Schrodinger's wave equation in class 9, unfortunately. ;) The very fact that you feel that I need to be lying about this, makes me proud. I know about IIT bachelors degree. I am aspiring for the same. And hence I am studying THOSE topics NOW. And there are at least 1.5 lakh other students doing the same. \"For my case .....\" <---- Something horribly wrong with this sentence. I never said American schools don't teach this. I said that they just don't go into this depth. Cheers again.", "votes": "1", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7GC2wYojONU", "comment": "Aritra Das Laugh as much as you like. I'm done with this banter. ", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7GC53FuMHIo", "comment": "riken maharjan I accept your apology.  Cheers, for the last time.", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugi1HGV8_GSxzngCoAEC.7-H0Z7-Mlaz7Hmbpoh7ePt", "comment": "Correct.", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "Ugzlb5P29RQOFLFKTFd4AaABAg.8GcHMj4R1DK8j7VkFTGflR", "comment": "tytoalba451 who said this to you how can you forget IIT is much higher than MIT 😂😂😜😜😛😝", "votes": "0", "replies": "", "reply": true}, {"vid": "3AVSORIJJJY", "cid": "UgyEIUNGc2GgZIpZvst4AaABAg", "comment": "Cornell is obviously the best school in the world. These MIT lectures are so slow and dumbed-down. ", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugyod_dgGat2mi1aVmd4AaABAg", "comment": "best lecture that ever listened ", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgyWzH7a-BQygAHbHUp4AaABAg", "comment": "What level is this lesson? i'm from France and I don't really understand how studies work for you :) Do you learn this first year in college or later?", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgztUdvkJG0FWL3URQR4AaABAg", "comment": "chemistry forever", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgyQgRKjop_uYcyKD0d4AaABAg", "comment": "You guys rock! Thanks so much!!!! Thanks so much!!! This is helping with my MCAT preps! My uncle referred me to your OCW! Thanks...!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgzpFPmW6oFi1yXX7Yx4AaABAg", "comment": "very clear!", "votes": "1", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgwJB7sbr9vLBRR5S-p4AaABAg", "comment": "fantasic", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "UgziAuJLXI8-D0lg4rF4AaABAg", "comment": "mit kicks cornell's ass any day. -says a desperate cornellian in general chem", "votes": "0", "replies": "", "reply": false}, {"vid": "3AVSORIJJJY", "cid": "Ugyalp7mxuBHkCf61c54AaABAg", "comment": "Yes, yes it is. MIT is amazing!", "votes": "1", "replies": "", "reply": false}]