[{"vid": "3edzxv_mYZk", "cid": "Ugxs6IwajQkYyJd-L014AaABAg", "comment": "Why? because Simon says so?", "votes": "0", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgycpvlpT4RP0UlNiqt4AaABAg", "comment": "Super knowledgeable at 12th class.....", "votes": "1", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgyOfrOtwADAHBBJPbB4AaABAg", "comment": "(Saturday, January 21, 2023) Fundamentals of Biology (MIT 7 Open Course Ware, A Public Beneficiary And Educational Effort).  Proteomics or the Basic Unit of Protein, The Amino Acid.  Chemical Interactions therein and Further Dynamic Studies of Chemical Polymerization Therein.  By Mdm Hazel Sive (PhD).  One Addendum.  The essence and importance of such valuable teaching of the Pure Sciences certainly must warrant the exposition in the highest quality possible (4k Resolution is currently Available), for Science is based on that which is observable.  Set the Mark, the Standard Right.  Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugy2FapTe37YS5BY5Rh4AaABAg", "comment": "great leacture", "votes": "3", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugz2YdO9u4tcGx0MwRp4AaABAg", "comment": "amazing videos! just wanted to clarify that even the tertiary proteins are not the functional proteins right?", "votes": "1", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugz87H2Q4x7qFHKRfQl4AaABAg", "comment": "What an amazing class!! Watching here in Brazil due to my teacher's indication", "votes": "2", "replies": "1", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugx6VvBPlSbGZ_TMjsR4AaABAg", "comment": "Spelling nitch", "votes": "0", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgzcIrDk7w5MnySmKax4AaABAg", "comment": "Unbelivable", "votes": "1", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugw29aa2CyY8zSejlRZ4AaABAg", "comment": "Very refreshing when lecturers forget slides and build up concepts instead.", "votes": "1", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugiic5Jwb_rBg3gCoAEC", "comment": "I do not agree with your definition of macromolecues, Macromolecues are always (and not oftet) polymer. Indeed could you please mention a macromolecule that is not a polymer ? Moreover, lipids are NOT macromolecules, so the title of the lecture should be emended in agreement.  For a definition of macromolecule, please refers to the IUPAC Gold Book at https://goldbook.iupac.org/M03667.html", "votes": "0", "replies": "2", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgjRLeuKR403HXgCoAEC", "comment": "6:52 wouldn't a better terminology be \"release water\" rather than \"eliminate water\"? Also in light of the information in the video on youtube if you search for:  c6ZXrXQQSGo", "votes": "0", "replies": "3", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugih9Vy9sd2YNngCoAEC", "comment": "Too bad God didn't know this shit when He created humans.", "votes": "0", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UghF2WhXBEfvhXgCoAEC", "comment": "where is the next lecture by her which was supposed to be on that friday", "votes": "5", "replies": "1", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgjTTdogkEXtFHgCoAEC", "comment": "Great Lecture, really helped refresh me on Amino Acids and Proteins", "votes": "8", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgywAL3iQNqeQ6k65ft4AaABAg", "comment": "i aGreE", "votes": "0", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "UgxXXUwcTZlNVWs7yg14AaABAg", "comment": "she has a really nice writing", "votes": "9", "replies": "", "reply": false}, {"vid": "3edzxv_mYZk", "cid": "Ugz87H2Q4x7qFHKRfQl4AaABAg.9DdF-wv7Syq9DlXASlvjen", "comment": "So am I!", "votes": "0", "replies": "", "reply": true}, {"vid": "3edzxv_mYZk", "cid": "Ugiic5Jwb_rBg3gCoAEC.8PvKgBTS3wS8aL3k2N8u3_", "comment": "ciccio formaccio well, lipids are counted as macromolecules because you have the glycerol group (and its derivatives) attached to 2 or 3 (depending on the type of lipid) alkyl acid ester groups. Considering the large amount of atoms associated with these, they are considered a macromolecule.", "votes": "0", "replies": "", "reply": true}, {"vid": "3edzxv_mYZk", "cid": "Ugiic5Jwb_rBg3gCoAEC.8PvKgBTS3wS8cv0ZozRHgI", "comment": "Most major biology textbooks in the US consider macromolecules to be lipids, carbohydrates, nucleic acids, and proteins. You're just being pedantic.", "votes": "0", "replies": "", "reply": true}, {"vid": "3edzxv_mYZk", "cid": "UgjRLeuKR403HXgCoAEC.7-H0Z7-2l858CRRusLtXwh", "comment": "+Uenbg she is simply referring to the fact that water is released in the formation  of the amide linkage.", "votes": "0", "replies": "", "reply": true}, {"vid": "3edzxv_mYZk", "cid": "UgjRLeuKR403HXgCoAEC.7-H0Z7-2l858CRUhVnU6I9", "comment": "J Smock same question, wouldn't it then be a better terminology to use \"release water\" rather than \"eliminate water\"? Now the students might get the wrong impression which could later come in handy if someone else wants to teach them some of the things mentioned in the video I pointed towards and overlook the problem of hydrolysis in those scenarios.  definitions:  Eliminate  1. completely remove or get rid of (something). ...  Release  Chemistry 4. generate (a simple substance) as a product in the course of a reaction involving larger molecules.  Which leaves quite a different impression regarding what happens to the water.", "votes": "0", "replies": "", "reply": true}, {"vid": "3edzxv_mYZk", "cid": "UgjRLeuKR403HXgCoAEC.7-H0Z7-2l858CRWAYmqUMZ", "comment": "you're probably right that \"eliminate\" might not have been the most accurate word to describe the loss of water in this case, but since this is not an organic chemistry class, i don't think that distinction really matters...", "votes": "0", "replies": "", "reply": true}, {"vid": "3edzxv_mYZk", "cid": "UghF2WhXBEfvhXgCoAEC.7-H0Z7-9Nrm709Y-okOfWw", "comment": "These lectures were edited into excerpts for 7.01SC Fundamentals of Biology, Fall 2011. The full lecture that this clip was taken from is not available. Fundamentals of Biology was designed specifically for independent study. It draws upon material developed for the three versions of MIT's Introductory Biology classes known as 7.012, 7.013, and 7.014. See http://ocw.mit.edu/7-01SCF11 for more information.", "votes": "2", "replies": "", "reply": true}]