[{"vid": "4HSKz4-sTMU", "cid": "UgxDf2LVMXU1TTZjUrt4AaABAg", "comment": "tnx", "votes": "0", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgwibLVeFoFH4ChxDSh4AaABAg", "comment": "perfect, thanks a lot for your help! :) ", "votes": "0", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgwcG9Y5lLznxZf1MQt4AaABAg", "comment": "No, no. Its not one mole, its a one to one mole ratio. What that basically means is that when you actually determine the amount of moles for one of the products (such as hydronium), the number of moles of hydronium will equal to the numbers of moles of the other product. This is because we have a 1:1 mole ratio. # of moles of hydronium = # of numbers of CH3CH2CH2COO- because we have a 1:1 ratio.. In our case we have 0.000316 moles of hydronium = 0.000316 moles of CH3CH2CH2COO-.", "votes": "0", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgzhgFOesO04uKLjR894AaABAg", "comment": "great, now I get that part! and how do I know it is 1 mole of butanoic acid and 1 mole of water? isn't it 0.03? :(  ", "votes": "0", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgzpokpEJCeh4om9BaV4AaABAg", "comment": "Let me know if that helps. ", "votes": "0", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgwvUgp5NClw4E7FKxl4AaABAg", "comment": "to the concentration of CH3CH2CH2COO-.", "votes": "0", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgwtwMSw8oY6dH00mIZ4AaABAg", "comment": "Hey! Thank you very much :) Your support is very appreciated!  Here is why. Look at the equation in part 1. Notice that one mole of butanoic acid reacts with one mole of water to produce 1 mole of the conjugate base and one mole of hydronium. Therefore, because our products (hydronium and conj. base) are at a 1:1 ratio, the concentration of hydronium produced will equal to the concentration of CH3CH2CH2COO-. So, what we do, is we first find the concentration of hydronium and then set that equal", "votes": "1", "replies": "", "reply": false}, {"vid": "4HSKz4-sTMU", "cid": "UgyrDB2Cp5Hvof2Ifq54AaABAg", "comment": "I love your videos, you're great! but I still have a little doubt :( why are the concentrations of the products the same? I understood how you got [h3o+] but I didn't get why CH3CH2CH2COO has the same concentration. I hope you can help me, thanks for all the videos! ", "votes": "0", "replies": "", "reply": false}]