[{"vid": "5ejPI6QqKBU", "cid": "UgzxrbPBXnLF6X9veLB4AaABAg", "comment": "\"-meric\" - a combining form meaning “part,” “segment,” “unit,” used esp. in terms describing structures or divisions of a cell.  I.e. multipart", "votes": "1", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugy_3bLiSBqLfsdHbKh4AaABAg", "comment": "So valuable.", "votes": "2", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgxQx7pWjXLMxF6UnLR4AaABAg", "comment": "Thank you, professor Barbara Imperiali <3", "votes": "3", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugwy_rSccoSN5cSTgCJ4AaABAg", "comment": "(On Sunday of February 5, 2023).  Cell Signaling and the Molecular Mechanisms therein (Ligand-Receptor Binding): 1)  Previous topic of Protein Folding where Ultimately all of the Aspects are Defined by the Genomic sequence but Post-Translational Misfolding can happen pathologically (Prion's Disease is perhaps the most Severe and miscomprehended Proteomics in the Universe); Chaperone Proteins (outside original use of the word) assist in the Folding of the Protein; They also mediate Hydrophobicity in certain Areas of High Hydrophobic Sequencing Sectors of the developing Protein Sequence (polypeptides of Hydrophobic Regions)and thereby conferring Protein Protection (Clumping Proteins and Premature Degradation by Default); 2) Proteosome (Anti-Ribosome Activity or Rather the Degradation of Proteins Locus (Organelles of the Ribosome Type; 2k kDa); 3) Ubiquitin Protein (76 AA Polypeptide or Actual Protein) is Specific to the Degradation of Misfolded (Old and Affected Proteins) and is Responsible of the Ubiquitination (Chemical Reaction) of Proteins (8.5 kDa), an Enzymatic Reaction Requiring ATP Solvency; 4) G-Protein Coupled Rectors (GCPR); 2) Receptor Tyrosine Kinase (RTK); 3) Ion Channels;   By PhD Barbara Imperiali.  Heil!", "votes": "4", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgwqSUBwCsN-6Luc3rB4AaABAg", "comment": "I studied cell signalling with professor Nomagugu one lecture  But I returned to elementary level because I never studied chemistry before so that I returned to elementary only was investigation to understand the marvellous scientific world . Strange world because I don't study science before so when I start investigation.science was as magic attracts me to dive in its ocean to know secret of science I searched all field not understand anything I got nothing only I can walk very slowly in pharmacology because of low living standard and self learning only depend on free videos on YouTube or professor Nomagugu when I can save 500 Ryals", "votes": "1", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgyzGOOfu4tmkLyrq514AaABAg", "comment": "Unpopular opinion I guess but I think this lecturer isn't that good", "votes": "0", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgwitIgBtYRlhvJ2ccx4AaABAg", "comment": "mad respect for this woman lecturing for a solid 40+ min. I learned a bit about the blood donation. I didn't know the specific restrictions of blood donating.", "votes": "8", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgzCUfWIAvholLxS-p14AaABAg", "comment": "Thank you!! Just soo good!! Thank you professor!!", "votes": "5", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugxlykdy5dilhrWS1Ep4AaABAg", "comment": "The lecturer delivers the content and concepts with an impressive vitality.", "votes": "9", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugxwos36nTlXt82pWJR4AaABAg", "comment": "Many thanks form Brazil. Very good class!", "votes": "0", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugz52ujLfkxubg_E6Xl4AaABAg", "comment": "Thank you ! :)", "votes": "0", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgzDKqbZnGcjS7SGSSR4AaABAg", "comment": "The hurried college generally analyse because snail equally telephone an a nappy clarinet. rustic, dramatic gander", "votes": "0", "replies": "1", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugxn9chWSWFYRTIEH_R4AaABAg", "comment": "little room for improvement with these MIT courses.  Keep up the good work", "votes": "6", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugzk2ws9bG70EKsqXlx4AaABAg", "comment": "This is teaching experience so smart and very informative", "votes": "4", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgwKY0XM3HFlRu5fzdp4AaABAg", "comment": "👍👍👍👍👍👍👍", "votes": "0", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgzZWnNTLNfofW1Xzgt4AaABAg", "comment": "thanks a lot :)", "votes": "0", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "Ugwd-I0Yu9zby486cSd4AaABAg", "comment": "16:13 This type of interaction made me feel connect with the classes and make me want to continue hearing her. This is type of things that make you realize the knowledge in classrooms is actually about the world that surround us.", "votes": "23", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgwbuwagDALsJm7ljhx4AaABAg", "comment": "Is it me or the person on the right corner is viewing their Facebook?", "votes": "2", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgyW3WaWeeoBT6l0m0V4AaABAg", "comment": "So valuable, thank you", "votes": "1", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgxxnSUZjzXDJmzEyHJ4AaABAg", "comment": "Very very informative.  And best Mentor.", "votes": "1", "replies": "", "reply": false}, {"vid": "5ejPI6QqKBU", "cid": "UgzDKqbZnGcjS7SGSSR4AaABAg.9Keh--twdjU9dtBG6ZEjRD", "comment": "Denson Bret,  Are we to suspect an ironic example of folded proteins?  One has to wonder what is going on at the cellular level here, oh my.", "votes": "0", "replies": "", "reply": true}]