[{"vid": "5qTCy2wTL_s", "cid": "Ugz66IlBQqx4YwlqwHB4AaABAg", "comment": "39:37", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgzHG3SUyuiRWBTSPal4AaABAg", "comment": "Morning mam", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgwRHNW7Uf3VFy_7xqZ4AaABAg", "comment": "Just a quick question regarding the bond length comparisons between N2 and H2. N2 bond length is about 1 A and H2 is 0.74 A (Inorganica Chemistry, Shriver and Atkins). However, during the lecture it is mentioned that N2 bond is shorter than H2. Is that correct?", "votes": "1", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgzpYhsmNc8BlTpvdQZ4AaABAg", "comment": "4:23 What if I bring a chemistry slide rule?", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgiMysBd9OOQVHgCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again", "votes": "3", "replies": "1", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgiFpcaWZSVg8HgCoAEC", "comment": "Tell me if I have a flaw in my logic, but I have a pressing question: Take Boron and Beryllium. Across a period the increase in Z effective overpowers the increase of the average distance(radius) from sub shell to nucleus. Therefore it makes sense that Boron has a smaller atomic radius than Beryllium. However, the ionization energy of Boron is less than Beryllium as mentioned in the previous video. This doesn't make sense because if the ionization energy of Boron is smaller than Beryllium, this surely means Boron has a larger radius (or vice versa).  Lower ionization energy of Boron's valence electron should also mean that the electron is not that deep in the energy well; it has a relatively high electric potential energy when compared with beryllium's valence electrons.  Is it safe to assume that atomic radius is more arbitrary so instead we should take orbital shapes into account? Since 2p orbitals are dumbbell in shape, could we assume that even though the atomic radius of the Boron atom is smaller, its valence electron in the 2px orbital encompasses a wider area (so to speak) than beryllium's 2s electrons and also has a higher electric potential energy therefore. I believe that would feasibly explain this irrationality.   Of course, one could probably attempt to explain ionization energy and atomic radius separately but when the ideas are put together there is a conundrum.", "votes": "0", "replies": "3", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "Ugj8OAlsDd9uqXgCoAEC", "comment": "The actual lecture start  at 8:50 .........", "votes": "12", "replies": "1", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgxiN_y3fGOSoOgQ8aN4AaABAg", "comment": "what happens if two electron wants to appear in the same location? ", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "Ugw2KtmIyS_i9upRYyR4AaABAg", "comment": "You had a camera with 1080p in 2008? ", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgyM5orkfj3uH6pKjmt4AaABAg", "comment": "This is MIT, what, they can't afford a camera with 1080p?", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgxR1WQdLFRnOsMcSYZ4AaABAg", "comment": "9:20 electronegativity is inversely proportional to the number 2? amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "Ugw7ZzvJoC1BfZhWHYV4AaABAg", "comment": "Who would not want to know about individual atoms, but want to know about molecules?  I know it's not me.", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgyXh_Qsymd2pzrTMzh4AaABAg", "comment": "from what cell membranes is this example from, from humans , plants ?", "votes": "0", "replies": "", "reply": false}, {"vid": "5qTCy2wTL_s", "cid": "UgiMysBd9OOQVHgCoAEC.83Q7lskPnEi8UHLi_i60A9", "comment": "This would be very helpful.", "votes": "0", "replies": "", "reply": true}, {"vid": "5qTCy2wTL_s", "cid": "UgiFpcaWZSVg8HgCoAEC.81p7BZZXrQV7-H1gpHJFDe", "comment": "The subshell structure dominates the z-effective in these instances right? Ms Vogel-Taylor did mention that those glitches of decreasing ionisation energy occur because factors like going into a new subshell and doubling up used more energy than the increase in z-effective could provide.", "votes": "0", "replies": "", "reply": true}, {"vid": "5qTCy2wTL_s", "cid": "UgiFpcaWZSVg8HgCoAEC.81p7BZZXrQV8TdC1-vdi_A", "comment": "sorry im super late lol but just saying you say that across period there is an average distance increase, that is only for going down groups the \"radius\" (more like probability of finding electron) increase across period the size is smaller because of the z effective. youre probably done with this class but i just had to say this cause i saw a flaw in your comment.", "votes": "0", "replies": "", "reply": true}, {"vid": "5qTCy2wTL_s", "cid": "UgiFpcaWZSVg8HgCoAEC.81p7BZZXrQV8TdCXvkfjmg", "comment": "the issue of boron wanting to lose the outer valence more than Berrylium has less to do with the radius then with fact that its a lone electron in the p shell", "votes": "0", "replies": "", "reply": true}, {"vid": "5qTCy2wTL_s", "cid": "Ugj8OAlsDd9uqXgCoAEC.7-H0Z7-RqYi8Ngff_dc2be", "comment": "thx", "votes": "0", "replies": "", "reply": true}]