[{"vid": "68KXOYTc1mk", "cid": "UgzEI1pZJpiPTKWp2Zh4AaABAg", "comment": "(On Friday of February 3, 2023).  This Matter of Genetics and The Modality of Experimentation Therein.  1) Model Organisms are Small, Inexpensive Ways to study Genetics (I Slightly Concur); 2) Forward Genetic Screen (FGS): 1) Identification of Genes; and 2) Mechanism of Gene (Structure and Function); 3) Hypothesis of Effect in Knockout Specie for Modality of Procedure in Analysis; 4) Trial And Error (Inference basis); 5) Genotype-Phenotype Analysis (Through Variation in Gene Structure); a) Notch Signaling Axis (Dysmorphogenesis of Wings) via Homozygous Recessive Inheritance Pattern; b) Wnt Signaling Axis is Developmental and Genetic; c) Hedgehog Signaling Axis Crossing of Homozygous Recessive (Variant Genes) shows Gene-Phenotype Correlations; 6) Most Variations in these Genes is Onco-genic (Oncogenes implying Transformation from Proto-Oncogene to Oncogene); a) Developmentally Relevant Genes and Signaling Axis (Pathways); b) Pharmaceutically Relevant and Therapeutics therein (Hedgehog Signaling Inhibition); c) MIT-Related Roundworm (Caenorhabitis Elegans; 947 Somatic Cells Totality Organism; 131 Apoptosis-Fated Cells) in Organogenesis and Apoptosis Signaling (Second Messenger Axises); Mutant Roundworm Crossing With other CEd-1 Variants (Mutant C. elegans); d) Apoptosis is Programmed Cell Death and highly Developmental Essentiality (If no Cell Death Gene then there is Agenesis, Aplasia or Pre-natal Death; Loss of Function shows Cell Lumped on the Specimen)-Robert Horwitz; e) Apoptosis Steps are Cell, Death of Cell (Programmed and Developmental) and lastly the Debris is Phagocytized;  7) Circadian Rhythm (Life's Sleep-Wake Cycle of Mammals or Animals); Dorsophila melanogaster (17,ooo Genes) genetic Screening shows variation in Mutant Flies (alternations in Sleep-Wake Patterns)-Konopka and Menzer; a) Behavior and Genetic Variant Correlation identifying the Mutant-Variant Behavior Changes (Sleep-Wake Alterations Identified; Positive for Circadian Rhythm Function through correlation); b) Period Gene Discovery in Flies (Human Gene Homologue);  c) Familial Advance Sleep Syndrome (FASS) Correlation to Human Disease (Human Genome is significant with a total of 20,000 Genes) and Gene;  PhD Adam Martin, es geht gut zu wieder lernen mit ihnen aber wir muessen gehen gerade aus vorwarts und eintreten im Reichtum und Recht jetzt.  Heil!", "votes": "1", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "Ugy0qK50pbDvRQZ6LKt4AaABAg", "comment": "Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "Ugzru9r3-4Eg4jnNZf94AaABAg", "comment": "29:38  947? The C. elegans I have (plush version from GiantMicrobes) says it has 959 somatic cells (the adult male seems to have more)", "votes": "0", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "UgxNSmZHgQk7W8vuEix4AaABAg", "comment": "10:10 Oh no! Not the first violinist!!-)", "votes": "2", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "Ugx5Rv3xLJfVDYaPgU54AaABAg", "comment": "👍👍👍👍👍👍👍", "votes": "0", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "Ugzlaqwlee9e35FcyoN4AaABAg", "comment": "thanks for helping me ,getting my assignment done", "votes": "1", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "UgyXNVCIxrKHp-KIIGF4AaABAg", "comment": "The user making extremely negative comments here is doing it on many of this professor's videos,  which seems extremely suspicious to me. User with username: kdrl nakle (at the time of me making this comment) has commented negatively in similar respects for videos: 13, 14, 15 and 16 and probably more but I suspect you understand my reasoning here.", "votes": "6", "replies": "", "reply": false}, {"vid": "68KXOYTc1mk", "cid": "UgwVjMby1SFwQaNsMxl4AaABAg", "comment": "A fascinating lecture that explains how genetic experiments in model organisms are helping to understand human disorders,", "votes": "3", "replies": "", "reply": false}]