[{"vid": "6rOvXGoXoJc", "cid": "UgxcYnuxJ6iXwzE5Tp94AaABAg", "comment": "Return that Nobel Prize. The body can fight cancer: NK cells, CD8 T cells, and B cells. Fraud.", "votes": "0", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgwJIVuxb3G8zOUeCi94AaABAg", "comment": "Y no mention of herpes, virology, CBD oil, and the endocannabinoid system? Major gaps in this lecture. Malpractice.", "votes": "0", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgxdnG36qHsWEjNUaEZ4AaABAg", "comment": "By this point in the class students with any mathematical background whatsoever should have pointed out the massive statistical/mathematical elephant utterly ignored by lecturers in the room:  Mutations are NOT  random, but highly influenced by toxic, noxious materials commonly introduced by individuals and overdensely populated human environmental products.   Alcohol, nicotine, P<2.5 suspended particles, not exclusively burnt carbon, reactive oxygen species, and their HUGE statistical correlational and causal influence on mutation rates affecting mutagenesis.  At least a few minutes of any class focused upon mutagenesis at all, at any point, should have noted on this, rather than let any possible erroneous perception of complete randomness persist.   While other elevated mutagenic factors exist, to preemptively correct relatively highly probable errors as may occur in the minds of students already exposed socially to ignorance-biased use of such mutagenic factors, is, or SHOULD BE, part of any basic education.", "votes": "1", "replies": "1", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgxgnB1nhG5KIAseS-B4AaABAg", "comment": "I'm thrilled by the body of knowledge Professor Martin communicates. Thanks a lot Professor Martin and MIT for this amazing lecture❤.", "votes": "2", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgwlvcjE3GhloiwyG4J4AaABAg", "comment": "Great lecture. Thanks to MIT", "votes": "1", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgxWjC06T6Dmm9E-lH14AaABAg", "comment": "(On Thursday of February 9, 2023).  In the Subject of Biology on the Subtopic Neoplasia (Cancer 2):  1) Tumorigenesis Regulation or Homeostasis of Growth Regulation: a) Barriers to Neoplasia Development; b) Basement Membrane (Extracellular Matrix are Proteins of Sheath Platform Function) invasion and Intercellular Adhesion Molecules Catalysis; Mesenchymal Cells or Stroma (Highly Migration because of a Lack of Adhesion Molecules) is a a connective tissue of Body Function rather than a Functional Tissue of Epithelia (90% of Malignancies Originate in this Tissue); Immune Cells (White Blood Cells) are Connective Tissue with High Migratory Ability and Immune System Mediation Function.  c) Immunocompetency is the Primary Mechanism of Anti-Neoplasia (Cytotoxicity of Neoplastic Aberrant Cells; Natural Killers Lymphocytes Primarily); c) Malignancy Pathogenesis follows Logical and Definitive Steps: 1) Hyperplasia to 2) Dysplasia to 3) Malignancy and 4) Metastasis (Francoanaplasia); d) Mechanism of Dysregulated Growth and Proliferation (Oncogenic Dynamics) Aberrancy in Intercellular Cytokine Signaling, perhaps Avoiding Transcription Factors Tumor Suppressing Activity of Apoptosis (Death Signals), Independent Growth Pattern (Proto-oncogene Transformation); e) Tumor Microenvirnoment is Highly Interactive Via Cytokine Signals often recruiting other Cells and Tissue Type (i.e Angiogenesis); 1) Varied Dependency of Growth Signals but not completely Aberrant; 2) ECM is Highly Specific to Neoplasia as it seems to Mediate Growth Pathologically When Dysplasia Arises; 3) Human Epidermal Growth Factor (EGF) Receptor 2 or just HER-2 (Gene and Receptor); 4) Herceptin is an Antagonistic Antineoplastic Agent Specific to HER-2 Receptor; f) Cell-To-Cell Adhesion Binding Loss: 1) E-Cadherin are Epithelia Adhesion Proteins (Molecules Attaching Cells); 2) Epithelial to Mesenchymal Transformation (EMT) or Metaplastic Differentiation (similar to Squamo-Columnar Metaplasia a Physiologic Reaction); 3) Embryogenesis: a) Transcription Factors: 1) Twist, 2) Snail, and 3) Snug are Proteins of Migration (E-Cadherin Inhibition Mechanism); b) Migration of Development (Embryogenesis Analogous to Reverse Differentiation) is Possibly Mediated Positively by alpha-Beta Cadherin (aB-Cad); c) Breaking Out Mechanism (i.e. Neutrophil Chemotactic Function) or Motility Function Mediated by Actin (globular Polymers)/Myosin (Filamentous Structure of Protein) Cytoskeletal Mechanism induced by Molecular Signaling; d) Protrusion or Motility is a Function of Cytoskeletal Polymerization and/or Depolymerization Therein: 1) Polymerization of Actin-Filament makes forward Motility Momentum; 2) Cell Matrix Adhesion mediated by Integrin Protein Traction Functionality (Translocation Process) is Significant In Development of Embryogenesis, Homeostasis and Pathology of Neoplasia (Malignancy);  PhD Adam Martin, Krankheit immer soll fahren schneller als Die Gesundheit (-Hobas).  Heil!", "votes": "3", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgwB9tTvHqwfM3tIP2B4AaABAg", "comment": "Great!", "votes": "1", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "Ugz2sB6bf5Udn-3Fe5V4AaABAg", "comment": "Thank you very much for very informative lecture.", "votes": "1", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgxzBOMOH3iLEiZwQl94AaABAg", "comment": "Thank you very much", "votes": "1", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgxZAC8NkGBtE5IvimV4AaABAg", "comment": "Lots of thanks Sir, for imparting this wonderful lecture.", "votes": "5", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgyAN-srq4Qw48aKpih4AaABAg", "comment": "If cancer is such a bad thing, then why'd they make a cancer 2?", "votes": "18", "replies": "3", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgwAYMfdusdddG3cTrt4AaABAg", "comment": "46:18 xD", "votes": "11", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgyGdHGun3p3Zbdt4r14AaABAg", "comment": "Such a nice leacture", "votes": "4", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgyfyVfw4lA_18b2TVp4AaABAg", "comment": "I wonder what is the signal that actin protein responding to when cell migrates?", "votes": "4", "replies": "", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgzeGaTSuqzTFouBEd14AaABAg", "comment": "Another great lecture. Thanks and greetings from Brazil!", "votes": "8", "replies": "1", "reply": false}, {"vid": "6rOvXGoXoJc", "cid": "UgxdnG36qHsWEjNUaEZ4AaABAg.A1yjazEGA_RA7-3zHM0ZL-", "comment": "you're so smart", "votes": "0", "replies": "", "reply": true}, {"vid": "6rOvXGoXoJc", "cid": "UgyAN-srq4Qw48aKpih4AaABAg.9MjLC6EvsFYA4QylhDjCOU", "comment": "Goddamnit, u should receive an Oscar for such good joke", "votes": "0", "replies": "", "reply": true}, {"vid": "6rOvXGoXoJc", "cid": "UgyAN-srq4Qw48aKpih4AaABAg.9MjLC6EvsFYA4R0ftSqpUJ", "comment": "the sequels are always worse", "votes": "0", "replies": "", "reply": true}, {"vid": "6rOvXGoXoJc", "cid": "UgyAN-srq4Qw48aKpih4AaABAg.9MjLC6EvsFYA4R8yC-fPLX", "comment": "Cancer is no joke. But good one.", "votes": "0", "replies": "", "reply": true}, {"vid": "6rOvXGoXoJc", "cid": "UgzeGaTSuqzTFouBEd14AaABAg.9B68ne7v_8c9GFbO1qdJw_", "comment": "Fora Borzonaro", "votes": "0", "replies": "", "reply": true}]