[{"vid": "6T6tdUUok-c", "cid": "UgwzG1DxNrIzXT8phdV4AaABAg", "comment": "I just LOVE listening to your lectures. You are making such a difference in my understanding. You teach with such clarity. It is like listening to a story- which makes it easy to remember. Setting the stage really makes a difference! Thank you for sharing your gift!", "votes": "0", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgyTUgyh7ImqzH4xegR4AaABAg", "comment": "Thank YAOU Sir!!  Where can i find the pdf of these lectures?", "votes": "0", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgxPUF777vwuWPFhnfR4AaABAg", "comment": "I really love the way he explains the material, I can tell he loves the subject. very good teacher, or professor. thank you, you make me understand the material and want to learn more.", "votes": "2", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "Ugw2P3ukPtk1M6JvwxV4AaABAg", "comment": "I want to thank you so much for posting these lecture videos. I have been watching every single video as I am in genetics and my instructor is very hard to understand. You explain things so well and have made my class a lot easier. Thank you for all your hard work!", "votes": "3", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "Ugz5H3lnwZwP3SBjlJx4AaABAg", "comment": "this video made clear the whole concept. Thank you for your work and effort !", "votes": "3", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgxWyLHWGw96b9KxYEF4AaABAg", "comment": "The best teacher in the world. Thank you Thomas Mennella. Really. I am italian but I follow all your lectures. I wish I could listen also to your lectures in class. Bless you", "votes": "4", "replies": "3", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgxZQafkNubny7NlmbF4AaABAg", "comment": "Very nice vdo", "votes": "3", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgxH7MGjQ6hUMx0Hsol4AaABAg", "comment": "Amazing this video , very clear concepts :)", "votes": "4", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgzWGUQrOgPGOyqcWZV4AaABAg", "comment": "Thank you so much", "votes": "3", "replies": "", "reply": false}, {"vid": "6T6tdUUok-c", "cid": "UgxWyLHWGw96b9KxYEF4AaABAg.9DU9dkKcUoW9D_tN34g8ui", "comment": " @thomasmennella5501  in the little town where I live, Torre del Greco, in Naples, South Italy, the best pastry making is called Mennella, very loved family. Maybe some your of your ancestor was from here. I will continue to follow your lectures. Biology is the most interesting subject EVER", "votes": "0", "replies": "", "reply": true}, {"vid": "6T6tdUUok-c", "cid": "UgxWyLHWGw96b9KxYEF4AaABAg.9DU9dkKcUoW9Da_Je2bZY7", "comment": "I have a bit of Sicily in me as well. Siracusano means FROM SYRACUSE, where my father (as well as the greek mathematician Archimedes) was born.  But I am from Naples. In Torre del Greco I live. I hope one day you and your beautiful family Will come over to visit. By the way, I used to be a journalist, but I started University again because I want to understand what is life, meant as consciusness as well. I hope you scientists will find out as soon as possible. Consciousness can't be a chemical reaction. Would be a very unusual chemical reaction ... Of what? From which substrates?  ;)", "votes": "0", "replies": "", "reply": true}, {"vid": "6T6tdUUok-c", "cid": "UgxWyLHWGw96b9KxYEF4AaABAg.9DU9dkKcUoW9Da_gvUngXB", "comment": "This is Mennella web site, the beautiful pastry maker https://www.pasticceriamennella.it/", "votes": "0", "replies": "", "reply": true}]