[{"vid": "78ts7G3LMFU", "cid": "UgyxANJk9znAP1E8VIl4AaABAg", "comment": "Why do those exceptions occure, what is the cause?", "votes": "0", "replies": "", "reply": false}, {"vid": "78ts7G3LMFU", "cid": "UgxEgi03YByhbOuO-0B4AaABAg", "comment": "You have nice explanations you r MI bst", "votes": "1", "replies": "1", "reply": false}, {"vid": "78ts7G3LMFU", "cid": "Ugzej1JpXZ6YOLZcqqt4AaABAg", "comment": "Hi, I'm hoping you can help me with this question.   My son is in 10th grade chem, and he has a test coming up with questions about ionization in relation to Coulomb's Law. On a practice test, he is shown 3 Bohr Models (Sodium, Potassium and Aluminum) and is asked \"which one would requires the least amount of energy to remove an election? Using ionization energy and relate Coulomb's Law in your final answer.\"  The answer key to the practice test says that Aluminum is the easier of the three to remove an electron because there is more that one valence electron in the shell, and the inner electrons are shielding the nucleus, thus making it easier to remove an electron.   Everything I've come across only speaks to the position on the periodic table. I can't find anything that includes the number valence electrons. Does the number of valence electrons influence ionization energy?  Based on your video. I would have chosen Potassium as requiring the least amount of energy to remove an electron because it is below Sodium and below and to the right of Aluminum. Meaning, it's valence electron in further from the nucleus of both Na and Al, and Al has more protons and thus a stronger pull on the electrons.   Any help is appreciated.", "votes": "2", "replies": "3", "reply": false}, {"vid": "78ts7G3LMFU", "cid": "UgxEgi03YByhbOuO-0B4AaABAg.9xsIqzS3XXb9xshG2LcQm0", "comment": "Thanks", "votes": "0", "replies": "", "reply": true}, {"vid": "78ts7G3LMFU", "cid": "Ugzej1JpXZ6YOLZcqqt4AaABAg.9UV8xNzCXa69UVG8AEZqK4", "comment": "Hello Rob!  The conclusion you drew from the video is exactly right...which means that the answer and explanation you were given is wrong. 😦  The ionizations energies for these 3 elements are as follows: potassium - 419kJ/mol sodium - 476kJ/mol aluminum - 578kJ/mol  If you were comparing sodium and aluminum the difference comes down to 'effective nuclear charge' as mentioned in the video.  The idea as that as you move left to right on the periodic table you gain additional protons in the nucleus but you also gain additional valence electrons which will increase screening.  But since the valence electrons are on average roughly equidistant from the nucleus the screening is not as significant as the growth in nuclear charge, and so you see an overall increase in 'effective nuclear charge as you move left to right across the table.  On top of this we know from the trend for atomic radius that aluminum is smaller than sodium.  So it should be more difficult to remove an electron from aluminum as it has a greater 'effective nuclear charge' (in the numerator of Coulomb's law) and a smaller radius (in the denominator of Coulomb's law) both of which are consistent with its higher ionization energy.  And then potassium is simply larger than sodium explaining why potassium has an even lower ionization energy.  Hope this helps!", "votes": "4", "replies": "", "reply": true}, {"vid": "78ts7G3LMFU", "cid": "Ugzej1JpXZ6YOLZcqqt4AaABAg.9UV8xNzCXa69UVLMZIQS3t", "comment": " @ChadsPrep  This is extremely helpful. Now I have to figure out how to bring this up to the my son's chemistry teacher that his answer is wrong in the practice test answer key.", "votes": "0", "replies": "", "reply": true}, {"vid": "78ts7G3LMFU", "cid": "Ugzej1JpXZ6YOLZcqqt4AaABAg.9UV8xNzCXa69UVNYBRslIl", "comment": "Best way to be diplomatic is probably to site a source for the actual ionization energy values for these three elements.  Wikipedia isn't often my go to source but they have compiled a good table of ionization energies: https://en.wikipedia.org/wiki/Molar_ionization_energies_of_the_elements  Good luck!", "votes": "4", "replies": "", "reply": true}]