[{"vid": "7ABSjKS0hic", "cid": "Ugyn6aM5Rpfb1fhVdCp4AaABAg", "comment": "Hosting History for ever!!Inform yourself also in Histooruy!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwG4gHTHhtMVP6ztxR4AaABAg", "comment": "5:21 “Intelligence is heritable” Big if true.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwuoxjxOZea0KZNyUh4AaABAg", "comment": "I love the “unless you’re a sponge” every minute or so lmao, rly has me wondering why sponges are still considered animals and not smth else", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx9c_94P19O97vrgcB4AaABAg", "comment": "I wish good luck to Hank", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwzsrzW8PE-4slXtN94AaABAg", "comment": "I love you shoshanna!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxJT1q0Ogzi3RKs_eZ4AaABAg", "comment": "6:22 This doesn't usually happen to me when listening to science but that genuinely made me want to stop breathing for a couple seconds as I became uncomfortably aware of the existence of my lungs in my chest. Nice work lol. 🤣", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwqhhqVgEE65O-IMsd4AaABAg", "comment": "I'm loved extra much", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyovTbfWXips_rXErZ4AaABAg", "comment": "6", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxyAjdBQAORv9tJ-Zp4AaABAg", "comment": "ALSO 'unless ur a sponge' XD", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwmC2DsA1KT69IsbxB4AaABAg", "comment": "who's here because of coronavirus I am and it sucksss T-T", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyaTwOLW-TtJ8mBIVh4AaABAg", "comment": "If we all share a common ancestor according to evolution, (unless you're a sponge. 😂), what is it? Cause i have never heard what it is. i just got \"We all share a common ancestor.\" Well, what is it then?!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwpcNpcKr5At4rHlwF4AaABAg", "comment": "“Unless you’re a sponge”", "votes": "3", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxTGYEwsz_wbHBVMoh4AaABAg", "comment": "man would I have liked to have Thomas Henry Huxley as a grandfather he must have had some awesome stories to tell", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy_YGizVR_Yj8t10Ep4AaABAg", "comment": "Do slime molds count as animals? Do men o' war?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxO2RmTNXfEXxVjZcp4AaABAg", "comment": "I fart on park benches", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugynb7UnKmu4PwRkXtd4AaABAg", "comment": "Gotcha, you fart on park benches", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz97judSj8LGKUl7F14AaABAg", "comment": "The people who disliked this video are actually sea sponges.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzWExl-b0mtNtBqRCN4AaABAg", "comment": "Sponges: the \"Unless you are the Mongols\" of Crash Course Biology", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzQm37FwgpW1wt0jc14AaABAg", "comment": "unless you are a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugys9_V4WyAYiYX2O854AaABAg", "comment": "This guys is the science version of the try guys...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyiBi628yGWOFWk4-V4AaABAg", "comment": "THis is my favourite  yiytuber", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwA7ZqijId6aaZjuuV4AaABAg", "comment": "\"unless you're a sponge\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwYVf9cMDk1XkuvMOJ4AaABAg", "comment": "Please stop putting birds in cages for your own fun. Its cruel. Should be criminalized. I love u anyways. But please stop.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwQvL2NjbBOlzqRJPR4AaABAg", "comment": "Do you see the sharks in the background?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwlW_49jN4LlV2jJ_J4AaABAg", "comment": "Me watching this at three in the morning: epithelial look like watermelon 😪😪", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgztzgGQlWqqQ9VVItd4AaABAg", "comment": "Gronk", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzz_QyQ1I_sWV0-LF54AaABAg", "comment": "when hank didnt take cocaine", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyvLotzSj8Xd23hQF14AaABAg", "comment": "Spongebob is sayd", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzbz-j4eH1vVjRH61F4AaABAg", "comment": "Sponges, the Mongols of the animal world.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy6QeJrOjQm4tx_TTd4AaABAg", "comment": "Great lectures!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyhCz3Pr24k0dXgaWp4AaABAg", "comment": "This video is discriminatory towards sponges!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwXwsVRo-WpczLZUv94AaABAg", "comment": "Unless i'm a spong!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxwVUK_XbywG_TunXh4AaABAg", "comment": "This is how many times Hank says \"Unless you're a sponge\"  | V", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyaFeyzOq4p7jKuy914AaABAg", "comment": "OMG you're fantastic", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxW7Vfw7ikC-fSUCrZ4AaABAg", "comment": "I'm studying for my Bio Finals tomorrow and just started watching all of your videos, I dont even think Im listening and Im probably just focused on the entertainment wish me luck", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyYjVMTCYa1k2b5tYF4AaABAg", "comment": "You are so spongeinst", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy9ejhf00_MpGxSQIF4AaABAg", "comment": "Nobody: Hank: except if you’re a sponge", "votes": "36", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzNCIhF-6UFJs617lB4AaABAg", "comment": "Sem legenda em portugues ._.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwD4DhfrdyOj_26dO14AaABAg", "comment": "All sponges are awful, except for spongebob squarepants", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzxiHUdFUXtWE_Hy6B4AaABAg", "comment": "0:33 the easiest quiz which i got wrong (ToT)", "votes": "3", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy1sIdYeRVSQT8aCqd4AaABAg", "comment": "so how does a sponge work?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx8HD5Pi-h9oPghWrB4AaABAg", "comment": "Thanks for helping me with my third year university animal diversity exam! 🙂🙂", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzzNzCIRb2EeAlXI_14AaABAg", "comment": "now i'll have to show this to everyone because i'll start adopting \"you just got hux-slapped\".", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzm99fPhPC6777iEq54AaABAg", "comment": "Can we have a tshirt with \"unless you're a sponge\" on it? please?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy3QI3RwS0_9pTkuK54AaABAg", "comment": "Was \"Huxslapped\" a subtle reference to Christopher Hitchens?", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyRZ123MURPkMqCUWt4AaABAg", "comment": "Grimm should definitely get a sponge Wesen.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgydeWI_B-0WI6mHDUB4AaABAg", "comment": "Hank is definitely more like Gordon the plant.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyKgL3LTNgodpAAmQ54AaABAg", "comment": "Fun fact, Huxley is the grandparent to Aldous Huxley. Brave New World Huxley.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx35-dobp1GgMUxWwh4AaABAg", "comment": "Where are all the evolutionary dead ends in animal structures, fossils or living?  If everything evolved from a single cell then it means that the genetic information of any organism is 100 percent variabled via mutation, albeit generally static after birth. Everything, from the length of your bones, their thickness, etc, all of the specifications of your body plan is contained in your DNA, correct? And mutations may act on any part of that specification \"information\", hence every trait of an organism is 100 percent variabled via mutation if a mutation happens. Okay, so what am I getting at? Essentially, why are there no failed nodes in bone structure? I say bone structure specifically, because having a bone anomaly is not necessarily a life ender, but all bone structures are basically smooth and perfect to do what they do, and are not bumpy. Life in general is very not ugly, which it seems it should be according to this line of thinking.  The only explanation for this is also problematic. That is, only traits (which are built on mutations) that cause an organism to be more fit to survive in its current environment are retained, and develop into traits. This is problematic, because then there should be a very visible, non-gapped, progression through all living things. Talk of supposed missing links is missing the real point. Where are all the missing intermediary intermediary forms? The intermediary intermediary intermediary forms, etc? It should be entirely smooth, in the fossil record and in living things, and when I say entirely I mean \"very very\".   Also, problematic with this apparently harmonious view (which is essentially what all evolution-accepting people believe) is how can a mutation be retained if its contribution to the survivability of an organism cannot be felt, or if it is just barely apparent? For example, it is said that a wing developed from bird-like tree dwelling animals gliding to the ground via burgeoning wing appendages, but what about the form before it was even able to be used to glide? I've seen one explanation for the bat wing, saying that it could have been used to hold water, previous to being used for gliding. That's fine, but what about before that, and before that? What I mean is, we know now that our cells correct for changes in our DNA (this is not to intone that mutations cannot cause change, but that there is definite impediment to \"natural\" change), so if you were to take a form to its very origination, when it juuuust started, why would it be retained? We, also, know that changes in features are very small and compiled over time. Often, Darwin's finches are used as an example of such a change happening, and over a relatively short period, but this still misses the point. A beak has a function, (and arguably potential function), but small fluctuations leading to change on an already functioning trait do not explain how the trait originated, or how it was retained. So, what about the very beginning of the formation of the beak? Day one of the beak, if you will. There has to be an apparent advantage on Day One. To say that every burgeoning trait simply did increase fitness from day one seems implausible.  I've also heard that mutations may be stored sometimes, and appear later on, but my research here is very lacking. So, I'll leave it at that.", "votes": "1", "replies": "5", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzVAgkcCpyd4MDRzv14AaABAg", "comment": "Did Hank say that common animal ancestor lived 1.6 billion years ago? I think that is roughly a time when an eukaryotic cell appeared. Animal ancestor lived about 0.6 billion years ago.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxQsjqmIWOkATMBsRR4AaABAg", "comment": "“Unless you’re a sponge” is except for the Mongles", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzUjfly4cHQNY96uNV4AaABAg", "comment": "anyone remember this      Titin            Methionylalanylthreonylserylarginylglycylalanylserylarginylcysteinylproly- larginylaspartylisoleucylalanylasparaginylvalylmethionylglutaminylarginyl- leucylglutaminylaspartylglutamylglutaminylglutamylisoleucylvalylglutaminy- llysylarginylthreonylphenylalanylthreonyllysyltryptophylisoleucylasparagi- nylserylhistidylleucylalanyllysylarginyllysylprolylprolylmethionylvalylva- lylaspartylaspartylleucylphenylalanylglutamylaspartylmethionyllysylaspart- ylglycylvalyllysylleucylleucylalanylleucylleucylglutamylvalylleucylserylg- lycylglutaminyllysylleucylprolylcysteinylglutamylglutaminylglycylarginyla- rginylmethionyllysylarginylisoleucylhistidylalanylvalylalanylasparaginyli- soleucylglycylthreonylalanylleucyllysylphenylalanylleucylglutamylglycylar- ginyllysylisoleucyllysylleucylvalylasparaginylisoleucylasparaginylserylth- reonylaspartylisoleucylalanylaspartylglycylarginylprolylserylisoleucylval- ylleucylglycylleucylmethionyltryptophylthreonylisoleucylisoleucylleucylty- rosylphenylalanylglutaminylisoleucylglutamylglutamylleucylthreonylserylas- paraginylleucylprolylglutaminylleucylglutaminylserylleucylserylserylseryl- alanylserylserylvalylaspartylserylisoleucylvalylserylserylglutamylthreony- lprolylserylprolylprolylseryllysylarginyllysylvalylthreonylthreonyllysyli- soleucylglutaminylglycylasparaginylalanyllysyllysylalanylleucylleucyllysy- ltryptophylvalylglutaminyltyrosylthreonylalanylglycyllysylglutaminylthreo- nylglycylisoleucylglutamylvalyllysylaspartylphenylalanylglycyllysylserylt- ryptophylarginylserylglycylvalylalanylphenylalanylhistidylserylvalylisole- ucylhistidylalanylisoleucylarginylprolylglutamylleucylvalylaspartylleucyl- glutamylthreonylvalyllysylglycylarginylserylasparaginylarginylglutamylasp- araginylleucylglutamylaspartylalanylphenylalanylthreonylisoleucylalanylgl- utamylthreonylglutamylleucylglycylisoleucylprolylarginylleucylleucylaspar- tylprolylglutamylaspartylvalylaspartylvalylaspartyllysylprolylaspartylglu- tamyllysylserylisoleucylmethionylthreonyltyrosylvalylalanylglutaminylphen- ylalanylleucyllysylhistidyltyrosylprolylaspartylisoleucylhistidylasparagi- nylalanylserylthreonylaspartylglycylglutaminylglutamylaspartylaspartylglu- tamylisoleucylleucylprolylglycylphenylalanylprolylserylphenylalanylalanyl- asparaginylserylvalylglutaminylasparaginylphenylalanyllysylarginylglutamy- laspartylarginylvalylisoleucylphenylalanyllysylglutamylmethionyllysylvaly- ltryptophylisoleucylglutamylglutaminylphenylalanylglutamylarginylaspartyl- leucylthreonylarginylalanylglutaminylmethionylvalylglutamylserylasparagin- ylleucylglutaminylaspartyllysyltyrosylglutaminylserylphenylalanyllysylhis- tidylphenylalanylarginylvalylglutaminyltyrosylglutamylmethionyllysylargin- yllysylglutaminylisoleucylglutamylhistidylleucylisoleucylglutaminylprolyl- leucylhistidylarginylaspartylglycyllysylleucylserylleucylaspartylglutamin- ylalanylleucylvalyllysylglutaminylseryltryptophylaspartylarginylvalylthre- onylserylarginylleucylphenylalanylaspartyltryptophylhistidylisoleucylglut- aminylleucylaspartyllysylserylleucylprolylalanylprolylleucylglycylthreony- lisoleucylglycylalanyltryptophylleucyltyrosylarginylalanylglutamylvalylal- anylleucylarginylglutamylglutamylisoleucylthreonylvalylglutaminylglutamin- ylvalylhistidylglutamylglutamylthreonylalanylasparaginylthreonylisoleucyl- glutaminylarginyllysylleucylglutamylglutaminylhistidyllysylaspartylleucyl- leucylglutaminylasparaginylthreonylaspartylalanylhistidyllysylarginylalan- ylphenylalanylhistidylglutamylisoleucyltyrosylarginylthreonylarginylseryl- valylasparaginylglycylisoleucylprolylvalylprolylprolylaspartylglutaminyll- eucylglutamylaspartylmethionylalanylglutamylarginylphenylalanylhistidylph- enylalanylvalylserylserylthreonylserylglutamylleucylhistidylleucylmethion- yllysylmethionylglutamylphenylalanylleucylglutamylleucyllysyltyrosylargin- ylleucylleucylserylleucylleucylvalylleucylalanylglutamylseryllysylleucyll- ysylseryltryptophylisoleucylisoleucyllysyltyrosylglycylarginylarginylglut- amylserylvalylglutamylglutaminylleucylleucylglutaminylasparaginyltyrosylv- alylserylphenylalanylisoleucylglutamylasparaginylseryllysylphenylalanylph- enylalanylglutamylglutaminyltyrosylglutamylvalylthreonyltyrosylglutaminyl- isoleucylleucyllysylglutaminylthreonylalanylglutamylmethionyltyrosylvalyl- lysylalanylaspartylglycylserylvalylglutamylglutamylalanylglutamylasparagi- nylvalylmethionyllysylphenylalanylmethionylasparaginylglutamylthreonylthr- eonylalanylglutaminyltryptophylarginylasparaginylleucylserylvalylglutamyl- valylarginylserylvalylarginylserylmethionylleucylglutamylglutamylvalyliso- leucylserylasparaginyltryptophylaspartylarginyltyrosylglycylasparaginylth- reonylvalylalanylserylleucylglutaminylalanyltryptophylleucylglutamylaspar- tylalanylglutamyllysylmethionylleucylasparaginylglutaminylserylglutamylas- paraginylalanyllysyllysylaspartylphenylalanylphenylalanylarginylasparagin- ylleucylprolylhistidyltryptophylisoleucylglutaminylglutaminylhistidylthre- onylalanylmethionylasparaginylaspartylalanylglycylasparaginylphenylalanyl- leucylisoleucylglutamylthreonylcysteinylaspartylglutamylmethionylvalylser- ylarginylaspartylleucyllysylglutaminylglutaminylleucylleucylleucylleucyla- sparaginylglycylarginyltryptophylarginylglutamylleucylphenylalanylmethion- ylglutamylvalyllysylglutaminyltyrosylalanylglutaminylalanylaspartylglutam- ylmethionylaspartylarginylmethionyllysyllysylglutamyltyrosylthreonylaspar- tylcysteinylvalylvalylthreonylleucylserylalanylphenylalanylalanylthreonyl- glutamylalanylhistidyllysyllysylleucylserylglutamylprolylleucylglutamylva- lylserylphenylalanylmethionylasparaginylvalyllysylleucylleucylisoleucylgl- utaminylaspartylleucylglutamylaspartylisoleucylglutamylglutaminylarginylv- alylprolylvalylmethionylaspartylalanylglutaminyltyrosyllysylisoleucylisol- eucylthreonyllysylthreonylalanylhistidylleucylisoleucylthreonyllysylgluta- mylserylprolylglutaminylglutamylglutamylglycyllysylglutamylmethionylpheny- lalanylalanylthreonylmethionylseryllysylleucyllysylglutamylglutaminylleuc- ylthreonyllysylvalyllysylglutamylcysteinyltyrosylserylprolylleucylleucylt- yrosylglutamylserylglutaminylglutaminylleucylleucylisoleucylprolylleucylg- lutamylglutamylleucylglutamyllysylglutaminylmethionylthreonylserylphenyla- lanyltyrosylaspartylserylleucylglycyllysylisoleucylasparaginylglutamyliso- leucylisoleucylthreonylvalylleucylglutamylarginylglutamylalanylglutaminyl- serylserylalanylleucylphenylalanyllysylglutaminyllysylhistidylglutaminylg- lutamylleucylleucylalanylcysteinylglutaminylglutamylasparaginylcysteinyll- ysyllysylthreonylleucylthreonylleucylisoleucylglutamyllysylglycylserylglu- taminylserylvalylglutaminyllysylphenylalanylvalylthreonylleucylserylaspar- aginylvalylleucyllysylhistidylphenylalanylaspartylglutaminylthreonylargin- ylleucylglutaminylarginylglutaminylisoleucylalanylaspartylisoleucylhistid- ylvalylalanylphenylalanylglutaminylserylmethionylvalyllysyllysylthreonylg- lycylaspartyltryptophyllysyllysylhistidylvalylglutamylthreonylasparaginyl- serylarginylleucylmethionyllysyllysylphenylalanylglutamylglutamylserylarg- inylalanylglutamylleucylglutamyllysylvalylleucylarginylisoleucylalanylglu- taminylglutamylglycylleucylglutamylglutamyllysylglycylaspartylprolylgluta- mylglutamylleucylleucylarginylarginylhistidylthreonylglutamylphenylalanyl- phenylalanylserylglutaminylleucylaspartylglutaminylarginylvalylleucylaspa- raginylalanylphenylalanylleucyllysylalanylcysteinylaspartylglutamylleucyl- threonylaspartylisoleucylleucylprolylglutamylglutaminylglutamylglutaminyl- glutaminylglycylleucylglutaminylglutamylalanylvalylarginyllysylleucylhist- idyllysylglutaminyltryptophyllysylaspartylleucylglutaminylglycylglutamyla- lanylprolyltyrosylhistidylleucylleucylhistidylleucyllysylisoleucylasparty- lvalylglutamyllysylasparaginylarginylphenylalanylleucylalanylserylvalylgl- utamylglutamylcysteinylarginylthreonylglutamylleucylaspartylarginylglutam- ylthreonyllysylleucylmethionylprolylglutaminylglutamylglycylserylglutamyl- lysylisoleucylisoleucyllysylglutamylhistidylarginylvalylphenylalanylpheny- lalanylserylaspartyllysylglycylprolylhistidylhistidylleucylcysteinylgluta- myllysylarginylleucylglutaminylleucylisoleucylglutamylglutamylleucylcyste- inylvalyllysylleucylprolylvalylarginylaspartylprolylvalylarginylaspartylt- hreonylprolylglycylthreonylcysteinylhistidylvalylthreonylleucyllysylgluta- mylleucylarginylalanylalanylisoleucylaspartylserylthreonyltyrosylarginyll- ysylleucylmethionylglutamylaspartylprolylaspartyllysyltryptophyllysylaspa- rtyltyrosylthreonylserylarginylphenylalanylserylglutamylphenylalanylseryl- seryltryptophylisoleucylserylthreonylasparaginylglutamylthreonylglutaminy- lleucyllysylglycylisoleucyllysylglycylglutamylalanylisoleucylaspartylthre- onylalanylasparaginylhistidylglycylglutamylvalyllysylarginylalanylvalylgl- utamylglutamylisoleucylarginylasparaginylglycylvalylthreonyllysylarginylg- lycylglutamylthreonylleucylseryltryptophylleucyllysylserylarginylleucylly- sylvalylleucylthreonylglutamylvalylserylserylglutamylasparaginylglutamyla- lanylglutaminyllysylglutaminylglycylaspartylglutamylleucylalanyllysylleuc- ylserylserylserylphenylalanyllysylalanylleucylvalylthreonylleucylleucylse- rylglutamylvalylglutamyllysylmethionylleucylserylasparaginylphenylalanylg- lycylaspartylcysteinylvalylglutaminyltyrosyllysylglutamylisoleucylvalylly- sylasparaginylserylleucylglutamylglutamylleucylisoleucylserylglycylseryll- ysylglutamylvalylglutaminylglutamylglutaminylalanylglutamyllysylisoleucyl- leucylaspartylthreonylglutamylasparaginylleucylphenylalanylglutamylalanyl- glutaminylglutaminylleucylleucylleucylhistidylhistidylglutaminylglutaminy- llysylthreonyllysylarginylisoleucylserylalanyllysyllysylarginylaspartylva- lylglutaminylglutaminylglutaminylisoleucylalanylglutaminylalanylglutaminy- lglutaminylglycylglutamylglycylglycylleucylprolylaspartylarginylglycylhis- tidylglutamylglutamylleucylarginyllysylleucylglutamylserylthreonylleucyla- spartylglycylleucylglutamylarginylserylarginylglutam23rr2", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxnRSSErKS3GSkdYql4AaABAg", "comment": "I am a Nerd thats why I am watching this!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyDI_ScJ5xNYp1OQEF4AaABAg", "comment": "One like for every Sponge joke in this comment section.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz2LH6BaibdESNYoA54AaABAg", "comment": "If i had a nickel for everytime he said unless you're a sponge.... I'd have a couple nickels.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwavGrCbXGN-W-kpCJ4AaABAg", "comment": "1.6 BYA, are you sure? I thought first multicellular organisms evolved only about 650 MYA", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw5GbbxcGgtyg7JhLZ4AaABAg", "comment": "Watching your vids one after the other and you've been belittling sponges a lot 😂😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyMyHzCNrQKkBmd4-14AaABAg", "comment": "Shirt that says \"Unless you're  a sponge\" Go!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyXCc8PADuOU_gA9Xd4AaABAg", "comment": "How do u spell that bird's name?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy3aJcIUz4xuMDco894AaABAg", "comment": "“Unless you’re a sponge” gets better each time he says it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx35-dobp1GgMUxWwh4AaABAg.8iYjNVsU3hX8ilwafjY3JK", "comment": "So how does that sky wizard magic work?", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugx35-dobp1GgMUxWwh4AaABAg.8iYjNVsU3hX8imETr9JSbw", "comment": "Go by yourself and pray, \"Father in heaven, I know I'm a sinner. I accept the promise of the sacrifice of your son, Jesus Christ, who died on the cross. Please, live in my heart forever.\"", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugx35-dobp1GgMUxWwh4AaABAg.8iYjNVsU3hX8imIreNmujC", "comment": "I don't go to a church and teach science (christians are way too stupid) Yet you come here spreading your fairy tales.....  You are as worthless and dumb as your fairy tales.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugx35-dobp1GgMUxWwh4AaABAg.8iYjNVsU3hX8imKN4tqkYV", "comment": "I could tell you were christian.... I could smell the dishonesty.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugx35-dobp1GgMUxWwh4AaABAg.8iYjNVsU3hX8imY5PIpZ8k", "comment": "saith the devil", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugy-99y1qwWHIIkEQB94AaABAg", "comment": "\"Unless you're a sponge\" is the biology version of \"Unless you're the Mongols\" of biology. Now I want a shirt with a sponge wearing a fur hat riding a horse on it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyID3mFnyMH_llKBoZ4AaABAg", "comment": "\"uhh... The plant?\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzqGC1LJAk9tdDe34t4AaABAg", "comment": "Sponges - the Mongols of the animal kingdom.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyVQBnRNrrVnatmCAx4AaABAg", "comment": "I'd date you in a heartbeat tbh", "votes": "2", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyRQExZ1Mh19Q5lCwl4AaABAg", "comment": "That was the second easiest quiz of my life. The first was the one where the printer glitched and only printed the cover page of each test, so the teacher didn't notice and distributed a blank quiz. And then didn't want to have to reschedule it so it was agreed as a class that everyone would just get 2% higher than what they got on their last quiz and the teacher would assume we were all capable of at least that.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxHnUl8aJzNXs8lbP14AaABAg", "comment": "sea sponge = mongols", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiHm3WwuIo6S3gCoAEC", "comment": "Why are sponges even an animal? They have nothing that makes us animals, so why are they considered animals? We need a video on this, even though it's pretty specific. Please supply.", "votes": "5", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiVa2TkoVZIGXgCoAEC", "comment": "But I am a sponge!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghlhnXB16lJ1ngCoAEC", "comment": "Just to say, 5:22, as famous doctor he must have had a bunch of money. And from that money his offspring and their offspring could get a better education", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgizplzX77Qe-ngCoAEC", "comment": "Hank is more closely related to the plant because they're both green.", "votes": "682", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiG1uAiAz9ze3gCoAEC", "comment": "plant needs water", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghvD7xXEfnMbHgCoAEC", "comment": "#nobullyingtosponges!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Uggvji1X4C0xwHgCoAEC", "comment": "...unless you are a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugig_G59e4H3CXgCoAEC", "comment": "spongebob", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugi_fH2AF518o3gCoAEC", "comment": "I love Hank Green, he's all over the science part YouTube and he's hilarious all the time, keep on rockin hank!", "votes": "15", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy3kK6DLgkWdQ-e5Gh4AaABAg", "comment": "Watch this video at 2x speed XD", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugj2o9TakO96CHgCoAEC", "comment": "'she's really good at it'", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiYASnomBz7BHgCoAEC", "comment": "People really underestimate how powerful convergent evolution is. It doesn't just select for environmental pressures but niche pressures. Animals (and plants and fungi!!!!!) can come to greatly (to the point that they look almost identical) resemble unrelated creatures that are not only cladistically but geographically and temporally far removed from each other!!! XD", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiNK8up1UUjCngCoAEC", "comment": "The sponge is equivalent to the Mongols", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjOyID8coa1GngCoAEC", "comment": "godamn sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyVQBnRNrrVnatmCAx4AaABAg.8YUKEK7RXL28rQKk-Sgc55", "comment": "... he's married...", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgiHm3WwuIo6S3gCoAEC.8UCOdYnUfHW8qoOiz6SHkS", "comment": "1 year later from when you asked your question :) .  While sponges are quite different then us, or dogs, or crabs, or whatever else you can imagine as a different animal, sponges and us are considered animals (kingdom Animalia).  Your question about \"why are sponges even an animals\" is because taxonomy & systematics (giving names to entire evolutionarily related groups species) are based on shared derived characteristics called synapomorphies. Synapomorphies define groups such as Animalia to to be composed of species that all share characteristics in common (because they inherited them from a common ansestor) AND that those characteristics are also derived/unique from just the characteristic it self (not just a common ansestor, but an exclusive common ansestor that all and only those species in the group share).  So for animals, sponges and us we share features that had evolved in the ansestor of all animals (e.g. multicellularity, and heterotrophic). Since then the ansestor that eventually give rise to both us and sponges had many more evolutionary changes, each of those make up other synapomorphies, which define other groups to which sponges are unique and we are not a part of (like the Phylum Porifora) while the same goes for us (like the Phylum Chordata) that sponges are not a part of.", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgiHm3WwuIo6S3gCoAEC.8UCOdYnUfHW8rQL5qGow40", "comment": "They're considered animals because they do have certain things that make them animals. They're heterotrophs, multicellular, and they haven't changed much because whatever it is they do, they've become really good at it so they do not have to evolve. We're just... far different from sponges, but we're still related.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgizplzX77Qe-ngCoAEC.8SUmBX4t5VU8skuBAfvPUz", "comment": "gottem", "votes": "20", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghVDy_NL_oUxXgCoAEC", "comment": "TIL Sponge=Mongols", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggSPfsVDVv4EHgCoAEC", "comment": "2012 Hank talks so slow.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugh6-7nwGmoApngCoAEC", "comment": "Gordon the plant XD", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjuCw-cpywWXHgCoAEC", "comment": "come on doggy stab me..... oh yea your dead...... btw where did he get the birds and when? DOES NOT FOLLOW THE SCIENTIFIC METHOD!!!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugj1BxHZliais3gCoAEC", "comment": "Thank you, you saved my life.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjgvNJe-vTgBngCoAEC", "comment": "I have spent months researching into human anatomy and discovered an awesome resource at Sebs Study Crammer  (google it if you're interested)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Uggl3cMu2YBTtXgCoAEC", "comment": "art", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghqvTDRT8J7p3gCoAEC", "comment": "you said \"unless you're a sponge\" so much I'm really hoping there's a sponge episode in here somewhere...", "votes": "41", "replies": "4", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Uggs2lNRP0bxFHgCoAEC", "comment": "Can you explain Convergent Evolution?", "votes": "0", "replies": "3", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghNsrIsMs-9qHgCoAEC", "comment": "I have a hypothesis: sponges are Mongols.", "votes": "106", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggWM7LvJQkWVngCoAEC", "comment": "\"Unless your a Mongolian.\"", "votes": "4", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC", "comment": "Who els is not cramming for exams and just interested in the universe enough to do these courses for the hell of it? Keep it up Hank your smashing it! :)", "votes": "179", "replies": "9", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg0CJvroeqxP3gCoAEC", "comment": "Here's to all the high school students cramming for the AP Bio test  Cheers", "votes": "46", "replies": "3", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgilzHu4QDrhrHgCoAEC", "comment": "opening music lit af someone give me a remix", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggUDkQckDFWYXgCoAEC", "comment": "Unless you're a sponge.", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugj5112g9ynLzHgCoAEC", "comment": "But...I AM a sponge! Now what?", "votes": "0", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghYK1DFh1HZoXgCoAEC", "comment": "sponge is going to evolve and kill us all someday for making fun of it lol", "votes": "45", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugjn-PIzT80D6ngCoAEC", "comment": "Where can I get these books!", "votes": "0", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghdD0GE_Fd6e3gCoAEC", "comment": "Beeping finch! My heart melted, she's so pretty and cute! She's an excellent teacher assistant ^_^ Plus Huxley sounded AWESOME XD", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjLCZ8V5W_kPXgCoAEC", "comment": "Sponges are like the Mongols of this video", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghqvTDRT8J7p3gCoAEC.8HOM_MuFujS8HOMcOneqhR", "comment": "Oh that's up next :B", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghqvTDRT8J7p3gCoAEC.8HOM_MuFujS8L1psdb02Sl", "comment": "thats what my friend said", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghqvTDRT8J7p3gCoAEC.8HOM_MuFujS8M0eVRz9WIs", "comment": "The sponge montage is a little less exciting than the Mongoltage over at CC History.", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghqvTDRT8J7p3gCoAEC.8HOM_MuFujS8OCD6tX64kQ", "comment": "Sarcasticron I was just thinking we need a Spongoltage.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggs2lNRP0bxFHgCoAEC.8FagwLG8-ck8FahJ4L7pFS", "comment": "... in more detail, I mean.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggs2lNRP0bxFHgCoAEC.8FagwLG8-ck8Fc3xw8hn73", "comment": "Gasp    .................      Phew", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggs2lNRP0bxFHgCoAEC.8FagwLG8-ck8GZJo02TsOT", "comment": "Simply, the same selective pressures are applied to organisms with different genes and mutations to work with. In the end, phenotypes that can meet that selective pressure (regardless of the genotype or developmental factors that produce them) evolve.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghNsrIsMs-9qHgCoAEC.8FZkB1zkLuB8ODT3t2MPI1", "comment": "FirstRisingSouI I thought the same thing!😂😂", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghNsrIsMs-9qHgCoAEC.8FZkB1zkLuB8ttkUqeM02H", "comment": "Mongols inspiration was sponges 😄", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8ISQ7eJ3VzG", "comment": "A college student here, studying something not even closely related to biology. Just love Crash Course and Hank.", "votes": "8", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8ISwhj0TCY1", "comment": "Same, I'm doing a music production degree haha", "votes": "6", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8IaL69KxpCY", "comment": "same", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8ODT0gvIEfH", "comment": "PulseCode Music at first I was here cramming for exams, BUT I started to take interests in the topics and ventured out a bit. It's crazy school has gone from a place to learn to a place to pass :( sad", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8UbWazaz7Zb", "comment": "*you're", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8gadXSWlI00", "comment": "DAMN I AM", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD8hASliu-sCd", "comment": "I don't watch videos for exams, I watch them for fun..  :D", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD95pshh8dcdg", "comment": " @gwyn_8562  ulo v<<bop v<nno VCR <j ji vj blog nb uhyb", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghE52Gj-HSrgXgCoAEC.8EZEcvDrqbD95psix8yo7R", "comment": " @departmentofanalytics1116  99y Lion kko", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg0CJvroeqxP3gCoAEC.8DcrjkVsXxj8DcyGVYt_-H", "comment": "+DannyLemonFace basically me", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg0CJvroeqxP3gCoAEC.8DcrjkVsXxj8DdBcaT0O_V", "comment": "Same", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg0CJvroeqxP3gCoAEC.8DcrjkVsXxj8DxpnlGxsfh", "comment": "+DannyLemonFace I'm having my make-up Bio exam on Friday, so...", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugj5112g9ynLzHgCoAEC.8D9Kep-RIs98DPI6-WlUhM", "comment": "How do the type thing?", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugj5112g9ynLzHgCoAEC.8D9Kep-RIs98EMf2izMEYb", "comment": ".............", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghYK1DFh1HZoXgCoAEC.8Bkvq5CFcWr8DEb3Vxolkx", "comment": "yes .....sponge uprising", "votes": "9", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugjn-PIzT80D6ngCoAEC.8Bk5mGPVWyf8Bk62AWJfPs", "comment": "+Xitlalli Marysol Garcia the ones that come out in Biolo-graphy", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggHVNFv4O_5EngCoAEC", "comment": "thanks, i'll let you know if i pass my test.", "votes": "0", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg3_G58poCtB3gCoAEC", "comment": "A video on mammals would be wonderful", "votes": "3", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiMmMN1c9V2JngCoAEC", "comment": "I love just hearing something along the lines of \"Every creature does it\" immediately followed by \"unless you're a sponge\" xD", "votes": "19", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugh4S3ZgFBLc6ngCoAEC", "comment": "sponges are like Mongols. \"WERE THE EXCEPTION\"", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggpGKnwbAJ0TngCoAEC", "comment": "sponges are like Mongols. \"WERE THE EXCEPTION\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugj1Hbp-qSyWCXgCoAEC", "comment": "Damn Sponges, ruining everything", "votes": "17", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugjxv3FuHTQ9qngCoAEC", "comment": "You have to wonder why sea sponges are in the animal kingdom at all.  Seriously, someone tell me, I don't know.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugi6J90OkJbil3gCoAEC", "comment": "I think it's Shashana", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC", "comment": "I think sponges shouldn't be in the animal kingdom.", "votes": "1", "replies": "7", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghiRmqceqSyG3gCoAEC", "comment": "2:19 when he does that jazzy walk has become my new favourite thing", "votes": "3", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugij0B-hrE9FfngCoAEC", "comment": "\"Dad can you help me with my science homework\" No problem at all when your dad is Hank Green :D", "votes": "16", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjxiemN8QQjkngCoAEC", "comment": "Shashana is hot!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Uggpn2Bx-tnvnXgCoAEC", "comment": "I'm so relieved I'm not the guy who invented this saying: \"old ladies of both sexes\" I do use it a lot. i had to read a book on this guy sometime in the past", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiDZcqKWwg573gCoAEC", "comment": "Cuvier is the father of comparative anatomy!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugi2r5_052PyPHgCoAEC", "comment": "You should all want to pet Shishana... unless your a sponge.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggMTg_18AoL13gCoAEC", "comment": "I am wondering if I came upon evidence that Hank's also a Christopher Hitchens's fan.  Well, don't mind that, it's \"just a theory\".", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggyhO0gI_kvh3gCoAEC", "comment": "Question: around minute 8:12 you said that about 1.6 billion years ago, an organism developed a muscular system and a digestive system, is this the first vertebrate? (if so, that would be more than 1.6 billion years ago?)", "votes": "0", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiNixUfKjaMWngCoAEC", "comment": "0:44 you are also green!!", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugixr0AKoTkKrHgCoAEC", "comment": "Now we begin the units that my biology classes always skipped (because schools like to skip 1/3 of the curriculum and for some reason every biology teacher though anatomy and physiology weren't worth going over).  I just counted ahead, and the 3 episodes that are covered here and not in my classes to this point jump to 22 episodes after A&P...wait. My classes didn't skip 1/3 of the content they skipped 1/2!  Welcome to Arkansas.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghTXiSiEAGTpXgCoAEC", "comment": "You just got hook slapped!", "votes": "0", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggHVNFv4O_5EngCoAEC.8BG9SPXxcCY8CpqMcqBZMm", "comment": "+Elizabeth trost did you pass? if not RIP", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggHVNFv4O_5EngCoAEC.8BG9SPXxcCY8CprrHirEng", "comment": "+Meep Merp yepppp", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8Cpq1aJH6qD", "comment": "+BLUE they are heterotrophs that have specialized tissues it gets worse if you move them to protists", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8D3iycmYdHe", "comment": "+Meep Merp sponges should be their own kingdom", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8D4GcJf-iaz", "comment": "no, thats even worse", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8D4Ge4GfQVi", "comment": "they are pretty animal-like", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8D4Gg117YsP", "comment": "it would be nice to put them in protista OwO", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8D4HAmTpRk4", "comment": "+Meep Merp its not worse sponges arent plants animals or fungi because they dont move or photosynthetic or decompose they arent protists since they dont move and diverged from protists and they definitely arent bacteria they need there own kingdom", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggVbq19imLpy3gCoAEC.8A5ASQF0fCL8D4HsCRJbtK", "comment": "They are almost like slime molds", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugij0B-hrE9FfngCoAEC.8A-I5SdFbM48PILawecKWL", "comment": "He reproduced already?!", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugij0B-hrE9FfngCoAEC.8A-I5SdFbM48cxJpflinTv", "comment": "Alo Izaguirre that was just the weirdest way you could have put that", "votes": "7", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggyhO0gI_kvh3gCoAEC.87ihoT_xMao8nEdvQZHr98", "comment": "You can have muscles and digestion without having a backbone.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghTXiSiEAGTpXgCoAEC.82zT7XaLhXK8Ij3oAxp54y", "comment": "Is that a reference to the hook-handed man from a series of unfortunate events?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg9nTsbBM-qxXgCoAEC", "comment": "NO HANK! I AM NOT A SPONGE!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjBIdmvHVPeAngCoAEC", "comment": "I think we deserve a video on purely on sea sponges!", "votes": "63", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg_aEK9_RQDr3gCoAEC", "comment": "I love that the sponge is this series' version of the Mongols. They need their own montage.", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjDI2LtMdnvxHgCoAEC", "comment": "I didn't know I could invent a word to describe my spiritual views!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiAk_ef-PMKCngCoAEC", "comment": "Um, I'm not an animal. I'm a little offended you called me one.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjYehUMSn2vi3gCoAEC", "comment": "Call me stupid but is BONE a TISSUE?", "votes": "1", "replies": "4", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggLk_8bkfyYhHgCoAEC", "comment": "Do you guys redo videos as new scientific discoveries are reported?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg9S-OUF_KybngCoAEC", "comment": "So, in thinking about evolution I always come back to a simple analogy I came up with all for myself years ago. Let's imagine two lines, and first let's imagine that they run perfectly parallel. Now let's imagine separating their angles by the very very tiniest fraction of a degree we can imagine, and note that, still, over enough time the distance between them will become downright inconceivable. Think about it.", "votes": "17", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugi--SudRbaMr3gCoAEC", "comment": "You make a face every time you say \"anus\" -- like the last four or five videos. I laugh every time.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghpYLjqOVIQJXgCoAEC", "comment": "stop being so mean to sponges they have feelings to ok  ", "votes": "19", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiLz3HgWCpwSngCoAEC", "comment": "You should make a shirt with the quote \"unless you're a sponge\" on it... it'd kinda be an inside joke for Crash Course Biology watchers", "votes": "47", "replies": "3", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggGz0DqfLQcYHgCoAEC", "comment": "Leave the sponges alone ! :( kappa", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggPiszxOh6SI3gCoAEC", "comment": "\"Huxslapped\"", "votes": "7", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiaEpjGbSo7PHgCoAEC", "comment": "You forgot the third brother, biologist Julian Huxley!", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugj5Ecdh7CP9_HgCoAEC", "comment": "Ha! 4:55. Oh yes you did...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghMcyxuDXVl2HgCoAEC", "comment": "hank's hair hahahahahahaha", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjeMC19k91bf3gCoAEC", "comment": "WHERE'S MY GOLD STAR HANK", "votes": "14", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg29ziMfLnI83gCoAEC", "comment": "These darn ads that play before every video", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjyCVSaBL5BFXgCoAEC", "comment": "5:28 my favorite book", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg-uKaJIHFFiHgCoAEC", "comment": "But sea anemones and squirts don't move either, no?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjBIdmvHVPeAngCoAEC.82fOcKBoiyN8UCOvoJ0RzA", "comment": "Precisely, this really makes no sense as far as sponges are concerned.", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjBIdmvHVPeAngCoAEC.82fOcKBoiyN8fej_-BPXHZ", "comment": "Yes", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjYehUMSn2vi3gCoAEC.801KVfYlNrP70He2hnpP1x", "comment": "Sweetha Ganapathy Technically yes. Bone is composed of a variety of cell types and they perform a function.", "votes": "4", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjYehUMSn2vi3gCoAEC.801KVfYlNrP70wsN-H9RAX", "comment": "Bones are organs made up of bone tissues. -wikipedia", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjYehUMSn2vi3gCoAEC.801KVfYlNrP70xJlLLhm9S", "comment": "Right, and \"tissues\" indicates a variety of cell types that work together to perform a function. Bone is not made up of one cell type. Common misunderstanding.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjYehUMSn2vi3gCoAEC.801KVfYlNrP8dE7BD_qO4D", "comment": "Wiki is not a good source but ok", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg9S-OUF_KybngCoAEC.7zf17Wcq4MR7-xgZjhevyG", "comment": "Fluent Blasphemy Well, technically, that analogy would have to work backwards, the lines starting together and separating. But it is a cool analogy that I have never heard before.", "votes": "4", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghpYLjqOVIQJXgCoAEC.7-H0Z7-SUeP72tPofyMe-G", "comment": "***** So I won't taste the fear if I eat a sponge?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghpYLjqOVIQJXgCoAEC.7-H0Z7-SUeP88gmB0S0wWC", "comment": "+Reginald Finley nah m8 sm0k3 w33e erry day m8", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgiLz3HgWCpwSngCoAEC.7-H0Z7-L_D070J53DABxWc", "comment": "River G Most biologists would be like \"lol sponges\"", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgiLz3HgWCpwSngCoAEC.7-H0Z7-L_D070yFNsKmsGo", "comment": "River G Or a joke for Aquatic Science classes XD", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgiLz3HgWCpwSngCoAEC.7-H0Z7-L_D0725-mDuSS52", "comment": "10/10 would buy.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UggPiszxOh6SI3gCoAEC.7-H0Z7-5bzK88gmETNc2ih", "comment": "+Greg Jang 420 BLAZE IT", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC", "comment": "\"unless you are a sponge\" is like John's \"wait for it... the Mongols!\" :D", "votes": "327", "replies": "11", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggbBJwblK07nHgCoAEC", "comment": "When can I expect my gold star?  I need psychological validation.", "votes": "8", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiB0cjHwnEJuHgCoAEC", "comment": "sponges just aren't cool enough", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghFtsOZnHydf3gCoAEC", "comment": "I'm beginning to get that sea sponges are \"the exception\" to like, everything...  Are sea sponges aliens? O3o", "votes": "47", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjPt9TUrYaLzXgCoAEC", "comment": "That sponge joke gets me every time ! Keep it up guys, you clearly understand how to pass on information (as oposed to my teachers).", "votes": "42", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghAo9CYct8PSHgCoAEC", "comment": "I love how the \"unless you're a sea sponge\" is kinda the same as \"unless you're the mongols.\"", "votes": "45", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Uggpgs9HS6IM4HgCoAEC", "comment": "I want a tshirt that says \"Ünless you're a SeaSponge\".....", "votes": "8", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjH-dsoS8oZc3gCoAEC", "comment": "Sponges, the Mongols of Biology.", "votes": "56", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiHCnzZ_RwmN3gCoAEC", "comment": "I'm not an animal. Maybe you are, but I'm not. The Bible says I'm a plant. Now don't ask question and stfu", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UggYcNnLKsaidXgCoAEC", "comment": "there should be a shirt that says \"unless you're a sponge\" on it.", "votes": "50", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgihCxr3_UvV1XgCoAEC", "comment": "I'm quite sure that wasn't a serious conclusion as for the case of hereditable intelligence, but damn those were great chops. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjXfb_tmYIWaXgCoAEC", "comment": "Imma sponge.... ", "votes": "0", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghHyv6juh5riXgCoAEC", "comment": "\"Unless you're a sponge\" in becoming like the \"Except for the Mongols\" in CC World History.", "votes": "119", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugh76oahhvjRNHgCoAEC", "comment": "So basically... Sponges are the Mongols of Animalia. Sweet!", "votes": "11", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC", "comment": "i hate this guys face its so annoying to look at on camera", "votes": "0", "replies": "130", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugjg7fYqKrzB9HgCoAEC", "comment": "I think Gordon needs to be watered. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgiBgaUxLG_SxngCoAEC", "comment": "\"Unless you're a sponge\" T-shirt. Go.", "votes": "27", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg4BwfZnY6ArHgCoAEC", "comment": "im only watching this for science class lol", "votes": "0", "replies": "4", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg6Qzn8w2KpdngCoAEC", "comment": "NOBODY INVITED ME FOR ANY REUNION! Well, maybe that's because I'm a sponge... :(", "votes": "67", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg0w0hfQAbwLXgCoAEC", "comment": "Sponges: the Mongols of anatomy.", "votes": "335", "replies": "2", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk7-qBI1T0e8U", "comment": "was literally JUST about to make the same comparison", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk70AkSnvgA_j", "comment": "Yes, but he needs a good montage to go with it!", "votes": "18", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk70avlifZt1B", "comment": "Jenny Kapau And the mongol montage music...but with kazoos!", "votes": "8", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk74Vi0EZu5yJ", "comment": "Jenny Kapau Spongetage??", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk78Mc8lF2wra", "comment": "florance333 He's always raggin on the rags..i mean...sponges", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk78cd44LbqzP", "comment": "florance333 I like your video very much, your tips in especially second half.. Another resource I also found useful for anatomy in biology  is Grathaw Simple Anatomy Expert - if anyone is interested search on google", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk78xwl7QrPbd", "comment": "florance333 He is not father of anything what lies. He just show us.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk7A4uFhIIdzL", "comment": "florance333 Exactly what i was going to say after watching iit", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk7CrbWpsv3TX", "comment": "florance333 EXCEPTIONS!", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk8VZRvgLhdAp", "comment": "I was about to type \"Unless you are a sponge\" is the new \"Unless you are the Mongols!\" until i saw this. :D", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ughkr85T2nqfLHgCoAEC.7-H0Z7-U5Mk8cT-p2Ax7sX", "comment": "There should be some combination of the 2 put on a Tshirt or something", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghFtsOZnHydf3gCoAEC.7-H0Z7--EJW96yn8YeHc57", "comment": "they are bunch of cells who needs each other. they don't move around and aren't very complex. So, they are almost excluded from animal kingdom.", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjH-dsoS8oZc3gCoAEC.7-H0Z7-MfPf79CIShmtfC2", "comment": "YES! I need this on a shirt.", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgjXfb_tmYIWaXgCoAEC.7-H0Z7-J8on8D3jHuBZVMp", "comment": "well bad for you", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghHyv6juh5riXgCoAEC.7-H0Z7-BFgd7-IVrNmIGyd", "comment": "was about to say just that!", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugh76oahhvjRNHgCoAEC.7-H0Z7-MR5q71Reo2cydze", "comment": "1 point for Mr. Squarepants!", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugh76oahhvjRNHgCoAEC.7-H0Z7-MR5q72e93GZ5XiU", "comment": "Mongols are the Mongols of Animalia.", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P719YEHgPaUA", "comment": "Don't look at it on a camera then. Just watch it on your computer like a normal person.", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P719exlSeJve", "comment": "Bendyman Scratch-Poland your not normal you peace of shit", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71EO1qAq4zV", "comment": "cryptotown Well clearly I'm not, if the definition of normal is someone with no sense of humour who can't spell and won't watch documentaries because they are randomly freaked out by people's faces, like yourself.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71Eb_xwOyoK", "comment": "what are you gay or something", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71Eu9gJAP4U", "comment": "Eh? Mate. Learn to read.", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71LpL34gfxV", "comment": "I think you have anger issues. I recommend therapy. I don't know what your obsession with homosexuality is but I find that excessive homophobia is normally a cover for being uncomfortable with one's own sexuality.", "votes": "4", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71MBL4JGzZh", "comment": "i don't know who you think you are but you have got to be the most uneducated piece of shit i have ever seen. why don't you take your shitty ass comments and go bother some one else for a change.  you obviously have some Nazi ass hate-read toward gay people.  i don't know what your problem is.  i am going to call your manager on Monday and you can bet he is going to fire your ass  ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71P4gfNODLx", "comment": "i have some advise your you, QUIT DRINKING.  you really need to lay back on the alcohol consumption.  and stop going on youtube late in the night piss drunk and type moronic shit and send it to me.  i don't what to join your gay ass racist colt you piece of shit  ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71R5hv9qCJJ", "comment": "You really don't understand basic English do you? All my responses are going straight over your head. This is rather amusing. I'm trying to figure out whether it's brain damage, whether you're a very angry 13 year old, or whether you're just incredibly stupid.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71iwYYeZaUr", "comment": "http://www.dumblittleman.com/2008/08/10-traits-of-losers-are-you-one.html", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71ixlfwEF1w", "comment": "someone is hobophobic, :) if you have a problem with me tho you can just block or ignore me, or you can keep proving to everyone who you are. btw, I have a girlfriend if that matters : D", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71iy4lM1SXm", "comment": "i have six girl friends if that matter you piece of shit", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71iyFvR5Zao", "comment": "It does, it makes you a player. I would never do that because I have morals and respect for others", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71iytjCB9V-", "comment": "I don't drink alcohol and I don't smoke :D I have a lot of respect for myself and my body these days, anyway idk why anyone has respect for someone who has 6 girlfriends", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71iz7lgq6Kp", "comment": "wow your gay", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71izLySFefN", "comment": "Gay in what terms?", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j0x80-W1V", "comment": "guy*", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j1Y30oo-9", "comment": "i find that hard that hard to believe but i wish you the best of luck with him because i know if he talked to you the way he talked to me you would be burning his house down", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j1yDHABS4", "comment": "i know but those ass holes ganged up on me in the beginning ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j2T20ShEu", "comment": "cryptotown eh, you coulda asked one of your friends to help you.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j2n2W7M00", "comment": "anyway, I am talking about having one girlfriend and that I'd never have more then one at once and you talk about having 6, then you talk about how I'm gay for taking care of myself and I talk about being nice to people and you talk about wanting to be offensive. idk why I'm an asshole for helping someone else. heck when we first started talking I said if something is wrong you can talk to me if you need help.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j31EXBWSp", "comment": "and i am sure youll get your much wanted brownie points with Jesus for that ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j33mlMKPS", "comment": "are you guys in the same room?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3AveMg_z", "comment": "cryptotown I'm athiest, anyway if the christian god is real I would not want to worship him unless he explained why he killed so many people was moral and why slavery was moral.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3CeYFW3-", "comment": "***** is he crying? he sounds like he is crying", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3OSMCKsg", "comment": "cryptotown : D, you can hear me?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3RH_EWE-", "comment": "now the truth comes out your an atheist why dident you just say that in the first place?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3WtWrAY-", "comment": "Why does it matter?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3aJZ2zEY", "comment": "i thought you were a Jew", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3c_nSo2w", "comment": "Why Jew?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3qyaMfWd", "comment": "because of your profile picture", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j3sufQaQz", "comment": "a picture of myself?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j403Yp_iH", "comment": "Would there be something wrong if he was a Jew?", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j46iWTpjD", "comment": "who the fuck are you", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4DEfz2XA", "comment": "Look at the old conversation you where having", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4KV85-LP", "comment": "i know its great ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4eMAzQ4v", "comment": "i thought you guys where mad at me because i made fun of the Muslim guy that  couldn't read English", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4iCWzBug", "comment": "Eh a lot of stuff he said was logical and medically true", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4nDLYkfH", "comment": "I'm not mad", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4r9pt9Sv", "comment": "is your gf mad?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j4xfwbrJB", "comment": "Assuming is never the way to handle people, it leads to confusion and then arguments, and then a waste of time arguing", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j51S95Z-G", "comment": "She said she's not, if the guy who couldn't speak or read English is mad it's his problem", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j5DiasNrI", "comment": "its never a waste of time talking or fight or arguing atheist to atheist only a waste of time when atheist is talking to religious person ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j5LLPsL2j", "comment": "cryptotown I love debating unmoral justification in religion", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j5YzjpPLN", "comment": "well i think your as dum as a sack of shit and your good looking girl friend could do a hole lot better than you ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j5tBSJ_Zw", "comment": "cryptotown and what if she doesn't want anything but me? also I am unsure if you know this but being dum doesnt make since, unless you steam your shit sack : D", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j6QsOq2qG", "comment": "hey you think JaclynGlenn gives good head?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j6VKRXZ2X", "comment": "Why would I care?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j6_x7Uk7a", "comment": "Also why would you if you have 6 girlfriends", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j6bAvWeZG", "comment": "what are you gay shes like one of the hottest chicks on youtube ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j6jHpznmD", "comment": "Well if you have a girlfriend why does it matter", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j6vuFYppq", "comment": "are you still going on about that holly shit you need to get laid son where's your gf at call her up your head isent screwed on right if you know what i mean", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j7MKa7vbW", "comment": "Dogs are loyal to masters, they understand they will be treated better and will have a better life if they stay loyal, anyone who is atleast as smart as a typical dog knows not to whore around, I know that", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j7fWbxADZ", "comment": "sounds like you have been reading the bible ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j7iuVzt7P", "comment": "***** when is the last time he took you out on a date?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j7j9yzIqo", "comment": "I love to read the bible it's a good book", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j7vx2zgfs", "comment": "Man personal lives are not your buisness", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8ASpLL0a", "comment": "Man, I said before if you are being bothered by me just don't reply to me and block me", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8QFHjLWd", "comment": "man as i said before get a hair cut you look like shit and while your at it get a job you inbreed povertive stricken son of a bitch", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8VEqPidY", "comment": "Who says I don't have a job :D also just got my haircut I just don't like it", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8cakdb9W", "comment": "were do you work?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8jHZiYED", "comment": "Like I said stay out of my personal life", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8n_awGK1", "comment": "bring your gf back i am tired of talk to you your so fucked up to need to lay off the drugs  ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8nwwrzNW", "comment": "Anything I put public is fine, talk about it look at it but anything I don't put to the public is personal", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j8vnijSAx", "comment": "do you like your new job because i am going to call your manager tomorrow morning and you can beat he is going to fire your ass", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9-WcnqWS", "comment": "My gf went afk, she doesn't have enough respect for you to talk to you anyway anyway as I said before I take care of my body and don't smoke drink or do anything that will hurt my body", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j94KuiQlS", "comment": "how long have you been a youtube troll your hole life or is it just something you got into recently", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j94z4qypY", "comment": ":D why would he fire me?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9Cf4O5pI", "comment": "he is going to fire you because your a shitty employee ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9Epcr6ZI", "comment": "I have been a YouTube fan for several years now I have become a good fan of google", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9LCjWVtp", "comment": "Shitty? What did I do? Working extra hours without pay and taking the extra time to make sure customers are happy is shitty?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9Tux0ndf", "comment": "My grandma can't walk she has a shatted knee D:", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9ahUDvrZ", "comment": "your going to have shatted knee when the Muslim population reaches 30% ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9fDJSNWk", "comment": "Lol why", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9tdSpQKa", "comment": "try and use the last 3 of your brain cells and think about why ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71j9zDQvCTI", "comment": "Uhm, Muslim people have no reason to dislike me", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jAGErctrV", "comment": "Nope, I'm not retarted", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jAJlPtAOa", "comment": "Nor Muslim﻿", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jAM1G_vW1", "comment": "well you sure come across that way!!!!!", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jAUgKPegJ", "comment": "Why? I ask you to explain because your not completing your ideas in a sentence then you claim I'm retarted for you not explaining", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jB20USv2H", "comment": "Why am I a piece of shit? I mean I don't feel like one no one seems to act like I am one", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jB4M_-6Um", "comment": "I'll gladly tell her that if you can explain why I am", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jCclUY2PL", "comment": "I think everything you just said is irrelevant, appearance is not something to judge someone by, I agree if god is real I'm going to hell(I'm atheist so duh, my girlfriend would too because shes follows pantheism) , if I'm going to hell Jesus then hates me, you don't know if I have a job or not, I'm 16 and almost have a car already, I clearly can see I have balls and a dick and I know I have a life... And after all that you still don't have a reason that I'm shitty", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jCsCIAdQ7", "comment": "Oh yeah my hair is cut now, and the only reason I had it long is because of ROTC I don't go anymore so I finally let it grow﻿", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jDAJbMcOV", "comment": "dude you know it me Tyler right and i have been just fucking with you this hole time", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jDJlAAC_2", "comment": "Tyler who?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jDY8Jhzk5", "comment": "Tyler from 2nd period we had had gym class together in grade 9 remember me ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jDdigEu0w", "comment": "Man I started talking to you", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jDfG93c4v", "comment": "Last name?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jDyJhGgPR", "comment": "Last name?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jE4xdnYDg", "comment": "what r u doing tomorowo at lunch man u want to play basketball or something? its me tyler man lol i really got you good dident i", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jEAmJBfzf", "comment": "Dude :D your such a fucking liar I live across the country since 9th grade", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jEIZFwLlQ", "comment": "zach its me tyler i swear ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jEPVjWWbj", "comment": "I seriously don't know who you are", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jERpo03wq", "comment": "i forget if i have you on facebook or not yo zach just message me over facebook lol", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jEZOPHHZY", "comment": "zach your not fooling me your trying to get back at me now for playing this joke on ya i know lol ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jE_9Bs7Ut", "comment": "I don't have a Facebook :D", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jEf5VL0Gh", "comment": "Dude I don't play basketball I don't even attend a school", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jEvhsoPWn", "comment": "i will prove i am Tyler man i will send you an invite and a password to get in to my minecraft server we should totaly play together some time ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jF013hZNA", "comment": "Lol tell me your last name first, if your someone I know then you know why", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jFtQBNG0b", "comment": "you little lier lol i knew you had facebook i just seach you add me and for the last time its tyler yes the tyler your thinking about ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jG5EqoXz7", "comment": "its me i know your from Cincinnati Ohio", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGAU3lDTt", "comment": "Man I lived in Ohio in 4th grade", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGHlQD4yq", "comment": "***** my name is tyler i use to know zach i say he posted on my status so i decided to mess with him lol", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGLxw9gHH", "comment": "What town in Cincinnati did you know me from?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGP0BYuT8", "comment": "just add me on facebook zach lol", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGZLYabLC", "comment": "cryptotown idk what your last name is, pm me your last name", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGemceGOv", "comment": "ok i will lol but you got to amitt i got you pritty good dident i ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jGwEArL5L", "comment": " No you didn't in order to have got me you had to of had me", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jH1UgEM6U", "comment": "***** where did you go any way? lol", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jHJvfDHem", "comment": "Quit being a troll and pm me on here your last name or my best friend last time you talked to me", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jHYndwWi9", "comment": "ok ok lol my last is Niemi ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jHg08pl3G", "comment": "cryptotown no clue who that is, anyone I was friends with I went by there last name because at that time I only talked to people in ROTC, if I talked to anyone I said there last name", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jHpcWFEc5", "comment": "i know i was just fucking with you again my name is Tyler Felty", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jHtUPl6Gq", "comment": "cryptotown nope", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jHxBlFINX", "comment": "one more try before I block you...", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jI0O0lxWB", "comment": "FUCK YOU!!!!", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jI7HMJmQB", "comment": "***** where did you go?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jICmQuNvM", "comment": "i was just wondering thats all lol", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P71jIMFcx9vA", "comment": "#Ellie Smith your gay", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P72_jwJeqQPn", "comment": "Bendyman Scratch-Poland I'm betting on all three", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P72fneOfA2JI", "comment": "cryptotown How to waste your time and look like a moron on youtube, an award winning biopic by cryptotown. Of course, you don't have anything to respond with beside vulgarity and homophobic slurs, so... don't bother. Or do, continue being loud and stupid.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P72g2zHHD1mw", "comment": "StFuzz ps how did you know my name is tyler?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P72i1ruLKqfL", "comment": "cryptotown Do you even get why everyone isn't being exactly warm towards you? people are trying to have a normal friendly exchange of comments and you keep coming out with offensive homophobic and racist stuff. People keep trying to explain what's unpleasant about the way you're being on the Internet and you keep responding like you're in some playground slating contest \"Your momma's so fat that...\"  I don't understand all the anger, dude.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P73OnDP7RXsa", "comment": "cryptotown  That makes no sense.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P73P0lZnWB9q", "comment": " lol, freedom of spech means you say what you want, but it doesn't mean let's fuck with people, once you get to that point where you feel like you can be like that you can/will be forced into a hospital where they will take those freedoms away in a legal way(including privacy) and you won't leave until you calm your ass down.", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P73Pym750Bwm", "comment": "cryptotown I'm just saying :D", "votes": "1", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P76Qm2ErfwW4", "comment": "cryptotown Do you talk to your mum with that mouth?", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P78qJiSiKzoX", "comment": "cryptotown Go troll the Christians and gamers; People are trying to learn Biology here.", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Uggq1LvYuVXEVHgCoAEC.7-H0Z7-AC_P7BuMM9_sJy2", "comment": "zemorph42 blow me ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg4BwfZnY6ArHgCoAEC.7-H0Z7-4PKK73Sn67xI3ox", "comment": "That's not funny at all.", "votes": "4", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg4BwfZnY6ArHgCoAEC.7-H0Z7-4PKK746M0eu-9P8", "comment": "werido", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg4BwfZnY6ArHgCoAEC.7-H0Z7-4PKK77MX-uGNjHg", "comment": "gavin patterson I love his face, it's adorable. :3", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg4BwfZnY6ArHgCoAEC.7-H0Z7-4PKK78-HH39e3UN", "comment": "+emoninjagirl15 thats nice", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg6Qzn8w2KpdngCoAEC.7-H0Z7-6MtF74E4YCAeFHs", "comment": "Cory Keilig Sponges don't have an anus, it was the jellyfish that invented the anus.", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg6Qzn8w2KpdngCoAEC.7-H0Z7-6MtF74E4spE5abC", "comment": " Cory Keilig It's called extracellular digestion.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg0w0hfQAbwLXgCoAEC.7-H0Z7-Ofvz8cQc2b-FyKT", "comment": "This needs to be a shirt", "votes": "7", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugg0w0hfQAbwLXgCoAEC.7-H0Z7-Ofvz8dHksTjQumV", "comment": "i agree", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "Ugj2DPyL9PS5zHgCoAEC", "comment": "4:55 Wouldn't \"Hucker Punched\" be a better pun? ", "votes": "4", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugh97O8BO9W6AXgCoAEC", "comment": "Henry Huxley what a baddass, i like this guy!", "votes": "52", "replies": "1", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugim0cCoamOWc3gCoAEC", "comment": "I got the easiest quiz in the world wrong??:(", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghrHTKnnjS1oHgCoAEC", "comment": "\"Aquatic animals cross their fingers.\" Wait they have fingers? I missed something here....   Just kidding.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgisJMe73lnDUXgCoAEC", "comment": "Sea Sponges... The new Mongels", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgjSSwwx8sJ4UHgCoAEC", "comment": "Poor sea sponge", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgipDHBuL_jr4XgCoAEC", "comment": "one could become very smart by way of youtube ", "votes": "11", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugg89P2v34jqu3gCoAEC", "comment": "Gordon uses Photosynthesis.  It's extremely effective!", "votes": "4", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC", "comment": "Waiting for creationists to claim comparative anatomy doesn't exist.", "votes": "21", "replies": "11", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzJQZN-4psRaRkf8y14AaABAg", "comment": "Is it bad that I wish this had been covered in an episode of CC?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz-pfM9vTF6flne08d4AaABAg", "comment": "Yeah electrical systems and circuits and all that fun stuff will likely be covered in Physics but a little 10 or 12-part series that goes more in depth would be great... *Cough cough -Hank read these comments- Cough cough*", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwXXbKafsdaSBl-VMN4AaABAg", "comment": "l period between single-celled and multi-celled life, and eventually the cells in the \"communities\" were no longer functional as individual species of life, and only operated as part of a unified multi-cellular (but incredibly simple) organism. Algae is the most likely class of life where this occurred on the autotrophic branch of life, since there are both unicellular and multicellular species of algae, including very simple multi-celled species which likely resemble those early \"communities\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwAC0jlPQhOV9bWD1F4AaABAg", "comment": "Not too complex but like basics: electrical components like motors and light bulbs, concepts like voltage, charge, EMF etc. as well as transistors, diodes, logic gates and basic boolean Algebra. I suppose it could be included Physics. I really hope they do that.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyeaAgnKaLPqUkUwtt4AaABAg", "comment": "The most logical theory right now is as evolution progressed over millions of years, the single-celled organisms started clumping together into multi-celled communities (but still each cell its own independent organism) because they were settled on a very abundant food source, after more millions of years, the earliest form of specialization of cells started to occur, with cells in the the middle doing certain jobs for the community and cells on the outside doing others, this began a transitiona", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugybzf4oHANkynSHfgV4AaABAg", "comment": "That'd be awesome, but odds are they'll continue the standard high school progression of sciences and Hank'll do Physics next. But maybe for a miniseries... Only time will tell", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzKaXJ5PfNGxwtt45l4AaABAg", "comment": "Ok. That makes more sense. At least it's the only scientifically plausible answer I've ever heard. Perhaps it would be better if schools had science textbooks with these kinds of hypotheses.   I'm a Christian, but I have come to learn that there' a lot more complex things going on. And since a Christian would say God is outside of time, who's to say that He didn't just create billions of years 10'000 years ago. If you have the ability to create time, then you could just create infinite time.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyUpzSjcBVi6hQDQLt4AaABAg", "comment": "You have both top comments. I just wanted to be sure that you knew.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyZy0mgq-mvU60sJs14AaABAg", "comment": "Am i the only one thinking the mongols have a counterpart CC Bio now with sponges?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyXnfuY4pDB3uf4OTh4AaABAg", "comment": "It's not really like that, single cells didn't clump into complex structures, the most accepted theory is that first single celled organisms made colonies (there's fossil evidence of bacteria colonies way early in earth's lifetime), then they started to stick together permanently and made organisms similar to sponges, after that evolution did its magic by adding useful structures to the organism. Leading to the non-chordates and eventually us (and as a bonus, all other animal life)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzrE05C22a5GUpvbWd4AaABAg", "comment": "He's calling opposers of the book, both men and women \"old ladies\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugh97O8BO9W6AXgCoAEC.7-H0Z7-0R9u8cT-yC4c6v4", "comment": "+", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27-ZX-3BGTBT", "comment": "It's that combination of two quite large words that puts them off. \"Anatomy\"? Oh heck that sounds scientific, so I wont have a clue what that means. \"Comparative\"? Now this is on the tip of my tongue .... If only I had the IQ of an evolutionist, I'd know all these things!", "votes": "13", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-276T9H2Uonju", "comment": " I'm a creationist but I still believe in aspects of Comparative Anatomy and Evolution.", "votes": "2", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-276_ReZuj3CS", "comment": "terry teston  Most modern creationists I've spoken with do accept the biologists definition of evolution: change in genetic frequency of populations over time. They understand how this process requires reproduction, inherited genetic variation and natural selection.  We can confirm common descent, the idea that lions and tigers share a common ancestor. But the idea of universal common decent, the idea that lions and oak trees share a common ancestor is a hypothesis based on the evidence. Biological evolution is a factual natural process, while universal common descent is a conclusion.  You aren't required to accept universal common descent to accept the theory of evolution in it's entirety. In science, it doesn't matter if you believe there is a supernatural being within every natural process in the cosmos. The science works the same whether you are a Christian, a Hindu or an atheist. It's simply a method of investigating reality and objectively explaining it's processes.  It sounds like you hold the position of most education Christians world-wide, that evolution is true but that god is ultimately responsible. This is called theistic evolution and it's the position of the Pope and most, if not all, of the Bishops. I only bring it up to illustrate the point that it's well established in the Christian community.", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27EqYQDst_B7", "comment": "***** Why post anything from the point of absolute ignorance? There is no evidence for a super-natural god, so logically we don't start there. We are developing the theory of abiogenisis with workable models. However, decent from a common proto-life-form is almost absolute in certainty. Our genetic code has 64 variations to build proteins using just 20 amino acids (out of 500 amino acids we have synthesised in the lab). That code is the same in bacteria, in insects, in fish and in mammals. In all life forms. Common, crucial proteins such as cytochrome c in mitochondrial inner membranes perform the same electron transfer in all eukaryotes and by studying its genes and rates of mutation we see a reflection of taxonomic heirachies. I could go on for ages, but I suspect your ignorance wouldn't grasp anything I wrote apart from \"Halaluyah, I'm the lord your god\"  ", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27I0CuMN0kAB", "comment": "Martyn Jones Holding back the urge to break into a rant on how they can coexist... holding it back..... Don;t tempt me", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27I8b2VoD623", "comment": "Quinn R. Conrad Quinn, please don't let me hold you back. Win a Nobel Prize if you can dispute evolution. Win something even bigger if you can prove the existence of a creator god!", "votes": "3", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27I9r_lsDJ2U", "comment": "I'M NOT GOIGN TO DISPROVE EVOLUTION. I SUPPORT IT.  BOTH CAN EXIST AT THE SAME TIME. Evolution takes place. That's given. And god created the animals (dissagree if you want) but nothing says that exolution COULDN'T TAKE PLACE AFTER. It could of just been  God Creates -> Evolution after -> continues with evolution. There is NOTHING saying that they cannot coexist. ", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27IGQLtIhCes", "comment": "Quinn R. Conrad Why would a creator god then cause so many extinctions? Why would he create prey - preditor or parasitic relationships? - the only reason would have to be that he's a masochistic god who likes to witness pain and suffering. Worship an arsehole if you want to!", "votes": "5", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27IHHadmINXA", "comment": "Read the bible dumbass Then come back", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27ISyhzd8GhB", "comment": "Quinn R. Conrad I've read the bible and god's a fucking dumbass who loves cruelty - worship that nutter if you want to - I'd rather hang out with someone sane like Richard Dawkins. Prove the power of your god by praying to him to strick me down - then get in touch tomorrow! If I'm dead it'll still be a coincidence.", "votes": "6", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UghWNgyrlWdHWHgCoAEC.7-H0Z7-16-27ISzOYXeBXj", "comment": "We kinda brought it among ourselves--- I mean he said: DON'T MESS UP then we messed up and then we kinda brought it amongst ourselves. by the way: I'm freaking sick of this argument, I've had it too many times in my life.  Goodbye Tokyo! GOOD NIGHT", "votes": "0", "replies": "", "reply": true}, {"vid": "7ABSjKS0hic", "cid": "UgxuE4LPqSOk8C4QEbR4AaABAg", "comment": "I know this is probably a question for the last episode, but how exactly did we go from single-celled organisms to multi-cellular organisms. Logically, single-celled organisms don't just clump up into teams of muscles and organs and other tissues without a reason. What caused a cell to start dividing, but staying the same organism?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy9uKaeNaDdpv66-9d4AaABAg", "comment": "these videos make so happy. thank you science gods for these people making my life easier.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyAVKUrpxcaQwI2-mN4AaABAg", "comment": "Does he just roll out of bed and do these videos?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyu9G-bd5YBsXnzLo54AaABAg", "comment": "I mean, Hank DOES look a bit like Gordon...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzQ6Rg9OqIe7G3yvM54AaABAg", "comment": "lol", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxoq8So2CEpvR5E8Jp4AaABAg", "comment": "If you are interested in Comparative Anatomy you will enjoy this video: /watch?v=VsOJblcKQ84", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw70ggShEyMf_tDU3J4AaABAg", "comment": "I want an \"unless you're a sponge\" shirt.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwT1mGlZci68fflYWF4AaABAg", "comment": "LOLOLOLOLOLOLOLOLOL BEST BIO TEACHER EVER XD", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyVt-KdL8_FNtWTlpF4AaABAg", "comment": "nah bad idea, Crash course Physics would be awesome!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzko9QrmmJXGqqCBeB4AaABAg", "comment": "You look more like a Koala.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzQXPyffc8Cx67Btu54AaABAg", "comment": "Do CrashCourse electronics/electrical engineering.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxsAxVZvzr6-gmK9d54AaABAg", "comment": "Sponges do not have enough Brain Cells to be able to have linguistic complexity. even less grammar.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxNFbbdGEBE2Ce7zKp4AaABAg", "comment": "I love watching these. They re-cap all of the info that I'm learning at Uni. But with Hank Green as the professor which makes it a much more enjoyable experience :) Thanks Hank!! And thanks to everyone that works on CrashCourse behind the scenes!", "votes": "35", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw9h28kWV7B-zAM9kh4AaABAg", "comment": "that is a very strange dichotomy you have going there.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgymS0LoTj2Rc15PCD94AaABAg", "comment": "Evolution is from god or is it from randomness hank", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6iy-IGvZWa-I0DTl4AaABAg", "comment": "They are plants.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzyOEGVRrFjq9ZxINN4AaABAg", "comment": "roar i liek butts", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw5JV92Py8XFbrsBiB4AaABAg", "comment": "What about venus fly traps?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxeqxUGXp9rqPJOtNF4AaABAg", "comment": "Nay, for I am Spartacus.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz1KIet7sZD4hRIcsN4AaABAg", "comment": "I'm a this and I offensive find sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwIGLkBpqLLZca6z254AaABAg", "comment": "you might be right, I guess. I don't think scientists are sure about everything. :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwARvK0hQIzKvgWGHt4AaABAg", "comment": "What if sea sponges are actually colonies of single celled organisms? That somewhat specialize... :P", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzAlkAbfg-PwHGcnUp4AaABAg", "comment": "they don't fit in any other category. They are multicellular and can't produce their own food.. sooo.... that's the available space left? xD", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwoVLSPxxGT9UZmUBl4AaABAg", "comment": "I'm a find and I sponge this offensive.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyvICQ3-ctig8EPuHR4AaABAg", "comment": "I'm an offensive and I find this spunge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxSgkgiH_HS_80iyyx4AaABAg", "comment": "or a mongolian sponge t-shirt?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxbsh7IvQkb9Yrz1HR4AaABAg", "comment": "Sponges are the Mongols of biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwl9yQCpDWhhc1d_iR4AaABAg", "comment": "I just need a sponge T-shirt to go with my Mongols one", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwBiL_UcpsS5jpewp94AaABAg", "comment": "Great video, crash course is by far the most useful study aid I've ever used. Now", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxmgSIznLtmm_RjMll4AaABAg", "comment": "your gonna be loving me extra extra much then cause I've watched this video so many times to revise for my physiology tests!!!! :D thanks :D ", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgynrdpqoYQ-qbn-nl54AaABAg", "comment": "I still don't understand what energy is, how energy from the sun creates complexity on earth, and how this all relates to entropy", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzMpIzrpm_zBbw0lM94AaABAg", "comment": "I was an atheist and this comment changed my life.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwAKpkdhO0E7sLdc1F4AaABAg", "comment": "EVOLUTION IS A LIE!!! PROOF RIGHT HERE: /watch?v=dQw4w9WgXcQ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwnYR6O2iYcHSOLk2R4AaABAg", "comment": "nerdfighteria, please make a tshirt of a mongol taking a sponge bath, and having both say: we are the exception, please", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw7vx8Dj-tyiwwlJ_R4AaABAg", "comment": "easiest quiz I've ever taken? Clearly you did not take a course in computer application in mathematics.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxiNvxX_Azwq2pF44F4AaABAg", "comment": "Meet Holden Hansen.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxKxOYm4EKkxru059h4AaABAg", "comment": "Where's the t-shirt of sponges saying \"We're the exception\"?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzYTaLEd1rFeeVBJxZ4AaABAg", "comment": "Are sponges basically the Mongols of evolution?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzKiGaa8tH85dNFRwB4AaABAg", "comment": "so we all have one animal ancestor...my mind is BLOWN", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzKi38AWjc8AosS6Ll4AaABAg", "comment": "sponges, the mongol's of the animal world", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy0x0LdcCHMEt8mneF4AaABAg", "comment": "Why are sponges even considered annuals?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyS5v4ytzunfZti8Ht4AaABAg", "comment": "^^ shaweet! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwvduzgnd81L9rDwzR4AaABAg", "comment": "Cause all animals move around and think a lot... unless you're a sea sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyzEgZwBw9WHiiYObt4AaABAg", "comment": "Oh man those sponges are such a pain, aren't they.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyrBdRTervILBHVga14AaABAg", "comment": "Since Gordon is a he, surely you're more closely related to him! Women are from a completely different planet, after all.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwQCyja7ELQUdw6OS14AaABAg", "comment": "I hate the animal family reunion. T-Rex is always there.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxOLYBuEMNrRpG4okx4AaABAg", "comment": "Somebody needs to make a drawing of a sponge in mongol battlegear.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwI_NRfBoB0swarN4J4AaABAg", "comment": "There needs to be an \"...unless you're a sponge\" crashcourse t-shirt", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwEN3gIPSWu3UJBfzV4AaABAg", "comment": "that's what the category is called. \"Nobel Prize in Physiology or Medicine\" Its not one or the other. I don't know why, it just is.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw23mlKTJcFsVtKC2t4AaABAg", "comment": "Ok, Huxley was kind of a badass", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxcGj7Iz5VaBKwRgR14AaABAg", "comment": "You guys should have made a sponge montage like your brother did with the Mongols.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxC-dVcq7TGvbwD-IJ4AaABAg", "comment": "actually it is amazing that he can even understand us or use a key board or rationalize since he is a sponge and doesn't have a brain.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwDrjJcPtdV4e3d-Ut4AaABAg", "comment": "I find this crash course of history not interesting since it's mostly based on BS", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxJ9FqhXkbO9mShzX54AaABAg", "comment": "Is it bad that i failed that quiz?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxacY87Iv1AxDDLYGp4AaABAg", "comment": "aahhhh I wish I found Crash Course before I took Biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzEk5hWvp_N-mJtu_p4AaABAg", "comment": "\"You get a gold star.\" *receives  a 'you tried' star*", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwWGIR-EwSmz8GS-jx4AaABAg", "comment": "\"Old ladies-of both sexes-consider it a decidedly dangerous book.\" Hux-slap!", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyLVyDFqWKnAHqR0gR4AaABAg", "comment": "If only I could pull out hank during my bio tests!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyvsRDmo-7Ql7SCxsd4AaABAg", "comment": "7:27 is it just me or do the nerve cells pictured look remarkably like rubber chickens?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyX1jsxFIf0HOojviZ4AaABAg", "comment": "Unless your a sea sponge? What are you implying about the mongols?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyvyfAtzSGc0CHKPdB4AaABAg", "comment": "I'm a sponge and I find this offensive >:(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwHneAE5SvLKtfUEMV4AaABAg", "comment": "Wow! That was great. Science rocks :D", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzmF41QzwdC3K54zJd4AaABAg", "comment": "Unless you're a sponge. Every biologist should have this as an epitaph. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyJX9Lk93jC7NfMlal4AaABAg", "comment": "FUCK!!!!! i said plant", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwrTKk5daMFEE52eUp4AaABAg", "comment": "Spongebob disliked this video", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxAjZWf9Aq5XtQw8Rx4AaABAg", "comment": "gorden the plant is closer. jkjk", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwodmb2yaOEiegbPPd4AaABAg", "comment": "The sponges are the Mongols of biology. They're always the odd ones out", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxHKBexhrtjMoCptpB4AaABAg", "comment": "He's a sponge. You shouldn't expect so much of him.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz3p3yMe4kjZk3idZ14AaABAg", "comment": "Excellent vid.  Thank you.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzMSpRXHS1_8tROR1V4AaABAg", "comment": "Seeing that cage without any food or water makes me think that that poor zebra finch is going to be euthanized for scientific research :(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzhQfipyyVguCjcpd54AaABAg", "comment": "We need a sponge montage.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgynDpvT25YcMwVLOE54AaABAg", "comment": "yes.  Mongols are the exception to like.... everything.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxRYD9HZvcZgat5lqZ4AaABAg", "comment": "Mongolian Sponges", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx3nR-OJDYO2T0v4al4AaABAg", "comment": "Someone explain this mongol thing to me >:o Is it a reference to his brothers segments on world history?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw4bEunu3ErzUubbHl4AaABAg", "comment": "....unless you're a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyowegB7j6CofLGi094AaABAg", "comment": "They already sell a \"Mongols\" T-shirt at DFTBA. com. =)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxs3uDeb1mfi1bvquF4AaABAg", "comment": "\"plus, we have much respect for his facial hair\"- can't stop laughing. haha", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzuDS_PN1-cB8yf6sF4AaABAg", "comment": "at least 27 people who disliked this are old ladies of both genders :l", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgysqEopm05O81TgbiN4AaABAg", "comment": "I'm a real sponge, and I find this posturing offensive.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw148DQOKN1ksVlrzJ4AaABAg", "comment": "\"Old ladies of both sexes\"... Whabam!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxSXmweWHq9xswUZa94AaABAg", "comment": "If they aren't already, I want 'Unless you're a sponge' and 'Wait for it... the Mongols!' on T-shirts.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzo32pHtETKVH5Yay94AaABAg", "comment": "watch the previous episode.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwrZLn3BCtRqOmM6i54AaABAg", "comment": "I think that sponges will be kicked out from the animal kingdom the way Pluto was kicked out of the solar system planets", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy7TT43OANYwswVKaR4AaABAg", "comment": "SPONGE!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyQKHL_bdreQ9B6ZuV4AaABAg", "comment": "Hey, that's offensive, my mother is a sponge, and I'm a potted peanut butter sandwich :(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzi4KwFKJcRaIBB5eJ4AaABAg", "comment": "It was obviously started to be the \"except for the mongols\" of CC biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwst7bWcZo3aneu2Zx4AaABAg", "comment": "sea sponge for president!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgydFBY_8V28PsgjmI54AaABAg", "comment": "im a sponge, and i find this offensive ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw9MmaAUrZ8rioYPi54AaABAg", "comment": "best. shark. imitation. ever.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzxW6b1c8sk97-fG-R4AaABAg", "comment": "Unless your a sponge :D", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxjzCyLiZnhB72HKKB4AaABAg", "comment": "You're telling me a fossil can be proof of evolution.... When you find a fossil all you know is that its dead. You can't know that it reproduced, thus making it impossible to say we're related to a fossil.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx7GGHtOZk6JhA-MkR4AaABAg", "comment": "I think since a step-by-step transition from one animal to another can be found in the fossil records (and some have been observed, e.g. Peter and Rosemary Grant at the island of Daphne Major), I'm more inclined to lean towards a common ancestor, than a common designer. Specially when you consider what the Grants observed, which is a natural transition from one species to another without a common designer tinkering with it ... erm, I guess unless you consider Nature as the common designer?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw46TuxxbZd8fCqhN14AaABAg", "comment": "Wait for it.... the Sponges, they are the exception!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyHYheRo1eRbjeAHAp4AaABAg", "comment": "Some Sponge spp. have limited motile capabilities! They can move millimeters every day.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyyUeyot-_m3Eawj354AaABAg", "comment": "I am now very confused as to why religious folk get so butthurt about Science. It's not like Science goes out and actively seeks to challenge Religion. It just happens inadvertently :S", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwS06akxtvIA1vpIeB4AaABAg", "comment": "20 people are still butthurt that Evolution makes sense when Hank explains it without mentioning religion being right or wrong. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxAV85yS13Tpy5YuJd4AaABAg", "comment": "What is the title of the book you are reading? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx7jccLFc-mMQAsBAt4AaABAg", "comment": "couldnt comparative anatomy be evidence for a common designer rather than common ancestor? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxVw9OWMDs2jmMkySx4AaABAg", "comment": "You can do anything!.....Unless you're a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwlf4KkLEghXOLqPt94AaABAg", "comment": "sponges and the Mongols, the two great exceptions", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6goKyPENs5E1J4KN4AaABAg", "comment": "2:18 to 2:23 Makes me want to be your friend. :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwmkHpmVT5M8iVbui94AaABAg", "comment": "I was half-way through asking if Aldous Huxley was Thomas Henry Huxley's son when you answered it in the video. :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwUEEY9ygoI6vPmNCN4AaABAg", "comment": "you should have an unless oure a sponge shirt like the mongol one.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy8Avxo09RXc9iekDt4AaABAg", "comment": "The Half-Life episode nobody liked.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzhwqQAdpKweKvZbkJ4AaABAg", "comment": "Mongolian Seasponges will rule the world.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyxoYAsbWjvhCNsWHV4AaABAg", "comment": "... unless you are a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxIImLn303mJ_CoAcx4AaABAg", "comment": "Woo! I got a gold star from Hank!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyon9-Z3cOZkuc6I194AaABAg", "comment": "lol.  \"spunge\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyhP6Q5w1NT3Oa1gGx4AaABAg", "comment": "Sponges are the only are the only animals who lack either nervous systems or a body cavity... Some multicellular plant ancestors are classified as protists because they are basically closer to algae than to the simplest of plants, yet the protozoaic flagellates have their kelp equivalent, and we consider them animals instead of protozoa?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyXXaJE8-eMWNQR0K54AaABAg", "comment": "I was thinking about the sponge thing when you were talking about \"animals moving.\" I think you should do a sponge special!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxeI_JP_McKTldbArR4AaABAg", "comment": "Dude! I just brainstormed something! Why don't yall make science and history books to go with your vids so that homeschooled kids can use your great material!  Thumbs up so he can see! I know that when I have kids I want them to be homeschooled because the ed system is so messed up!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzw_6BQfhSr32ZYWyB4AaABAg", "comment": "Okay. I have one thing to say about a non human thinking. Jesus made all that there is. There are those in the world that have been made in the image of God, but do not want to see Him fro who He is. The most saddest thing that I see in the world against man kind is that Satan has fooled Billions of people. All those that chose not to be with Jesus will DIE the second death. They have made thier choice. For those that know what I'm talking about, hang in there,  Jesus will be back soon.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzjl-devpTJUim1yz14AaABAg", "comment": "I'm a spunge and I find this offensive.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgybWOdqLpRJKueaK494AaABAg", "comment": "Can we just have a shirt that says \"unless you're a sponge\"? Please?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz72lksJQcJMuzW9cl4AaABAg", "comment": "Sponges. The Mongols of the animal kingdom. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxqFDhgc-9iMDQWtJt4AaABAg", "comment": "My goodness, that darling little finch there just made you sooo much cuter!!", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz2OB3zR4KyEFlCAQx4AaABAg", "comment": "I love you, Hank", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx5dZRbbxnLxO0vPSR4AaABAg", "comment": "Sponge is to CC: Biology  as Mongol is to CC: World History. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyQIaZ6dsVaOoOMxCt4AaABAg", "comment": "Can we just please have sponges in another kingdom so we don't have to make so many exeptions for them?!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz8sWGWXuguj9zfLAN4AaABAg", "comment": "Next time I wanna scold someone I'll just say, \"YOU'RE A SPONGE!\" or \"YOU'RE A MONGOL!\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwuUJOA2tMd8tcBqVd4AaABAg", "comment": "Did anyone else think it was a trick question and pick the plant as more closely related to Hank? It is Green.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzLQnMcwq95Fo_RdEZ4AaABAg", "comment": "The word you're looking for is Clade, Dinosaurs are a Clade of reptiles that includes birds, at least based on modern evidence. However the reason I said that it depends on your definition is that, again based on what evidence we have now, Birds seemed to have evolved exclusively from Theropod dinosaurs (which oddly, also means they evolved from saurischian dinosaurs. There are several species (this was what I meant by species) within the Theropod clade that could be the ancestors of birds.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwKulMpC3XRFvnaoE54AaABAg", "comment": "Dinosaurs are not a species. \"Dinosaurs\" is the name for a hughe group of species and birds belong to that group. Look it up. There is nothing unclear about the definition.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyuHZY_0XtVuX-EXFJ4AaABAg", "comment": "Watch out mongolians, theres a new exception in town. The sponge!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyXHjbqU68xRGKOLJ54AaABAg", "comment": "Shoshona Sholmbalm? #united_states_of_tara", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzAWecMfTIX0WKgOa54AaABAg", "comment": "unless you are... the mon- I mean Sponge ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz3ZntLln4vvwNYw0J4AaABAg", "comment": "I need to know. Are Sea Sponges like the Mongols?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzZ5iaJl1WMkQiyC1Z4AaABAg", "comment": "And captioned it \"The Exception\"", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxGovxV5PWwXwslIgp4AaABAg", "comment": "Unless you are, wait for it...... A Sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwT73axKRU4T_TGPcl4AaABAg", "comment": "Why has nobody Photoshopped a sponge wearing Mongolian clothing/gear??", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxJSln35Qt0bKhYBB94AaABAg", "comment": "so usually i listen to hank talk while he plays assassin's creed... now i'm listening to hank teach me things while i play assassin's creed :) ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy30TIElf0f8YTTfS54AaABAg", "comment": "What about corals...?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxhPdNw9cgGlaxKmxZ4AaABAg", "comment": "Anyone else starting to feel sorry for sponges? xD ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwxYjAUNte1i8earTB4AaABAg", "comment": "Hop on, fasten your seat belts and take the ride of your life thru a human body. See YouTube video \"Organs and Glands Simplified\".", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwJ5XpjvG3Xe1xl9T14AaABAg", "comment": "i think 'unless you're a sponge' is turning into 'except for the mongols' ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyxt_tk9tPMGeSQRLd4AaABAg", "comment": "Actually the easiest quiz I've ever taken was at the end of Dora the Explorer", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzWz5w_uG_uoNetoRt4AaABAg", "comment": "youtube.com/watch?v=itsb2SqR-R0 Crashcourse has actually covered it! ;)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxBiBRljUp08s_DJS94AaABAg", "comment": "Look for Titin in wikipedia... over 200,000 letters!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyIGXpAYqZ_IK2qFPd4AaABAg", "comment": "Sponge: The mongols of biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyvP7ZRIxICvjzz41x4AaABAg", "comment": "Eukaryotes with no chlorophyll or cell walls?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzKKJpQrm4ihDrVQ294AaABAg", "comment": "where's my gold star, hank? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy3fo1n9-D2SK5F-4t4AaABAg", "comment": "A comparative anatomy video with no mention of Agnathans?? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw2l0zszWjBmTS_NNN4AaABAg", "comment": "what's up with the greens and special chairs?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgySvfxyd4bDDjJUybF4AaABAg", "comment": "Because they are multicellular, heterotrophic, and their cells have cell membranes instead of cell walls like plants have.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw_AG4gzNAAuHC-Av94AaABAg", "comment": "why?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxD2UNbSGKKWPot6gt4AaABAg", "comment": "This joke is why I love nerdfighteria. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgygsLR1mLqPi69G8bJ4AaABAg", "comment": "am I the only who, after every Hanks sentance, said \"unless you're a sponge\"?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzCI5iHEuWNqamY42t4AaABAg", "comment": "because unlike other plants sponges can't make their own food but have to hunt it. granted for sponges hunting means standing still while the ocean currents bring plankton to them.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyZZYndOQOmCPYp0D14AaABAg", "comment": "they swim as babies", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwpRRXYOAA8qoVSD894AaABAg", "comment": "On a scale of one to Voldemort sneezing, how awkward would it be if sea sponges came from Mongolia?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzUMfOOxl7T54WGG3l4AaABAg", "comment": "I want a shirt that says, \"Unless You're A Sponge.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxYuphwXvcxuYVxlh54AaABAg", "comment": "/watch?v=tIfsHPpkSPs", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgybsvW7-Ed4TQ3KFsB4AaABAg", "comment": "2:17 Replay that over and over again. Your welcome.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzESeKtQ26TSS0DTex4AaABAg", "comment": "17 people were Huxley slapped", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyoJC5V_e3iPflk2MN4AaABAg", "comment": "The pink dots are moving!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgybaJv9WEy12YHlkNd4AaABAg", "comment": "Intelligence and knowledge aren't the same thing.  Intelligence governs how quickly you gain (a certain kind of) knowledge.  Also, if you look at recent studies, there is evidence that parenting doesn't matter as much beyond the genes given to the child.  Nurture often follows nature, but it isn't likely to supersede it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzv9fhmtuizFG1jw754AaABAg", "comment": "Why so you hate sponges", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy7g55Tmiunnw5VIg54AaABAg", "comment": "You probably learned a few new things from watching this video... unless you're a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxQ-xMWjOFUHXZguw54AaABAg", "comment": "Maybe because their sperm and eggs do move, so they count.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwbOGKorXFpKLGsVT54AaABAg", "comment": "There is no need for hostility. It may be argued for a long time, but that is only because people find this aspect of reality to be unsavory. To reiterate, evolution cannot operate on traits that aren't genetic, intelligence evolved, therefore intelligence is genetic, QED. Not a shred of evidence is needed.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxb4tZrqVgGjW0Bljd4AaABAg", "comment": "But you can just as easily say that the offspring had learned from example. Not simply have it handed down through genes. Again... This has been an argument for a long time... There is no need for you to try to convince me other wise. Why? Because it is the internet. Not only that, it's YouTube. I simply want entertainment and not this nonsense.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyamsIHq3Xbem4pJaR4AaABAg", "comment": "Intelligence must be an inheritable trait because it evolved; evolution requires that traits have variation, and that offspring tend to have similar traits to their parents. It doesn't matter what arguments that may be had about nature versus nurture that go against the inheritability of intelligence, because you can automatically know that there must be something wrong with those arguments, or that they are correct but being misinterpreted. I think in this case it is the latter.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwgVRhtfV1ilf8EmO94AaABAg", "comment": "SPONGEBOB WALKS AND EATS KRABY PATTIES, SO SHUT UP HANK. SPONGES ARE JUST AS ANIMAL AS WE ARE", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxpttU4ZUvm4OUsd3B4AaABAg", "comment": "Because they live in pineapples, duh. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzPwb2mXBqu5RmDJfV4AaABAg", "comment": "Why are you so mean to the sponges? they haven't done anything, in fact they aren't able to do anything...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxLRZuQPEDQ0WZCoiR4AaABAg", "comment": "I've read Brave New World, it wasn't bad", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzeROGWz_GljUVdhul4AaABAg", "comment": "Sorry Hank, but I'm going to have to call you out for intelligence being heritable. As being someone being really into Psychology, it very well could have been that the people were simply born into an environment which would allow them to become intelligent. But then this would go in that age old argument \"nature vs nurture\", which I'm sure both sides have very good points.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzhc4URfmdFJ-e2CrJ4AaABAg", "comment": "I just found this channel and im pretty sure im going to spend the rest of my day watching these video.  ", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz14mWuVohzrfTgexV4AaABAg", "comment": "What is that supposed to mean? Sponges are animals because they are animals; they have animal cells. Also, the word is spelled \"atheists\".", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxBliyco3LADFVuGVh4AaABAg", "comment": "Nerdfightastic Drinking Game: Take a shot every time Hank says \"Unless you're a sponge.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyAct4dp9n3nlY-H5d4AaABAg", "comment": "Sponges are sessile, so they don't move.They've connective tissue though; for support they've collagen protein and pointy spicules.They're heterotrophs and filter-feed through their pores. Waste is excreted through one large hole or osculum. Their cell specialization; collar cells which flagella circulate water throughout the sponge and grab nutrients in the central chamber.And ameobocytes which basically do everything else including the fascinating gemmule.  I took a high school MarineBio class", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwmGV13IbFA-frIGo94AaABAg", "comment": "Checkmate athiests!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwyqivSccT8IwdMdvZ4AaABAg", "comment": "DAMNIT! This video was not helpful to me at all :(  I'm a sponge. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwjH-T-F7yCsP-54lV4AaABAg", "comment": "You should do a whole video on gila cells. They are a lot more important and do more a lot then insulate. Long story short, The only difference between Einstein's brain and a normal person's brain is Einstein had more gila cells in certain parts of his brain.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwZrWiKSNcdDlMBLAl4AaABAg", "comment": "(continued 1) nutrition your theory would be flawed. (paragraph) \"You dont need someboody else work to build your theory and give it credibility, that is an appeal, the logic of scientific method is enough.\" No the logic of scientific method is not enough, evidence is required. The only field where logic alone is sufficient is philosophy. (paragraph) As I explained I do not say appeal to prior work for credibility I say don't ignore said prior work.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw-D-HurjWaOvSpf_J4AaABAg", "comment": "My dad and brother are both called Gordon, so I'd say I'm more closely related to them.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwh0QiA9u0gicanUv54AaABAg", "comment": "(youtube again) It seems you do understand. But then, if you include others theories within your own you run the risk of selectivity bias and circular argument. Analyse that statement. (new paragraph)You dont need someboody else work to build your theory and give it credibility, that is an appeal, the logic of scientific method is enough.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwSgybJIj3L40s0vYN4AaABAg", "comment": "is john jealous that you're funnier??? lol!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy2_wqUv5fdGO4wpl54AaABAg", "comment": "\"Who won the Nobel Prize for Physiology or Medicine in 1963\"... Which one is it?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy74yTUxtQwICyd08l4AaABAg", "comment": "\"Unless my a sponge\"? Or did you mean \"Unless I am a sponge\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz7yj3fiS21yTN0MoV4AaABAg", "comment": "unless you're a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz7GLxFBGeaF-PMmi94AaABAg", "comment": "...unless your a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyi4gXfOrbOh9tkk6x4AaABAg", "comment": "i think John explained why in one of the recent videos. :) DFTBA", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwQblO057e0nB5j25N4AaABAg", "comment": "Here's the thing... war is so insanely important to world history, yet we've barely covered it in crash course, why?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgziX_YRA1-PsIJaWgN4AaABAg", "comment": "I'll expect my gold star from the quiz in 2-4 weeks by mail, yes? ", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6vt93T6Tr1V6BM8B4AaABAg", "comment": "I thought of Kylie Minogue. (Locomotion)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxulCDTe9_F9QGLYVB4AaABAg", "comment": "Heck, you've got platypusses and marsupials and stuff. They're basically exceptions to everything!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxJqQO91qyfn_69z9J4AaABAg", "comment": "If sponges are the exception to all the rules about animals, why are they classed as part of the animal kingdom?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxGo5xYtcukbLa4xUN4AaABAg", "comment": "only 14 creations found this video?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzqPTE59zB_3u0qLuh4AaABAg", "comment": "could you do ann episode about sponges then? and when talking about extraordinary stuff, one about mushrooms ?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzu_hXWPSuFsCK7Kul4AaABAg", "comment": "How am I getting defensive? Here is a simple explaination of the scientific method: Observe a phenomenon, hypothosize, experiment (test hypothesis), if experiment supports hypothesis submit to peer review, if not reject hypothesis. Understand that this is a simplified version to fit here. FYI knowing the names of fallacies is only usefull in debates but being able to spot fallacies is usefull in everyday life.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyGMTcQpKRsXZQhWIV4AaABAg", "comment": "Where did I say you need to appeal to others. I said you need to take their work into account. For example if a person who is studying the transition between hunter gather societies to agricultural societies, ignores all prior work and instead just uses his own work he will have a poor base on which to build a theory to explain why it happened. Before we continue please explain where I said you need to appeal to others.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxYb-dPWD8L47kQCrh4AaABAg", "comment": "evrebody likes science! unless your a spong,,,,,", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzxwKZNnqFBfGhA56d4AaABAg", "comment": "Hank Green certifies that 'extra much' is a unit of measurement.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz591w15jFoAqjAu8R4AaABAg", "comment": "Huh? What to you mean different \"source,\" what source? Natural selection is one of the huge movers, and when an environment creates hardships for an organism...you know, I'm not really going to continue that little diatribe on selective pressure. I'd like to know why you say \"WE don't make [assumptions] in the scientific method.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwV3xwcbGKqKb13rgp4AaABAg", "comment": "0:33 ill go with the plant cause both are green", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy7Fcu_J0k1wwEb_e54AaABAg", "comment": "if sponges are the exception to all these rules, why are they classified as animals?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyhW7i9cgD1fVL1FsB4AaABAg", "comment": "Same phylum", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxVLT9gT-CtyedlTxB4AaABAg", "comment": "\"Old ladies of both sexes consider it a dangerous book.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugygt6MgUC8SFeCrIaV4AaABAg", "comment": "I want a sponge episode now, these creatures seem exceptional (exception being the key word there) to deserve an entirely individual explanation.", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyz7ga9qnNy5EE9nT94AaABAg", "comment": "Wrong. That is an assumption. We dont make those in scientific method. All the statistics prove is that evolution can progress at different speeds. Selective pressure does not tend to create such a wide verity of divergence in one area. In fact it probably does the opposite in most cases, ensuring only the adapted survive. Not that things keep adapting in many ways long afterwords. Anyway im now reaching the boarder of my knowledge on this area.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy-Dn_U4iXTrNhlY6t4AaABAg", "comment": "I meant what i said. Whats with all the \"ill use a different source to interpret what hes said.\"? Anyway its statistics.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw9bimtLzNgSZsUReN4AaABAg", "comment": "Continued 3 And your getting mighty defensive. Unless you explain what scientific method you use i will assume you arnt using the right one. Also im thinking you dont know what critical thinking is. Flaws and fallacies, criteria of credibility, credibility of evidence and then maybe debating. I would designate them separately. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyFHqysLTCMlTexCtV4AaABAg", "comment": "\"That means that if you don't account for work done by others before you your theory is worthless.\" Absolute unfounded unscientific balderdash. Ive explained it to you before. You do not need to appeal to others reputations, to justify the integrity or credibility of your science paper. As soon as you start appealing its a fallacy, popularity, authority or history. Continued 3", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy1kF4dHT1pc_0DDkB4AaABAg", "comment": "In the same was the General Relativity, Gravity, Special Relativity, The Big Bang Theory, Atomic Theory, and Quantum Theory are all theorys?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwlWRTqYrU6zurAz3V4AaABAg", "comment": "Hank should do an IDTIMWUTIM on the difference of the word \"theory\" in everyday language and in science.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwAL4AM8jAqRMslnt54AaABAg", "comment": "Shouldn't it be the animal KINGDOM reunion?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxZpGQ9OmwqTS2o_At4AaABAg", "comment": "Yep! Mongol Sponges are the ultimate exception.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxZwNc8ldlM-7nwXPV4AaABAg", "comment": "Excellent point. Kudos.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxQQ2MUR9rkkL_6u0F4AaABAg", "comment": "Just in case someone didn't understand what 'selective pressure' meant. That is all. continue :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzmVyn5GKHiLVeMyMd4AaABAg", "comment": "Just to correct Thomas Henry Huxley, agnostic and atheist answer different questions. agnostic answers \"Is there a God??\" while atheist answers \"Do you believe in a God?\" so therefore most (or all) agnostics are atheists.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx9OJvTBHoml-RuLsB4AaABAg", "comment": "Which only seems to raise the question, why are you quoting me, when \"selective pressure\" is the answer to the post I quoted first.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwFfiS_Y96JL7nzzax4AaABAg", "comment": "Yes, Therefore, they are able to increase their own fitness  by having more healthy offspring suited for that environment. And on and on..species evolution and adaptation. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzs7MMa3xn6noq3_C14AaABAg", "comment": "...yes, an environment changes and exerts pressure, and in reacting to this pressure an organism changes to a suitable extent to have certain characteristics making it more fit to the new environment than its contemporaries and is thus selected for survival.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw9pXzLTIsmndLy-C54AaABAg", "comment": "It means there is something in the environment or 'culture' that has created pressure or stress on a species, that causes or favors and selects a certain trait to help in their survival. Hence, Selective Pressure- but this is only for evolution..I could be wrong.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw59nZjjMly_QeXZLx4AaABAg", "comment": "Unless you're a sponge x5", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzrPWBx7Rgfym1RvFN4AaABAg", "comment": "What, you mean selective pressure?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugztj4MVyEetxG0WlbJ4AaABAg", "comment": "I see a new meme on your channel...wait for it...unless you are a spo shit that's been said already", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyyXP4qYJFA_S7DPrZ4AaABAg", "comment": "damn it i chose Gordon", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzBCY6bx97ghQmXXnh4AaABAg", "comment": "AWRRG! ENOUGH with the \"Unless you're a sponge.\"... NO SPONGES are watching your channel! Having said that... great video :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxvT3j4BAGKtOTUONt4AaABAg", "comment": "A Penguin, A Tuna, and a Seal swim into a bar...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwjJl_3VA4VFUPhnI94AaABAg", "comment": "First you realize that sicence is based on critical thinking, so I have indeed studied critical thinking. Second you cannont know how my univeristy teaches science. Third where did I say that a theory must inculde other thoeries, what I said was that a theory is based on scientific conclusions. That means that if you don't account for work done by others before you your theory is worthless. Fourth remember to ask questions when you don't know what is ment instead of assuming what I ment.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwtINvGB0ixsvv4vL54AaABAg", "comment": "What is the song that is played at the beginning of this?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwPmK5jkcWwJFLGP5x4AaABAg", "comment": "Fucking youtube with its new fucking rules. Have you studied critical thinking? No? Well i have, with scientific method. For over five years, but five years is when i had the most productive thought. You studied science, not really scientific method. And the fact is, many many colleges and schools and just as many professors, teach different versions, wrong versions. To say that a theory MUST include others to be valid ignores how the first theory ever came about.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyWaFwP5TAw3156B-d4AaABAg", "comment": "Sponge + Mongols = Shpongle!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz5T0qq0-WC4FYNXU94AaABAg", "comment": "Thank you! It has been useful :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx9IDZJaWM9pZM1y8l4AaABAg", "comment": "Surely this would make Dictyostelium an exception too, considering that they form multicellular structures in order to migrate to new food sources...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxzRPmKuslsQz8umvZ4AaABAg", "comment": "I am SO using \"You got Huxslapped\". Also, look forward to seeing you at the Animal Family Reunion!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwLZjTlJLpP67XJCIl4AaABAg", "comment": "Anatomy is my favorite part of biology, so I'm really excited for the next few videos! You do great work, Hank!", "votes": "4", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwjX8N5HDUGw0DuW-x4AaABAg", "comment": "how on earth is a sponge an animal?? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzxR49tHBVdeKourAt4AaABAg", "comment": "You should be more explicit about making sponges a 'thing'", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyyCj_PnYgnuRhx0pZ4AaABAg", "comment": "I wish the Mongols could have a tea party with the sponges. :(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxKluYGuhEH97u60V94AaABAg", "comment": "Technically, it should be an animal \"phyla\" reunion. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz-CK8LqXtxFcvEYWZ4AaABAg", "comment": "i realise the crashcourse views are getting lower as the episodes progress and i'm contributing to that. i'm still working my way through the first ten episodes with furious notetaking. you've made the best learning resource.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzu6iZLa8Sd43cdsMF4AaABAg", "comment": "Hey Hank, what's with your haircut? Seems like pillow style haircut :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzIWIE_bRS4FsUOuMZ4AaABAg", "comment": "Good. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzFQPa7OSL0Dnkz6-J4AaABAg", "comment": "Do we have any idea what the first organism with muscles and a digestive system was?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwOfREQMhZkmSv2iux4AaABAg", "comment": "But when do we get to the part that is completely dedicated to sponges?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyJ9_FpqVif3EZWNex4AaABAg", "comment": "What makes sponges animals, if they're the exception to everything? Only the fact that they are multicelular and heterotrophs? Are they animals just because they couldn't be classified as fungus because they don't through digestive enzimes on the floor and then absorve the nutrients? I'm curious!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxxVBTwb4uqh74DdRR4AaABAg", "comment": "Speaking as someone who has grown Venus fly traps before - actually, they can go an incredibly long time without catching bugs because they still get the majority of their energy via photosynthesis. The bugs are to make up for the lack of nutrients in their native soil. Also, like with flowers opening (as others brought up), the reflexes that cause traps to open and shut aren't really comparable to the actual mobility of animals, as the plant as a whole still stays in one place.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugys5GnXIHlXeejXZAp4AaABAg", "comment": "Shoshanna is so cute!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxGIXkHXO6_SVFbdIh4AaABAg", "comment": "unless you are, wait for it.... a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx9qgD5EnKQY5KxMN54AaABAg", "comment": "Sponges are the Mongols of the biology world", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw41-nCfRV-eUOcyoh4AaABAg", "comment": "Ahhh Hank Green. \"... and we'll love you extra much.\" Don't ever stop being you. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw391IJZASftCrrW5F4AaABAg", "comment": "I'm watching and taking notes to get A. Ideas for my science project and B. Ready for my Accelerated Bio class in the fall.  It's been absolutely fantastic ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyJDp6orbpVX7Vc9Qd4AaABAg", "comment": "Anatomy is so freaking awesome.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwHONoMaTMhyI3vcMt4AaABAg", "comment": "I love convergent evolution! It's why koala fingerprints are so close to human fingerprints that they can be confused at crime scenes!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzOPMr2vp11iKcvOft4AaABAg", "comment": "why you hatin' on spongbob", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxZ6r8HbMoDkCtu_LZ4AaABAg", "comment": "hank prefers to poop on park statues. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgziFIufF7Jw90bHLj14AaABAg", "comment": "Continued 2  For your information I have a Bachelor of Arts Degree in General Science (with a focus on Archaeology). So I suggest that before you question my understanding of how science works you consider that I spent five years studing science, and archaeology in particular. This is not intended as an attempt to assert my athority in this discussion merely to provide you with the facts so you don't make a erronious assumption.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyKNTxpeBmbwoMQKCp4AaABAg", "comment": "Continued 1  Fourth yes authoritarianism is indeed misplaced in science. However nothing I said could be interpreted as an apeal to authority, if you disagree show me.  Fifth \"if you use scientific conclusions to make your theory your in danger of making a circular argument.\" No if you fail to do so you have built your theory out of nothing.  Continued 2", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzLdYFyLpoXwaMxViN4AaABAg", "comment": "Movement isn't the same thing as locomotion, mind you. But yes, life is full of exceptions like that, which is why modern taxonomy is based on evolutionary ancestry rather than defining traits. A Venus fly trap will always ancestrally be a plant no matter how animal-like it behaves.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx5gm7_mu0sSMp8u9d4AaABAg", "comment": "The Venus Flytrap is a plant but developed their ability to absorb energy from outside sources (other than the nutrients found in soil, sunlight, and water) due to the fact that they grew in environments that didn't allow them to absorb enough energy for survival.  They are still plants and have no means of transportation so they can't be classified as an animal.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxmCq3KNHqp86Lfeq54AaABAg", "comment": "First yes theory comes after experiment, but it also comes as a result of the conclusion. The conclusion is the last part of the experiment, you look at your results and draw conclusions from them. This can lead to the formation of a theory to explain the results.  Second where did you make that point about RAVEN criteria of credibility?  Third science builds upon prior work inorder to expand knowledge. If anyone in science did as you suggest scince would grind to a halt.  Continued 1", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwLLL-o9j4vd-Y23UN4AaABAg", "comment": "Sponges are the exception, just like the Huns", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyYnsAoj4F_7-Ek4114AaABAg", "comment": "So, you're going to do an entire show on sponges, right? :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzv1UbtWkvmOfj6bWt4AaABAg", "comment": "unless you're a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzLwxM-4guJmfcatRZ4AaABAg", "comment": "My there were a lot of sponge exceptions today!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwjKv817AEUm4fm_Z14AaABAg", "comment": "Continued 1 Authoritarianism is misplaced in science and is analogous to the dark side of the force. The work should stand on its own logical merit. This is why an appeal to authority is a fallacy in critical thinking (which every scientist worth their salt should have studied).   Also, if you use scientific conclusions to make your theory your in danger of making a circular argument. [dot]criticalthinking[dot]org[dot]uk/", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx6U7NxEY_SNPWKeLt4AaABAg", "comment": "But, Hank is Green.  Gordon is green.  Not related? I no understand.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwQ9eSRvI6kE5Hz9J94AaABAg", "comment": "That would mean the theory comes after the experiment. But that instead is the job of the conclusion.   And the point i made somewhere else about the RAVEN criteria of credibility is imperatively important.  Next time your handing in a science paper, write to your teacher that you are not going to reference any other science in it atall. Like as if it was the first paper ever invented. This will greatly improve your knowledge and also remove authoritarianism.  Continued 1", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy7WYDszc_r-4-aiB94AaABAg", "comment": "What is the slippery fluid that the epithelial tissue can produce?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxop-rkIDmid2ynzRB4AaABAg", "comment": "True, but we can still be friends with the ignorant can't we? We can't expect to share ideas and discuss as enemies over the interwebs. DFTBA.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyR1NOzVT1a14L9OmV4AaABAg", "comment": "I for one believe we should all work together, yet ignorance is a huge hinder to that ideals. Religion is not completely ignorant, but thinking the earth is 6000 years old and every species on earth was poofed into being, that is ignorant.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgynPOgU0ebmeH77zmd4AaABAg", "comment": "It actually doesn't 'snap', as one would think, on a hinge. Instead, as apposed to having a mechanism down the centre of the 'mouth' that quickly snaps shut, the process occurs by both sides of the leaf expanding it's cells and cell walls on the skin to the point where one end, in tandem with the other, grow quickly and bend shut. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyFCe5ZVmbUOIdmA1V4AaABAg", "comment": "Unless...wait for it...You are a Sponge! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzvLaLlO46-M_z0N6Z4AaABAg", "comment": "I imagine our society would be rather interesting if we had to release our seeds into the wind in order to reproduce.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyRCndpA_2mB63PNd94AaABAg", "comment": "Youre more closely related to Gordon the plant?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgydJoBI1LPVHlrffFd4AaABAg", "comment": "HUCKSLAPPED!  I never knew blood and fat were considered connective tissue. Now I want to know more about connective tissue!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwZOU1sIzxeYwttOVZ4AaABAg", "comment": "Oh and You can't prove god!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxm7Dquc4bE538WTD94AaABAg", "comment": "*You *can't *prove *evolution.  Just shows how much you know! XD", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyrcjpTi5O56fhFhVJ4AaABAg", "comment": "yes u can", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxbjqro6GrHKWYxSqZ4AaABAg", "comment": "Just a quick question...how can one win the Nobel Prize for Physiology OR Medicine? Don't you just win one? (Unless that's just the name of the category...I'm not very well versed in the Nobel Laureate nomenclature.)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxC0oYJL38eUJHA4Qd4AaABAg", "comment": "\"Unless you're a sponge!\"", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy6kvBj6P2JLvs7Brd4AaABAg", "comment": "close your mouth and hope somebody gets pregnant", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyV07YkyZcbdmi21_94AaABAg", "comment": "wait for it the sponges ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxBHlSQHBJGmYuZ06h4AaABAg", "comment": "Sponges cells are animal cells. If you don't know the difference between animal cells and plant cells then look it up. Though mainly, plant cells produce their own food (photosynthesis), they have a thick cell wall, animal cells can move around, and have to take in nutrients externally.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxuZBo6Us816iW_ilh4AaABAg", "comment": "Ghenghis Khan holding a sponge, Hamlet style, saying: \"Alas, we are the exception.\" This needs to be a thing!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxaeM5owMFQ8FMLnF14AaABAg", "comment": "Nope, I failed that quiz cause sometimes I think Hank is more like old Gordon there!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxyQXe5MqtTHixt5VZ4AaABAg", "comment": "I've decided sponges are like the Mongols \"we're the exception!\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyDpTwmYeX59YCU4i54AaABAg", "comment": "They don't have differentiated tissue types which is one of the general qualities that animals have, however, they closely resemble choanoflagelates  which are the ancestors of animal life. They're also ingestive Chemoheterotrophs. Which differentiates them from all other eukaryotes... They share genetic similarities with other animals too.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwjIJSNzY_nIU-Z5nV4AaABAg", "comment": "go tell it at parties...(your not going to get invited to any parties)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxinQaTvQCgxxDFwLB4AaABAg", "comment": "Omg a shirt with the Mongols and sponges hanging out and saying \"we're the exception\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxiC15_mTT3aLFOMJV4AaABAg", "comment": "Easiest quiz ever: Is justin bieber's music good?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz2lOeStjsdGBp-FnB4AaABAg", "comment": "I concur. Don't feed the trolls!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy1VNUjSE0uSE5_hXt4AaABAg", "comment": "I think that movement doesn't count, and the plant as a whole stays in the same location. And they DO perform photosynthesis, despite also feeding on animals.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwaa1g2gWvthgupsc14AaABAg", "comment": "Hank for the biolo-graphy are you actually looking different books each time or is it the same book and you guys just change book jacket to make it look like your looking at different one?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzrjesNOnhBrjwUagd4AaABAg", "comment": "unless your a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzj8835-_GBEl8X-F94AaABAg", "comment": "The plant, duh, 'cause they're both GREEN! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwiMu_Ev5Vli23Blgp4AaABAg", "comment": "Anus face 7:46. Internet, please make a gif.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzJDoUhVXaoe_2bC1J4AaABAg", "comment": "\"you can't prove evaluAtion?\" what the oh... learn to spell it and understand it, THEN come at us with critic", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw0SSD1qoq80gnGKxx4AaABAg", "comment": "lol ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwMF45QO3Ld7IKXsAN4AaABAg", "comment": "HAPPY BIRTHDAY HAPPY BIRTHDAY HAPPY BIRTHDAY!!!!!!! And congrats on making top comment sir! ;D", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzXld7PverC79ty0S94AaABAg", "comment": "free the poor bird please! birds shouldn't be kept in cages!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz2k7MQrV2X7wGK6LZ4AaABAg", "comment": "When Hank was on a black background, my five year old commented: \"It looks like you could fall and die in the blackness\".  ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwa0u_N0k2sPx__61Z4AaABAg", "comment": "so many new cool dances can be seen in this episode", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzyZCAocuoEvyYcZBN4AaABAg", "comment": "Aw, why don't the sponges get an awesome montage, just like the Mongols?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxS6uFHEICBK4WTGZp4AaABAg", "comment": "Why are the sponge animals then?!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwXGCq33KjRKxvIZUV4AaABAg", "comment": "no, the easiest quiz i took was in 1st grade: 1+1=?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxKLRbNZECMBVmh2QJ4AaABAg", "comment": "The joke is that if you're complaining about evolution, you're acting like an old lady, even if you're a man.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxmD7TZTNujFyrhZ894AaABAg", "comment": "How can any old lady be of another sex?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw5fbryxrbMNqDjw6l4AaABAg", "comment": "Thats just a mistake with the picture I think.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxPW-jVRdbSyMTI43B4AaABAg", "comment": "\"We'll love you extra much.\"Brilliant grammar Hank, especially after all that awesome science stuff XD   Spongy mongals. I couldn't not say it! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxkJe8qsJvdW6zZ2g54AaABAg", "comment": "'you just got Huxslapped' NEEDS to be a tshirt!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxhy-P57I3ATUutdgV4AaABAg", "comment": "I suppose that's true, but I'm not one to be politically correct in any sense of the phrase. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyaELlLAb4-Yyntqtl4AaABAg", "comment": "I failed the quiz, I thought it was Gordon.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwemv-_j530mDIQd4R4AaABAg", "comment": "Sometime in the future, Hank, I'm going to remix you saying \"unless you're a sponge\" into a song and give it to you. Either that or I'll put a compilation of you saying that phrase with a counter in the corner.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugye0eT0W4bcZ-GDMyB4AaABAg", "comment": "Sponges, Natures MONGOLS?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw172Bq2BmpRD9e_Bh4AaABAg", "comment": "you're obviously more closely related to Gordon", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxexglcVG7mBMJlw1p4AaABAg", "comment": "Hank is a master of Silly Walks.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzP4aK9d_Y4efSMFzR4AaABAg", "comment": "Wait for it.. sponges! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzOxF-eMlB8sWOIg3Z4AaABAg", "comment": "HAHAHAHAHA, he said anus...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyx9YPH5RWuX5KhYaF4AaABAg", "comment": "Why did people decide to add sponges if they don't have anything to do with everything else?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzonqPMnFI2xt_jFcZ4AaABAg", "comment": "SPONGIFORM SQUAREPANTSCII!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxfXbsGqIm8D_Hu6t94AaABAg", "comment": "Oh come on, Hank. We all know you poop on park benches.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzo87aQUtsithQKfaN4AaABAg", "comment": "I didn't get a gold star.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugylrse5PvvlLIZsGUN4AaABAg", "comment": "the 13 people who disliked this video are about to be huckslapped ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwYmGCYA-bW_ozgF694AaABAg", "comment": "Correct- but please, try to at least SOUND respectable and intelligent by learning to spell. :)   Love, the Creationist community", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwEzA6l3nsi24BcdNZ4AaABAg", "comment": "GORDON THE PLANT.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzH8TB4NYNjdDb4pCl4AaABAg", "comment": "So, do I get a sponge shirt to go with my Mongol shirt? 'Cause I don't want to get Hux-slapped, again...  Also, Gordon looks a little thirsty.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw04jyDr0x4kpG6UjF4AaABAg", "comment": "Cool story bro.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyrCBk1bTdgzbI-85h4AaABAg", "comment": "Sponges- the Mongols of biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxaLUSqGQ88XWUpsMx4AaABAg", "comment": "Are Sponges Hank`s-equivalent-Biology-Crash-Course Mongols?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzJT1kJr5Gvz1bth414AaABAg", "comment": "Sponges: We're the other exception.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwLygjBStEWtLvvTC94AaABAg", "comment": "Who lives in a pineapple under the sea???", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzV1zaxExKdgfjbkjt4AaABAg", "comment": "Some fungi move on a multicellular level.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzg83ZHYPn_rtGL6yd4AaABAg", "comment": "And the father of the father of Aldous Huxley!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxdMnetCNDl9cxdtDR4AaABAg", "comment": "Yay now Biology CrashCourse has its very own Mongol.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzlOyjw10LjV9m9qHV4AaABAg", "comment": "Thanks ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxFs19COJRJX_7rzVJ4AaABAg", "comment": "That makes sense plants have cell walls, ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzrmpTnX3ql_z-vPT14AaABAg", "comment": "sponges biology mongols", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxJW3p4eQbbIy43w7B4AaABAg", "comment": "hahahahaaaaa!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzbgD33UcAeKvGKTwh4AaABAg", "comment": "I've grown very fond of Gordon. I hope he's in another crash course soon", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz7gNwvTf2geIomOuh4AaABAg", "comment": "When you were 'being a shark' you looked more like a dolphin, very funny.  I really enjoy watching your videos. You are very clever and present the material in a simple, humorous and digestible manner.  I watched zfranks video and realize you are much more comfortable on camera when you have a script.  I laughed when you said you are NOT an improvisational artist and then went on to prove it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgztE0jRXumNRPTSkl14AaABAg", "comment": "He forgot to mention Julian Huxley, another smart brother of Aldous and half brother of Andrew. The Huxley family rocks! He edit the nice 8 volume compendium The science of life, with HG wells.  ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzWwxx1IC1tN5t2m-Z4AaABAg", "comment": "Sponges are kinda like the Mongols of animal world. always an exception!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyCH8c7KmzJ-VPKiYB4AaABAg", "comment": "Hank is more similar to the plant ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6_T4bD0fiFj8iXrd4AaABAg", "comment": "Well I looked it up, and it seems that there is no strict boundary between science, pseudoscience and religion. However, science is closely associated with the scientific method and as far as I know, religion does not follow that method and therefore I think it should be considered as a separate thing.  I think that it's wrong to simply believe in a scientific theory the same way that one believes in religious things. You can be aware of a scientific theory and you can test it or make use of it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwiIqBg1azoGAGPaX94AaABAg", "comment": "Because they're eukaryotes.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz37XO2e7SltlYS7HV4AaABAg", "comment": "Ok, Hank. Now you need to dedicate a video to us. Sincerly,  The Sponges", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyrVjniIpxSgH6lInJ4AaABAg", "comment": "sponges are the mongols of biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx46I8_eP-hFb0ijCd4AaABAg", "comment": "you just got hux-slapped", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxgtXMzCqXrT3j4dNZ4AaABAg", "comment": "Hmm,  Perhaps science if the most meaninful religion.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzG-6LZuXJLuSlGWyx4AaABAg", "comment": "You should tell us what kind of a plant Gordon is, unless you're a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyAOx2HQ5qhGPyr0dh4AaABAg", "comment": "Sponges, the Mongols of the sea.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyaP04UKTIp_uSW9LR4AaABAg", "comment": "Gordon doesn't look so good...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwm0JEnToxan6yceV14AaABAg", "comment": "animal biology", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyEyDDNhkDz4QOG5wJ4AaABAg", "comment": "everyone in the comments made that joke... ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyZRHbajBeoN9kPn6h4AaABAg", "comment": "11 sea sponges watched this video and felt excluded.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwp9Dt4JUVXpYcwaLF4AaABAg", "comment": "So weird to see some people pretend that science is a religion.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzyHwBEqjfTvnevPv94AaABAg", "comment": "Wait! Don't forget about Julian Huxley, another famous biologist from the same family!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzw2nnYeK2MullP4HF4AaABAg", "comment": "You can't believe in putting aside differences and just being friends, it is the most proven branch of humanity. You may as well question your life, but I don't see you thinking about other complexly, do I? DFTBA", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwS2ZDL-ml9xo9UNXd4AaABAg", "comment": "I thought... I made that joke last time... =(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzS8859rtSF8h7t9LZ4AaABAg", "comment": "You can't have belief in evolution, it is one of the most proven branches of sciece, if you're gonna question it,you may as well question gravity, but you wouldn't jump out a window, now would you?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzpPjHV0E8w4CeFATZ4AaABAg", "comment": "skin is also epithelium, just a different kind.  pretty much everything that connects with the outside world (skin, digestive tract, respiratory tract) is made up of epithelium, with different kinds each specialized for their function and location", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyoKJmnd6iqyQEK1gV4AaABAg", "comment": "damn that Shoshanna had some skill at being a bird. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzrV1EAXLa88wIPv9t4AaABAg", "comment": "Well now you have to do a sponge episode", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyae7TQDSQ3tqYsR_p4AaABAg", "comment": "tz....u say you are more related to the bird...but...gordon is green...and so are you!  ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzv5cmD378S9w8kExp4AaABAg", "comment": "I will be honest: when you gave that quiz, I thought it was a trick-question, and so I said the plant. xD", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzHvufWNvAf29muef14AaABAg", "comment": "I was gonna say... Mongol Sponges: Ultimate Exception.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwYxfjffsWmPLkgwzN4AaABAg", "comment": "Can you please do a CrashCourse biology episode on Immunology? Im taking a course next semester and I'd like to be prepared :) ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyTQoe50X4rPG8J5q54AaABAg", "comment": "Thumbs up if you facepalm every time someone states that fish aren't animals (usually in the context of them thus not counting as meat).", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyESxUCqFlNJEcM_fF4AaABAg", "comment": "One of my favourite T. H. Huxley quotes comes from an interview in which the reporter asks him: \"It's obvious you don't beleive in god, but if you did, what could you say of him, knowing what you doabout nature?\" and T. H. Huxley responded: \"God has an unusual affinity for beetles.\" ", "votes": "2", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxdlkNngs5s2l0j4c94AaABAg", "comment": "Wait, what type of cell is the skin then made out of? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwnFzL6xtV5PjotB714AaABAg", "comment": "\"...unless you're a sponge.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwOlEBzJbOG4ATQoPJ4AaABAg", "comment": "Make a video about what makes a Sponge an animal! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyjV4KtACpJaog2F_h4AaABAg", "comment": "Seeing that birdcage in the beginning of the video made me expect a dead Norwegian blue parrot which had been nailed on it's perch and wouldn't wooo if you put 4000 Volts through it. Or a pet halibut named Eric, I'm a bit on the fence on that one. Still, not what I expected.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw32KGTt5w4eVyrXEd4AaABAg", "comment": "Well, there are some small multicellular organisms that exist today (microscopic organisms) which are probably much more closely related to that original organism, such as hydras. So, probably similar to those.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw7RfzhoSm2vSdiC1F4AaABAg", "comment": "Hank, you're awesome, but you need to add music to your sea sponge \"We're the exception\" slide and play that each time you say it. Or not. Your choice, sir.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxhV_aVisVmjwYDkH14AaABAg", "comment": "I watched this with my pet sea sponge, he found it quite interesting!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx1Lk0XWJHdS8lJ1xV4AaABAg", "comment": "Hank talks about the sponges in this episode:  Animal Development: We're Just Tubes - CrashCourse Biology #16. Not a lot though, just a little from 01:29 to 02:00 approximately.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgydgcP3bJPO5f9pkPB4AaABAg", "comment": "HAHAHAHA :D :D", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw1oIM0YnaTewcM_2x4AaABAg", "comment": "I wonder how you'd pick what the \"first\" thingie with bones and tissue was, honestly. I'd imagine a whole spectrum of protobones and pseudotissue along the road from those single-celled organisms and dipoblasts.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz5O6AvFwnPQLnfl2J4AaABAg", "comment": "the finch has the same name as me!!! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzIePaFxPhASa0Ebpd4AaABAg", "comment": "*its", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwBkwtc9zS3wdMfJDl4AaABAg", "comment": "I'm a Christian and I accept evolutionary theory (though I feel weird saying I \"believe in it\" that's like saying I believe in loop quantum gravity), but I feel I must tell you, cells were not created randomly. Darwinian evolution has the mechanism of natural selection that prevents it from being \"random.\" It's a natural mechanism (not needed to be guided), but it is decidedly not random.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz3FfTw5Wk5skFtH-l4AaABAg", "comment": "gold star achieved", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyLdBanNXnyrNrMgw94AaABAg", "comment": "2:02 and just after= one more reason I don't like to go swimming in the ocean.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzxdWs0mPnG5-g4P_d4AaABAg", "comment": "Mongolian sea sponges - funny, because Mongolia is land-locked :P", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy60gvE4shUqMi5wfF4AaABAg", "comment": "Try Richard Dawkin's Blind Watchmaker. I'm reading it now, he really has a way of explaining things. It does get a bit technical sometimes though.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzMCXQBrBxwo3aFno54AaABAg", "comment": "They're the exception!  XD", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxekgizi7A_skZL7G54AaABAg", "comment": "\"except if you're a sponge\" is the new \"wait for it - the Mongols\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyQaA3rPLsgM2Zcze94AaABAg", "comment": "Ummm... picked the plant for some reason", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwqB3OPBDKs6GOSnEd4AaABAg", "comment": "I am a sponge... soaking up all the good info.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyJ3zoaoSFY1mVCIX54AaABAg", "comment": "Awesome vid, thank you! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgynREwixcuu8F1-jE54AaABAg", "comment": "Damnit. I was SURE I hade the first one right.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzvpziZNgvQ5Gfx1KN4AaABAg", "comment": "ectually we have the same genetical alphabet: A,C,G,U and T. and actually some proteins have the same code as in humans.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxioLBAgbeTE0lNxlV4AaABAg", "comment": "So was choosing the plant the wrong answer?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzvM8Yxbsk4LoKXePF4AaABAg", "comment": "Sea sponges are the new Mongols, lol.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwscu4t4_v_W7inF6N4AaABAg", "comment": "where is my gold star?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy69M_hT4eD4aIjP2J4AaABAg", "comment": "Talk to me about sponges god damn it, it's killing me to hear it", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6oBcwr0KsFE_d_kd4AaABAg", "comment": "What?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx_kKexAS4tOSFyPcN4AaABAg", "comment": "Hux-slap!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw8Vmdsi8ek_1LjfaV4AaABAg", "comment": "Wait for it legen... the mongols unleast you are a sea sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxFjMVn5vsODaxFqDd4AaABAg", "comment": "Sponges = Mongols  ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx0gIbiJrZj49kRnh94AaABAg", "comment": "Hank, will there be an episode where you talk about fascia?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxkbRv5GiHy0DZ8jRB4AaABAg", "comment": "do you think sponges are alien life forms, because they are so different from the rest of the living things on this planet?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxmg5z7vc54MlTD9cV4AaABAg", "comment": "7:44.... and an anus. Lol look at his face!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy06P7o6_GRzy3Bm_B4AaABAg", "comment": "I obviously work too much at the pet store.  I had to rewind to make sure that your Zebra Finch was indeed a female.  And since she doesn't have rosy red cheeks, she is most definitely a \"she\". :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyrFGrm4viuwt-02AF4AaABAg", "comment": "Hey the Mongolian sea sponges are Mongols", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy0k-KfpmDMQ-3WfaF4AaABAg", "comment": "So if sponges are the exception to so many common animal traits, why are they classified under Animalia and not their own kingdom?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzJU3YRx4vVb5ud1Qt4AaABAg", "comment": "agreed", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwJQxDsPWFhnnS6URF4AaABAg", "comment": "Sponges are the Mongols of biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwMBd9_SUcbRyUouQp4AaABAg", "comment": "so theres a mongol t-shirt.. how about an \"unless you're a sponge\" one? :D", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzy2TXNvMp7-znPzD54AaABAg", "comment": "seasponge! they are the exception! i want this as a shirt ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxlgu1-Hlbz9u7K4GB4AaABAg", "comment": "we need that as a shirt ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz4rbHbtjeqTSPbAKV4AaABAg", "comment": "Evolution and gravitation are processes, as such they are OBSERVATIONS. They are not theories. There is a reason the actual theory is called \"The theory of evolution by natural selection\" and the \"Theory of gravitation\". Evidence in science is observations, and peer review does not apply to theories it applies to individual papers seeking to becomes part of the theory. Also being widely accepted by itself has absolutely no bearing on theories, science is not a democracy.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxFm41Y0da1L6UUPIN4AaABAg", "comment": "now the inevitable question: Why on earth are sea sponges considered animals?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyTcD1kPbxXDoj8SSx4AaABAg", "comment": "Sea Sponge = Mongols. They are the exception!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgycLdtKbHP5F2hqT0d4AaABAg", "comment": "2:32 gif anyone?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwsC3okw3_yQlT0UkF4AaABAg", "comment": "When we finally discover the theory of everything (a quantum theory of gravity) it will explain everything that can be observed in the universe in the most fundamental way. ... except for mongolian sea sponges.", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyBVCJMH1TbLVhLilZ4AaABAg", "comment": "unless, wait for it, the see sponge mongles :D", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxdnpC7x4QAi-o3pp14AaABAg", "comment": "i want to see hank and john swap roles on crashcourse.  Let John fumble through these science terms", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgygI2Vwuh2GPoIU1tN4AaABAg", "comment": "Sponges, the Mongols of Animalia.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx7RfxMH9zAl0EZsU54AaABAg", "comment": "I enjoyed the layout of this one. Sorry, but I get sick of the plain black background after a while!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxUbFq948jH_2dAJGh4AaABAg", "comment": "Mongols = Sea sponges", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy5W1nh8CKuH-Vo9B54AaABAg", "comment": "I believe in evolution....however one thing one must consider is that one cell is more complicated than the smartest supercomputer ever built. It's really hard to believe that that was created randomly.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwdTkORp3EqRJrz1JJ4AaABAg", "comment": "Nonsense, the existence of a regular icosahedron with seven faces and two fifths of a vertex is impossible, and so is finding two integers the ratio of which is the square root of two.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzX7ZSG7I7OaxjB3ol4AaABAg", "comment": "I want my gold star! >< ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxEZxgx0iV0t3aOUlR4AaABAg", "comment": "Spongols!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxv8uaRBkGc1u4jNJd4AaABAg", "comment": "If Spongebob Squarepants was Mongol, it would be such an exception that the universe would crash.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzDNgn_7c4hk6As_EJ4AaABAg", "comment": "you said evolution and gravity are observations, but they are theories, so i made the connection there, sorry if i misunderstood", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw0qNK4r6dxFqr1oCB4AaABAg", "comment": "All the people replying to my comment with hate that is. others are just fine :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgysMdk4Jp-CS7uvvmV4AaABAg", "comment": "So, according to this, I'm assuming sponges and the mongols evolved from the same thing?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyr6T7d4ddvqBEl8bx4AaABAg", "comment": "Lol you know its so funny when everyone calls christians and creationists jerks and idiots but i never once said anything offensive or mean but...asked if despite our different opinions we could be friends and i get slapped with all this lol...you guys are all hypocrite's and the real idiots not because of ur belief in evolution but because of your snap back remarks...you make everyone else look bad and im sure they dont like you talking :P", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxrTQzxspjCWr95Y114AaABAg", "comment": "Sea sponges are the mongols of crash course biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwsGENIN1Jkl-KKAbp4AaABAg", "comment": "Hmm, I started watching crash course because I was interested in the chemistry you were initially teaching, I only just realised I've been learning biology for a good while now. xD", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyMdE4LC29gRvQ4SBp4AaABAg", "comment": "Idiot you can be creationist and believe in evolution at the same time. Who's to say God didn't create the single celled organism that eventually evolved in to everything that's alive today? Not saying that I do, just saying it's not impossible to believe in both.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyTeoONt-fYsLt1Z0F4AaABAg", "comment": "Gordon doesn't look too healthy", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxS3PMX_6c7C4mGyMh4AaABAg", "comment": "We would always be considered animal because we're part of the kingdom \"Animalia\". We're pretty much right in the centre of it too, not some weird outshoot that may or may not be animal. It would take billions of years of evolution and the rest of the kingdom dying out to be considered part of a different kingdom. Plus by that point we wouldn't be human anymore.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxffWjEAdmvhUkdvFN4AaABAg", "comment": "I'm not getting the \"unless you're a sponge\" jokes. Anyone care to explain?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxhcT2EQRlmqgthfz94AaABAg", "comment": "Why aren't sponges considered plants? Their are plants that can move, like the venus fly trap, and everything else that animals do sponges don't do...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyYqPwG9mAcu5C704h4AaABAg", "comment": "How can you not agree with evolution? What's your better theory on how it all happened?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw4vo9roIwUl00_0uh4AaABAg", "comment": "Umm I thoght it was Gordon the plant... :(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwmrAkjuVQq2q7-iIR4AaABAg", "comment": "they need a cool sponge montage.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxaLvpuRLuNlcTsXF54AaABAg", "comment": "You start with F face, then go on to  saying your christian...then magic?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwNn6dw41SPUgT-0x54AaABAg", "comment": "I wish I was a zebra finch as good as shashawna", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzCaSNE9FkyqmBDxK54AaABAg", "comment": "I don't have the data in front of me, but I'm convinced that intelligence tends to follows the mother's line and class tends to follows the male line. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwIx8bh4iu4iw54uxp4AaABAg", "comment": "Tell us why sponges are so different...?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxKjjxLW3vklS3D1Sl4AaABAg", "comment": "COME BE MY TEACHER FOR HE REST OF MY SCHOOLING PLEASE.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw1vvk65-beosbzCQt4AaABAg", "comment": "@ScienceofWinning Hay, Fuck Face! How about you lern to read see that I actually said. I was offended how he said that people don't believe in the therory of evolution because they are uneducated. I bileve that evolution is a thing and am quite well educated, I've watched everything CC has put out and have learned every little because I already know most of these topics. Being a Christian I believe in creation and not that a single celled organism magically appeared in a puddle and magically tu", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz79qlA-oy2nwkb2IF4AaABAg", "comment": "hank grow your hair out pls ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxaPShaJcGOkcRFVI94AaABAg", "comment": "Evolution is science, you don't agree with it, you don't agree with science. And Science is interesting and if you don't like it, f*** off.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx2xOjtAfXrlWxeFsl4AaABAg", "comment": "I think you need to put this stuff on a DVD and sell it for use in classrooms. Its that good.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzdAoKJpWCfggZA2nh4AaABAg", "comment": "Sorry, I just can't be friends with people who see clearly explained facts and then reject them. Did you see the Crash Course video about the evidence of evolution?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxJZJXXhEZrMwT_CWh4AaABAg", "comment": "Dick move ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwXeI8ui9xyPkjLiT54AaABAg", "comment": "trololo what could possibly confuse you about jellyfish? one of the simplest multicellular marine invertebrates out there", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzLOkQ2cIxbBJ0s8_14AaABAg", "comment": "Thank you Hank, for saying Anus in an adult voice, but still acknowledging how funny it is with your face. This is how grown ups should ask.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzsOzDrBkK6CZ1nPFh4AaABAg", "comment": "Can we have a sci show on Sponges?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxDF3kGkpikgv9mpq94AaABAg", "comment": "most sponges would absorb the blow, though.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx1wl7BH7F87naiRkV4AaABAg", "comment": "so are the people you leeched money off of", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwRtlprctnA5XNhcMp4AaABAg", "comment": "so does he drag that grouchy octopus across the ground?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwLnxb1ylb5CPoLZ7F4AaABAg", "comment": "no", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxCs1TjbixRl2TlLFZ4AaABAg", "comment": "but they have two holes and three layers of tissue.  hooray!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy1OURcbXAwOObzOQF4AaABAg", "comment": "I'm assuming that by \"we\" you mean humans, and that you are not a sea sponge.  My comment was both making a reference to other Crash Course episodes (the world History series) and making a comment on how sea sponges ARE the exception to animal anatomy, because.... they are.  So in a sense I was joking, but not in the way you were reading it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwMzuwBgbwch-Cq57N4AaABAg", "comment": "i say we kick sponges out of the animalia group", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy-OCdlqNkFFZlEuHB4AaABAg", "comment": "I don't understand why people don't watch hank's videos. I think they're very interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6eTcIwlVqRcyThSt4AaABAg", "comment": "2:37 Humpy Hank", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw0x_A1wzW3HEjNZDx4AaABAg", "comment": "A tuna, a penguin, and seal go into a bar...stop me if you heard this before... ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgytSrkIAbiLxvyAP5x4AaABAg", "comment": "I love you but i dont agree with evolution :( can we still be friends?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugztr2jt5Y08S2wB8Sh4AaABAg", "comment": "I'm a sponge and I'm very offended!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzFgX4pa_ZLYpjQfGN4AaABAg", "comment": "Also there is now an organism called The SpongeBob SquarePants Mushroom.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwGx5G2t6ZbVjrEk4t4AaABAg", "comment": "Spongekhan Genghispants ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgygPihdxH6mo9gcxWV4AaABAg", "comment": "you beat me to it, I actually waited for the music to play", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwUOj1dKizWRWVsc054AaABAg", "comment": "So you're saying sponges drag their enemies across the seabed? ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzxtvOiBc33vjY2rNZ4AaABAg", "comment": "An episode on sponges, it is needed.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyyAjgzh7vMkFv04P54AaABAg", "comment": ":( i said i was closer to gordan.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz6vT1MS8U4KpYrEhN4AaABAg", "comment": "All roads lead to the Mongolian Sponge, since everyone was dragged across the ground to there.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwIWby2b5_3vneNB314AaABAg", "comment": "Can you talk about jellyfish in some episode?  They are so confusing to me.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwrOm3xwts0vDx31_V4AaABAg", "comment": "the thing that connects us all", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxb8rMlqHKMsgpfHNF4AaABAg", "comment": "anus ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyFyI_G1ktc5kaa2Ql4AaABAg", "comment": "not to be overly critical but that ending seemed... abrupt.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxVUBI6ii7FBT6ZFtN4AaABAg", "comment": "They're doing 40 of these, then changing to another subject, so they're about half way done with Biology and World History.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxuraEN-mzdnUGrwF54AaABAg", "comment": "does population growth affect the speed of evolution? I'm thinking that the more population there is the more chances for mutation and changes to happen. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzRoki5MVL8xu4Ce7Z4AaABAg", "comment": "i have a bio exam today and this is actually really helpful.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzkSlBOzYR4DbzqSSh4AaABAg", "comment": "lol why thankyou, also today's my birthday so it's like double compliment :D also sir haha ", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgykMtRGQJjMia4Yo114AaABAg", "comment": "\"You are a human animal. You are a very special breed. You are the only animal who can think who can reason and can read!\" Thank you Disney Sing Along Songs for bashing it into my head that I'm just an animal.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz2rfgsA0jgN8M1cld4AaABAg", "comment": "No, hank, no. The easiest quiz I had to take was in preschool and was a spelling quiz, where I had to spell the word \"a\" and the word \"I\". Also, the test was given verbally. :) ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwkjkW6uCOTNoJhFxR4AaABAg", "comment": "idea...u shud art doing other subects", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyVzGLaRbOoFV6aP5h4AaABAg", "comment": "sponges: WERE THE EXCEPTION!  NAH NAHHHH  NAH NAHHHH", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxTg6-GD5DL37Yhv9F4AaABAg", "comment": "I can't like this enough. You, sir or madam, are a badass.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz2x0zdSdOW7VQ-OwR4AaABAg", "comment": "Theory.\"“a well-substantiated explanation of some aspect of the natural world, based on a body of facts that have been repeatedly confirmed through observation and experiment.\" Theory of Relativity, theory of gravity....etc.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyOAppa-Dl92vLkuMF4AaABAg", "comment": "Huxley is such a hunk!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw6gxWOdZkryqjBae94AaABAg", "comment": "the mon-gonges!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwh2nlVL1IqDTzWXL54AaABAg", "comment": "Don't you mean the animal KINGDOM reunion?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy1TPxcw3GE_xnmtRZ4AaABAg", "comment": "Hank looked so shy saying \"anus\". I normally don't giggle at that word, but it was so adorable that I had to.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyWGtrjiDgtiBTX1gV4AaABAg", "comment": "Gravity is a theory too.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyTmg8SICWlGAVEAGx4AaABAg", "comment": "HANK! Don't plants move too? They move to find a surface to grow up on like rain forest vines and such", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxk8qZLp0WJYmuQxYd4AaABAg", "comment": "This reminds me of the PBS show, \"Inside Nature's Giants,\" except they dissect the animal guests...  But really, it shows how snakes, and lions, and whales and sharks and people are alike as well as different.  Really interesting!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxG3CzqypxTK4MgqIl4AaABAg", "comment": "You need a spontage like the mongoltage", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxWB8nj5It8CsB2T-Z4AaABAg", "comment": "Stop it with the sponges.  Sponge anatomy would be about a twenty second video.  They are boring animals that really shouldn't even be considered multicellular.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugykvxpup7CbjrTMlFV4AaABAg", "comment": "So sponges are like the Mongols, they're the exception. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxh3phB_frBB-cqWih4AaABAg", "comment": "\"unless you're a sponge\" is going to be CC Biology's \"except for the Mongols\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyr2TFshMrpnEcDP4B4AaABAg", "comment": "spronge bob is the exception ......", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgycnB1e80eCOwcYfq94AaABAg", "comment": "Sponges - the Mongols of biology", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwYG05sTGJ0VsdxAk94AaABAg", "comment": "I knew it! ALL MONGOLS ARE SPONGES.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwDP0kZoqHA-FPRcrV4AaABAg", "comment": "Sponges are the biology Mongols.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyz4nDjxyGty6bBfqJ4AaABAg", "comment": "Sponges are like the Mongols of crash course biology :)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy_BvxV0eqqfcE5jaR4AaABAg", "comment": "... unless you're a sponge", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxeIHKgkm0h-Lcyzfp4AaABAg", "comment": "Awww zebra finch! My mom used to have lots of them and they had babies. It was my job to clean the cages. I miss them!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyy6pnu3Xt87FLZ2RF4AaABAg", "comment": "Sponges are the exception. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxyueFFiSPmJdj5zKx4AaABAg", "comment": "Wait for it ..... THE SEA SPONGE !!!", "votes": "1", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwXTtOtkn4PpF2L03l4AaABAg", "comment": "Nope. Formal science major =)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwVEx31dW5hIWsfq8N4AaABAg", "comment": "Wrong. In the realm of science a theory is \"a well-substantiated explanation of some aspect of the natural world, based on a body of facts that have been repeatedly confirmed through observation and experiment.\"  You need to learn that some words have more than one meaning. The meaning you seem to be using is that which is in common usage. But as the Theory of Evolution is a scientific theory the scientific definition is the one we must use.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwiImiP1M2-q4FgGrp4AaABAg", "comment": "Sponges, we're the exception!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwPW0O0XotzXXl9DEh4AaABAg", "comment": "Hmm. really hope your joking. I'll bite though. In what anatomical way are we an exception to animal anatomy?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyryhsORvvvI9D7b4h4AaABAg", "comment": "You didn't get a gold star.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz1ikBsc5c3lQIjB1l4AaABAg", "comment": "Hank's sponges are like John's Mongols :P", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyKJ0kosh2Wb5UP82x4AaABAg", "comment": "The Sponge = The Mongels of Science", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgweHHkEdXDC_dnXQMN4AaABAg", "comment": "No. It's horrible. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzPG0z0Izl9koJ3NAh4AaABAg", "comment": "Facial hair respected.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzYd8w5h8TJ999F5Ph4AaABAg", "comment": "if you think the theory of evolution is wrong,  why don't you ask god to prove you right? in a way we all can see and no possible to denied", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxrgBPnfjxO-nUKSFB4AaABAg", "comment": "That's what the award is called. The Nobel Prize in Physiology or Medicine. If that's confusing in any way, blame Alfred Nobel. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwUEpl3uvP5rDSJKy54AaABAg", "comment": "To anyone who is interested in this there is a really good nature doc here on youtube about all of this. It' called \"Inside Nature's Giants\". Check it out really good stuff. Probably not for people who are queasy though.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxyMYk2GEZpjwGMQ8p4AaABAg", "comment": "Stay in school man, you need it!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz6hFuSNvsoB9RAndt4AaABAg", "comment": "animal family reunion", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzDvMmY1SHgfOp3rr14AaABAg", "comment": "Your counter argument is that a theory includes evidence and conclusions. Which is wrong. And if you learnt it that way. UN learn it.  Scientific method would not call it a theory. But it would say there is still much to explain. For example, sometimes the speed of evolution greatly increases in a certain species.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugykh6IIb-oJWjRJB7B4AaABAg", "comment": "\"Physiology or Medicine\" is one of the categories that the nobel prize is given for. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzUa96QFYeoz-VXMZ14AaABAg", "comment": "The exception to every rule ever made: The Mongolian Sponge :O", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgybYC1OQxIKUEK9FjB4AaABAg", "comment": "It doesn't? Inconceivable! ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw1b9c2jE60i7T_U6d4AaABAg", "comment": "I guessed Gordon, seeing as both he and Hank are Green. ;-)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwsE_CduptVlHE5etF4AaABAg", "comment": "Can Hux-slap be a thing now?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzNri-grk2pxsTrHEp4AaABAg", "comment": "I hope your joking ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxkHSGHkBBgkHSIprt4AaABAg", "comment": "Sea sponges: We're the exception!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyuORsQSie0vmhfeNV4AaABAg", "comment": "Time to make tshirts with a sponge on it with a quote bubble saying \" unless youare me!\"", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwneekBeZkVaB5djcV4AaABAg", "comment": "\"you just got Huxslapped\" ... lolcano", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwEGQpdr9r1hkNNfQJ4AaABAg", "comment": "When he asked who's he's more closely related too, who shouted \"Gordon the plant\" in hope of it  being right.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz0_Tzkrm4_89FnHjx4AaABAg", "comment": "I...must wikipedia sponges now, thanks Hank!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzJCRwrZ3lyzyuMuLN4AaABAg", "comment": "as*", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyUHhhXoS6EusrRIqh4AaABAg", "comment": "I did not provide gravity as proof of evolution, I put it forward as an example to show the because evolution is a \"theory\" that does not debunk it as valid. Though string theory is just as good as is it just ass valid in explaining a certain field, our only problem now is getting them to work together. My point still stands.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx3L3AolzVb38bYJaR4AaABAg", "comment": "so sponge bob eating crabby pattys makes no scence because he doesnt need to move around and eat food?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyz_QuSIyFvm5G3S3V4AaABAg", "comment": "Will we get a video about sponges?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzhIdF8HFbIK74Keht4AaABAg", "comment": "I agree.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxfeCXvpr2D7sZ8mm54AaABAg", "comment": "Plants move also.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwOsLfwEe_SXcwgxkd4AaABAg", "comment": "spontage", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxcXYumx6m_2yxsU-R4AaABAg", "comment": "Great, now the inside of my ribs itch.... ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxSeGl_GMzxvSMWTqt4AaABAg", "comment": "What about the sponges?? Thumbs up if you think Hank should do a separate video on sponge anatomy.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugww7AUm1qUsFGY4ok54AaABAg", "comment": "and where did I say theories were observations?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzZlSAvFWD_1UuknDZ4AaABAg", "comment": "i think this \"unless you're a sponge\" thing should be on a t-shirt :p", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy9hbBnzeqSJ_1tGop4AaABAg", "comment": "Huxslaps!  Oh Hitch we miss you", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxsvYw1n-tE-srUWjt4AaABAg", "comment": "Well said. I'm not sure I see how evolution can lead to medical advances without being true, but it's good to see someone with an open mind.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxEGEciwvUvcp35gc54AaABAg", "comment": "How come when we refer to other animals, we say they are mating, not that one is being raped? Also, when an animal kills another of the same species, we see it as a part of life but if it happens to us, we say its murder?  If we all come from a common ansestor, and we're all animals, then why are we not held to the same standard?   If morals seperate us from animals, then why do other animals have some sense of morals, and if it doesn't seperate us from eachother, why is there a double standard?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxdWcTjGl5zBOGDSzh4AaABAg", "comment": "think we need an episode for sponges now...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugxzsl-t2-8R4TIkn5h4AaABAg", "comment": "No need to be so rude. Do you know what the word abundant means? Now read my comment again and you'll see that you don't need to convince me.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyyhYnFdJ82F1Iushl4AaABAg", "comment": "I know... I always make a point of clicking the not spam button and then down voting it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx0pQabKPJnxbVZP_14AaABAg", "comment": "It's so easy to say that and go back to having a mind that is closed to science. I find that it is much more liberating to accept science as tending towards fact, and see how it enhances the Christian faith. Evolution is no threat to belief, as anyone who has embraced the theory can see.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxYfrs1xNe6_u_TKCB4AaABAg", "comment": "the sponge is biology's version of the mongols #captainobvious", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzVqh_dAm9mQE-06x54AaABAg", "comment": "I don't believe that it matters who you are or what you believe- telling people that they are definitely wrong is something that should always be done with extreme caution.   Having said that, I just remembered that I've already posted on this video telling someone that they are wrong in their definition of 'theory' in no uncertain terms. I should be more careful.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzwZT3ZUtJaiXkVHiJ4AaABAg", "comment": "THE PLANT!?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgydiLr6WpFgnae-ezR4AaABAg", "comment": "Key word: Or", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugwu5uJVy6KCuPhQuHN4AaABAg", "comment": "i love Timmy", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw_9xopqZZAz_tdWSN4AaABAg", "comment": "theories are more than observations, they are detailed explanations of natural phenomena supported by evidence, tested by peer review, and widely accepted throughout the scientific community.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwWvqqCeRVWBdjWIxp4AaABAg", "comment": "Exactly, the key word is theory not hypothesis, you should learn the difference.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw5dKR37cdlhCAUazh4AaABAg", "comment": "I love the bird video!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzYlQL-tZPZv196p3p4AaABAg", "comment": "Nope  Money is what make man animals  ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugyts25kQuFKHBMrJox4AaABAg", "comment": "you keep using that word, but i don't think it means what you think it means...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxaL1ixKJCqPjiqb3J4AaABAg", "comment": "sure The Theory means Evolution, such a briliant mind you have.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxxZJBjaYBU89z42Y54AaABAg", "comment": "There is something incredibly massive at the centre of our galaxy. We think it's an example of a phenomenon that has been calculated to be possible from current scientific theory called a black hole. A lot of maths has been done around this phenomenon, and we are pretty sure they exist, but we don't know.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy-YBm3OOM5rdTnxmd4AaABAg", "comment": "unless your a sponge (._.) ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw4qzUH6JQNZSXEtDZ4AaABAg", "comment": "Sponges are the new Mongols!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwisVmZEAulXjMSDv94AaABAg", "comment": "They're called *black* holes because light can't escape. (I think that's what he meant)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzp4ybISAb9hO6sjvJ4AaABAg", "comment": "Proof of evolution:  ERVs, BDVs, fused chromosome #2, computational genomics & proteomics, biogeographical distribution of species, comparative anatomy, vestigial structures/organs, direct observation and more  GTFO", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz_q-JHTo2JTpCN3Yp4AaABAg", "comment": "Theory is a scientific word  You think all the biologists telling you that evolution is simply true haven't noticed theory is in the title of the thing they are promoting?  Are they supposed to be funded by the Communist-Athiest-Muslim League or something?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyATH6vRxPZPeka0dR4AaABAg", "comment": "As is string theory- stop using gravity to prove evolution. Prove evolution on its own abundant merits.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwDGxzFGKZUkuNH9yh4AaABAg", "comment": "I'd like to have a \"unless you are a sponge\" tshirt", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxXFGBy6pao4fHGpnJ4AaABAg", "comment": "unless you're, wait for it... a sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwuDQYUd67VhbHQzC14AaABAg", "comment": "dude take it easy with the \"unless you're a sponge\" joke.  IMHO it was overdone in this episode", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx78CfcBcJ717ZW7iR4AaABAg", "comment": "Unless you are.... wait for it.... A SPONGE!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwFvQv-KYd8142pQjJ4AaABAg", "comment": "Except... Wait for it, if you're the moguls!  *epic music* er.. I mean sponge.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxM7JjNQe5vzs3u57p4AaABAg", "comment": "I like this \"key word Theory\" argument, it's funny because you point out that word without knowing what it means.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxaE6XrPcM24ktHjCd4AaABAg", "comment": "Wrong. I'm not saying that I disagree on evolution- that theory is pretty sound, but theory is not the word bestowed on an idea once everyone is convinced of it. Case in point; string theory- an idea that has almost no practical implications and no way of testing it (as I understand it). The fact is that science has no higher accolades because the next word up is theorem- something that is absolutely definitely true and proved from first principles; something that can only be said in maths.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgznXpXHXxESkV_NjER4AaABAg", "comment": "The sponge is the new Mongols. (Unless you're... wait for it!... a sponge.)", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzkkD7JvUxKonh55ph4AaABAg", "comment": "i believe theres proof for evolution...key word: proof", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugw2xJavjumLHyxJ4jN4AaABAg", "comment": "Thanks, Tim Minchin.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzuBBCuU05M537h9Q54AaABAg", "comment": "Johny? How did u get out of the 'Special' jacket? And you cell. O.o  Where did that knife come from?", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugx9sHoF7d1M4FKyBWR4AaABAg", "comment": "light bends as it passes, that's how they see them.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugy-kzu7NCNVD4t073l4AaABAg", "comment": "Sponges, the biology version of... you guessed it.. The mongols *Cue Mongoltage*", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxT73KpELVyv8RpQZF4AaABAg", "comment": "what was the name of this early animal 1.6 billion yeas ago ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwvzQxpLsOQi3iX2rN4AaABAg", "comment": "Well get close enough to a black hole and you'll really feel it.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzOAGtzdjjIn9am6OJ4AaABAg", "comment": "Watch the Crashcourse video on evolution. As Hank said, \"Evolution is a thing, not a debate.\"   So there you go. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyINXNm_YIVoyJ22a94AaABAg", "comment": "i failed the quiz :(", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwZgiXxDRJ9dS03dY54AaABAg", "comment": "Thank you Hank and John for doing these amazing videos! :)", "votes": "3", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxWPTCuljYTA73GbRF4AaABAg", "comment": "Gravity is also a theory.  Gravity: a force between two objects of mass. Gravitational theory: describes that this force is between any two objects of mass and increases with closer distances Gravitational law: describes the behavior of the theory mathematically  While kutkinderen wasn't correct either, you should also make sure that you are correct before trying to correct someone.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgwldPa3AlBSjazBF6t4AaABAg", "comment": "By the same logic, you can't see a regular hole or feel cold temperatures.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgxuFtCrw12hv5x6Ndp4AaABAg", "comment": "This question is for both John and Hank:  I was wondering if you guys could sub you're crash courses in Spanish so i could show them to my professors at college here because they're entertaining and informative ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzNjB_bBhA9ZN0TdxF4AaABAg", "comment": "There is nothing wrong or stupid about criticizing the beliefs of an atheist, for it doesn't affect them. However, it is not correct to be an atheist and go around saying, \"your belief is wrong and if you don't believe what I believe, you're and idiot.\" That's just my 2 cents on the subject.  ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugzl9OBNtUtJSBQruxJ4AaABAg", "comment": "There should be a sponge montage...", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgycmtOu9ppU8y4SDiF4AaABAg", "comment": "I hate seals. Evolutionary fail. They are mammals that are practically too fat to move on land and can't breath underwater where their weight wouldn't matter. Then there is the \"Weddell seal\" whose life expectency is half as much as other seals because instead of migrating it stays in the antartic during winter, keeps the hole they breath in open by scraping it with it's teeth, but then their teeth get worn down and aren't as efficient at eating food. #dumb lol I'm just sayin", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz__45bgPqagE__D2h4AaABAg", "comment": "There is no 'theory-of-black-holes'. Our understanding of them is largely mathematical and based on Einstein's theories.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyPjxZuGFahRf9em-54AaABAg", "comment": "What is greatest in life for sponges? To crush the starfish, drive the sea urchins before them, and hear the lamentations of the clams.", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "Ugz7QGhoLCcRTq0ML7t4AaABAg", "comment": "Well there is such a thing as Hawking radiation which we can observe and we can observe their affects. ", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgyTndK-NbE-f8rlMQZ4AaABAg", "comment": "They really should change it to a law or something. No matter how many times we explain it, it just doesn't get through their thick heads!", "votes": "0", "replies": "", "reply": false}, {"vid": "7ABSjKS0hic", "cid": "UgzEWHMgZUOehUflSUl4AaABAg", "comment": "I truly wish i could thumbs up that more than my one account would let me ", "votes": "0", "replies": "", "reply": false}]