[{"vid": "7ehfXmO42h8", "cid": "UgzXW9elaoYpIs_KkUR4AaABAg", "comment": "From all the optics videos I've watched I've never seen any focal length being negative. Eventho it even says in the 2nd exercise that it's 5 cm you wrote down -5 cm. Why did you do that? Did that have to do anything with the type of lens?", "votes": "1", "replies": "2", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "Ugw8o8ybGPe3jnDCkq94AaABAg", "comment": "My teacher taught me a way different way so I got a different answer... wth", "votes": "0", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "Ugw-NLEOKuL2YnTCILR4AaABAg", "comment": "how is the absolute m equal to 1 if the calculation said its equal to -1 pls explain", "votes": "1", "replies": "1", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "Ugwdg6U70xXflVY1RT94AaABAg", "comment": "No one explains the thin lens better than you, thanks:)", "votes": "5", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "UgxRcrx-NRnMQpiZ_rB4AaABAg", "comment": "This is a certified hood classic", "votes": "26", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "UgxxyXVzDk-3ZxTNbZ14AaABAg", "comment": "No one explains Optics better. No one.", "votes": "9", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "UgwGwO2mwgc_1Iv17gV4AaABAg", "comment": "THANK YOU I CAN NOW ANSWER MY MODULE 😸💙", "votes": "3", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "UgxDJBPh1nK9I8lvBCV4AaABAg", "comment": "Thank you for the explanation. You're a great instructor :)", "votes": "8", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "UgxRzGSLIC52E4AKFzB4AaABAg", "comment": "How do you upload every day what the hdck", "votes": "4", "replies": "", "reply": false}, {"vid": "7ehfXmO42h8", "cid": "UgzXW9elaoYpIs_KkUR4AaABAg.A0Q3y6RxmC1A7bh-752MXJ", "comment": "There are two types of sign conventions in use when mesuing distances relative to thin lenses, in this case distances measured from the optical center of the lens towards your left hand side are considered negative and distances measured to your right hand side are considered positive.  Note that when it comes to a convergent lens, the focal lenght we consider is measured to the right and when it comes to a divergent lens, the focal lenght we consider is measured to the left.  There is a fancier way of putting it by dragging in primary and secondary focus of a lens as a supplimentary concept, but the above description is a simple way of putting it imo.", "votes": "1", "replies": "", "reply": true}, {"vid": "7ehfXmO42h8", "cid": "UgzXW9elaoYpIs_KkUR4AaABAg.A0Q3y6RxmC1A7biEguQlpw", "comment": "Thx for the help. And in physics class in optics I found out that everyone uses it differently. Some have their focal length for e.g. positive while either with their similar formular have the same number in negative. But at least I understood it. Thx for ur help", "votes": "0", "replies": "", "reply": true}, {"vid": "7ehfXmO42h8", "cid": "Ugw-NLEOKuL2YnTCILR4AaABAg.9jSlw49A0eq9qhIFs_X8rK", "comment": "Absolute value cannot be negative, like for example whenever you plug a negative number in your calculator as an absolute value it will give you a positive answer.", "votes": "2", "replies": "", "reply": true}]