[{"vid": "7gLcuMtM_HY", "cid": "UgyDWyJLVpPouoJ081t4AaABAg", "comment": "Magnezium were not their food oxygen were not habitable", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxHJBTYn5CCV2KQSbt4AaABAg", "comment": "Mud is mush like coral like thing made by some broke down  tree   do to high humidity calcium were used as fungus all sort of protozio eventualy did make other side of mountain", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzHADXrAZgGq3m7dhR4AaABAg", "comment": "Tried to float", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxThr_d3NHY5rvfkAR4AaABAg", "comment": "What would it be so much hot and lots of iron lots of humid spor  got to river trying to condensate", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugx_P2sHEh_w3Hhezld4AaABAg", "comment": "After kahoot era some dinosaourus flesh got to decayed properly", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwS0ZyaU6uZBi7a6Dp4AaABAg", "comment": "I that is sucks all related to carbon dioxide fixing environment but not magnezium but iron centric", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyqFYnlh4wSXzqwhyB4AaABAg", "comment": "Almost make decision", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzFuLUPmCrPDz4dBCZ4AaABAg", "comment": "I love how even folks at MIT question whether or not they are pronouncing the names of bacteria correctly. Glad I'm not alone :D", "votes": "0", "replies": "1", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugwi1N2v3gjD_8MwBYJ4AaABAg", "comment": "Minor technicality, at the beginning of the lecture about most dangerous animals: I thought that bacteria and viruses are not cassed as animals (i,e. they are members of different biological kingdoms). Still it.as aninteresting lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyP1F_1-j_G2v5jIVh4AaABAg", "comment": "thanks for your course", "votes": "1", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyWqar4O3wZqn3rgKx4AaABAg", "comment": "😮", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwhlAvZfUBe1bti_XN4AaABAg", "comment": "Interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxM3mEeSMjQRQbe6SJ4AaABAg", "comment": "Very informative", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwfSBqMImQ6LjVUlRp4AaABAg", "comment": "I'm interested in disease from industrial toxins, in particular, toxins in industrial/technological medicines (virtually all based on petrochemicals). So we have on our hands probably the greatest irony in human history, that is, that the main causes of disease cannot be named because government and industry have always been in bed with eachother. Government protects industry, the economy, and capitalism. At 8:30 the speaker says once we thought we'd take care of microbes with our drugs. Not so. The 'we' refers to the Western biomedical model which always had its critics. In the early 1940s, it was correctly argued that the birth of a new system of national healthcare, as envisaged by the creators of the NHS in the UK, would lead inexorably to an expansion in illness. That's how capitalism works, and that's exactly what we've seen year on year. No purported virus has ever been isolated and the idea of viral pathogens is make-believe.", "votes": "2", "replies": "2", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxioPQbaXrOfRzD4wh4AaABAg", "comment": "Thank you professor! <3 I was able to finally understand the diff. between gram +ve and gram -ve , even tho I have a degree in microbiology XD", "votes": "1", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzocJK5ahNFZASxTi94AaABAg", "comment": "Thank you so much ma,am very good lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwqxPK2yRAWti_dlzt4AaABAg", "comment": "Thank youuu!!", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwPjq_w4-cU1P4s85R4AaABAg", "comment": "As a recent biochemist graduate, thank you oh so much for these lectures! I understand about 80% something I could not phantom 3 years ago. <3", "votes": "8", "replies": "1", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyRMos42I6DYhnqPzp4AaABAg", "comment": "All thanks to Betty Thomas for directing me to doctor OARE on Youtube that help me to cure my human papilloma virus 🦠 (HPV) visit dr OARE on Youtube channel for any disease or disease for a permanent cure", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxFIQsOHwqNqXXZWWd4AaABAg", "comment": "https://www.youtube.com/watch?v=plVk4NVIUh8 link for the video that was restricted in the last part of the lecture", "votes": "0", "replies": "1", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzFuLUPmCrPDz4dBCZ4AaABAg.A3DU32qv6QVA3EvAma4j0H", "comment": "if they don't know then does anybody actually know?", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgwfSBqMImQ6LjVUlRp4AaABAg.9l2RYnY5K9lA36ytKUaG58", "comment": "Absolutely truth right here. The whole med system is a con.", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgwfSBqMImQ6LjVUlRp4AaABAg.9l2RYnY5K9lA36yyVa_T_g", "comment": "Yes. We understand what a virus is .", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgwPjq_w4-cU1P4s85R4AaABAg.9dMRW1V1FMkA6yEcIdxmVV", "comment": "Diseases and infections and the bacteria, viruses and protozoa that cause them carried by vectors: (Animal hosts)  Bubonic Plague a.k.a. The Black Death spread by fleas and rats, this bacteria plague can be prevented with antibiotics like the fungus Penicillin which helps your T cells and Neutrophils kill this bacteria while they are infecting cells.  Yellow Fever and Malaria, a virus and protozoa also plagues carried and transmitted by mosquitoes in tropical eras, yellow fever can be prevented by vaccinations and booster shots, giving your B cells the information they need to create antibodies for that virus to stop them from causing infections in your body without being exposed to or getting sick or infected by the virus beforehand, while we have not yet found a cure, vaccine or drug to protect people from Malaria. Malaria, a protozoan, is more deadly than Yellow Fever, a virus.  Lyme Disease, a bacteria that is transmitted by ticks and deer, and found in woodlands, a common antibiotic can protect us from this bacteria.  COVID-19, a virus and the cousin to the Common Cold that is transmitted by tigers and other great apes and caused a major pandemic from 2020 to 2023 it can now easily be prevented by a common vaccine.  Any more you can think of for me?  Diseases and infections spread only through direct contact and are easier to eliminate and eradicate or prevent by antibiotics and vaccines and your white blood cells, (T cells, B cells, Neutrophils, etc.) antibodies and immune systems:  The Common Cold, obviously. No vaccine can prevent it, only antiviral drugs. (A virus)  The Flu, prevented by vaccine and Flu shot. (A virus)  Cancers (Caused by no bacteria, viruses, protozoa or fungi, just abnormal cell division.) T cells and bacteria and cancer radiation can stop this.  HIV (A virus) A virus.  Smallpox, eradicated worldwide by the world health organization and vaccines in 1980.  Chicken Pox, common in the USA till 1995. Both viruses.  Strep throat, prevented by antibiotics. A bacteria.  Cavity, treatable with cavity fillings, is a bacteria.  Ebola, a deadly virus that is preventable by vaccines.  Spanish Flu, Cholera, Athlete’s Foot, Strap, E. Coil, and Giardia, etc.", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgxFIQsOHwqNqXXZWWd4AaABAg.9b87kxatpwx9kahsCtpN3U", "comment": "Thanks for this...", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "Ugx4SzJgO8N7czu_Iex4AaABAg", "comment": "Humans have gone to moon, learned the bacterial cell wall molecule structure through organic chemistry, and sequenced their own DNA - but they can't use readable font size in slides.", "votes": "1", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgycKyTFe1UMLuX0-4R4AaABAg", "comment": "All thanks to God and  #Droziengbe on YouTube I was able to get rid of my herpes Virus with the herbal medicine I order from #Droziengbe", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugw-So09kpWlsxiUk8Z4AaABAg", "comment": "Herbal medicine i received from Dr Ogbebor herbal centre YouTube channel cured me.🌳🌳🌱🍀", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyTxWR3F3nrDaO4-Hl4AaABAg", "comment": "Great lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugy7vQj220_36mkZIe14AaABAg", "comment": "More mutations?.....is it the increased heat?clim changes?", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgynlTnaOKRgJ9oYSeV4AaABAg", "comment": "Mycobacteria....cell wall strongest? Hard to kill?", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgylHXCaxpwo22aSqe14AaABAg", "comment": "25 is age here ...i love mom.....dad less", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzFJeaaz3JmR3zm5wh4AaABAg", "comment": "I just want to say big thanks to Dr Itepu for helping me get rid of my herpes virus, please everyone if you are also infected with herpes virus please you can get in touch with Dr Itepu on his YouTube channel", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzpSzhfS9i5SD24b_x4AaABAg", "comment": "Wow! I could sit and listen to your professor all day long! She’s extremely smart and very articulate. I’ve graduated from 2 different colleges and I never had a professor this good..", "votes": "16", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzwNcRRyZKsspycFiV4AaABAg", "comment": "A few hours ago I just finished my final for microbiology and here I am watching a lecture of what I just studied.", "votes": "3", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxLzdKHDOAmR4w7A5d4AaABAg", "comment": "10:00 it's important to mention that all of these resistances take a toll on the replication rate and viability of the pathogens. Whereas normal E. coli would take 12 mins doubling time at perfect conditions, penicillin resistance will make it 2 hours doubling time.", "votes": "10", "replies": "2", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugwzo_oAtPJDASap6Pt4AaABAg", "comment": "I  am an electrical engineer and know zip about microbiology. This was fascinating. Thank you!", "votes": "8", "replies": "2", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwHepe-oTpDbocvOt14AaABAg", "comment": "My Thoughts.  \r Is Covid a Bio-Weapon?\r Are we common peoples being given a Mockery, of Disdain and Contempt,\r by and from “World Leaders”?  \r \r The Covid-Virus strains, like I have speculated from my research recently, can be killed by resonating them at 90.6 cycles per second. I have finally applied this from my research to success. This frequency oscillation does break up the Covid Formation and then it is excreted out, even if the Covid Formation was implanted in the body from a vaccination. \r \r Without this removal of the Covid Formation, it will likely stay in the body permanently, for the rest of one’s “life”.  It appears to grow, and by its very existence, causes constant damage by energy drain, infections held-in-place and also constant blood clotting formation. Concentrations of Covid Crystals are so far found in the lungs and heart.  This goes away with breakup and it is then flushed out by the body. It is likely, that from other toxic contents of the “vaccine” that people will have other problems, as Chromosome damage, that will result in long term problems of many sorts.\r \r What I also see, is that people that get Covid and/or Vaccinations are being permanently effected by Covid formation, in their bodies, even if they did not even get very ill with Covid or the Covid vaccination. Many of those that get Covid and “get over it” still have a low lying infection in their heart and lung areas as well as some blood clotting, that stays with them, until the Covid crystals are destroyed and expelled.\r \r There also seems to be other infections (held in place) in different parts of the body, caused by these Covid formations. Some people contract Covid and do not even get very ill and do not recognize that they have Covid and so it lies hidden to them and very subtly works against their good health. Unwittingly, they are carriers and spreaders of Covid. They sometimes say, “I have never had Covid”!\r \r It has recently been admitted that the Covid Identification Tests are very poor and miss a lot.  The recognition of Covid being concentrated in the lungs and heart and findable with x-rays, was by an independent Researcher and this works.  In my own tests, a high percentage of people now are carrying Covid, inoculated or not and do not know it.\r \r Let’s say your stress reduces and you feel a little better.  With a Covid Formation Implant in the body, a person can be resonated with a Covid Growth Wave-Form (from the air/sky or piggybacked on a radio/communication site) or breathe or ingest a solid form and it will once again potentially take hold and cause untold damage and even death. So, then are we presently being set-up to just be “sitting ducks” so to speak? After everyone is implanted with this Covid, or share it, will they then become puppets that can be dominated/manipulated or killed? Is Global Depopulation starting?  \r \r Is this system becoming “The Number Of The Beast”, “666”, prevailing over us, where we cannot engage in business or commerce, without the “Number of the Beast” or the “Number of his Name”? (A Green Passport) Or we can be forced to do things we know are against God’s teachings and values?  This violates our freedom of Religion!  Insurance companies are now writing clauses they won’t cover Covid.  Threats are coming that people can’t work without an inoculation.  Maybe they are banned from stores.  Businesses are closed.  Federal medical care, that you pay for with taxes, is now being considered to be withheld from you if people don’t get inoculations...\r \r Despite much prior speculation on Earth, here is a new thought. A God whisper. In Kabbalah, the way the spiritual number system works, is that each letter has a spiritually assigned numerical value, from 1 to 22 letters. You add-up all of the numbers for the letters of a word, for example, and then reduce the total to any number below ten (10).\r  \r After I wrote the first main part of this article it occurred to me to look and see if the letters for “Covid” answered up to numerical scrutiny and they for sure do. Most of us have never learned this. Let’s try this. Covid is C-11, O-16, V-6, I is 10, D is 4.  This becomes =47. Then if we add 19 to that, we get 66. Only two “6’s” of the mentioned three. Let’s take another word, “Corona”. The numbers for the letters of Corona are 11,16,20,16,14 and 1 and add up to 78. Reduced is 7 + 8 is 15, that then reduced again to 5 and 1 = 6.  Now you have a tiny lesson in Kabbalah. \r \r In Hebrew, the Numerical Value of “Covid 19” is 66 in their letter/number system. Where is the other 6?? Taking the letters of the word “Corona” in Hebrew, you find the other 6, so then in the words Covid 19 and Corona are 666 total. Are the enemies of God laughing at us, now and again?\r \r Remember that Faith Without Works is not viable! In the book “The Art of War”, by Sun Tzu, one of the Axioms is that, “Wars are costly and so it must be done in such a way that your enemies are made to pay for this war”. Paraphrased! Who is paying for The Covid Dominion? We The People are! Taxes, addictions and support of Toxic Businesses/countries fund the placement?\r \r My prayer is that the truth, the whole truth and nothing but the truth will come out and be disseminated far and wide in a good timely way! Know the truth and the truth will set you free, even from diseases. \r \r It is important to have good quality parts in a Sine Generator, so the signal is properly formed.  I’ve tested this idea before. Following is one source of a good Sine Generator, so you can start learning how to deactivate the viruses on your own:\r COPY\r     • Let us quote you our best price \r     • Toll Free (877) 571-7901 \r     • International (732) 728-2590 \r https://www.tequipment.net/GME/FG-2020/?rrec=true\r \r Initial procedure...90.6 C.P.S. exactly/precisely, for potentially 15 hours straight.  You won’t have the same equipment I do, though information to improve signal sending is in recent articles and videos. As Covid is statistically being continuously distributed around the planet, maintenance or crisis work can be done. So far, mild “other” symptoms may come up but pass quickly.\r \r I just run 2 wires from the sine-wave generators output around my chest. \r \r In Sincerity, Integrity and an interest in Truth, \r \r Cordially, Robert \r \r 14 August 2021", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwNsCIdp8m0kcvTIBx4AaABAg", "comment": "She is fantastic at conveying information in an easy to understand manor", "votes": "6", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzXTofsvaZXZG4QLpV4AaABAg", "comment": "Finally am healthy again...I thank God for using Dr Ebube to cure my sickness, on YouTube keep on saving life,God bless you sir", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyDeBY9SCJt6vfVYbh4AaABAg", "comment": "Thank you so much very good lecture", "votes": "2", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgydJW1uaF_C9MEyDMh4AaABAg", "comment": "Doctor, Ben Uda, has really made me so much believe in him by getting me cured with his herbal treatment. i really appreciate you Ben Uda on youtube channel for bringing back happiness into my life, visit his Facebook@ https://www.facebook.com/Dr-Ben-Uda-herbal-healthcare-108459721374234/ or Whatapp +2349055476554 .", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxeEgsr8kGaSRvSRaJ4AaABAg", "comment": "Herbal medicine is 100% guarantee of Herpes virus cure, the reason why most patient are finding it difficult to cure Herpes virus is because they believe on medical report, drugs and medical treatment which is not helpful to cure Herpes virus. Natural Roots & herbs are the best remedies which can easily eradicate Herpesvirus so herbal medicine is the best remedies for Herpes virus. I was once a patient of Herpes virus now I give thanks to spiritual Dr.okougo. Contact Dr.okougo Herbalhome on YouTube channel is there for you.", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgydyckAJ6G16hVF5nl4AaABAg", "comment": "fornicators spread Infectious Disease and other filthy people who can't keep their hands off of each other", "votes": "0", "replies": "1", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgycIfszFz662LrIGMh4AaABAg", "comment": "Damn it. It's so helpful.", "votes": "1", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxLzdKHDOAmR4w7A5d4AaABAg.9SvM8ZuRSvcA3I4lzNtnIL", "comment": "I've heard of doubling times as little as 20 minutes but never 12", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgxLzdKHDOAmR4w7A5d4AaABAg.9SvM8ZuRSvcA6yFp4QA-NZ", "comment": "Functions of different white blood cells:  Neutrophils: The most common white blood cells, they eat and consume any bacteria, virus, protozoa or fungi that first enters the human body usually in an injury or anytime. It is the immune system’s first line of defense.  Eosinophils: A type of white blood cell that targets and destroys allergens and fungi and anything that gives the body allergies.  T cells: A T cell is a lymphocyte that destroys and kills bacteria and viruses, protozoa and fungi while they are infecting cells or any cells being infected by bacteria, viruses, protozoa and fungi in total, or abnormal cells like Cancer, they also alert the immune system when dangerous germs are present and give information to B cells to create antibodies. Antibiotics and antiviral drugs also help T cells kill bacteria and viruses while they are infecting cells or kill cells once infected.  B cells: A B cell is a lymphocyte that creates antibodies which they use to bind to germs like bacteria, viruses, protozoa and fungi to render them useless and kill them and kill them before they can infect any cells, antibodies are also used to stop the body from getting sick and infected from the same infection and germ over and over. Vaccinations can help B cells gain the information they need to create antibodies for a specific type of bacteria, virus, protozoa or fungi to use to kill those bacteria and viruses and protozoa and prevent the body from being infected by them.  A B cell can only stop a germ from infecting! T cells can only kill cells once infected or even germs while they are infecting cells!             (lymphocytes) The immune system’s second line of defense after neutrophils.", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "Ugwzo_oAtPJDASap6Pt4AaABAg.9SQnrHo5tjv9WFjf9qksLl", "comment": "yo my fellow electrical engineer,  same brooo", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "Ugwzo_oAtPJDASap6Pt4AaABAg.9SQnrHo5tjv9WFjfJNnZsN", "comment": "yo my fellow electrical engineer,  same brooo", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgydyckAJ6G16hVF5nl4AaABAg.9OB964VQeA59PFQyrgYOqv", "comment": "You need some urgent help", "votes": "1", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgzGxi4GHSnJzjQMpHt4AaABAg", "comment": "love out yo", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugwvin1TlBSb_YL0xiB4AaABAg", "comment": "very grateful to find such prof to make bacterial resistance more clear thanks alot my darling", "votes": "3", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzsknMopc1f3aiwBz14AaABAg", "comment": "I've been suffering from Morgellons condition since I was 24 years old. I'm now 29. Why is there no treatment?  https://youtu.be/N5aDt7Dv9QI", "votes": "1", "replies": "1", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugyt6JjvzZ2ttqnv2Hx4AaABAg", "comment": "The lasy try end my life", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugxq5e22bnD4-7twEit4AaABAg", "comment": "As specialist, I do believe Womezon Remedy is good way to cure your bacterial vaginosis issue naturally . Why not give it a shot? maybe it can work for you too.", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxCLBgMef9FpK7ddB14AaABAg", "comment": "Guys. treat your bacterial vaginosis issue naturally does not need to be hard (I used to feel it did). I'll give you some advice now. Get a bacterial vaginosis treatment called Womezon Remedy (do a google search). Thanks to it I have cure my bacterial vaginosis issue naturally . I should not even be talking about it cause I do not really want lots of other guys out there running the same game but whatever. I am just in a excellent mood right now and so I will share the wealth lol.", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzUuQL6c1qqCPAuLWp4AaABAg", "comment": "thanks alot", "votes": "2", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugyxx9ED-fs7dzYhYhd4AaABAg", "comment": "Wow.. Thanks MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwNZyvaeVCsCcM1dvV4AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "5", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgyWpch07vJgZHkPPQd4AaABAg", "comment": "Good lecture. Thank you.", "votes": "3", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "Ugw3t1SI0j8aiJEraQt4AaABAg", "comment": "Thank u ma'am", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwdmYWx-rQrKqewKkR4AaABAg", "comment": "Here are some yoga asana which is very helpful and really works if you do it regular https://yogalifetips.com/how-to-overcome-infectious-diseases-by-yoga-and-some-tips/", "votes": "0", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgxGRRlzBdppsBTwq0t4AaABAg", "comment": "very good and educational video, this teacher's awesome!", "votes": "2", "replies": "1", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwJnL1zN7h2aBZpR414AaABAg", "comment": "I bring good news to you guy, especially does of you battling with any viral or deadly diseases, such as HSV1&2, hepatitis,cancer,diabetes, e.t.c to get rid of these diseases through natural herbs totally, not just reducing the out breaks..contact Dr Hopkins.. Am a witness to the effectiveness of his medication, get natural herbs cure from Dr. Hopkins let me know if you want to get his info", "votes": "2", "replies": "", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgwRko6mM9m1CofNz8p4AaABAg", "comment": "Those students are probably working on covid 19 vaccine right now", "votes": "13", "replies": "2", "reply": false}, {"vid": "7gLcuMtM_HY", "cid": "UgzsknMopc1f3aiwBz14AaABAg.9L7hGnhL0kB9OD2LTerJKQ", "comment": "Herbal medicine is 100% guarantee of Herpes virus cure, the reason why most patient are finding it difficult to cure Herpes virus is because they believe on medical report, drugs and medical treatment which is not helpful to cure Herpes virus. Natural Roots & herbs are the best remedies which can easily eradicate Herpesvirus so herbal medicine is the best remedies for Herpes virus. I was once a patient of Herpes virus now I give thanks to spiritual Dr.okougo. Contact Dr.okougo Herbalhome on YouTube channel is there for you.", "votes": "0", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgxGRRlzBdppsBTwq0t4AaABAg.9EZi0RTvFGo9Kyph_XDaTE", "comment": "Professor", "votes": "1", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgwRko6mM9m1CofNz8p4AaABAg.9Bv0q4azoha9F-ugey2xCb", "comment": "This is a introductory level course.  You don't get to work on vaccines and such until you graduate and even then you wouldn't be leading any studies. You usually need a Ph'D and that takes at least 6 more years after the initial 3 or 4 years to get your B. Sci", "votes": "6", "replies": "", "reply": true}, {"vid": "7gLcuMtM_HY", "cid": "UgwRko6mM9m1CofNz8p4AaABAg.9Bv0q4azoha9G2RkHm9Xnm", "comment": " @diannemurray  maybe when they aren't MIT students ;)", "votes": "6", "replies": "", "reply": true}]