[{"vid": "7xJPSuSVmSk", "cid": "UgweeUs--vozbaN_I7d4AaABAg", "comment": "impirialli’s animation for the win🎉❤ so good so low key goood", "votes": "0", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "Ugx2GbQBr_AZ8menI7Z4AaABAg", "comment": "there's one thing she said that I am not sure about: if a non-sense mutation causes the translation to stop, you end up with a truncated protein, that most probably is not functional, so it's going to be degraded. That can be a huge problem if that's the only allele coding for such a protein, as your organism can't make any functional protein. Am I correct?", "votes": "0", "replies": "1", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgzYWujElSE33Q0FHAV4AaABAg", "comment": "I suck at chemistry i still watched all lectures hahah, professor Barbara is very engaging", "votes": "0", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "Ugw8drEOS-mBeRSck0l4AaABAg", "comment": "I am a huge fan of Prof Imperiali. I am hooked on her lectures LOL although I've done genetics before in med school. I am learning so much!", "votes": "6", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgxfZGeksN2LQzidTBx4AaABAg", "comment": "(On Tuesday of January 31, 2023).  On The Matter of mRNA Processing in the Process of Translation (Gene Expression Axis):  1) Mature Messenger RNA (Post [Pre-mRNA]) Post Processing and Splicing; 2) The Discovery of Three Nucleotide by Crick and Brenner (1961) for Each Amino Acid (3NTs Per AA); and the Discovery of the Translation Site, the Ribosome itself (By Claude, De Duve, Palade); to the Proteomics of a Ribosome (2000) By Ramak et al.); 3) Transfer RNA (tRNA) Structure and Function Thereof (With Hydroxyl end (-OH Group Serving as The Binding Site For the Amino Acid [AAtRNA Synthase-dependent] with Enzyme-tRNA-Amino Acid Specificity) and the Anti-Codon Binding Site [Binding Site To Codon of mRNA]); Anti-Parallel Binding of Codon-Anticodon (tRNA) Basic Chemistry and Configurations; 4) Genetic Code Of the DNA Molecule only has Phenotypic Meaning (Structure Thereof) Because Each Codon of (mRNA) does have a Specific Amino Acid (For Humans there is 20 [Sometimes 21 for Selenocysteine Amino Acid]) Pairing (Guided by the Various Side Chain Chemical Characteristics [Polarity, Positive Charge, or Neutral]) as Proteins Structure and Function is a Function of its Amino Acids (Amino Acid Dependent) a) Degenerate Nature of Codons (There are Multiple Possible Three Nucleotides Specification i.e. Leucine AA has Six Possible Codon Configurations) where Speciation is Probably a Function of the Amino Acid Degenerate Version or Species Specificity in Codon Degeneracy; 4) Loading the Amino Acids; 5) Size of Ribosome and Complex Proteins (A Large along with a Small [A Protein Factor]) and Various Peripheral Cofactor Proteins;  6) Energy Consuming Processes of Translation where GTP solventizes the Transfer of Codon-Anticodon Reaction of Binding (Initiation of Translation and The Release Therein); and ATP is the Molecular Ergonomic Factor in Transferring AA to (tRNA)at a Rate of 20 AAs/S (about 60 Nucleotides bases/S) otherwise consistent with Nucleic Acid Transcription Biosynthesis Rates (DNA Replication Rates are 50 BP/s); 7) (mRNA) Molecule can actually have multiple Ribosomes Attached configuration which is denominated as a Polysome;  Protein Degradation and Regulation; Translation Errors and Autosomal Origin Errors: 1) DNA Point Mutations (pathological Variation) as the Mechanism of Inherited Autosomal Recessive Aetiologies; 2) Non-sense Mutation (DNA error leading to a RNA Translation Manifestation); this is also known as Frameshift Mutation (prematurely Stopped Protein Synthesis), usually Degraded without much other manifestation;  3) Silent Mutation has no Effect on Translation because even though an Error, it is not relevant to actual Protein Synthesis Product; the Protein is all the same; 4) Mis-Sense Mutation Without Phenotypic Relevance (Conserved) and those that do (Non-Conserved), As in Sickle Cell Anemia Pathology (Hemoglobin Abnormality);  And so is Protein Biosynthesis.  PhD Barbara Imperiali, es gut ist zu bauen Leben und Lieben auch weil das Leben sie muss haben.    Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgyXKvPTexosPzUQfFJ4AaABAg", "comment": "33:40", "votes": "0", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgzhvAkC1gh1_ImI6yN4AaABAg", "comment": "I like blackboards .....", "votes": "0", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgxbujTMT7b7XoPK55R4AaABAg", "comment": "She is saving my Biology Grade like hell", "votes": "2", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgxGQEyeVxrpB9cqVHJ4AaABAg", "comment": "👍👍👍👍👍👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgzSmb8-0nY24pmi1wN4AaABAg", "comment": "She explains so nicely,  my prof just sends out a PowerPoint instead of lecture and calls it a day", "votes": "13", "replies": "1", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgwHqnK8bddp3-HzHoJ4AaABAg", "comment": "i like this professor. she's happy to give a lot of information.", "votes": "4", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "UgxJjDgbgEadT6uoGeR4AaABAg", "comment": "thank you professor you have helped me  much in my  biochemistry university examination", "votes": "3", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "Ugwx3NpAMirnS1Po9TF4AaABAg", "comment": "MIT be coming through. I have an exam the day after tomorrow and was looking for a nice set of videos to further understand. Thank you so much! The professor explains it so nice and concise even a highschool student like me can understand!", "votes": "17", "replies": "", "reply": false}, {"vid": "7xJPSuSVmSk", "cid": "Ugx2GbQBr_AZ8menI7Z4AaABAg.A04mLJJ4npYA2VojXipgFE", "comment": "I too thought of it. I am not sure, but I suppose she meant that they are less dangerous since in the case of the sickle cell anaemia the incorrect protein causes damage whereas if there were no protein at all (e.g. blue eyes), it would cause less or no harm. That is just my guess though", "votes": "0", "replies": "", "reply": true}, {"vid": "7xJPSuSVmSk", "cid": "UgzSmb8-0nY24pmi1wN4AaABAg.9FC212p9fQr9HUlYbj_53b", "comment": "Anna Mouse 😂😂😂", "votes": "0", "replies": "", "reply": true}]