[{"vid": "83-yKXuRDGc", "cid": "UgyZnLMOQuSKlnunMCV4AaABAg", "comment": "Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugyqmvx2r9MEw6fG7Yp4AaABAg", "comment": "(On Saturday of February 4, 2023).  Single Nucleotide Polymorphism (SNPs) and Human Genetics on the Matter of MIT OpenCourseWare in the Docency of Introductory Biology:  1) Sanger Method (Frederick Sanger Is an Initial Pioneer in DNA Sequence); 2) Aniridia (Disease of Iris Development Attributable to Genetic Inheritable Metabolic Disease) has known (speculative) Autosomal Recessive--Actually Dominant--Inheritance Pattern (Cloning of the gene of Loss of Function) to Investigate Aetiology and Mechanism of Developmental Diseases; 3) Inheritance (Genetic Variation Transmissibility); 4)  Positional Gene Cloning is the Reproduction In Vitro of a Gene (Allele when it is Object of Investigation) based on Position of Chromosome (Karyotyping Visualization and Staining);  5) Linkage Mapping to identify Molecular Markers linking the Disease and Genotype (Genomic Assessment); a) Microsatellite via Gel Electrophoresis will establish Locus of Gene; b) Physical Map shows Recombinant Pieces of Gene within The Chromosome (Cytogenetic FISH Methodology); c) Microsatellite Analysis and Chromosome Walking; d) Identification of a Gene of Interest (GOI; or Protein Product Identification); e) Transcribable Gene Assessment (In vitro) by Assess Proteomic or Synthesis Product Positivity; f) Eyeless Gene Illustration with Transcription  and Translation Correlation in In Vitro Results in Fly Phenotype-Genotype Assessments; g) C-DNA (Complementary DNA) and Library will complement a (mRNA) Molecule and Purification Of Mature RNA on the Basis of Affinity Of the Molecule (Buffering and Sterile Washes) for Poly-dT (Polyadenylated Tails and Capping Mechanics Particular to RNA Molecule); h) Central Dogma of Biology and Modern Science also: 1) DNA; 2) RNA; to 3) Protein Product (Protein Synthesis or Regulatory Regulation or Silence Also Possible); 4) Reverse Transcriptase (RNA-Dependent DNA Polymerase) an MIT Recombinant Discovery; 5) RNAase H for (mRNA) Degradation and Synthesis of Second Strand (Primer Utilization); 6) DNA Polymerase to get to DS-DNA (Reversibility of Central Dogma Hypothesis proved by Viral Processes like Bacterial Recombination Reversal Technology in CRISPR Cas 9;  6) DS-DNA (Recombinant Type) has no original DNA Transcription Genomics of Introns, Promoters, No (Non Transcribed Regions [NTRs]), No (mRNA) Structures, and Others; 7) Understandably, the C-DNA Genetics (Quantity) is Directly Proportional to Expression of Gene (Gene Product Manifestation of Protein Synthesis); Therefore C-DNA Library would Lack any Genetic Expression if Gene Product was Absent (Central Dogma Positive). Tissue Type similarly would influence the C-DNA Library where for there to be Product there must be Genetic-Genotypic Encoding Somewhere; 8) CDK (Cylin-Dependent Kinase) Gene is a Celebrated Discovery because of the Effective Reversal Engineering of Signaling Genes and Transfection of Such into Yeast (Saccharomyces cerevisiae) by the Methodology Herein Described by Professor;  9) Hybridization (In Situ Hybridization is Medically useful to Identify Genetic Variation in Diseases) shows irrelevance of Sequence Identification or Specificity when Base Pairing and Single Clone in (cDNA) Libraries are Used and Florescence Radio Probe Identification (FISH) is usable (Recombinant Clone and DNA Denaturing and Radio Probe Binding Thereafter and Visualization is a Positive Result for GOI or POI);  1) PAX 6 Gene and Highly Conserved Evolution wise between Species (Fly to Humans) and has been identified to have Regulatory Function in Development (Morphogenesis) Specifically to the Eye; a) Fly Tissue of Optic Neural Origin has been grown due to dysregulation in Embryogenesis and Correlated to Variation Type (PAX6 Variants must be in the Millions however);  Technology is not Terror, but the Ideation and Application is. PhD Adam Martin, Lebensraum muss sauber und rein weider Sein oder vernichten es Alle soll Sein.  Heil!", "votes": "1", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugx0cVSjpH5M6JPwPbF4AaABAg", "comment": "Miles is not Malik bro cmon", "votes": "2", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "UgwpvPZs0ndaG3uPZRh4AaABAg", "comment": "All seeing fly :)", "votes": "0", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugwf30DRG5J2LuM5qGd4AaABAg", "comment": "Is it really ok to use term infected with heritable genetic disease when speak about this disease phenotype?", "votes": "4", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugwwv9G1Z8LA9rqnkdV4AaABAg", "comment": "What does it mean when they say open courseware ? Is it from their actual university courses ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugz0mUwX47CdXV-ukd54AaABAg", "comment": "--- https://www.youtube.com/watch?v=2UwEjxduHM0---", "votes": "0", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "UgwagD9AnJ_Z3xRkmJ14AaABAg", "comment": "\"Stan Lee doesn't mention if Cyclops is a PAX6 mutant\" 😂", "votes": "4", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "UgxsM9Wnmod9lTCCddp4AaABAg", "comment": "\"This is MIT. This is a no-compliment zone.\" OMG", "votes": "11", "replies": "1", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "UgwntnVc1Wrib6lV9JV4AaABAg", "comment": "👍👍👍👍👍", "votes": "0", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugyo9l-_OmasQ_LIShp4AaABAg", "comment": "This vid is full of knowledge! I have been trying to search for a video like yours that breaks down everything in this video! 👩‍⚕️ 👨‍⚕️ The part at 1:29 is my fav. Your breakdown is like the content of Dr. Ethan! Ethan's demonstrations are knowledgable and I really learned a lot for diet.  Go watch his YT out and give Doctor Ethan a subscribe! ➡️ #StudentDoctorEthan", "votes": "0", "replies": "", "reply": false}, {"vid": "83-yKXuRDGc", "cid": "Ugwwv9G1Z8LA9rqnkdV4AaABAg.9UMFp3KZxNh9UMpFgVYZjc", "comment": "Yes, these are actually courses from Massachusetts Institute of Technology published under a Creative Commons license CC BY-NC-SA (Attribution-NonCommercial-ShareAlike International). Here is a short video about us: https://youtu.be/XUM4lLbG5UY. See https://ocw.mit.edu/about/ for more information.", "votes": "7", "replies": "", "reply": true}, {"vid": "83-yKXuRDGc", "cid": "UgxsM9Wnmod9lTCCddp4AaABAg.9KCjVmbMkLoA2K_41jN_Kn", "comment": "Fr lol. It's even on their timestamped markers instead of \"complement\"", "votes": "0", "replies": "", "reply": true}]