[{"vid": "9iJryWzLDIw", "cid": "UgxBqy7gkfYOkZekJ6h4AaABAg", "comment": "For those who said \"I don't understand this\"... As far ad I can tell, this series is one of the BEST tutorials you can find in earth about fourier & other math topics in engineering,  If you still cannot understand what he said, that means your math sucks and this is not for you. Stop learning something that you are not going to use in your whole life.", "votes": "2", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgjF-qYTI6kU5XgCoAEC", "comment": "that was very useful, many thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "Ugx-s_1KLmu0lgU8s854AaABAg", "comment": "@stearin1978 You got a good point, I happen to be more dedicated and focus now that I do online classes without having a Teacher \"simplifying\" everything as you said. It is rare to have a well dedicated educator that cares to know if his message is been understood. But it took me a while to get to this point, call it lack of motivation, so yes you are right students should try to be well prepare on advance so the class is more interesting and more like a mentor-student approach. ", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgxCwzwzgsflIpF1h-R4AaABAg", "comment": "@Zydanaa all he uses is school mathematics and a little. he makes clear a lot for me and makes things simple. certainly you have to do homework to show you understand and to see you understand. what is more strange thing for me is why smart students need teacher that simplify everything? ", "votes": "0", "replies": "1", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgxB47JfBUrmfT_yuXd4AaABAg", "comment": "He seems to be talking to himself all along, he makes the question, he answer them and he keeps writing, without stop. It is like having to fill the board with formulas will somehow fly into the students brains. How does he knows if the students are understanding the topic.", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "Ugz1NDGnKnGOheUEXWx4AaABAg", "comment": "don't know any thing what did he say about? ", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgyHu24fg8GQGS64I014AaABAg", "comment": "don't know any thing ", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgzgNEJlHUgkOTRgGMd4AaABAg", "comment": "Even though I don't understand this... It seems cool !", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgwPzdsHvPaiAAUGv114AaABAg", "comment": "He's a good lecturer  but nobody knows how he applies all this theory in everyday science  job.", "votes": "0", "replies": "", "reply": false}, {"vid": "9iJryWzLDIw", "cid": "UgxCwzwzgsflIpF1h-R4AaABAg.8GcZQLEn2Zs8yxoxZ-8fkW", "comment": "No all, certainly, but I would venture to guess that most \"smart\" students have been taught like this all through their education experience.", "votes": "1", "replies": "", "reply": true}]