[{"vid": "9WZv2mAG07o", "cid": "UgwN4YhUuU6CXO-NqHN4AaABAg", "comment": "so much better than reading the chapter on my own! THANK YOU  SM", "votes": "1", "replies": "", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgxBEcupyBTnhMrm4454AaABAg", "comment": "please come teach at UNC-CH", "votes": "0", "replies": "1", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgyDHQbhcglgxoOQ0J14AaABAg", "comment": "Thank you soo much sir!", "votes": "2", "replies": "", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgxR4gFr16yc3az5pnV4AaABAg", "comment": "Can you please tell me , what was the content that was taught in lecture 9 & 10 , so i can read it from book , before jumping to the 11th lecture ??", "votes": "0", "replies": "2", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "Ugx-h3u5mhelyb8rGKh4AaABAg", "comment": "I wonder if there is a problem with classifying membrane proteins. I think the Lipid Linked proteins are also Integral membrane proteins. I checked the book. In the book, Lipid linked proteins are in the class of Integral proteins.", "votes": "0", "replies": "3", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgyIkW_D2BgqtUU_aWN4AaABAg", "comment": "Thanks so much Dr, do you have lecture 10 in analysing gene and genome . I am following your lectures", "votes": "2", "replies": "1", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "Ugzs1pJKk5Ue7EWUQYB4AaABAg", "comment": "Sir could you add MCQs questions in each chapter to support understanding", "votes": "1", "replies": "", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgzovtatrLNHitn2vxF4AaABAg", "comment": "Sir I am Intrested in communication with you for little helping could you put your email at least because we already studied it. In sometimes I will need help and no one can help me. Could you put you email", "votes": "1", "replies": "1", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "Ugwp4uyKccPsCp-KkQh4AaABAg", "comment": "This is amazing explanation of this book I like it", "votes": "5", "replies": "", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgwioHGqXl15i3wg2XB4AaABAg", "comment": "Very helpful lecture. Thanks for all the effort!", "votes": "4", "replies": "", "reply": false}, {"vid": "9WZv2mAG07o", "cid": "UgxBEcupyBTnhMrm4454AaABAg.9utc9WIbMx09uu6iVT8UmC", "comment": "Not only did this make me laugh out loud, it’s also the nicest compliment I’ve gotten in awhile. Thank you, Amaris. And best of luck in your course!", "votes": "0", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "UgxR4gFr16yc3az5pnV4AaABAg.9ehLHGDq7GT9ehmNSetlgC", "comment": "This course was built as a typical one semester Cell and Molecular Biology course (using Alberts’ Essential Cell Biology as its text). The first half of the course up through Lecture 9 focuses on molecular biology and then the second half is devoted to cell biology. Lecture 9 is on analyzing genes and genomes (experimental techniques for molecular biology research) and Lecture 10 marks the pivot to cell biology as an overview lecture: Introduction to Cell Biology. All of these lectures are available on my Cell and Molecular Biology channel here on YouTube.", "votes": "0", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "UgxR4gFr16yc3az5pnV4AaABAg.9ehLHGDq7GT9ehwIxnNriS", "comment": " @thomasmennella5501  Thanks a lot , found them 😍", "votes": "0", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "Ugx-h3u5mhelyb8rGKh4AaABAg.9dcpyIP2JY39dpYCY_X8WQ", "comment": "Thank you, Eymen, for such a thought provoking question. And, indeed, finding a conclusive answer has been frustrating. You’re correct that some lipid anchored proteins are classified as integral. Also, though, other GPI-anchored membrane proteins are classified as peripheral. And, a wonderful paper by Guo, et al from 2018 argues that we, in fact, need three classifications of membrane proteins: integral, peripheral and lipid-anchored.  This is partly due to the ambiguity around this issue. Again, great question!  So, it seems the only answer I can provide is an unsatisfactory one: there is no blatant error in this lecture video because some lipid linked proteins are peripheral, but some are integral as well. To me, this is another example of the nuanced complexity of biology and our incompatible desire to classify all of life into neat bins and boxes.  Just as a cell could never answer if it is in very late metaphase or very early anaphase (due to the boundaries between the phases of mitosis being quite blurry), it also appears that some membrane proteins cannot be clearly classified as peripheral vs integral. I learned something new here investigating this answer. Thanks so much for that and for your interest in my videos!", "votes": "1", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "Ugx-h3u5mhelyb8rGKh4AaABAg.9dcpyIP2JY39eGoashAMuw", "comment": " @thomasmennella5501  Thank you for your answer sir. It is clear now", "votes": "0", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "Ugx-h3u5mhelyb8rGKh4AaABAg.9dcpyIP2JY39eGoj1lrdF1", "comment": " @thomasmennella5501  And thank you for your lectures it was very beneficial. And it helped me to pass an important exam.", "votes": "0", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "UgyIkW_D2BgqtUU_aWN4AaABAg.9CoHGFpA_wk9Cp-P3DBEnO", "comment": "Thanks from the bottom of the heart Dr", "votes": "0", "replies": "", "reply": true}, {"vid": "9WZv2mAG07o", "cid": "UgzovtatrLNHitn2vxF4AaABAg.949wVoGDpBW9dctyUv5jIV", "comment": "Can you help my questions?", "votes": "0", "replies": "", "reply": true}]