[{"vid": "_dRXA1_e30o", "cid": "Ugzx8xLpYvBAGRuN-TV4AaABAg", "comment": "Gonzalez Michael Lewis Elizabeth Thompson Margaret", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxwVmlRXuOgyy2AH4t4AaABAg", "comment": "Robinson William Brown Patricia Thompson Ronald", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwWDrPup617KzJ4Vit4AaABAg", "comment": "Smith Timothy Anderson Lisa Thompson Elizabeth", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwSlPfJTPini42dekJ4AaABAg", "comment": "Clark Patricia Martin Helen Thompson Kimberly", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxN2Ce6g69tOkadCLl4AaABAg", "comment": "Walker Patricia Wilson Laura Garcia Carol", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyIIw2cgW7Q-TsJvXV4AaABAg", "comment": "Thompson William Lee Ruth Walker Steven", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz9uSV1iqkflcrqmd94AaABAg", "comment": "Jackson Angela Martin Dorothy Thompson Sarah", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzI6jML2tc-HUI60rZ4AaABAg", "comment": "Allen George Perez Helen Harris Timothy", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxbrkd20NQFbss25uF4AaABAg", "comment": "Martin Jose Perez Margaret White Jason", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxya-CBxdOcgWW0wil4AaABAg", "comment": "Got neuroscience class this minimester.  Came for the lock and key. 🎉", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugznk8imzNXZ7bqTZ0J4AaABAg", "comment": "Anderson Daniel Hernandez Dorothy Moore Karen", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwjRP2qvqjPYJmv5Bp4AaABAg", "comment": "Fossils can tell more than some people think. If some creature doubled its brain size, its head shape should've changed too etc.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxGF085US8ofB33F2p4AaABAg", "comment": "Man Space Station 13 is confusing.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwZfMdTGNKYW9932_p4AaABAg", "comment": "Wish they had the catch up sessions online too", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz0X__Aw6uMs1GLth94AaABAg", "comment": "He's brainwashed with bourgeois molecular biology, a pseudo science. God help us", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzbFZpG5XnhwYQYb5l4AaABAg", "comment": "51:43", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxvX3fTFZK-UPtbAad4AaABAg", "comment": "Amazing!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz24ghS11QGjrL9iRB4AaABAg", "comment": "Corea del Norte y Corea del Sur", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyawtD1hfm6ahWSqw94AaABAg", "comment": "I put some yogurt on my food after this", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyZW4ih_MvFuPRArdZ4AaABAg", "comment": "1:24:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz0X__Aw6uMs1GLth94AaABAg.A6WB58m0v3ZA6WuE3AYloD", "comment": "god no real", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz0X__Aw6uMs1GLth94AaABAg.A6WB58m0v3ZA6XPFoVGkzE", "comment": "Which god?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxNIqxJyzAb2CRgICJ4AaABAg", "comment": "4:55 21:50 32:25 47:30 1:12:25 1:30:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyktiqZ4bAgvFvGGbp4AaABAg", "comment": "Environmental catalysts? (Driving rapid mutation).", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwVnJzBoX_M2p20I6B4AaABAg", "comment": "Protein!!!!!!!!!😅😅", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxXTTZVDfSbR4jLDmp4AaABAg", "comment": "🙏💜💫🪶", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzg7Mzu_6xBBVh1lH54AaABAg", "comment": "I am watching this in May, 2024.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyy-ub9TeNoLl54HRd4AaABAg", "comment": "What a professor!! Wauu 🤩I still cant believe that we can assist to such lectures..  PS I think that insensitivity to androgens was also a case in Dr House 😄", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwY_AWxTcs-0_L95kJ4AaABAg", "comment": "listening to some of these gave me such a head start for my biology bachelor, 1 love sapolsky", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyV6EL2vP7IOe9QrO14AaABAg", "comment": "1:30:00 mothering affect on genes / epigenetic changes.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzMgzOfMBzb4_GqP9F4AaABAg", "comment": "No way people pay Stanford tuition for these lectures, these lectures are way too qualitative, he hardly ever uses the whiteboard for visual aid. Science is meant to be quantitative, in fact it NEEDS to be quantitative for it to be called a science.", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxoKKwMOvCAapEtox94AaABAg", "comment": "noob in biology here. I found some links to help me get the beginning of this lecture. so I ll post them here to help my fellow noobs.  DNA:  https://www.youtube.com/watch?v=6rv5Z8EBXwY RNA: https://www.youtube.com/watch?v=Y4p6jhFaru4 What is a protein : https://www.youtube.com/watch?v=wvTv8TqWC48&list=LL&index=3 And for amino acids i just  googled : what are amino acids. Feel free to share if you find better stuff/or correct if there is something wrong in this videos", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz2Tl_P0UYfmBmiz1N4AaABAg", "comment": "when you see a poney glyph rember to turn on your left the your right", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx-eXGFOaSMkrqwuY14AaABAg", "comment": "His clothes are soooo 80´s, to say the least.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzcyN_voiIBa71kEQN4AaABAg", "comment": "How's that for fucking retarded", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxnGBHrGvfvzzs6mMp4AaABAg", "comment": "This explains the covvid vaccine", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxGZVQyciU-hkziDwN4AaABAg", "comment": "Thank you youtube Algorithm", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy62xL1yPU9fvzvNGl4AaABAg", "comment": "I sincerely respect him, he is such a good teacher too.", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy3Wzj2aUeHHJOnxcV4AaABAg", "comment": "26:36 sex and gender are weird! but its very interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyfZOYZtdHF-3-LN5F4AaABAg", "comment": "So it’s Eric and Dylan 41:14", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzChSa0RIKFDlDcjap4AaABAg", "comment": "Stanford look they are the dumb ? They … said… hw 0:25 u know the other acronym 0:33", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxtgh43P0gUvy019iZ4AaABAg", "comment": "Does anybody know if it's possible to access the reading list which went with these lectures?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzMgzOfMBzb4_GqP9F4AaABAg.A0oG2G5a1YcA23IAT9okqY", "comment": "Pretty sure this course was designed so that even people without a background in science can keep up with it.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzMgzOfMBzb4_GqP9F4AaABAg.A0oG2G5a1YcA7cKN_JsvAw", "comment": "​ @OmniversalInsect  He literally says so in the first class 😅. There were even English majors", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxoKKwMOvCAapEtox94AaABAg.A0mWtHsK9VQA23IsZ_Mx2L", "comment": "Amoeba sisters is a very good channel for biology.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxe0bOm5d4z9CD6GdN4AaABAg", "comment": "Robert Sapolsky is hot", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyIwSHJfmo3X3CxzL14AaABAg", "comment": "Shaving developed so males could play females in theatre?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwbADm99gqD6tDw3dF4AaABAg", "comment": "29:47 Nowadays the same syndrome is called Androgen Insensitivity Syndrome or AIS.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwhQzIfdYv7SYCpSap4AaABAg", "comment": "Bookmarked for now.  I watched these lectures about 12 years ago. I looked for what I was hoping to understand - confirmation bias. Now taking notes and following up. Much to expand upon.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwbxS96wHyhIGqyHrR4AaABAg", "comment": "Listening to this while I read \"Folly of Fools\" by Robert Trivers", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyEjXewZuNn3N4WJvV4AaABAg", "comment": "I just want to listen to these awesome courses again. Great share.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgybD0N2828jIT5fFoV4AaABAg", "comment": "Identical twins do not agree with you", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwkHN0BRdvb-s503ap4AaABAg", "comment": "🎯 Key Takeaways for quick navigation:  00:00 🧬 Evolution and Criticisms - Overview of the course focus on interdisciplinary connections between behavioral biology and molecular genetics. - Criticisms of the heritability and adaptation concepts in the evolution of behavior. - Introduction to the importance of molecular biology in understanding evolution. 03:37 🧬 Sociobiologists' View on Heritability - Sociobiologists and evolutionary psychologists emphasizing heritability in behaviors. - Use of structured models based on genetics to explain behavior. - Molecular biologists' contempt for the sociobiologists' approach. 04:41 🧬 Molecular Biologists' Perspective on Evolution - Shift to molecular biology's perspective on evolution. - Emphasis on genes as molecules, specifying proteins, and their role in shaping behavior. - Introduction to the central role of proteins, DNA, and the flow of genetic information. 08:00 🧬 Proteins, DNA, and Shape - Explanation of the critical relationship between DNA sequences, protein shapes, and functions. - Importance of protein shape in interactions, illustrated by the \"lock and key\" analogy. - Exploration of how amino acids, proteins, and DNA contribute to the diversity of shapes. 10:45 🧬 Central Dogma of Life - Introduction to the central dogma: DNA to RNA to protein. - Overview of the flow of information and the significance of DNA as the starting point. - Mention of the violation of the central dogma with the discovery of retroviruses. 13:37 🧬 Importance of DNA Mutations - Discussion of mutations, focusing on the consequences of changes in DNA. - Explanation of point mutations, deletions, and insertions. - Emphasis on the potential impact of mutations on protein function and downstream consequences. 23:34 🧬 Microevolutionary Change - Overview of microevolutionary change resulting from mutations in proteins. - Discussion on how mutations affect the efficacy of proteins. - Connection between protein function and microevolutionary changes in the context of evolution. 24:58 🧬 Genetic Mutation Impact on Enzyme Function - Genetic mutation example: Phenylketonuria (PKU). - PKU results from a classical point mutation in a gene coding for an enzyme that converts phenylalanine into a safer form. The mutated enzyme loses its function, leading to the accumulation of toxic phenylalanine and causing neurological damage. 26:24 🧪 Hormonal Mutation: Testicular Feminization Syndrome - Example: Testicular Feminization Syndrome (TFS). - TFS involves an androgen receptor mutation, leading to insensitivity to testosterone. Despite high testosterone levels, individuals with TFS develop a female phenotype. This highlights the role of receptor mutations in gender expression. 30:08 🧬 Mutation in Testosterone Biosynthesis - Disease example: Mutation in testosterone biosynthetic enzymes. - Mutations in enzymes involved in testosterone production can result in individuals born phenotypically female with extremely low testosterone levels. Puberty triggers a surge in testosterone, causing a transition from female to male. 34:50 🧠 Neurochemical Signaling and Anxiety - Genetic variation in benzodiazepine receptors. - Variability in benzodiazepine receptor genes contributes to individual differences in anxiety levels. Examining these variations provides insights into the genetic basis of anxiety-related traits across different species. 40:01 🧬 Evolutionary Implications of Genetic Changes - Fox P2 gene as an example. - Analysis of the Fox P2 gene demonstrates how single base pair changes, driven by positive selection, can lead to significant evolutionary differences, especially in traits related to communication and language. 47:37 🧬 Genetic Relatedness and Evolutionary History - Clarification on genetic relatedness. - Sharing 50% of DNA with siblings and 98% with chimpanzees is not contradictory. The percentage reflects different aspects of genetic relatedness—siblinghood involves shared alleles, while the similarity to chimps highlights evolutionary history. 48:35 🧬 Genes and Genetic Similarities - Genes specify traits like antlers, dorsal fins, petals, pistils, and more. - Different species may share genes coding for similar traits, leading to genetic similarities. - The human-chimp genome comparison highlights a 98% similarity in genes coding for similar traits. 50:01 🧬 Types of Genes and Variants - Genes can come in different flavors or variants. - Discussion on the diversity of genes and the variations in traits they code for. - Highlighting the importance of understanding different versions of particular genes. 51:28 🧬 Evolution, Genetics, and Political Themes - Point mutations and gradual changes lead to genetic advantages in terms of evolution. - Emphasis on the role of competition in the evolution of behavior and species. - Connection between gradualism in evolution and its intertwined political and philosophical implications. 52:26 📉 Gradualism vs. Punctuated Equilibrium - Introduction to the punctuated equilibrium model by Stephen Jay Gould and Niles Eldridge. - Gradualism challenged; long periods of stasis punctuated by rapid evolutionary changes. - Exploration of the political themes associated with the two models and their contrasting worldviews. 55:07 🐚 Punctuated Equilibrium and Paleontology - Gould's punctuated equilibrium influenced by paleontology and fossil records. - Gaps in the fossil record lead to the idea of long periods of stasis and sudden evolutionary changes. - The role of paleontologists in tracing evolutionary lineages using fossil records. 56:58 🔗 Molecular Genetics and Gene Structure - Introduction to the modular construction of genes with exons and introns. - Discovery of splicing enzymes and their role in generating different proteins from the same gene. - Implications for tissue-specific gene expression and the combinatorial possibilities of protein variations. 01:07:41 🔍 Combinatorial Possibilities of Gene Expression - Baltimore's insight into the combinatorial possibilities of gene expression. - Discussion on the modular basis of gene construction leading to diverse protein outcomes. - The shift from one gene, one protein, to one gene generating multiple proteins. 01:11:54 🧬 Non-Coding DNA and Junk DNA - Discovery of non-coding DNA and the realization that 95% of DNA is non-coding. - Challenges to the notion of \"junk DNA\" and the quest to understand the function of non-coding DNA. - Recognition of the potential significance of non-coding DNA in genetic processes. 01:13:19 🧬 DNA Regulation Overview - DNA sequences are not the starting point of the central dogma of life; instead, they serve as the readout under the control of various factors. - 95% of DNA is dedicated to regulating genes, introducing the concept of regulatory sequences upstream from genes. - Promoter and repressor sequences are stretches of DNA coding for switches, influencing the activation or deactivation of gene transcription. 01:15:34 🔄 Transcription Factors and Gene Expression - Transcription factors are molecules, usually proteins, that bind to specific DNA sequences (promoters) and activate or inhibit gene transcription. - Different genes can share the same promoter, leading to the activation of entire networks of proteins with functional similarities. - One gene can have multiple promoters, responding to different signals, allowing for versatile gene activation in various contexts. 01:19:19 🌐 Environmental Regulation of Gene Expression - Gene expression is regulated by environmental factors, either within the cell or from external sources like hormones or chemical messengers. - Environmental signals, such as low energy levels, can activate transcription factors, influencing the transcription of genes related to energy regulation. - Hormones, like testosterone, can travel through the bloodstream and affect gene expression in distant cells, showcasing the impact of external environments. 01:24:33 🔄 Contextual Significance in Gene Expression - The most interesting aspects of DNA lie in the regulation of when genes are turned on or off, not just the properties of the proteins they encode. - Emphasis on the modular ability of one gene to generate diverse proteins based on different contexts, introducing \"if-then\" clauses in gene expression. - Contextual regulation, rather than the protein's intrinsic qualities, adds complexity and richness to understanding genetic information. 01:27:23 🧬 Chromatin and Epigenetic Regulation - Chromatin, the structural stabilizer of DNA, plays a crucial role in regulating access to DNA sequences by transcription factors. - Chromatin remodeling, influenced by environmental factors, determines whether transcription factors can access DNA, adding another layer of regulation. - Epigenetics, focusing on heritable changes in gene function not caused by alterations in DNA sequence, introduces the concept that development is all about epigenetics, not just genetics.  Made with HARPA AI", "votes": "9", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyWqP0guPV1Mvkmcmh4AaABAg", "comment": "Molecular Biology and Genetics seek to understand how the molecules that make up cells determine the behavior of living things. Biologists use molecular and genetic tools to study the function of those molecules in the complex milieu of the living cell. Groups in our department are using these approaches to study a wide variety of questions, including the fundamental processes of transcription and translation, mechanisms of global gene control including signal transduction pathways, the function of the visual and olfactory systems, and the nature of genetic diversity in natural populations and how that affects their evolution, among others. The systems under study cover the range of model organisms (bacteria, yeast, slime molds, worms, fruit flies, zebrafish, and mice) though the results of these studies relate directly or indirectly to human health.  Could anyone rewrite it for me in his own words please ?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgykftKIpjnLXThFBYp4AaABAg", "comment": "F e muito muito forte mas é só falar sobre g Du ND gente se vê se ele pode ir lá e muito obrigada", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxWIfDsOqZRNA8ftlx4AaABAg", "comment": "Tô aqui fora esperando aqui terça feira se Deus quiser vir aqui e muito muito forte mas se quiser ir lá buscar os momentos e muito obrigada por ter vindo as coisas ai sim entendi agora só, r é só r e muitas felicidades sempre vcs estão fazendo oq hj e muito muito forte mas se quiser vir amanhã né se fala comigo e muitas alegrias e felicidades sempre e muito muito muito forte mas é só falar pro hospital agora", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxL0NMT91LlXvzMJvN4AaABAg", "comment": "G e muito muito lindo e maravilhoso e maravilhoso e muito muito e muitas felicidades e muito muito forte mas se Deus quiser ir lá e te falo ok bjs fica até às três horas é só falar pro trabalho amanhã às noite e muito obrigada pela informação e muitas alegrias e muitas felicidades sempre e muito muito forte, mas é só e muito muito forte e ET, r e", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzqvUQEGpwKBj3pI2h4AaABAg", "comment": "Fala alguma r viu se ele for buscar as crianças estão muito felizes e muito muito forte mas é só r viu se fala alguma coisa ER hoje né se ET ER ir pro trabalho e muitas alegrias e felicidades e muito muito muito muito forte mas é só r viu é muito muito caro mesmo e muitas alegrias sempre vcs estão lindos e muito obrigada pela informação sobre os", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyZL-OFha6kqjrZpk54AaABAg", "comment": "V se fala alguma coisa ER hoje né amiga é muito muito forte mas se Deus quiser ir lá e muitas felicidades sempre e muito muito muito forte mas é só falar pro hospital é é e é é é é é é só falar sobre as coisas ai sim hein se fala alguma coisa ER e", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzE3bnaBiN89CecFrV4AaABAg", "comment": "DJ Henrique Henrique e muito muito", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwbEZPdRcgqiMnmuP54AaABAg", "comment": "F xi w r viu e muitas felicidades e muito muito forte mas é muito muito lindo esse valor e muito obrigada por favor se for w r e muito obrigada por ter vindo é só chamar ele ir amanhã então só, se for w se for por causa das pedras e muito obrigada por ter vindo as coisas ai Sim e muitas é é só r viu e muitas felicidades sempre e muito obrigada pela atenção por favor", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw6xYtzfXPiPOTfgrp4AaABAg", "comment": "G e muitas felicidades sempre e muito muito muito forte mas se Deus quiser vir aqui tô esperando vcs vão vir buscar as coisas ai sim entendi e muitas alegrias e muitas felicidades sempre vcs vão sair amanhã às noite é é só falar sobre os é é é é é só falar pro hospital aqui esperando vcs estão fazendo oq Deus abençoe vcs e seus amigos são Paulo e", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxKdm2SizFjESRT97Z4AaABAg", "comment": "G e muitas felicidades e muito muito muito forte mas é só falar pro hospital agora é r é só r e muitas alegrias e felicidades e muito muito muito muito muito forte mas é muito difícil né amiga é só falar sobre as coisas ai sim entendi e muitas felicidades sempre", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxR-cKAwyaqMP_Jcf14AaABAg", "comment": "V se fala alguma r viu e muitas alegrias e muitas felicidades e muito muito muito muito forte mas se quiser vir aqui tô esperando vcs vão vir aqui tô aqui fora esperando aqui terça e muitas alegrias sempre vcs estão lindos e muito muito muito muito muito feliz aniversário e muita saúde", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxKyyTUHq9Z8X4DhCZ4AaABAg", "comment": "G e muito obrigada por favor se for w se fala comigo e muitas felicidades sempre e sempre vcs, vão sair hoje né amiga é só falar sobre as coisas por aqui e muitas felicidades sempre e muito muito forte mas é só falar sobre os momentos bons e muito obrigada por favor te amo tanto e muito muito muito muito muito muito forte mas", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgybD0N2828jIT5fFoV4AaABAg.9x6wh80JPvQ9x6x3_xbftN", "comment": "Does he stop talking", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgybD0N2828jIT5fFoV4AaABAg.9x6wh80JPvQ9x6x9fnuoXa", "comment": "-2", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwUscDUOVSdgT1JyVd4AaABAg", "comment": "F e é é só falar sobre os dias e muitas felicidades sempre vcs vão vir aqui e muito obrigada pela informação e muito obrigada pela atenção por favor te amo tanto e muito muito forte e muitas alegrias e muitas alegrias e felicidades sempre e sempre vcs estão lindos né amiga é só r e muitas alegrias sempre felicidades sempre vcs vão vir buscar f e muito obrigada pela atenção e muitos dias quando estiver pronto", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgypYT8m9cP_AsaF_v94AaABAg", "comment": "Gh e muitas felicidades e muitos dias", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwDA4sGK487-bp2-3p4AaABAg", "comment": "C BB GG", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyJtCn9_AeUeIblUnp4AaABAg", "comment": "F e muito muito forte mas é só é é é só falar sobre os dias e muitas felicidades r e muitas alegrias e felicidades sempre vcs estão fazendo as coisas por aqui e muitas é só r e muitas felicidades e muito muito forte mas é só r viu se ela amanhã é feriado né amiga é e é só", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwa1Apcr1DNeh6RY2x4AaABAg", "comment": "F e muitas felicidades e muito obrigada por ter vindo as coisas ai Sim e muitas felicidades sempre e muito obrigada pela informação e muitas felicidades sempre vcs estão fazendo oq hj e muito obrigada pela informação e muito obrigada pela informação e muitas alegrias e felicidades sempre vcs estão fazendo oq", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy6OeEu7n7Khlh3ddh4AaABAg", "comment": "C BB GG GG e GG e muito obrigada por favor se for w se for w se fala alguma coisa e muito obrigada por ter vindo aqui e muitas alegrias e muitas felicidades sempre e sempre vcs vão vir aqui e muitas felicidades e muito muito muito forte e muitas alegrias e muitas felicidades e muitos anos muitos", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxSA1dyMpGH6PlZUCh4AaABAg", "comment": "Fg e muitos anos muitos anos muitos anos", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwaEKiGZ3T9B77jYX94AaABAg", "comment": "G é só falar sobre as coisas por aqui mesmo e muitas felicidades e muito obrigada por ter te ajudado muito muito muito forte mas é muito muito muito muito muito muito muito muito muito muito muito muito muito muito muito muito forte mas se Deus quiser vir aqui e muito obrigada por favor se for w r viu e muitas alegrias e muitas felicidades e", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyNce2-XAkUKE5jH914AaABAg", "comment": "V se for w r viu e muitas felicidades e muito muito muito muito forte mas é só falar sobre os momentos e muito ET r viu se ela quiser ir lá pegar ET e muitas felicidades sempre vcs merecem muito muito muito e muitas alegrias e muitas felicidades e muitos dias quando chegar aqui te falo", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyqHf7iNxshEjTRhcd4AaABAg", "comment": "F e muito muito forte mas é só r e muitas alegrias e felicidades e muito muito forte e muito muito muito muito forte e muito muito feliz aniversário e muita paz saúde e paz e felicidades e muitos anos atrás r te amo muito vcs vão vir buscar f xi w se fala alguma coisa ER e muito muito muito forte mas se quiser vir aqui tô esperando vcs vão vir aqui tô aqui fora e muito muito muito forte e muitas", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyL5kwUbUjPi3yRpc14AaABAg", "comment": "F e muito muito muito forte mas é só falar sobre as crianças estão muito felizes e muito obrigada por ter vindo as coisas por aqui e muito obrigada por favor se for por causa dos Santos Dumont Dumont Dumont é só r e muitas e felicidades e muitos anos muitos DJ e muito obrigada pela informação sobre os momentos bons sonhos e muito obrigada pela informação e muitas alegrias e muitas alegrias e felicidades sempre e muito obrigada pela atenção por causa dos meus amigos são Paulo", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRLSA85o8ie6N7nOB4AaABAg", "comment": "F xi w se for por causa dos meus amigos e muitas alegrias e felicidades sempre e muito muito forte e muitas alegrias e felicidades sempre e e muitas alegrias sempre vcs estão lindos né amiga e muito obrigada pela informação sobre e é só r e muito muito feliz aniversário e muita saúde paz e felicidades e muitos anos muitos", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxOTDHwLOXMhN_oTX54AaABAg", "comment": "F e muitas felicidades sempre vcs estão lindos e muitas felicidades sempre vcs estão lindos e muito muito lindo esse vídeo maravilhoso né amiga é só r viu se fala alguma r viu se fala alguma coisa e muito muito forte e muito muito forte mas é só falar sobre as coisas ai sim entendi agora só r e muitas alegrias e muitas felicidades e muito obrigada por favor se for", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx09fsLbxA49a99x-R4AaABAg", "comment": "R viu e muitas felicidades e muito muito forte mas é só r e muitas alegrias e felicidades e muito obrigada por favor se for w se fala comigo e muitas felicidades e muito muito forte mas é só r e muitas felicidades sempre e sempre te mandar mensagem e muitas felicidades sempre vcs estão fazendo oq Deus", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzlR-cm_8x7IC5lc-h4AaABAg", "comment": "Rf", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzZwi8F3Hg4xQKU5EN4AaABAg", "comment": "G vi agora agora só amanhã mesmo né mas se for w se fala alguma coisa e muitas felicidades e muitos dias quando chegar lá buscar as crianças e muito muito obrigada por ter vindo aqui e muito muito muito feliz aniversário r muita saúde paz e felicidades e muitos anos muitos DJ e muito obrigada por e muitas felicidades r", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzx_lxdtnPe54lBYG54AaABAg", "comment": "Xi tô falando sério e muito obrigada por favor se fala comigo e muitas felicidades e muito muito forte mas se quiser vir amanhã né e muitas felicidades e muitos dias quando estiver chegando amanhã te dou retorno r e muito obrigada por favor se for por favor se r", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxvRwfeDWwtjaJEoxZ4AaABAg", "comment": "F e muitas felicidades sempre e muito muito muito muito forte e muitas alegrias e felicidades sempre e muito muito forte mas é só falar sobre as coisas por aqui e muito obrigada pela atenção e muitos dias quando estiver chegando amanhã te dou retorno r viu e muito obrigada pela atenção e", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyCYXZQNBz5gFd9yud4AaABAg", "comment": "G e muito muito lindo e maravilhoso e maravilhoso e muito muito lindo e maravilhoso e muito muito muito lindo esse vídeo amei essa hora ri demais né se fala alguma coisa ER e muito muito muito e muito muito forte e muitas felicidades sempre vcs estão", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz_0mEwSozQ3n_RAnx4AaABAg", "comment": "Just one observation, benzodiazepines are not proteins xd", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzsvQrjQj7ERNGW_rB4AaABAg", "comment": "I think you could describe DNA as source code read by different, and compilers on pretty crappy machines. You often have certain lines of code, like the logic statements, and you run this line of code (gene), or that line, maybe you get this input, perhaps you don't have this .dll, (or molecule) and can't finish the process, or you have this interference (in both cases most likely ionising radiation) and it affects this molecule or even the source code itself, and sometimes the code does not work the same on two machines and all of that stuff.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw1DJ5PY6w2kfvLnyZ4AaABAg", "comment": "Dialectical materialism is a materialist ideology that contains dialectics, as in, opposing forces affect each other and each other's development, eg. fuedal lords and burgeoisie; burgeoisie and proletariat", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxNdu_meqPOXnbhofx4AaABAg", "comment": "Sorry.  I have, you have.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzISFirsTwHH_a6x4R4AaABAg", "comment": "Ok 👌 I found Chaos on YTube (<3hrs), the Professor 's book on ThriftBooks (<$10)....The University putting lectures on-line for free (priceless). Thank-you.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx3Z1vzqioatGrq8HV4AaABAg", "comment": "He wrote An amazing book called Behave which goes along the same line as these lecture, it overlaps a lot but also gives other information", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwnIPiJkJpM6gHJR2J4AaABAg", "comment": "Among all the dross and misinformation on the internet  these lectures are  a refreshing oasis of sanity and intelligent thought.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwBrJ0324b3r0d9AeR4AaABAg", "comment": "This is just computer programming, we are all computers", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzIBebJM_JJXR179T54AaABAg", "comment": "48:33 Eren Jagger", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw3AcLrhw4O5iZt0dZ4AaABAg", "comment": "Grateful to get this edu and adding Sapolsky to my Teacher/Master/Guru/Swami list!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwao7bd7KLGdz_SS7h4AaABAg", "comment": "One thought. Its not just compitition through other life but the earth its self . One example that comes to me is this giant slab of landmass in an ocean due to volcanic activity. It looks incredibly  boring, void of any vegetation. then you go underwater and aqua life is flourishing. So my point. Their was a species of iguana and well fast foward abit and now they can hold their breath longer since their food was underwater. Could that be that burst change or just evolution as we know it", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzZim3MfkuDpLgGKS54AaABAg", "comment": "Do you use the Levenstein distance to estimate drift, and if so, are there numbers showing how close or far it is in practice?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyGuSxEQviL4O9Jsvh4AaABAg", "comment": "The catch-up sessions are avaliable as well?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxIQjEJ6d9UIjjx7t94AaABAg", "comment": "Sapolsky just here being the goat", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgybsaNcYnkd4VCcnE14AaABAg", "comment": "High and Low anxiety rats? WONDERFULL!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzwcGOj3Gtmb8ZhJHR4AaABAg", "comment": "Summary :   1. Genes code for proteins essential for cellular function.  Genes contain the code for proteins, which are crucial for the structure and function of cells. The sequence of DNA determines the shape and function of proteins, which can have significant effects on bodily processes. Enzymes, a type of protein, are responsible for accelerating reactions and are crucial for many biological processes. The flow of information in life is from DNA to RNA to protein, but this notion is challenged by viruses and retroviruses that can convert RNA information back into DNA.  2. Various genetic mutations can have significant consequences.  Genetic mutations can occur due to various reasons and can have varying consequences, ranging from neutral to disastrous. Point mutations, insertion mutations, and deletion mutations are the three types of mutations. Point mutations occur when one nucleotide is accidentally changed into another, and can result in a neutral mutation or a different amino acid being coded for, depending on which letter is flipped and its location within the triplet. Insertions and deletions tend to have bigger consequences than point mutations. PKU is a common genetic disorder caused by a single-spot point mutation that knocks out an enzyme responsible for converting phenylalanine into a safer form, leading to the buildup of phenylalanine and destruction of the nervous system.  3. Genetic mutations impact gender, anxiety, and cultural adaptation.  Genetic mutations impact gender and anxiety, such as conditions like testicular feminization syndrome and benzodiazepine use to treat anxiety. Tiny changes in single base pairs can lead to dramatic diseases and individual variability, and molecular biology intersects with cultural adaptation.  4. Punctuated equilibrium vs gradualism in evolutionary biology.  There is a debate in evolutionary biology between gradualists and punctuated equilibrium supporters, mainly focusing on the speed of evolution and the lack of molecular mechanisms supporting punctuated equilibrium theory. The majority of fossil pedigrees show patterns of punctuated equilibrium (rapid evolutionary change followed by long stasis). However, modern molecular biology provides evidence for such mechanisms, resolving the controversy surrounding punctuated equilibrium.  5. Genetic differences and similarities between humans and chimpanzees.  Humans and chimpanzees share 98% of their genes, but have differences in genes coding for specific physical features. Small genetic changes can have a significant impact on evolution over time, tracing evolutionary history, and studying genes such as Fox P2, which is linked to language and communication disorders. The Fox P2 gene has undergone positive selection over the last quarter-million years, resulting in significant changes in its amino acid sequence.  6. Modular gene construction, gene expression, and introns/exons.  Genes consist of separate coding domains called exons, with in-between sections called introns. Splicing enzymes remove introns from RNA and connect exons to form a continuous stretch of DNA, enabling gene expression. This modular structure allows for the creation of different proteins through splicing, generating various protein combinations. Long stretches of non-coding DNA between genes, initially called 'junk DNA', have been found to play important regulatory roles in gene expression. Promoter and repressor sequences code for switches rather than coding for proteins. They bind molecules that interact with the DNA, turning gene transcription on or off, and, consequently, protein generation. Shared promoters and outside regulators activate entire genetic networks, producing multiple proteins with functional similarities.  7. Gene expression regulation and influence of environment.  The environment, both inside and outside the cell, can regulate genetic effects and influence gene expression. Hormones, chemical messengers, and external stimuli can activate transcription factors and regulate protein production. Furthermore, chromatin modeling, methylation, and epigenetics affect gene accessibility and transcription factors. Genes are regulated at multiple levels, and mutations in splicing enzymes, transcription factors, and promoters can significantly impact evolution.  For summarized notes of all the lectures, check here : https://www.wisdominanutshell.academy/tag/human-behavioral-biology-robert-sapolsky/", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgylaDvY66YLAQMNgPd4AaABAg", "comment": "Is it the single letter changes and variable expression of genes that makes brothers who get the same X from mother not identical?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxQgIe8EfWoX5c4t_p4AaABAg", "comment": "Id like to study enzyme function in society to break down or speed up group structures.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgytvSroihswX2iR4SV4AaABAg", "comment": "A venezuelan here. This is amazing", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw4zedlf88IO3Log0l4AaABAg", "comment": "his beard is so fluffy, would never need a neck pillow on a plane", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxTzn0WCLMUHfQR72R4AaABAg", "comment": "😅", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwBrJ0324b3r0d9AeR4AaABAg.9uoOh19zilPA23I0J_tsd3", "comment": "Very weird and complex computers but computers nonetheless.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy0qGiW0suROVZZtrh4AaABAg", "comment": "For the people who didn't attend the catch-up session on classical genetics, this video might help as a primer: https://youtu.be/_-vZ_g7K6P0", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyIuvG2-UXCRQ2q23d4AaABAg", "comment": "Cool stuff, but benzodiazepines are not protein (35:37), though its receptor is. Just to point out a detail.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwik2UvylQrb2ycV654AaABAg", "comment": "It seems to me that small incremental changes occur over time while going unnoticed until they accumulate enough to become noticed. So evolution is gradual but looks punctuated.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyPrnuUMf-TaFpngwp4AaABAg", "comment": "So, the marxists were correct indeed", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwRdjMhVwIQZAu4Pf54AaABAg", "comment": "+", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwfq11fH3FrvSaw2-54AaABAg", "comment": "There are about 6 other chemical forces that cause the formation and thus the structure of proteins beyond simple hydrophilic/hydrophobic. A big one is Hydrogen bonding. Others include charged covalent bonds, polar ionic bonds and more i can't even remember. Not an expert here but that's what i remember from biochem I.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy1bnVbrBUzMNBEXHl4AaABAg", "comment": "he looks like a hippie amish genius", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwuLnXmMmLENb0V5ql4AaABAg", "comment": "Absolutely blew my mind away! I have learned more from this 90 minute lecture than I have from all my genetics classes combined! It all now clicks and makes sense.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwmyjV4Xu2e-tX3pK94AaABAg", "comment": "Someone in the class is dying of a horrible cough", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRoWNe_JNZNbssM7t4AaABAg", "comment": "Hi everybody. I'm trying to follow these lectures, but english is not my first language. Around 1:04:00 he is talking about gradualism and punctuated equilibrium. I just can't understand which one of the two better explains reality. Can someone help me??", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzD_nbn8N-kxIPGSNJ4AaABAg", "comment": "Very true I am currently studying biology on line this is a blessing", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyVauUofoHpQ98AkjJ4AaABAg", "comment": "Hmmm. The lecture had no specifics, no graphics, no visual aids, of which there are plenty available. The lecture would be better if it at least pretended to show molecules, genes, or other images. \"Molecular Genetics I\" with no molecules to look at. And no genes to look at.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzK9zANSunBN6UFfsp4AaABAg", "comment": "I love this guy", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5P8W3Hf9lWpTE_ht4AaABAg", "comment": "what about the design, of practicing  long term fasting like 150 + days a year for ten years increasing the days of not putting anything in the body all while working full time building houses and even doing long distance running throughout this fasting and working ,,, many people have practiced and it's not studied by science what and how it's different from every other individual", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxUHIyHy7C9e4P3sOd4AaABAg", "comment": "lmao I've heard the 95% of DNA is junk all my life. Glad to know there's a better explanation for it.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgypvRuVosIADpKuvGt4AaABAg", "comment": "28:58 bruh xD", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwjMlI1PeTbq6tMINx4AaABAg", "comment": "it might help if he drew some diagrams", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzQnXWEnv7XaE8I1Xp4AaABAg", "comment": "16:29", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzH91MRzgrd5vqFWSd4AaABAg", "comment": "quite genious after, cool basic talk", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxDR1KqC78MQ5dS2WZ4AaABAg", "comment": "These have become some of my comfort watches, and I also refer back to them for arguments with uneducated blowhards. I am such a fan.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRoWNe_JNZNbssM7t4AaABAg.9jR22rlRSul9k-OXcFXwvY", "comment": "gradualism", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyRoWNe_JNZNbssM7t4AaABAg.9jR22rlRSul9whXkh5QQv7", "comment": "Most of the contemporary evidence supports to latter", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgziVqzp6VChkE7otrl4AaABAg", "comment": "Could someone provide notes of the serious, it would be a big kindness and pleasure", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxEFv15Qg1qhsTPgkV4AaABAg", "comment": "51:43", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgytUFIeEuBv1iVVLLZ4AaABAg", "comment": "The wobble nucleotide is the third one", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzP4A6wT-L7k-mkP4h4AaABAg", "comment": "I was the highest graded students in my science classes. I was a borderline genius and psycho. The students in higher learning have such an opportunity in this age. I hope my work will some day effect the stars that these students can be. What a venture. Especially in biology and human development. Find the stars achievers of this incredible future", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzuUIl0OUMjbe-PmA54AaABAg", "comment": "To break the personality DNA code just discover when the professor is constantly laughing at permeated penis mutation and your there. We're there. Laughing dick....", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwJl1O4HmT96qJSpLB4AaABAg", "comment": "40:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgztYKIUaoZd35dQiXx4AaABAg", "comment": "I will now do this ???", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwY3D8gMSOuksRi4tV4AaABAg", "comment": "❤️❤️❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxjkMfLdLvPqansGcB4AaABAg", "comment": "20:04", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQRPd3v3ewLe7SkJ14AaABAg", "comment": "Sapolsky try \"Peratt and Petroglyphs\" on youtube..", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw10SGzqBnYkqvUZIV4AaABAg", "comment": "I am regretful that I didn't find his lectures earlier. He is like nonstop leading strand polymerase. hehe. BTw, The wobble codon is the third one for the clarification.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwUrpWYVViFy7H1gll4AaABAg", "comment": "Non-coding DNA = 1 H atom (no electron)", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyNsoK8hnyt4E1-RCV4AaABAg", "comment": "(1) Human = (1) Neuron   ©️Robert Sapolsky", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgztZHz-KB720epwSOJ4AaABAg", "comment": "LSD is one neuron short of being ARSENIC! Our body becomes the missing neuron when we take acid. So the trip is experiencing what it's like to be a neuron in an Arsenic atom. No wonder people have bad trips! bahahahahaha  ©️Robert Sapolsky", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyi9Pn738olbZnjqgd4AaABAg", "comment": "Listening to him is like listening to a symphony. Wonderful.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgziQjW2rBWDoGV1iqp4AaABAg", "comment": "47:00 FYI, a 2018 study concluded there's no evidence for recent positive selection on FOXP2: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6128738/", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw4NU5SJqcdBUP7L754AaABAg", "comment": "Am I the only one that can barely focus on the lecture because of the mic feedback in the audio?", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwSi5GhZU4oF6G4U7h4AaABAg", "comment": "I did mediocre in high school biology, but somehow the way this guy explains stuff makes so much sense.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw2nPkwsYF9okOTkGJ4AaABAg", "comment": "48:00 How come humans share 98% of their DNA with chimps", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwkcl7bwIvf0_hgsTh4AaABAg", "comment": "Thank you so much for this incredible, wonderful opportunity to listen and watch the lectures of Robert Sapolsky. Thank you for doing this for free! This is the best thing you could ever make! They shall be accessible like Bible, to everyone. The best educational course ever, the best professor ever.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw2nPkwsYF9okOTkGJ4AaABAg.9dU3HPw7eAf9eTaWGtqlmo", "comment": "Genes =/= alleles", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxl9O85mVcBGM0vDl14AaABAg", "comment": "I really wonder how different his lecture would be today, 11 years out.", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzeU0PTHcQM-ItqPOx4AaABAg", "comment": "If you want real  happiness and improvement in your life , read about Islam, read  the Quran and convert to Islam 🤍 just try and give the Quran a chance.  May Allah Jude you all and me too.  🌿🤍🌸", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzVWk64TNHZJnAKCZJ4AaABAg", "comment": "Anybody else remembered Charlie from Flowers for Algernon when PhenylKetoNeuria is mentioned?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxKf-laQKO3AlCvMB94AaABAg", "comment": "Gotta love the cliff hanger", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzRxolkO-XUKJaQxil4AaABAg", "comment": "i love this man", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzVo55eP7BdQ1MHw4l4AaABAg", "comment": "i only know that protein is the thing i need to eat a lot of to function. thus every day is chicken day.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw9m0rL1Y-yu6qoSKd4AaABAg", "comment": "o-o eek science is creepy.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx099IFAwVUjzbyw094AaABAg", "comment": "is it possible to have mutation in holoenzyme , its v basic information but the multidisciplinary approach helps us to see the bigger picture", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwtSYkmt6Nr13b90Lp4AaABAg", "comment": "Cultural marxists, or whatever they call themselves, claim gender and sex were always two different things. Yet here in this lecture from just 11 years ago the two terms were still synonymous.", "votes": "2", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwhdycU7jZXpfolNwR4AaABAg", "comment": "yeah", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx-t0A4kAO_91FLAAR4AaABAg", "comment": "1:25:00 or so: the “context” as it relates to gene expression and protein synthesis must mean that environmental factors could be turning otherwise good genes into badly behaving genes.    Our environment is sick on multiple levels. Some of that could be intentional for a whole host of malevolent motivations.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxM71alu9_dFcfBQrR4AaABAg", "comment": "Capitalism is the behavior of a virus in human form.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzHrcrZpb4Py1cyWsh4AaABAg", "comment": "44:11", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxJYG9buA0v3l0vJtp4AaABAg", "comment": "<3", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwNeDWcRcAIwjTm6dF4AaABAg", "comment": "24:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzThFvBkCfTgHGCiVR4AaABAg", "comment": "fml", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw0M0QFxAneDIO9PV54AaABAg", "comment": "ՊԻԶԴԵՑ", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw99JXpXwXsJbgIXt14AaABAg", "comment": "5:58 22:32  43:59   1:01:04 done", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwoc1NWlXdE5_6gF1F4AaABAg", "comment": "Wow.  Nurture Power!  A strong argument for removing the negative impacts of poverty, toxic neighborhoods, poor educational environments...  to maximize child development.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxT8fhpv_osWwlUFrJ4AaABAg", "comment": "I am so grateful to have access to these classes. Thank you so much. This is so cool.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwtSYkmt6Nr13b90Lp4AaABAg.9c9KD_8Ixym9onFP_DYqV9", "comment": "Keep watching his courses until you hear him talk about trans identity.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzdYHnoUUbp1otAwKp4AaABAg", "comment": "9th Grade and wanted to be a biologist since I was 4. Thanks for posting these :) Finally narrowed it down to either pursue marine biology or horticulture!", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx6brT6qiSN3d20xih4AaABAg", "comment": "37:44", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx79MmVDBka1_eqT794AaABAg", "comment": "Very usefull lectures", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwl1ANZmOxjZK-GXat4AaABAg", "comment": "Can we please some how arrange a meeting of Robert and Irving Finkel, they look like they could be related, have oddly similar mannerisms and teaching style and I think a discussion between them could be interesting, perhaps if they discussed how behavioural evolution influenced the development of language... Random idea but meh whatever. I just want to see them both have a chat", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQHBwDvBPQqpVhYO14AaABAg", "comment": "And the best thing is once you add this pile of neurons that we call brain, even the actual external environment doesn't matter as much as our interpretation of it.  The same external event can map to completely different internal worlds which will in turn lead to completely different gene experessions.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgztHpVyrSETjCWnxv14AaABAg", "comment": "Bro", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwf5U4iYpl7pHFfjNx4AaABAg", "comment": "Omg every time I fall asleep with autoplay on I wake up to one of this guys videos.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyVLktrcgtkLACjnn14AaABAg", "comment": "Dialectical materialism is a belief that dualism and change are inherent to everything  in the universe (dialectics) and that the universe exists independent of us (materialism).", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwAq9g3Bbk36fMGHwh4AaABAg", "comment": "Another thing: Look at all animals that have five fingers and toes and you look closwe relatives. So don't dis rats they are our cousins.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzmZg9a9pnY1B6Zb_54AaABAg", "comment": "About retroviruses. For some reason in every book I've read about evolution the basic tenet has been that no aquired characteristic can be heritable. How come they forget the simple thing that our DNA is riddled with retorovirus information. If a retrovirus codes it's thing in germline cell then it is automatically inherited by the offspring of that individual. I don't say that giraffes got longer necks by reaching ever so higher, but I'm saying that there is genetic information that individual can aquire and pass to their offspring. And that is aquired characteristic that is heritable.", "votes": "0", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxIkMMuZKVqmtQbrmB4AaABAg", "comment": "Very good !", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx8lVAJ3a17Ge8_17p4AaABAg", "comment": "im confused", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzgil9GcSEWOu_Bthd4AaABAg", "comment": "i got 4 hours++ of Stanford education in one day for free , internet its ok", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzSgYD2XQkP9bTeHBZ4AaABAg", "comment": "0:12 Introduction 0:51 Recap 2:53 heritability 4:46 protein 🧬 12:57", "votes": "3", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwao0XZAlodxPN4p9V4AaABAg", "comment": "this looks like prison", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzXUcCgAurvXBdpL_p4AaABAg", "comment": "Better than Netflix", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzQIGYIVDA4nFRR_m94AaABAg", "comment": "epi", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz5yiE0kAO38iOfR_p4AaABAg", "comment": "Breakthroughs in science are not gradual. suddenly one knows", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwtEUWCvBw8RDVr5nl4AaABAg", "comment": "There was one mutation in a fungi enzyme that made a tiny difference in shape, so instead of breaking a natural wax (think of trying to get through the first layer of an apple) it can break plastic. ^^", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy4Y_G8aQNbkZJFIrF4AaABAg", "comment": "❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx6brT6qiSN3d20xih4AaABAg.9ZxhzbIuKdP9_1mH4tO5Fm", "comment": "50:00", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzmZg9a9pnY1B6Zb_54AaABAg.9YpgrRjQWnM9gepBBnlTYF", "comment": "The mutation has to occur in germ cells that will form the gametes to be inheritable. When retroviruses insert their DNA it's usually inl somatic cell i.e. normal body cells. So it is not inherited.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzmZg9a9pnY1B6Zb_54AaABAg.9YpgrRjQWnM9gepPt7kVXZ", "comment": "And iirc if it got inherited, the new born dies soon after birth if not before because of the emergence of the virus", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzmZg9a9pnY1B6Zb_54AaABAg.9YpgrRjQWnM9gf8somQWak", "comment": " @enteryourname4284  That is not true. In Southern Africa there are babies born with HIV in their genes and they do not die soon after birth.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzSgYD2XQkP9bTeHBZ4AaABAg.9YdxAdJr5wX9YdyYTdvI_d", "comment": "Behavioral biology & molecular genetic influences Protein synthesis and point mutations & microevolutionary change gradualism & punctuated equilibrium epigenetics & development", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy9D54zqDatx-YdD0p4AaABAg", "comment": "어젠내가 감당해야할몫이였을거야 지나갔어", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz_WaPTZDyAcKBh51h4AaABAg", "comment": "나의 하루", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyVYhop6xIZn3Sa41R4AaABAg", "comment": "Never made it as a poor man, couldn't make it as a blind man stealing... BUT I'm privileged to have lectures like this to enrich my mind without cost of a tuition 🙃", "votes": "12", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzXe1bOyWMac1akm4p4AaABAg", "comment": "Really nice lecture! The way he explains it makes it even more interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwja2PfMhXg9rG01pN4AaABAg", "comment": "I LOVE YOU! I REALLY DO!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz0-RzpCNDrh5Ns9BN4AaABAg", "comment": "Thank you. I enjoyed your lecture style and the content expanded my perception. Hugs! 🎈❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyKgYgR1tUEowX1U854AaABAg", "comment": "loved it", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwtJm6P0n8Uc9eb2dB4AaABAg", "comment": "truly excellent! he's made it look like a child's play ..The Biology of Belief by Bruce Lipton could be a good book to read after this !", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx-hazOE9gsUkhLIFl4AaABAg", "comment": "Mind blown!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyTbju1D6gz7SsJJHp4AaABAg", "comment": "am just 11 bro you lost me this part when I could understand the other parts ima head out now back to cocomelon and roblox", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzhC2IN7H-FClCd59x4AaABAg", "comment": "i will never see or hear the simile 'like a glove' again without mentaly replaying the sound of a lecture hall of depressed young adults disappointedly muttering the last word😂😂 love to hear it", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxiGP1NObaMGxGyCb94AaABAg", "comment": "Great", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyZcr_32CymYfJEf8B4AaABAg", "comment": "humans have been known to use bovine and pig heart valves, ect in the human body to fix certain health problems. if we share 98% of our genes with chimps, what would be the result if someone tried chimpanzee instead of bovine or pig. has anyone ever tried? can someone please tell me more if you can?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx5WPidyy2W2hdWrM94AaABAg", "comment": "Sir aap bahut achha padhaate hain maine aapke channel ko Subscribe kar diya hain.🙏❤️❤️❤️❤️❤️💕💕💕💕❤️❤️❤️❤️❣️❣️❣️❣️❣️💕💕💕💕💕🌷🧡🧡🧡🧡🧡🧡🧡💕💕💕💕💕💕💕❤️❤️❤️❤️💛💛💛💛💛❣️❣️❣️💛💛💛", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwdNVlPHKyebEEFOW94AaABAg", "comment": "Master Sapolsky 🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzDDYLEmXZWIa1FmTl4AaABAg", "comment": "Apples? Apples", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxGn6BVF9MSlrCR51t4AaABAg", "comment": "does someone actually have the images of the fax he was talking about. i googled them, but i think i have wrong animal. pls help here 🥺", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxFdwvtlVr2ckm6ll54AaABAg", "comment": "1:29 🤦 wtf?   Microevolution is genetic modification from common descent.  Macroevolution is 'Changes in biodiversity by genetic modification from common descent'   They're both the same thing. EVOLUTION. Modification with shared descent.   Essentially, if you reproduce or have the chance to reproduce (keep in mind we're not just talking about humans) before you die, than you are \"fit\" for that environment.  Evolution is not a \"stairway to heaven\".  Evolution is not constant development to being a super being.    And it's not some Lamarkian bullshit.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyW5piZh8_kPKxrRph4AaABAg", "comment": "I’m listening with my jaw dropped … the best thing ever and I was never interested in Biology", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxIIkuY3tF87pYYTK94AaABAg", "comment": "1:22:48", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyZcr_32CymYfJEf8B4AaABAg.9X3abTn-1YB9XgSvZ4fQWI", "comment": "Pig is used because it is close in approximate size and readily available. Regardless patient has to be on immunosuppressive agents long term. There’s no difference between whether we use pig or chimp.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxFdwvtlVr2ckm6ll54AaABAg.9WeSGxXXRGg9Yt6fIfl3J_", "comment": "He knows he was being sarcastic", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw_vNiRHVgDyk6sseF4AaABAg", "comment": "So \"Punctuated Equilibrium\" has Marxist roots. Telling.  IF there are sudden revolutions of change in consonance with Marxist ideas, dont be surprised if there are high body counts in periods of explosive change. Touted as a theory that supports Utopian periods of noncompetion, it also posits periods where \"a lot of eggs will be broken\".", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgywSilHAUhL1OwIlW94AaABAg", "comment": "Fell asleep with vsauce on and woke up with this 👍", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyIkgRgCme55jJ9kZx4AaABAg", "comment": "This is the first one in the sequence where I had to rewind to double-check my understanding. Even then, it only took me two listens to get something well outside my expertise. Terrific stuff, lucidly explained. Things like this really make me believe again in the old notion of the internet as a repository for human knowledge.", "votes": "11", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxtNQqglnX8MuZr0ud4AaABAg", "comment": "Love it", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzI_dTkvWdXxelHFSZ4AaABAg", "comment": "Great lectures but I wonder how valid the information still is 11 years later :/", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx0fZKk3mcIolYYq-B4AaABAg", "comment": "I'm a computer sci student on his 4th video on behaviour evolution 😂... what a professor wish I had this person as my programming professor.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx5TwDBrVNIicIbT1p4AaABAg", "comment": "📍38:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzjQ2TsLrAztXj_u9R4AaABAg", "comment": "I need an update of this course....how much has changed for the past 10 years?", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxQaKTJMq8AnHEraCZ4AaABAg", "comment": "I feel like he is a God in a human form to teach us knowledge and wisdom for free anonymously", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyXB2dijkSdgu1YlQZ4AaABAg", "comment": "Totally riveting. Amazing breadth of information and so well delivered. Thank you so much for sharing these lectures 🙏🏼", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxBNns2MhlW1q-fTsR4AaABAg", "comment": "I like how instead of saying et cetera he instead says blah blah. hahaha", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyt1_T1JkAfgqn-tvx4AaABAg", "comment": "I was watching videos about. ENTP personality type. Don't know how I ended up here.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxOVpy5OCfTAhgleq94AaABAg", "comment": "Does anybody know someone else who gives such good lectures? (on YouTube or otherwise) on the walter lewin /feynman / him-style.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzhwc60gHKqYZodhtp4AaABAg", "comment": "So you learn the same thing like this is n Biology 9th but in College and University you learn a higher and more professional version of this?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyAGCoVbTEtW74GrTJ4AaABAg", "comment": "It seems to be true that \"automatic\" non-intelligent Lamarckian influences (external influences can change gene systems, either by promoting cer5tain mutations or changing the actions of an organism to promote its actions toward certain goals) actually do exist, either to eventually change the physical structure and function of genes or when they are on or off, so that the \"wheels within wheels within wheels...\" interlocking control and response systems in our body ARE changed in various ways by the \"desires\" (influences) of other genes that respond to other genes that...", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgycSxK7iZqxSPRryex4AaABAg", "comment": "I am a suspicious person when it comes to \"random\" things just happening to do things we want, when we had no way to make these things happen AND they did not happen to any other living thing that we know of.  Those multiple mutations that allow us to talk properly that, as far as we know, NEVER occurred to any other living thing, EVER, is a VERY, VERY strange thing.  If we have no control over this stuff (and nothing else in our world does either -- no \"friendly spirits\" with the power to modify genes exist, to my knowledge).  Then how come we get not only one, but a whole list of needed changes like we were in a bio lab and the scientists did it on purpose?  I think that this kind of thing has to be investigated thoroughly.  Do we or something else in this world have the power and the desire to force such changes on selected living things?  If so, our world is not what is seems to be...", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwq4-trS8MVpkp5x-l4AaABAg", "comment": "Why haven't I heard of this guy? Oh, jeezez.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwXDQKi03iLj-pb2Xd4AaABAg", "comment": "Kurzzusammenfassung: Krieg in Afghanistan - Entstehungs- und Entwicklungsgeschichte der Taliban https://youtu.be/AIZ8CF4rFec", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwW6_GNay8q41bHKcd4AaABAg", "comment": "Covid Vaccine:  This mRNA just creates a single type of harmless protein, its 100% safe.      Body:  Watch me create all kind of proteins with your snippet", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzwB6thnjHSufaQaVh4AaABAg", "comment": "He’s  the Man I want to hear.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwKjWJXmB-byExxl2N4AaABAg", "comment": "This takes foster parenthood to a whole new level", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz7GwilsmhYVoWFoNF4AaABAg", "comment": "00:05:30 Protein as Intermediaries", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgySQBHKMfl9rjlB7gl4AaABAg", "comment": "I would have loved to school like this in college, not like my teacher who discuss' half baked topics and expects us to just pass.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwsXUrUx9ktSvILEkh4AaABAg", "comment": "Super interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwW7Az4MnTf-vpVAgx4AaABAg", "comment": "I am a computer programmer.  How mentally dense were these biologists?  Did they think genes used MAGIC to know how to function or when to be used?  The number of instructions needed to know how to use and when to use and how much to use and how and when to stop using a protein would be mind-boggling!  Even making the drive shaft of an automobile requires large amounts of material and manufacturing instructions, as well as the design, use, and building of the machines to make that drive shaft.  A human body?  The number of instructions to do this would need an entire library of instructions for everything that has to happen...", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyABVlMgNNeKY2g8wN4AaABAg", "comment": "loving this class so far!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwu-maegRpNzT6qxnt4AaABAg", "comment": "Love this and the joke about research! 😂🤣❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwzPItuXmorGiD4Vkd4AaABAg", "comment": "This will be amazing no doubt!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz7O8a3jxdxjAY83Y54AaABAg", "comment": "This guy psychobabble’s too much. Is he a highly respected instructor at Stanford? He never really gets to the point he’s always say tracking to something else", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwsmnpJH1uRY6Sv-Dp4AaABAg", "comment": "I enjoyed  your lecture. It's really  interesting. Thank you! So kind of you!◇◇◇🌐", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzCGPfDPijM4rq385x4AaABAg", "comment": "Comment no 1000th. Please like it", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwjeiEiUIfjeCkYPFh4AaABAg", "comment": "He’s a great lecturer", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyMBRRPaRnmmB_uW7B4AaABAg", "comment": "1:13:48 fucking revelation right at the end where you don't expect it", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg", "comment": "Pay attention people 13:10 /1:06:00 He is speaking of your covid vaccine RNA. -  lecture given 10 years ago.", "votes": "2", "replies": "8", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyLwvkNhkR0JnTvasV4AaABAg", "comment": "53:14 I wanted him to follow that with: \"But every few hundred millennia, evolution leaps forward\" and then queue the X-Men theme song so bad", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx_tTDbA-8iT60_Ce94AaABAg", "comment": "What is name of doctor?", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxzpvUkgcwQanE8woB4AaABAg", "comment": "It's real amazing listening to this guy, damnnn . He clarify things every straight and knock well in the head.", "votes": "8", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwncl42gf3ftTyuVeN4AaABAg", "comment": "1:03:53", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw6zBSJ3U8ylCq9uax4AaABAg", "comment": "and here i am aftet 10 years 1 sept 2021.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRZLNlp7SnJHRlnK54AaABAg", "comment": "sometimes, I love the internet", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz7O8a3jxdxjAY83Y54AaABAg.9SZ3nMB7rEw9Svod0gzjsS", "comment": "I don't think you understand the concept of a lecture. There are many reading materials that the students are expected to at least browse before attending. They are a series of scientific articles from different fields. The professor is just summarizing and putting it all together with a unifying theme. He's an abosultely amazing lecturer.", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9UbPJ9AAOov", "comment": "And?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9UbT3NA37na", "comment": " @dp2404  and I am uncomfortable, with human Genome editing. Here is more articles.  https://hsci.harvard.edu/translation/what-are-drugs-4-gene-therapies.     https://hsci.harvard.edu/translation/what-are-drugs-4-gene-therapies.     https://www.pnas.org/content/113/4/801    ￼ ￼According to the Harvard article the m in mRNA doesn’t stand for messenger, like the government says. It stands for methyl. Now the government is forcing this injection on people. Something is not right…", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9UbTtxF1ibh", "comment": " @rockybutler  Are you a conspiracy theorist? Do you know how many politicians, doctors, biologist etc around the world should be complicit?  Do you think it is possible when it is difficult to pull a scam with 5 people involved? If it were true I would be positively impressed of the capacity for human cooperation...", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9UbTxfyGLBc", "comment": "I should add... WORLDWIDE.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9UbaOYBv8wr", "comment": " @dp2404  I am no conspiracy theorist. All though I do question everything. Covid is the real deal, just look at the cruise ships for proof. I have also had a personal experience with the infection. It is scientific fact that mRNA is used in Genome editing, Dr saplosky is a creditable source along with the Harvard article. I personally don’t want my Gnomes edited by science. I was essential personal (HVAC) kept working with no outrageous unemployment benefits. Keeping these Politicians,doctors,and biologists. Furnace and A/C working. Now these same people say, that if I don’t get this mRNA vaccine. I can not work with no pay?", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9Ubb8KXPWwV", "comment": " @rockybutler  vaccines with mrna are nothing new.. and do you really think that if \"they\" wanted to do something to us they  would use such a controversial vaccine? They could put it in the flu shots, in the water we drink, in ibuprofen. No one would ever know or talk about it. We can get into scientific technicalities and never get to a point. The thing is, the supposed motivations behind this just seem not credible at all.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9Ubc__VSLqp", "comment": " @dp2404  mRNA vaccines are new. The technology for this, is less then 10 or so years old. Yes they were discovered in the 70’s. Using them is a different story, that technically is very new. Think about were this first started China… They used fear techniques that stuck, and spread worldwide quickly. China wins. With worldwide panic, this thing is being fueled with fear. Maybe my no fear attitude is a mistake that will cost me… I guess only time will tell.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyQ0a34hRXAZNQB-zh4AaABAg.9SEe6Hdg7Ss9UdUT0eTN45", "comment": " @rockybutler  the mrna vaccine uses the same technique as the virus does. The virus combines with the dna of the cell to replicate it's own dna and feeds off the cell. (Sorry for the poor terminology, I am no virology expert). The \"classic\" vaccine uses the virus directly but makes it weaker. This way the body can fight the disease in a mild form. But in rare cases, with a compromised immune system, the disease can develop. The mRna solves this problem by using only a copy of the mrna of the  virus and no dna. So it is safer. In the past 10 years this technology is being used a lot. This is to say, we should not be surprised that the vaccine interacts with our dna, that's what every vaccine does because it replicates what the virus does. There is a lot of controversy, I understand, but I believe it is more tied to the restrictions we have had imposed on us, and the feeling that we are not being told the complete story (which is often the case, not only when it is about the cov). I choose to believe in science and honestly this vaccine seems like nothing particularly new. Again, if there was a weird agenda, why not use substances that we already use and have no problem with? Why use this controversial vaccine? To me it makes no sense.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugx_tTDbA-8iT60_Ce94AaABAg.9RxPt_UV-uF9U1Nsip5P66", "comment": "Robert Sapolsky", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxRKONBc9kNN9qgM_x4AaABAg", "comment": "I’m addicted to these lectures. Kudos to Stanford for making it publicly available.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxNAxKMDnp_gpSq_q54AaABAg", "comment": "So, according to epigenetics - potentially - if I had a child ten years after and another now - it will be a difference of \"active set\" which kinda influence it's \"starting set\"?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz8h46yXtWz3n8t9rl4AaABAg", "comment": "I love just replaying this in the background as ambient learning <3", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyw6rIKkKMyscdltHV4AaABAg", "comment": "Watching this in 2021! Absolutely incredible, I can't stop learning.", "votes": "8", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyKNJkFBDnVrgy526B4AaABAg", "comment": "All sort of behavior", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzlPZL5xFU1BQj996J4AaABAg", "comment": "My eyes and ears are wide open ... As this amazing professor is not only obviously knowledgeable but also quite eloquent!🙏🙏 Thankyou SIR", "votes": "5", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzitS167mm7MCwrV6t4AaABAg", "comment": "Stanford University  Lecture 4. Molecular Genetics 1 Robert Sapolsky   26:36 min ... 30:01 min ... 40:51 min ...", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxjWz2F0MaTqoQdPPF4AaABAg", "comment": "Pranams", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyuD7ZRNaaUik9iZBR4AaABAg", "comment": "can you believe this is free?", "votes": "9", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgweyF-kkqJCQLT-8Jt4AaABAg", "comment": "1:00:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx3mWdGtETQpMgeSeh4AaABAg", "comment": "I paid more attention to 4 videos of this professor speaking than I did to all of my professors in all of undergrad and grad school combined.", "votes": "7", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxcR79k1KaPOcvMcjh4AaABAg", "comment": "I love that he touched on phenotypic sex vs chromosomal sex. I wish I was half this smart.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxRBITKkeiIS3kHS5R4AaABAg", "comment": "This is the most interesting man in the world", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzZJX5rsS_DarWyF3Z4AaABAg", "comment": "This is starting to look like the game of life, with all these \"shapes\" that form other shapes and fliying \"sprites\"...", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgywOQLGsNEVb49wofh4AaABAg", "comment": "I was born in the wrong fking country I wish I was in that classroom...", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz6s9eWNQDJcoOC3bJ4AaABAg", "comment": "So if I spend 2 hours a day watching these videos and others like it and become extremely knowledgeable it means almost nothing because the point of our society is playing the game the right way and that means paying this University hundreds of thousands of dollars and then all that information magically becomes useful there's something strangely rotten with our society today", "votes": "2", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz2iWUm-k3_Q-7a8Zh4AaABAg", "comment": "Benzodiasepine? Dangit, Benzodiazepine.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyo0adyCCEUfCdbE714AaABAg", "comment": "\"There is a whole world of examples showing that everything I just said is wrong, but for our purposes, everything I just said is right.\" I love biology.", "votes": "12", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyJFBU8gkeTEbXjsfB4AaABAg", "comment": "Dr Mephestos", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz9vT327uUKRIxtCbF4AaABAg", "comment": "I love this smart guy", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxNAxKMDnp_gpSq_q54AaABAg.9RhurHdf7XG9mWxcDp4CFW", "comment": "Yes.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgywOQLGsNEVb49wofh4AaABAg.9QrSKVv8aYj9U1OWAUfULa", "comment": "Most of us in this country (🇺🇸) wouldn’t have a chance of attending such an expensive, top notch college like Stanford University. A university like Stanford attracts the brilliant thinkers like this man😊. Famous for his research, but also an excellent teacher!", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgywOQLGsNEVb49wofh4AaABAg.9QrSKVv8aYj9U1qrph-MyB", "comment": " @dshepherd107  if you see yourself as less then you are, that's your problem, stop projecting it on others.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz6s9eWNQDJcoOC3bJ4AaABAg.9QkPJvKCoVj9Qoyx_dGlf6", "comment": "A degree is a certificate of completion and understanding of a selection of information so the guy doing the hiring knows you have the knowledge to perform the tasks he is hiring for.   However, this type of information can find application on many levels. You distinguish yourself from the competition not only by your certified abilities but also by other skills: leadership, team building, education, conflict resolution, workflow, precision and the list goes on. Everything you learn can give you an advantage. Enjoy the free lecture", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz6s9eWNQDJcoOC3bJ4AaABAg.9QkPJvKCoVj9UbPir-SRQ9", "comment": "If you think that following lectures on yout tube is like getting a degree, you have never attended university. There is no comparison in the slightest", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzhrKKsDAGawJy5BKh4AaABAg", "comment": "I hope the students realize bjustbhow fortunate they are to have such an fantastic teacher. This professor, he just enthralls you and keeps you interested. It's almost like you don't realise you are actually learning! I wish I had had the opportunity these students had. At least we have these videos!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy7PtBmoXmuM7sbEqZ4AaABAg", "comment": "I wish my parents could watch this and understand. but oh no, they won't. COZ SCIENCE IS A MYTH.", "votes": "2", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzEEnUTCHdLj4g-6pt4AaABAg", "comment": "Wow. Thank you so much.  I understand everything I’m amazed.  Wow gracias mil gracias", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyo4BHeA0BL30OBwzt4AaABAg", "comment": "Computers and living organisms are just exact same things, but computers are electronic and faster", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyBVk9qfoY0u5F0oTh4AaABAg", "comment": "1:02:45 “evolutionary jerks” vs “creeps” (punctuated equilbrium-ists vs gradualists) wit was perfect", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxV5rWn_Ev0imtchZx4AaABAg", "comment": "Lectures like these is was what the Internet was invented for", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw3IVfYt7zFj9KN5mB4AaABAg", "comment": "Me who woke up at 6am (fell asleep at 1am) and found out I was on auto play and had just watched all previous lectures", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyKrYpnlIQcaLXyyUV4AaABAg", "comment": "How did I wind up with 1 functioning testicle, one non-functioning ovary, a micro micropenis and legitimate, big round mammory gland breast development in puberty?  I live a happy life nowadays, but my early years were torture and up until Transgender options became fashionable, I was horribly confused, depressed and suicidal   Estrogen therapy and Testosterone blocking was the key to my sorting my life out but I still lack definitive reasons for my birth  Could my mothers carbon monoxide poisoning in her second trimester with me have messed with my development?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyiRGEIiBcEZ-U128Z4AaABAg", "comment": "Really great! DNA is the α nor the ω, nor what's in between. Bravo!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwPIJSHzA0GwFJwXOh4AaABAg", "comment": "Anyone else watching drug videos while going to bed and you wake up to this ?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw8JDDUsMJLbmLwZld4AaABAg", "comment": "2021? 🙋🏼‍♀️", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxq3N3U-_2VFNVfeQB4AaABAg", "comment": "This the kind of content YouTube needs to promote more", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwsYVH_VdcPjNmPCGl4AaABAg", "comment": "Me: There are two types of teachers: the ones that wipe out the whiteboard before using it, and the ones who only partially wipes it before using it. Robert: 1:20:45 My OCD: Am I a joke to you?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzYUo4dKirJU3ljIE54AaABAg", "comment": "DNA to humans be like: \"read the fking manual\"", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzDJ6ef_K5X5mO0cHJ4AaABAg", "comment": "0:12 0:57 2:22 3:03 4:09 4:47 5:41 6:19 7:04 8:16 9:57 11:07 12:57 16:15 20:00 22:04 22:37 30:03 37:34 38:21 39:40 40:32 43:58 47:31 48:19 50:46  51:43", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxoz_lpH0KBrnXE_Kl4AaABAg", "comment": "A kindly reminder, for wobble base pairing to happen, it is usually the third base that differs, rather than the second. Check any genetics textbook and you will find me correct. Nonetheless, I enjoy Dr. Sapolsky's lectures a lot. I play them as some sort of podcast and it works wonder. Thanks a lot for putting these lectures up here.", "votes": "10", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwICm4pMu3H2jHxq2d4AaABAg", "comment": "I think I was slightly confused by one of his statements that 95% of the DNA is non-coding and regulatory. I believe he slightly eluded to the fact that non-coding strands all have a purpose, but their true purpose is not yet well understood. What I learned in an intro bio class was that the vast majority of the non-coding regions in DNA are largely filler (i.e. jumping genes, junk strands etc.), and don't have any effect on phenotype. Am I mistaken?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxE_NbeOLFU-_SmrXx4AaABAg", "comment": "\"sometimes you get acne, sometimes you get penis\" God damn :D", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyu7mJ9_2tZVxUg9OV4AaABAg", "comment": "44:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzDq1IQj2zXUFnFL3V4AaABAg", "comment": "dude just casually decides to disprove major theories on molecular biology. you know as one does on their day off", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy7PtBmoXmuM7sbEqZ4AaABAg.9QUuWF8jTEf9RYesDLzBAX", "comment": "Yet they probably watch tv, use phones, fly on planes and take Advil when they have a headache but science is a myth 😁🙌🏻", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugyo4BHeA0BL30OBwzt4AaABAg.9QNi_S7sywA9Xp6BlxRkme", "comment": "computers are just machines that can count to 1 and make that work really hardXD at least biology can count to 4 /lh", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyKrYpnlIQcaLXyyUV4AaABAg.9PsnFwyaFJs9QcrsqrYlMM", "comment": "Possibly, but most sex development happens in the first trimester (week 7 through 13), with a little in the second.  The presence of both ovarian and testicular tissue is usually either a genetic issue from conception or chimerism (which is pre-implantaion).  Chemical exposure later in development would alter the functionality of organs, but not change them into different organs.  The big thing that CO does in fetal development is reduced growth via impaired oxygen uptake.     In all likelihood, while CO probably had some effect on you, it probably didn't cause your DSD.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxoz_lpH0KBrnXE_Kl4AaABAg.9OyE2zEbcho9XE0QbuIBWQ", "comment": "as a 14 year old who knew the 3rd is usually least consequential, threw me off a little but i assumed i mustve misunderstood the weel from the book i read when i was 11 since that was blatantly the most obvious explanation, but im so glad you mentioned itXD i wouldve taken sapolsky at his word haha, i supose this is a little reminder on questioning my sources haha", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxoz_lpH0KBrnXE_Kl4AaABAg.9OyE2zEbcho9YsL_8QGnya", "comment": " @Summer-uq1vr  I presume you have higher than average intelligence.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwYvUEWV3cCRfz2iWx4AaABAg", "comment": "I will now do this I will mow do this I will not do this I will nod ot his I will now nd othi", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyHIa-UPX4E_T6ePFl4AaABAg", "comment": "In Grade 10 biology one of my classmates had PKU. He did a presentation on it. He is now a physician. He had to maintain a strict diet.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwmGYetZcUq-0e_fzZ4AaABAg", "comment": "I'm in", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwiSdNzfYf0H-coH-F4AaABAg", "comment": "I love having access to these lectures.  Thank you Stanford for making these accessible to the public.  I have always been interested in why people do what they do... I remember when I was about 10, I asked someone why 2 people can have the same experience and respond in such different ways. I was referring to siblings with alcoholic parents- why might one become an alcoholic while the other might stay away from alcohol. Both might say its because their parents were alcoholics that they either followed that path or avoiding it. This kind of thing always intrigued me. Later in college and through research(I never went to high school),  I gained more understanding of biology. Biology fascinates me as well. This lecture series brings the two together seamlessly and holds my attention extremely well.  I have been pondering returning to college to study something in the realm of biology for quite some time.  After getting a concussion early this year, I've become almost obsessed with understanding how this intricate machine we call the human really works. I'm especially interested in how body & mind interplay. How internal is affected by external. How physical is affected by mental, and how mental is affected by biological. This series is filling in some gaps in my understanding & I can't express enough how much I value that. So, thank you again for making this available. Thank you, Robert Sapolsky for making it so engaging.", "votes": "10", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwI8ePrfiWbE_zh6r54AaABAg", "comment": "He's like the Bob Ross of human biology!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzGbINXqDQJthT51v54AaABAg", "comment": "The Bob Ross of Biology.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxRS7q3768CDcWHLoR4AaABAg", "comment": "58:24 ThaT sounded like sum1 yawning belligerently exactly 4 seconds after speaker coughs. \" Stomach problems!!\"  Haha . Some 1 timely slipped some enzymes n her Diet Dr Pepper Cherry  as the lights went out. Hshaha I did ThaT once when I was n 2nd grade. Very immature.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx3yk624Lc3GyeHhIh4AaABAg", "comment": "The amount of coughing in the background gives me anxiety on 2021", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyecRObYc3ThUCpCjZ4AaABAg", "comment": "Rumour has it in this class there was a future celebrity😎😂", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzo55ENWudfNno6UCx4AaABAg", "comment": "What is the definition of “gender” that he uses in this lecture?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwvD-AMzvsrt2WLPRh4AaABAg", "comment": "22:50 big consequences with insertion and deletion", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyDvB1BM_co2x0ixnl4AaABAg", "comment": "Enjoying this during COVID 19", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwLwWw_t41GJOmwU014AaABAg", "comment": "Robotic", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxr73R9ZM6O4B3AD3J4AaABAg", "comment": "it's  responding to context genes then just are tools", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRz-nry8EKgwSyCr94AaABAg", "comment": "To my way of thinking it appears that there another intelligence at the cellular level", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwZHAabYL2prVIXqmZ4AaABAg", "comment": "😂 the 'jerks' and 'creeps' jabs", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg", "comment": "He has a real gift in giving lecture. it is hypnotizing and effective.", "votes": "0", "replies": "9", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg", "comment": "4:51 for a molecular biologist, what is evolution about? -genes: not just as some entity to maximize but also as molecules, i.e., genes as information, as strings of DNA etc. -intermediary: proteins -proteins structurally the most important things you've got making up cells: • hold the shape of cells together • form messengers, hormones, neurotransmitters • are the enzymes that do all sorts of the most important stuff => are the workhorses of what have cells doing what they're supposed to do 6:20 how to code these proteins?  -where the genes come in.", "votes": "0", "replies": "9", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyhujtcWmmEMP_YWI54AaABAg", "comment": "I feel like I understand what he's saying when he talks about how important epigenetics is, but I don't understand the throwaway line near the end when he says that sometimes the DNA sequence itself isn't that interesting.  I mean, sure, outside influence can determine whether a given gene activates or not, but it can only influence genes an organism already has.  That is, all potential outcomes for that organism are still limited by the organism's genes, it's just that each of those genes and gene combinations happen to have more possible outcomes than we might otherwise think, based on outside influence.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz2TTZ3eUEns4Iq0Nh4AaABAg", "comment": "This lecture literally includes all genetic stuff we had in 11th grade for HALF A YEAR", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwLwWw_t41GJOmwU014AaABAg.9OFq4j81TV_9Oa8EWQIzHJ", "comment": "what u mean man if u mean he sounds robotic ur insane. This guy sounds like he cares about it lmao.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9OCwOhJizWM", "comment": "Yes, that is what it seems like to people who have never heard his trivial musings. The problem is that this is worthless knowledge. It's on a level where you can't do anything with it except to imagine that you are smart. One wonders why Stanford is paying him to give these trivial lectures.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9OD1hLYstmt", "comment": " @schmetterling4477  why do you find this information worthless?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9OD2P4ZJ7XP", "comment": " @cyglass  You can't solve any problems with it. It's like being told the names of the colors in a painter's palette. It teaches you nothing about art or how to compose a good painting.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9OD6M4R1Zzs", "comment": " @schmetterling4477  well that's ridiculous. These are building blocks to developing an understanding of the human condition. If you truly don't get how this can help with honing common sense and good decision making skills then I don't know what to tell you.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9OD82rWx7qm", "comment": " @cyglass  I can only tell you that if you go into a serious job interview with this level of knowledge, then you will make a fool of yourself. This, on its own, is totally useless stuff that a professor throws on the wall for you because he doesn't know or doesn't care to teach professional level science.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9ODChtnUwy4", "comment": " @schmetterling4477  I think you sound like a seventeen year old whose good grades have gone to their head.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9ODlX_NUH0R", "comment": " @cyglass  That is true. I had great grades in high school (but then, high school is trivial stuff). I didn't do all that well in university, though, and I am not ashamed of that. You know why? Because none of the classes that my university offered were fluff. They were all tough and packed densely with scientifically valuable material. In other words, the teachers deliberately made it hard to get good grades. However, even if you didn't get good grades, you still learned more than enough to become a useful science worker once you were on the job.   The point here is that Stanford is selling a course that will not give a job applicant any marketable skills, which is a very sad thing for a university with such a grand name as Stanford. One would think that they have better quality control and higher standards, but they don't. Or maybe they just have to offer some classes that even the athletic teams can pass without studying. Yeah, maybe that's it.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9Oa9JcmKCu0", "comment": " @cyglass  YOU'RE ARGUING WITH SOMEONE ONLINE BROTHER DONT DO IT STOP LOL RUN REMEMBER DONT ARGUE WITH IDIOTS ONLINE. ITS JUST A WASTE OF YOUR TIME. NEVER DO IT haha ok im out have a good day", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwCGjOXsHtPD6aRkNZ4AaABAg.9OAQdw8G-9b9OcKC_Jb9An", "comment": " @torin8871  Call it morbid curiosity", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OCwUoV7-2P", "comment": "This isn't molecular biology. This is just trivial oversimplifying nonsense.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OCzQ8CjFtt", "comment": " @schmetterling4477  hey man, I was just trying to take his notes up, but you're probably right about the oversimplification part", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OD0Or9SJwv", "comment": " @prayaanshmehta3200  The only real question is this... why does a university like Stanford offer this as a course???? This has absolutely no academic value. A student won't learn anything here that they can use to solve a scientific problem. Furthermore, if anybody is naive enough to write \"molecular biology\" on his or her resume after taking a class like this and the person conducting a job interview latches on to that and asks a real molecular biology question, then the interviewee will have automatically flunked that interview because he or she won't be able to answer the trivial question that they are going to be asked. And, yes, I have seen actual interviews like this in person. The candidates had no chance whatsoever and they actually made their chances far worse by pretending to know things they knew nothing about. Not only that, but they turned into utter humiliation for the interviewee and felt embarrassing even for the interviewing manager.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OD7Bbelh5R", "comment": " @schmetterling4477  in my opinion the whole point of this course is to just provide a generalist multi-field approach towards analysing human behaviour, and thus it really won't be possible to get into depth of any one of the topics: whether molecular biology, or neuroscience or anything else, but just enough so that the student gets a broad overview. I feel you should really read up sapolsky's book behave and I've heard from the ones who complete the whole course that it's pretty great as well. It's just that you can't make everyone an expert in all of those sub-domains as any attempt to that would defy the whole purpose of this course, that is just to identify the various layers at which behaviour operates. As per the job interviews and resume part, I really don't think it works like that. This is a non-certification course and it's true that just watching a couple lectures within an introductory course can't deem you eligible for a domain-specific job. With that fact known, this still remains a great source for anyone looking to just fulfill his curiousity and focus just on the learning part more without having any prior background knowledge, just like it has helped me", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OD7OVsXkip", "comment": "And after that you can obviously go deep into whatever domains you'd like, just like I'm pretty fascinated by neuroscience and I'll probably go onto cover more in depth courses in that from a course which'll teach me just that", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OD8w6G0ZLs", "comment": " @prayaanshmehta3200  You aren't getting any money in the real world for being a \"generalist\". You are being paid to solve actual problems. A person who can solve actual problems of human behavior is called a \"therapist\" and they don't need any of this, either. They need to understand the psychological development of individuals and how to successfully correct deficiencies that hold individuals back from achieving a somewhat balanced and happy state of mind. Genetics plays no role in that job.   So you have heard that he has a book that's pretty great? But you didn't read it cover to cover? You don't have it in your book shelf? OK. Well, in my field there is a book called \"Gravitation\". It's 1300 pages densely packed with physics and formulas and I did read it cover to cover. If I wanted to tell you something about it, I would give you a proper citation with chapter and page number of my edition. That's what professionals do. They don't just wave generalist statements around and pretend how much they know because somebody has written a book that they haven't even read.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9OD9AUaHU7s", "comment": " @prayaanshmehta3200  You may be fascinated with neuroscience, but you obviously don't know anything about it. So what? So absolutely nothing.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9ODDpYeR-P1", "comment": " @schmetterling4477  damn man way too many rude personal assumptions lol. And way too many insane disagreements with whatever you've said to argue, I'm sure you'll be right in whatever context of life you're currently at. Good luck for whatever physics specialisations you're persuing mate", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw5nYJPDho07-OxpU94AaABAg.9NwvRIwkzhw9ODkBBOu5f3", "comment": " @prayaanshmehta3200  It's not a matter of luck, my friend, it's a matter of knowledge and skill. That was my entire point and you clearly missed it.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugw1OI-p3tjOuSGDZhV4AaABAg", "comment": "I avoided watching this dude for a while cause he reminded me of Charles Manson. Now I'm hooked.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzLgoLKrxJU_j7ZkWx4AaABAg", "comment": "Glad to hear that \"scientific\" communism fails to accuratly represent reality once again! Graduated equilibrium and dialectics are stupid", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgycXTLs-PkCzrbv90d4AaABAg", "comment": "I would love to monch on this man's beard", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwuJWNBAAgROnO4Z4p4AaABAg", "comment": "Here trying to figure out if molecular genetics can explain why my GF is so petty...", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwe9yjrqj-Ru01OogV4AaABAg", "comment": "positive vibes ... Robert Sapolsky your the man", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwrBtabYLJraNmwrSd4AaABAg", "comment": "What does this person need to not do", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyl9TO-oHmXqTLJMmh4AaABAg", "comment": "The black squash phylogentically list because shovel cytologically seal amid a hanging editor. gaudy, magenta wood", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx017kfZL2sJuBXPqt4AaABAg", "comment": "These effin lectures are mind-blowing.  Extremely grateful that this guy (me) , who probably only graduated high school because his siblings died, is able to watch content such as this.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzmNQKRXmFvUEZhGLJ4AaABAg", "comment": "You tube fuck off with autoplaying this absolute god damned drivel thats 10 years old to add.... how many fucking times do I need to press Im not fucking interested ...", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyuRuBbJ3PFe6C9iA14AaABAg", "comment": "Anyone who has made notes? Share them. Lol", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgytgeGxv6UKYR8KSzd4AaABAg", "comment": "Where is lecture #5?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyyI3UaPAm_WJHvLIR4AaABAg", "comment": "a Decade down the line and this stuff is still relevant as ever.", "votes": "4", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzmzAwPnjJbMmVaFGV4AaABAg", "comment": "I would love to be as educated as Robert Sapolsky!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzEnsobULinm3iCYuV4AaABAg", "comment": "I would love to be as educated as Robert Sapolsky!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxgk_2s5bOiUz65pIl4AaABAg", "comment": "that we get this for free is such a blessing", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw_wZwCI8_GjjAIE0B4AaABAg", "comment": "I had no problem spelling benzodiazepines... English major.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwnLZwKGU1pIhC-_2l4AaABAg", "comment": "54:43 Gould is going to lose was mentioned earlier and the last sentence before the above time and it's a odd that this is correlating with the infamous Detective Gould that Is currently destroying my life as he has me  mistaken as a violent criminal which has me looking outwards to realize I'm good. I have learned how to negentropicaly phase congigate longitudinal waves creating implosive DNA or the bliss experience. Hard to hold in this ragged new world of new out of the ordinary normals.. the new norm. Fart!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw9ELOr7dNUri-t25l4AaABAg", "comment": "33:44 10 years later and here we are..", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzV5PoyDiiUccAvbcp4AaABAg", "comment": "I imagine the 326 dislikes received both the acne and the penis. 🥺", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxpuCOIX3aQ0M-Z7jl4AaABAg", "comment": "This is so relevant to what Bill Gates is Doing to Humanity in 2021   :( QC", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwuJWNBAAgROnO4Z4p4AaABAg.9NmFYyQoACl9NrM9gAtqS3", "comment": "environment shaping", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyyI3UaPAm_WJHvLIR4AaABAg.9N8VRbK5O_f9NFWx0KbhO9", "comment": "Why wouldn't be?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugx35rAquqZMGcA2Gwh4AaABAg", "comment": "Solingen scissors is the treatment.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwKhZWr7FW6-mnu51V4AaABAg", "comment": "This dude is amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzgQNOeNRVzqKfiE-B4AaABAg", "comment": "Iam soooo happy i found this ..wow what an amazing teacher", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgywwvEgIW_t1pFGLdp4AaABAg", "comment": "Here's something to consider: How lucky are we that we can actually listen to somebody as intelligent and eloquent as this man who literally is educating some of the most educationally privileged people in the world? I'm really grateful for this, because I can't afford to go to college, because information is so valuable to me, more valuable than money, and I truly enjoy having different viewpoints that challenge my belief structure. This guy is so engaging, so intelligent and yet so gentle when he disseminates so much information. He truly wants to educate people, so he is truly in his own element. We're lucky to live in a time we can actually enjoy this kind of information because we want to, not because we have to, not because anybody told us to, but because we want to enrich our lives. Anyway, everybody have a great day!", "votes": "50", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxqppwz5OfJeiZIVt14AaABAg", "comment": "\"The most important consequence is that contrary to classical evolutionary theory, the processes that drive the small changes observed as species diverge cannot be taken as models for the evolution of the body plans of animals. These are apples and oranges, so to speak, and that is why it is necessary to apply new principles that derive from the structure/function relations of gene regulatory networks to approach the mechanisms of body plan evolution. - Evolutionary geneticist E. H. Davidson, The Regulatory Genome: Gene Regulatory Networks in Development and Evolution, Elsevier Academic Press 2006, p. 195  Dr. Roger Lewin commented after the 1980 University of Chicago conference entitled “Macroevolution”:  “The central question of the Chicago conference was whether the mechanisms underlying microevolution can be extrapolated to explain the phenomena of macroevolution. … \"At the risk of doing violence to the positions of some of the people at the meeting, the answer can be given as a clear, No.” Roger Lewin was a staff member of New Scientist in London for nine years.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzdQn3wx2l25UMIjkt4AaABAg", "comment": "At 15 min now I understand the corona vaccine even more it's a RNA virus forming our DNA", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgypLU0QpCQGnuVficV4AaABAg", "comment": "This is the best answer on YouTube for anyone who doesn't take Covid seriously. But they're probably too smart to watch it.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyqVwAwrTx0ewHsA9Z4AaABAg", "comment": "So what was that noise?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw-KNiL2avpNbFWI9R4AaABAg", "comment": "Thank you for the glimpse into the wonders of human advancement.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyTAt2dTol6ie4cK-l4AaABAg", "comment": "When I want to pretend I'm smart I put this bad boy on.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyzR3ofue-lBXVEKex4AaABAg", "comment": "1:00:15", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRvrESAd-zR1O7xFp4AaABAg", "comment": "The unaccountable hamburger clearly decide because ex-husband coincidentally command until a clear paste. private, bored shake", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgySNWTe1XThK3g8f3B4AaABAg", "comment": "The obsequious tulip seasonally load because delivery considerably shelter by a half spleen. recondite, thundering move", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzHU36_ydteEEu0PnR4AaABAg", "comment": "The jobless brow precisely live because salt metrically replace as a jagged jam. divergent, wild timpani", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyUvf2Km02hADI19Up4AaABAg", "comment": "I'm starting to change my mind about the course that I wanted to take in College, since I'm getting fond of Mr. Sapolsky's lectures.", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxK7MbtO0WxmfB83hx4AaABAg", "comment": "The problem with western genetics is that it is based on impulsive identifications that have no general consensus, just so called scientists coming up with their attention seeking names and symbols.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzZ8Nbc-0aM1GidAgJ4AaABAg", "comment": "This is basic knowledge.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyu7vso8HzKE7h2UNZ4AaABAg", "comment": "Netflix doesn’t even have anything this binge-worthy.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgztLc-PgL89rIVAvm14AaABAg", "comment": "Genius is obvious when u see it", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzllellwjXTFAaNT194AaABAg", "comment": "34:20 \"Yeah... puberty... sometime You get acne, sometimes You get penis...\" ba dum tss", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgywwvEgIW_t1pFGLdp4AaABAg.9M6Vb8o1bAc9NaJYhZ_hsF", "comment": "I think you will also apreciate the YT channel of dr #RobertMorsend, just give him a try", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgywwvEgIW_t1pFGLdp4AaABAg.9M6Vb8o1bAc9Nb3cJL8lmF", "comment": " @galadrael  thank you! I appreciate it!", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzZ8Nbc-0aM1GidAgJ4AaABAg.9LT6g6qcaSv9LXDrUOB9H8", "comment": "Ummm excuse me?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyKboSJiT1-ZOySHAp4AaABAg", "comment": "Skin tag n*** proper phrase skin tag yes I have that too couple of them", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy9BFb98mRdjyFkhEF4AaABAg", "comment": "Does anyone know if this information is still relevant/correct, since it's been 11 years after this lecture was made?", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw1jA8IOQp_JrPlQKp4AaABAg", "comment": "1:08:40 How can explain why 7 variations of proteins? A,B,C,AB,AC,BC and? 0?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxjLAtJT7VVdSH_5fV4AaABAg", "comment": "💯 would be down to be crooned to bed together with these speeches lol", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxlhLCSxAG_VbrP3gJ4AaABAg", "comment": "47:00 so this means ALIENS?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzhBOkNXyJN9aUMSBl4AaABAg", "comment": "If I had had a professor like this spectacular teacher, I would have continued to study science.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxxNgjtkXoRUCijWSt4AaABAg", "comment": "thank god it's friday  <3 neuros", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxgO16398DSvHvqi4x4AaABAg", "comment": "The obnoxious fiber inevitably disarm because begonia ophthalmoscopically smile besides a used japanese. fabulous, angry lisa", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzgi6DSAiIz4FfXDFp4AaABAg", "comment": "His lectures are great for those that are trying to learn.  I wonder how  his tests are.  He does a great job of illustrating the fact that nothing in phsychology is unidimensional, but that makes test taking difficult. With nothing being black and white, what would a multiple choice question look like? I'd be terrified to answer an essay question. I would love to see a sample test for him.", "votes": "5", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy1nIvlKSuMk7Ce0HB4AaABAg", "comment": "What came first, the DNA or the proteins that translate it?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzzeKCtwNkYNQ5Lmcp4AaABAg", "comment": "what happened at min 51:00?", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugytf0uIDYAyDtSFErN4AaABAg", "comment": "Are the catch-up sessions on Youtube aswell? I feel like I should have attended them just to get back into his headspace!", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwSCWwSQrE-hhQUvXZ4AaABAg", "comment": "Thank you for this video", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxATI8hkWIL6sa8dgV4AaABAg", "comment": "51:40", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzRzHi6Lg04DYWWukp4AaABAg", "comment": "The shut battery explicitly order because lock unexplainably knit per a erect taiwan. thin, nostalgic suit", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy-WDT20XQcWQTFrGF4AaABAg", "comment": "I’ve found that I remember things more when I read them, so I’ve turned on the subtitles. Now I have an audio book.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxbOtEAGYE93nvfhS54AaABAg", "comment": "Funny that the vaccines violates the fuck out of central dogma", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxqRaf4hrAWAXjS5ad4AaABAg", "comment": "Funny that he mentions RNA viruses", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgydcMQNidrX9tR9ULt4AaABAg", "comment": "What happens at 51.30?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxgBfqBB6e0f1LHsuF4AaABAg", "comment": "Evolution is being driven by our environment in my eyes. Which is getting worse. So how can we be evolving in the right direction. Natural foods are needed for good genes and we live on rubbish. We are just becoming weaker than we were.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw1jA8IOQp_JrPlQKp4AaABAg.9KxwZWfd5n69KzC1wguISx", "comment": "probably ABC", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugzgi6DSAiIz4FfXDFp4AaABAg.9Jl2GeFdCJy9XE0Xxx1P_I", "comment": "would probably die with an american style essay😂", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugzgi6DSAiIz4FfXDFp4AaABAg.9Jl2GeFdCJy9akE8DFGCJN", "comment": "I would think it would be an essay weighted format with some terms to define or provide an example of as well as identifying key figures and their contribution to the science.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzRzHi6Lg04DYWWukp4AaABAg.9JJ9j_ELB0T9JQ8dul6lYo", "comment": "That’s what they all say.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy-WDT20XQcWQTFrGF4AaABAg.9JFWaBQPiV69MtDOw1Z5x8", "comment": "He's written a book on the contents of this lecture series. Currently reading each chapter and then watching the part of this series on that topic. I can retain information much easier and longer this way.  Check out the book, if you haven't yet", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgydcMQNidrX9tR9ULt4AaABAg.9J2lTOcc7ty9JJZgHUaReX", "comment": "The lights went out", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxgBfqBB6e0f1LHsuF4AaABAg.9IrL_w1HMzA9JJ_2SKlLx7", "comment": "There is no \"right\" direction for evolution. It's only \"right\" in the sense that it helps us survive in our environment. If our environment selects for shitty traits, we're going to end up with shitty traits", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugwb5o3JV-sPKNxJp994AaABAg", "comment": "I have a B.sc. in molecular biology and this guy explains the whole genetics part better than what i got. And it's not even in my native language.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxpXrcm3tIzxKqqqAx4AaABAg", "comment": "sir that's one of my emotional support scientists", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwezt9cSKURoFYDlFB4AaABAg", "comment": "It is quite a big step from DNA to protein function and by no means does the function directly follow from the DNA or amino acid sequence.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxksSx8QL6UwQTCxsl4AaABAg", "comment": "@27:40 this is what I call a plot twist!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5BMA2RigIugJCLwF4AaABAg", "comment": "That means after/during DNA replication, all the epigenetic meta informations must be copied too.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw_dMVLhmjvwEQSdm54AaABAg", "comment": "I me me I my and mine! Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxlZCiIX3luHDihogt4AaABAg", "comment": "Has Someone understand why 40 of the 60 possible mutations will not cause a change in the amino acid  ( 44:30) ? and could explain me please ?😊", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxce5vcmgyQWEpu7id4AaABAg", "comment": "Getting in online on lectures", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyzZOSW6gmNEEhtE-F4AaABAg", "comment": "speaking of proteins  does anyone else here wonder what the pfizer self ordering protein covid 19 vaccine will do long term like i know it sets off anaphalactic shock in people that are already prone to it, but what about people that develop anaphalaxis at a later date, or what if it cases anaphalaxis at a later date with the right other enzyme/toxin in system or what it will do to people with blood clotting disorders(ace2 is part of acavenger system for ace1 process which supplies cells with oxygen as far as i recall) extra because to me seems like we are making millions of cyborgs without having a prototype test group that we can monitor for side effects for the main group following them seems like a pretty big evolutionary risk/step, reminds me of the azguard in stargate and how they cloned themselves to avoid a virus but then discovered they couldn't reproduce anymore and had to keep cloning themselves till their dna finally collapsed/became to corrupted..... not saying i think it will be that extreme, but i don't think its going to be without a long lasting  impact on humanity i feel we dont understand proteins enough to start injecting people with nano bots/self ordering proteins as a symptom suppressant, for a new mostly unknown single strand quickly mutating RNA virus, in my opinion we tend to go, this fits here, this is a protein for here, without considering the 100 similar shaped receptors it may also attach to under various circumstances.", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzV7B9367djAE6_OeJ4AaABAg", "comment": "No.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzX66uXhA-7a1L7a5x4AaABAg", "comment": "I truly love his lectures. I wish all my instructors were like Bob", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxGEEuOHvPhb4bX28h4AaABAg", "comment": "Doesn't that epi-genetics thing kind of point the finger towards Nurture over nature?  that's really interesting.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxkVDfhPpuEbky1t2R4AaABAg", "comment": "Show me something other than the beliefs I have. Until this, I will believe my belief. Why does this bother me?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwUrxlfCyzlh45KqB94AaABAg", "comment": "I am thankful for the professor as it cleared my doubt of prescription factors while I was studying A-levels. One thing that surprisingly came up to me was how our environment is more important than our genetics when he was talking about Epigenetics.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzbtkOxzR5tG_bpJ7d4AaABAg", "comment": "Thanks professor", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyQ40mzZ7tx3zrgKLd4AaABAg", "comment": "Smoke weed everyday", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzX4kJJLmK-HWxibVh4AaABAg", "comment": "2 whoever did this recording: You know from his last lectures that Robert is running around like a lion that has been kept in a cage for too long. USE HIS Mic! Or make sure it is working before class next time!!  The audio is bad! BAD! BAAAD!", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyoSHwPkTl9CwTdHTR4AaABAg", "comment": "We need another update on the \"Zebras\" book, please.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxkXWKHL-DBoToMp0F4AaABAg", "comment": "51:00 I don't get why gradual changes makes competition to be everywhere", "votes": "0", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxJqU52fqwT0WohD4F4AaABAg", "comment": "The smartest person in the room is the cameraman, he got free lectures", "votes": "5", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyzZOSW6gmNEEhtE-F4AaABAg.9ILS_db3Nmf9JQBZXoJu4j", "comment": "I think that you would be fun to hang out with. I don’t have a lot of friends who ask good questions anymore.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzX4kJJLmK-HWxibVh4AaABAg.9HaEn6N0hF39Qp5dkB28mX", "comment": "I hear it loud and clear.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxkXWKHL-DBoToMp0F4AaABAg.9HQwlx_ZfzY9HeYUzDAgKb", "comment": "I think perhaps gradual means small changes fairly often. Thus change is affecting the fitness of the species in the competition fairly often, i.e. everywhere in time.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxkXWKHL-DBoToMp0F4AaABAg.9HQwlx_ZfzY9HoWP23cwEN", "comment": " @REDPUMPERNICKEL  ok, I think it be it", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxkXWKHL-DBoToMp0F4AaABAg.9HQwlx_ZfzY9HoWQF7Hm4t", "comment": " @REDPUMPERNICKEL  thank you", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxJqU52fqwT0WohD4F4AaABAg.9HNadiJT3hg9OT-RFrso55", "comment": "Tripods r incapable of pertaining knowledge.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxJqU52fqwT0WohD4F4AaABAg.9HNadiJT3hg9wNi20TTRPT", "comment": "Probably one of the TA's who already took the class.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyJUAbG2XqU3jzDZjJ4AaABAg", "comment": "I think I really could have used some more visual aids for this lecture. Had a hard time keeping up!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyCdaD0n2QNhWjVnml4AaABAg", "comment": "17:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzOu6ufbK59YBsLg8l4AaABAg", "comment": "Can I take any whatsapp number for Professer  I want to ask him about hardy-weinberg", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyogoGgSMheWLYOghF4AaABAg", "comment": "I'm getting to this 9 years late... What have subsequent updates modified these ideas?", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxjMgZCKjdQKjWdojN4AaABAg", "comment": "Perfect lectures to geek out on! 🤓❣️❣️", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxn4y0vwTj4VSyZNYJ4AaABAg", "comment": "I'm thinking of DNA as just a giant program where code and data is freely intermixed.  Old-style code with lots of GOTO statements along with new style vastly concurrent processes.  Basically throw out any coding style you've been taught as 'bad' and realize that genetics doesn't adhere to a style guide.  It uses whatever works.", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxS2wlGT9L_KpD5rLN4AaABAg", "comment": "where are the catch ups?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgydvIToEdI86yATPjZ4AaABAg", "comment": "CANADIAN Accent", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzdfjy836ccscDpbJN4AaABAg", "comment": "Wow. I'm loving these lectures so much. This stuff has blown me away. I'm am now more fascinated and astounded by evolution than ever before. Thank you Stanford and thank you Robert Sapolsky. I will continue with this series.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgymbKJb-IiW5PbuHat4AaABAg", "comment": "Nice lectures! There is a small mistake at ca 19:45: it is always the last/third (NOT the second) nucleotide of a codon that, when exchanged for a different nucleotide, does (often) not change the amino acid it is coding for.", "votes": "11", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwI01Iqd4aKM-oJ-cN4AaABAg", "comment": "Absolute nonsense. He's got the basics mostly right, but his conclusion is way off. Regulatory regions of DNA are sequence specific and subject to mutational change, similar to protein coding regions (a gene is both the DNA regulatory regions and the coding region). Transcription factors are proteins, which are coded for in the cell's DNA and, like all proteins, are themselves subject to evolutionary change. Epigenetics (closing and opening of DNA) is mediated by proteins, which again are subject to mutation and selection and are ultimately directed by nuclear DNA. And as far as cell signalling is concerned, for the most part the major players are cell surface receptors recieving external signals and cytosolic proteins carrying these signals internally, oftentimes to the cell nucleus to effect gene expression. Again, these signalling proteins coding DNA and their gene regulatory sequences are subject to mutational change. In the final analysis, uncontroversionally, the information of a cell (and, by extension, an organism) is contained in its DNA sequence, and this information is used to direct its biochemistry by changing a cell's compliment of relevant proteins. DNA goes to RNA goes to Protein. Nothing to see here.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwPL2PJklBGXZWGYFd4AaABAg", "comment": "20:39", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwnOsO7OtMw1HRgijR4AaABAg", "comment": "So with all the redundancy which basically means a back-up plan in case something goes wrong the wrong thing gets overwritten by all the redundancy then you could have a missing part of the DNA coding which is not a complete program so the protein will stop forming at that point yeah I'm not a biologist you're losing me so to sum up biology is not a perfect system and there is no intelligent design behind it it's just chemical reaction leading to decisive or indecisive outcomes depending upon outside influences so what are you saying there may be some sort of intelligence behind it after all well it would seem to make some sort of sense that there would have to be multiple program running to transform proteins in two different cell structures skin cells bone cells so it's a step-by-step process", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxnXf8gZdeCGpsbN7V4AaABAg", "comment": "dude WHAT A CLIFFHANGER IS THIS MAN CHARLES DICKENS?!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwfcyD5ES8cNb2mrxZ4AaABAg", "comment": "Evolution is \"the Ebner Effect\". The promoter is controlled by the outside EM field. The women's body changes when her child alters her DNA abilities.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxT0qVQypg-wxFCHlB4AaABAg", "comment": "Thanks, Robert.  I had you for a week in '87-'88 first year survey, and have enjoyed following your books and on YouTube over the many years.  Hearing you tell all about the baboons helped make Stanford worthwhile.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgztIT4ow6oAFG-ume14AaABAg", "comment": "Just noticed his error at 19:50.  He has the position of the variable base in codons wrong...its 3rd, not \"middle\" position that can change with little consequence.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzJEAD_On7OaSV-hdt4AaABAg", "comment": "Yo, what's the meaning of \"gazillian\" (hopefully etymology included :p)?  Grande Sapolsky!!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxtod14fhz8B6fEaQB4AaABAg", "comment": "The whole promoter/transcription factor pattern kind of reminds me of event driven programming, like in javascript. Wonder if there are deeper connections here.", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxOtAvjyn9YMUF6kE54AaABAg", "comment": "7:52 is there variation from amino acid sequence to protein structure? I don't think it deterministically folds into the same protein structure every time, but curious how much variance there could be", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxn4y0vwTj4VSyZNYJ4AaABAg.9Gr-G85xarr9Qp5nLVSosb", "comment": "BASIC with .css that would be awesome", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgymbKJb-IiW5PbuHat4AaABAg.9GNYD4rmHQh9cG-ogOECds", "comment": "You are right, i am studying molecular biology atm. Was just going to comment this :)", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxtod14fhz8B6fEaQB4AaABAg.9ER0zHAcBgX9Qp0IxdtYsg", "comment": "I am certain that this has something to do with programming language design. How is a hard drive directory setup? These things are not new inventions, they are borrowed systems. And THAT, might be why AI can destroy is. We share the same DNA system code.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxOtAvjyn9YMUF6kE54AaABAg.9EKqW3w0PhA9cG0RyOrwzE", "comment": "There are general structures which can be expected from amino acod chains on the seconday level such as the alpha helix and beta plated structures", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyZrCZnkMWxOc55lMR4AaABAg", "comment": "That coughing is so disgusting and distracting. Hard to believe how acceptable that was less than a year ago. Really hope those sick people get better in the upcoming lectures.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxHnlh4hjmgMuRhPUd4AaABAg", "comment": "no glasses....", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgziaiY1h8OWQ3fKwrl4AaABAg", "comment": "https://youtu.be/Ejj-S-0B0XM", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz-rysPDcK_v95znAh4AaABAg", "comment": "200 years.....", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzKWG2bpDLTyk4YuaJ4AaABAg", "comment": "https://youtu.be/weQz5tGEKwE", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxpCt0Ujn2x2uuvrsV4AaABAg", "comment": "Like the human pupil, the rat's pupil size is highly variable. Under dim light, the rat's pupil can reach a diameter of 1.2 mm (Block 1969). ... Pupil diameter changes can be very rapid in the rat: a contraction from 2 mm to 0.5 mm takes only half a second (Lashley 1932). Next, the light passes through the lens.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxcHZA8cZYGl2ZR_MF4AaABAg", "comment": "is it corona mother ? :D", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyTezetBGdfomZVZWR4AaABAg", "comment": "https://youtu.be/LwsAYQFpLXY", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwWNPogFL9qhovOzIp4AaABAg", "comment": "One question - does he has family?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQxC9Xz3DfdMttp0F4AaABAg", "comment": "High quality education for all. More of this is exactly what the world needs.", "votes": "7", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzvyQU2wA8oT3viyi94AaABAg", "comment": "Did you see my Creation vs Evlution debate?  It is here      https://www.youtube.com/watch?v=6GivUPbmABs", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzfW8RUQRZKfiIr9uh4AaABAg", "comment": "I have binged-watched these lectures mutliple times, and I am fully aware that I do not retain enough to pass any exam, but when I listen to these lectures it makes me feel home. I keep finding hard sciences too cold and social sciences too... warm? Too romanticised? Anyway, you probably get the idea. This is right there in the middle, and it finally matches where I live in my head. It's incredibly comforting if not therapeutic.  I really enjoy swimming in this universe. Thank you Dr.Sapolsky for making these and Stanford for putting these up for free! This is my Netflix.", "votes": "227", "replies": "5", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzQanWlcJoYYz1lEKl4AaABAg", "comment": "急におすすめに出た", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxWVcg09LndkNOaw614AaABAg", "comment": "can someone explain to me where Sapolsky got the fact that out of about 60 possible mutations, 40 don't change the amino acid?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyYkFcEPjjpelSOkg54AaABAg", "comment": "Men have especial ability to communicate and make things understand easily...thank God", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwbs_2yqN6Gvy0vzcV4AaABAg", "comment": "1:22:59 me trying to figure out what smart joke I missed. Oh. They're just laughing at his drawing", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwDR3iI4wY3KXsxs8d4AaABAg", "comment": "No comment. God Bless", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwLWY2iL_YnrI2xZ2J4AaABAg", "comment": "That is not possible.... He speaks perfect, fluent English like no professor I’ve ever had privilege of hearing. So passionate about his subject and knowledge, full stop. An absolute joy.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzaV1NmvF02iaUVZxB4AaABAg", "comment": "What if his beard was his jaw.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwHqXucJDYlhRbHn5d4AaABAg", "comment": "45 years since i studied this  at UCLA, enormous breakthroughs, i am au current now. thanks", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzfW8RUQRZKfiIr9uh4AaABAg.9DYZClPvKJQ9EElEs2QOux", "comment": "I'm hoping it sinks in by listening. Way beyond my intellect but it's pretty cool.", "votes": "8", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzfW8RUQRZKfiIr9uh4AaABAg.9DYZClPvKJQ9diNvxlU_D0", "comment": "same 😅", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzfW8RUQRZKfiIr9uh4AaABAg.9DYZClPvKJQ9eq_b23Hm00", "comment": "Such a great explanation. Couldn't agree more!", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzfW8RUQRZKfiIr9uh4AaABAg.9DYZClPvKJQ9y9nvG5Hiee", "comment": "​​ @Themultimediaguy Proactive osmosis. That's my strategy, too.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzfW8RUQRZKfiIr9uh4AaABAg.9DYZClPvKJQA6sQGKvN8jS", "comment": "​ @ingridaholmes  indeed ❤", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxunFrOAsAeiByBEj14AaABAg", "comment": "🙏", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxRikhoCFxgaRZwO_Z4AaABAg", "comment": "can you translation your lecture in arabic please", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgytcMXdnIn1e0qzX3l4AaABAg", "comment": "Yak,Yak,Yak show me one chemical reaction that seeks out energy to self perpetuate. Egg-head academics believe that space and time (immaterial) create material things but they cannot accept life as supernatural. They can't find one self replicating chemical reaction in nature that could lead to life. Frauds like this guy always start their fairy tale in the middle but never at the beginning.", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQhWWpgG_KKqJK7Z54AaABAg", "comment": "THE LAST FEW QS!!! I WAS THINKING OF IT!!! This is the first time it ever happened!! Usually when I think of qs in lectures the drs never have an answer for it, or an unsatisfactory answers, but this is the first time, a professor voiced the EXACT same question Ive been thinking about in epigentics.. wow.. I wish I could meet Sapolsky 🥺🥺 stanford is sooo lucky to have him!! Its not fair 😭😭😭😭 I never knew epigenetics was a thing!!!! I was soo mindblown multiple times during this entire lecture!!! Wow.. is this what real teaching is???", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwaH4fZhTziDbg_UWJ4AaABAg", "comment": "that is madness", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwjc-kAjr33IIWdXlF4AaABAg", "comment": "hey young girls, aged 18-23 , do u find this man attractive ( i know he's older i don't care just answer the question)????", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxl9fbOq4V8C49RuVF4AaABAg", "comment": "Evolution became a laughable myth in the 20th century, during which it was disproved by millions of discoveries. One such discovery is that polymerase is a product of it's own translation, which proves Special Creation. Another is the discovery that the cell's structural design is not generated by genetic information, but is instead passed on by reproduction form the reproductive cells of the parents (Cortical Inheritance/Cytotaxis) which traces back to the original created organism. Evolutionism is a philosophy which is contradicted by science. Over 100 yrs ago, Evolution Theory was plausible for naturalists because of their rejection of God. Biological science was rudimentary and archaic, and provided no information about the operations of the cell. Modern biology has very greatly changed what is known of genetics and biology. It has been discovered that life is based upon information which is digitally encoded and stored in a more compressed form than man's best computer compression schemes. DNA is a material medium encoded with information which is organized to conform to linguistics, possesses algorithmic information processing operations (Dichotomy in the definition of prescriptive information suggests both prescribed data and prescribed algorithms: biosemiotics applications in genomic systems, David J D’Onofrio, David L Abel and Donald E Johnson, Theoretical Biology and Medical Modeling, 2012), and the human language properties of phonetics, semantics, punctuation, syntax, grammar, and aprobetics, all of which have been discovered to be more complex that the properties of human spoken languages (Complex grammar of the genomic language, published in the journal Nature, November 9, 2015, Karolinska Institutet). The information input and output processing of DNA includes the analytical operations of proofreading, information comparison, cut, insert, copy-and-past, backup, and restore, all of which operate by algorithmic operations. There is no potential for the material actions of chemistry to produce information, algorithms, and linguistics. They are non-physical fundamental entities that can only be produced by intelligence. This fact is proof that all life was designed by a mind of supreme intelligence. Because of this and many other biological discoveries, it has been overwhelmingly demonstrated that evolution is impossible and creation is a scientific fact. DNA is a 4-dimensional (3 dimensions+time) operating system which is far more complex than man's computer software technology, posessing many thousands of information hierarchies and pathways in the cell. When the DNA molecule is supercoiled as chromatin, some of it's information is available to the cell which is not available when the molecule is uncoiled, and when it is not supercoiled, some of it's information is available to the cell which is not available when it is supercoiled. DNA is a dual-directional information package, providing different information depending upon which strand and direction the transcription machinery of the cell is traveling. Man does not know how to to write computer software that can be read both forward and backwards to provide separate information processes and functionality. It is beyond our ability. DNA's individual information sequences are overlapping and nested sharing nucleotides between sequences, and information in different locations of the molecule are interdependent with each other, even when separated by hundreds or thousands of base pairs in distance from each other - a feature which exemplifies why chemical processes cannot design DNA. DNA possesses codes built upon codes which regulate the use of each other, even when they are distant from each other in the molecule. Genetic algorithms and information possess forward-thinking properties, which nature is incapable of producing because molecules are not sentient. During an organism's development, the genetic information instructs the cell on how to turn on and off, like chemical switches, many sequences of information of the DNA in a supremely complex and yet to be understood orchestral arrangement of various groupings and orders so as to build the structures of the organism over time. These patterns of genes being switched on and off is so complex that man will likely never be able to decipher it. If you want to believe in evolution because you refuse to acknowledge the existence of our creator, nobody can stop you. But doing so is to be a denialists of the discoveries of modern science because the truth is uncomfortable, and to continue to believe things which the outdated concept of Charles Darwin over 150 yrs ago could not have predicted. Believing in evolution today is as antiquated as it was to believe that flies arose from meat, or that frogs arose from mud a century prior to Darwin.  Eugenie Scott, a militant anti-creationist and promoter of evolutionism has stated, \"If your local campus Christian fellowship asks you to \"defend evolution,\" please decline. Public debates rarely change many minds; creationists stage them mainly in the hope of drawing large sympathetic audiences. Have you ever watched the Harlem Globetrotters play the Washington Federals? The Federals get off some good shots, but who remembers them? The purpose of the game is to see the Globetrotters beat the other team. And you probably will get beaten.\" Atheists in fact hate the Scientific Method and refuse to employ it. The most agregious example is the scientific knowledge of the effects of random genetic mutation. Random genetic mutation experimentation has been conducted for over 80 years. Over one million studies have been concluded, and they have provided consistent results demonstrating that random mutations are destructive and have negative effects upon organisms, both biochemically and anatomically, and do not add anything useful to the physiology of any organism, not even incrementally. What do we therefore conclude? We must conclude that mutation cannot be a mechanism for accruing change that results in macroevolution. But what does the atheist conclude despite such a massive body of evidence? They continue to claim that random mutation IS a mechanism for accruing change that results in mind-bending complexity, microscopic interdependent machinery, and macroevolution. They do this not because of science, but because their worldview requires it to be, since if evolution were true, random mutation would have to be the base mechanism for evolution since genetic information prescribes the features of organisms. In this way, they refuse to come to the correct conclusion because of their paradigm, tossing out the Scientific Method and the conclusion it would require them to accept.", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw_OR5OHqnaf35q32R4AaABAg", "comment": "His behavior is very anxious .", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwq-ekPit2Y-JPVdjF4AaABAg", "comment": "Can someone please share the entire playlist", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzEYy_AuN7L1TfxmgR4AaABAg", "comment": "I need me a \"show me the genes\" T shirt", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQTVfINX6N6mZzMCl4AaABAg", "comment": "Damn, these lectures have made me rediscover how much I love learning. School being too easy and boring pretty much beat that out of me. Now I know again what it's like to actually be curious!", "votes": "14", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx20qswP5KdchhYhDB4AaABAg", "comment": "These lectures are an utter complete waste of time. A book will teach you all of this so much faster and more efficiently. Lectures are tiring and a hindrance that will lower your grade. If a student can not discern the important from the unimportant without the use of a lecture, that student has already flunked.  EDIT: The positive upside about recorded lectures is that I can sit at home and play videogames whilst listening and learning at the same time.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzH9IZmHBGHSLk_HnV4AaABAg", "comment": "whoa, I just can't stop watching his lectures. I can't work, I can't do chores, I'm frickin addicted!", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyEFEpbZ__xWuwR-ZJ4AaABAg", "comment": "I remember reading a paper that proposed homeobox genes and other key developmental genes that control the expression of lots of other genes, as a mechanism for punctuated equilibrium. I can't find it unfortunately but it makes sense. A mutation is very likely to screw things up fatally, hence long periods of stasis, but every once in a while the mutation is actually survivable and results in a big change.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzRun01Pw7iYjSj1kZ4AaABAg", "comment": "These promotors that are affected by things in the environment that then cause one or more genes to activate reminds me a lot of 'event listeners' in programming. Basically when an event occurs like clicking a button or moving the mouse or pressing the escape key, an event listener fires and then the program can execute one or more functions in response to the click event or mouse move event or escape keypress event, this is very intriguing and the way I kinda figured DNA actually worked all along, because it can't just make proteins Willy nilly it still would need a way to time when to have the body make a protein, and at the same time it would need to be able to tell the body to simultaneously make one or more proteins in response to a single event in a parallel way versus triggering a Cascade of responses on at a time in a serial manner, it makes perfect sense to that the junk dna would not so much junk dna serving no purpose", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy-Ey4OkWIHbZuuNZB4AaABAg", "comment": "His damn gray matter's oozing out of his beard he's got so much.", "votes": "8", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyfFMJajo05dWN0rI94AaABAg", "comment": "If this guy taught me in high school I would have ATLEAST got a D.. damn.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzYimYhupkPeraE3T14AaABAg", "comment": "Is there a new series I should be watching first already? How much of this is out of date? Besides those killer fucking Sapolsky jokes, those are comedic gold.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxgsJEuKhly_sfPxTl4AaABAg", "comment": "5 mill plus viewers first episode, 850k this one.. More for me.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx9z4YOvOwiSc2_zwp4AaABAg", "comment": "59:25 The professor says that the geologists are not studying evolution because they are not biologists.  The geologists are studying fossils though and came up with an idea to explain evolution. I understand it's not in the job title but seems highly related. It's like other fields were looking at it too miopicly and geologists were able to pull out and see a bigger picture.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgytcMXdnIn1e0qzX3l4AaABAg.9BtlZGiSOC29CQgcWfIBhL", "comment": "You stupid.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxl9fbOq4V8C49RuVF4AaABAg.9BKStTZ2G6A9CQhIXmSRkb", "comment": "And who is the \"Creator\" that you speak of?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxl9fbOq4V8C49RuVF4AaABAg.9BKStTZ2G6A9M1QuL-sUgp", "comment": " @blacklegsanji3339  There is more than one entity that fits the bill?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugwq-ekPit2Y-JPVdjF4AaABAg.9B8QjB2YcQN9EElUVT4oaW", "comment": "I know. I seem to find the next one by scrolling down about 10 videos or so. Hope to find a playlist too.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugwq-ekPit2Y-JPVdjF4AaABAg.9B8QjB2YcQN9Qp9WQe9_Iy", "comment": "Go to your library tab, that’s where I find the play list. Might help to save the video as well", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyEFEpbZ__xWuwR-ZJ4AaABAg.9AreSZLIr8c9JQALgnvn9I", "comment": "It’s still a lot of happy accidents to make millions of species and the general trend is towards extinction with more species becoming extinct than being produced.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy-Ey4OkWIHbZuuNZB4AaABAg.9AcgUt4j15T9NaGXO6zzJo", "comment": "maybe you want giving a try on YT channel to dr #RobertMorsend too", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwbPkVW-o9s8hFoC5Z4AaABAg", "comment": "46:00 Ancient Aliens.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwjiID2c60qjRgFgxJ4AaABAg", "comment": "I always thought of amino acids as lego bricks. you can shape them in a variety of ways for doing so many tasks", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzZ5pEe9W-P7Mt75p14AaABAg", "comment": "1:10:29 \"You can find any pattern you want to any level of precision you want as long as you're prepared to ignore enough data.\" mattparker", "votes": "6", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxqRCoS_uM0i8YCF8x4AaABAg", "comment": "I'm in my first year of high school and a artist but i just want to listen to something to fulfill my interest in psychology so I'm now binging all of these lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzt3ob6TRAHNDPSy0p4AaABAg", "comment": "I'm so annoyed at whoever forgot to turn on the camera after the break", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw75VhNbUxnuYRLYoF4AaABAg", "comment": "\"And that's how you get evolutionary jumps\" right at the end. What a cliffhanger!", "votes": "15", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwYwoby7gxWBFKINA54AaABAg", "comment": "37:54- mark", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgycBujyrp45ToL4Bfp4AaABAg", "comment": "Minute 58:33 I died XD XD XD XD", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxmDslvX5UiM4lXL9h4AaABAg", "comment": "i am a molecular biologist. and fucking he makes me laugh at myself.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxpgr9jP2u9So43wQV4AaABAg", "comment": "The last third of this talk was absolutely mindblowing , exons/introns, transcription factors, chromatine, methylation & epigenetics ... daaamn, mega-fascinating !!!", "votes": "2", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxN6c8r8QO7i6TGtGB4AaABAg", "comment": "rats' lives matter", "votes": "2", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugww5kUfB9y_RfBdL794AaABAg", "comment": "Amazing lectures! \\o/", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzcC3UV02FwxpPD8uZ4AaABAg", "comment": "Fascinating and enlightening", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzbSnRJsaZjo4WHK4h4AaABAg", "comment": "27:30 my favorite part lololol", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxbqzwRmI93nCRT9OF4AaABAg", "comment": "20:43", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzPvuueKb_FmkIeGft4AaABAg", "comment": "A real Master Class!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyXTACYPY8HPAE3x7p4AaABAg", "comment": "College can be super cheap or free for taxpayers and students.    Government paying everyone's tuition would be such a waste unless it's made cheap via online first.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw3sJPcdotoS9BggnJ4AaABAg", "comment": "Thank you Stanford Thank you Robert Soplosky", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxt3A7GcYKtNJ6JUx94AaABAg", "comment": "biologist study evolution. paleontologist only study shapes. BUURN!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzHkzBNGW2x-MsQr9R4AaABAg", "comment": "He used the blue and red diagram to show the missing gaps in fossil records but then when he returned to THE SAME DIAGRAM demonstrate exons and introns my mind was blown away", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzZ5pEe9W-P7Mt75p14AaABAg.9AUSvTEYAKa9QoyCi-JJjg", "comment": "That’s quite true. The importance however is not the pattern but the solution you develop from observing it.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugzt3ob6TRAHNDPSy0p4AaABAg.9AGbAuNC7vX9AWFT8tSjUW", "comment": "I enjoy the lecture, but whoever operated the camera needs better skills. Been thinking that since the first video...it sure is annoying but the great teaching makes me watch all of it.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgycBujyrp45ToL4Bfp4AaABAg.9A3uY8OPuXY9AYBT1h7pIF", "comment": "yeah heard that what just happened there?", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxpgr9jP2u9So43wQV4AaABAg.9A03esXQvS49AWFhNcPXAQ", "comment": "Yeah! I always wondered why every single cell has the whole DNA inside it, now I know.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxpgr9jP2u9So43wQV4AaABAg.9A03esXQvS49XzzTXj4b6W", "comment": " @benlinus5772  so what do Introns actually do?", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxN6c8r8QO7i6TGtGB4AaABAg.99yRZ2HCBs39AY4rd9OUGx", "comment": "let's march to that xd", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxN6c8r8QO7i6TGtGB4AaABAg.99yRZ2HCBs39Ab0FzDm1B1", "comment": "Well, there is a monument to a lab rat in the Russian scientific cluster – Akademgorodok. So, at least they get some recognition:D", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxbqzwRmI93nCRT9OF4AaABAg.99_19_kbL4l9A3JhLuD8uN", "comment": "1:01:40", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy7SjxQGdCO1w7XXUd4AaABAg", "comment": "What a outstanding gift of access to this  highly  motivated educator. Thank you Dr. Sapolsky!!!", "votes": "6", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzfAq2ItlwXFeykUo94AaABAg", "comment": "What if we are the random chimp event? 😮", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgykHsM4rDjoPRDeqeV4AaABAg", "comment": "EVO ! ! !  😮", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzeyfWa5-HbjXwuba94AaABAg", "comment": "I love everything about this guy", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyDUk1u1BfmlsLt6IJ4AaABAg", "comment": "28:58 \"and you've just given away the punchline, you creep\" 😂😂😂", "votes": "148", "replies": "4", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyrn2_Up2cFmTCkA-p4AaABAg", "comment": "I was the guy whose like made it 8k 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyli1wlidIPAJiiVhx4AaABAg", "comment": "\"The punctuated equilibrium advocates were called Jerks, and the gradualists were called Creeps, so they ultimately got along very well because they were so witty.\" 1:02:45 hands down the best joke I've ever heard from a lecturer on any topic!", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwPIl7pE9UuVBW1Gsl4AaABAg", "comment": "27:50 B-b-b-bu-but I th-thought there were infinite genders?!  SCIENCE IS SO PROBLEMATIC!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz_x7mZuoNXWFMqeDV4AaABAg", "comment": "10:54 You could say he drew a blank", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzIrClJ5cxDHwDc47x4AaABAg", "comment": "Does anyone have notes/ supporting materials/ homework assignments that he gave out during this lecture series?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzl9pSd2rxKDF7BrSx4AaABAg", "comment": "58:30 really knocked me out 😂😂😂", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwFejXlewlCdsYsG5l4AaABAg", "comment": "\"You know puberty, it's not a big deal sometimes you get acne, sometimes a penis people just deal with it\"   He's got a way with words doesn't he?", "votes": "261", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwCiG42kGxFaG-hfT54AaABAg", "comment": "Stop reading the comments and concentrate with Saplosky", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5s5gOBDgSGzb_54V4AaABAg", "comment": "Stop reading the comments and concentrate with Saplosky", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzH8j0cGe57Os4FDFR4AaABAg", "comment": "Am I the only person addicted to his videos?  He’s like that good  bag of chips that you just can’t stop eating.", "votes": "6", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyDRGmwIwnpT0vo6GZ4AaABAg", "comment": "Can somebody explain what a \"pair of triplets\" mean? I got really confused XD", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwjTMCgx644ejp8ag14AaABAg", "comment": "Been listening to this fantastic professor since yesterday while I am knitting a sweater! Getting a Stanford education from my couch in Denmark 😬. Thank you You tube, Stanford and Professor Sapolsky. My BS in social work is getting an upgrade 😎!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyvmYppNr5bVBoGKiV4AaABAg", "comment": "Not all the non-stop speeches carry meaningful information.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxlbgznu308HzKOTzx4AaABAg", "comment": "Amazingly lucid lecture on a very complex subject. But I can't help but thinking this genius, while talking in terms we all can understand, there is a whirlpool of organic chemistry formulas racing through his head simultaneously.", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwxae5ZYwWuQGr-WCp4AaABAg", "comment": "48:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyDUk1u1BfmlsLt6IJ4AaABAg.991M55WDLtI9HhlpGcxgDw", "comment": "i felt kind of bad for the person :-)", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyDUk1u1BfmlsLt6IJ4AaABAg.991M55WDLtI9IRTEHddFbM", "comment": "I really enjoyed a laugh 🤣", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyDUk1u1BfmlsLt6IJ4AaABAg.991M55WDLtI9JF3GK46X4h", "comment": "Right? That was hilarious", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyDUk1u1BfmlsLt6IJ4AaABAg.991M55WDLtI9JF3HR_tPIz", "comment": " @CodepageNet  me too", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwFejXlewlCdsYsG5l4AaABAg.98jcgCbINXm9HpJ213573h", "comment": " Ismael Barrera  lmao he said that too", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwFejXlewlCdsYsG5l4AaABAg.98jcgCbINXm9Ux7RKW2YX3", "comment": "Yes, he really does. 🤣", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwFejXlewlCdsYsG5l4AaABAg.98jcgCbINXm9UxFPY0W91-", "comment": " @SeliahK  lmao", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyDRGmwIwnpT0vo6GZ4AaABAg.98XeZTzDDrw98Z7KjBHBTD", "comment": "Amino acid is paired with a triplet of 3 nucleic acids.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyDRGmwIwnpT0vo6GZ4AaABAg.98XeZTzDDrw98aXFhXKlPG", "comment": " @alexedgar6539  ooh that makes more sense, thank you :D", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugx-FP5NmHI4hSSKfQl4AaABAg", "comment": "26:22", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyueJYWwDVNbC9Eek94AaABAg", "comment": "The splicing bit about proteins creating certain tissues in certain parts of the body- is he referring to how and why closely related people resemble oneanother? @ 1:09:10", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzX2fFPWG8KkRRmN5h4AaABAg", "comment": "I have been watching his lectures for fun. I am taking a course this Fall in molecular genetics and thought I'd prep by watching some videos on it. I happened to search for molecular genetics and the first video that pops up is by Dr. Sapolsky. Thank you youtube!!!", "votes": "7", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwfsr8h_P6VlnHHD-F4AaABAg", "comment": "These days we call it 'transitions'.  Interesting that it was wasn't the word to use nine years ago, and having tried 'transfers' and 'transmits' he settles on 'jumps ship'!", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRhq2cSZbaTnZxxCp4AaABAg", "comment": "I also love the fact that he gives us so many interesting and real life examples to back up his theory. Just amazing!", "votes": "5", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy_1SQ86yn2Z-U70DR4AaABAg", "comment": "Pandemic or no pandemic the lectures are a treat and everyone needs to make time to listen to them. Not only is an integrated inter-disciplinary approach required to appreciate behavior but the application is relevant to all walks of life too and very much to my profession of marketing.  I just finished reading The Gene and this is such a wonderful follow up. Can't wait to finish the lectures and proceed to reading Behave.   I have one request though, is there a way we can access the handouts, the link shared  to coursehero requires a paid subscription.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw4KQYWAe_hJKA58nl4AaABAg", "comment": "Epigenetics very much solves the nature vs nurture debate too then. Since the nurturing inevitably affects how nature is expressed. . feels like my mind is gonna explode...... LOVE THIS", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx9Skh2migagQ9oDxN4AaABAg", "comment": "I think the source of Corona was the girl coughing continuously in most of the lectures. But the lectures are unbelivably perfect and I cant stop watching again and again", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxE27vOSKfWEBPR85l4AaABAg", "comment": "Robert Sapolsky and Noam Chomsky, the way they speak is very soothing and it actually makes me want to listen and concentrate more", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyUoRyt9CiG7JgCpix4AaABAg", "comment": "Timestamp 51:50", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwvc4VVjOH11Z-fB2d4AaABAg", "comment": "I think it is magnetism; water and the electrical(waves), the waves then create the shape - what the Hell are the magnetic waves", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyMfLw0IYuXx0UA4Dh4AaABAg", "comment": "its scary how much dna is similar to computer scripts", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugza4PVHiS6gjnOlHYd4AaABAg", "comment": "Pop Quiz Question: What does the mtDNA A3243G mutation cause?  Ask Dr. Enns in pediatric genetics for a good answer.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg", "comment": "Man I’m curious if he has any idea that people all around the world are still listening to his lectures like 10 or something years down the line. whoa", "votes": "351", "replies": "11", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwLGakaCEwHPlxI-R54AaABAg", "comment": "What about sybiotes?  Adapting to having help I guess?   Like having a mechanical heart too.  Are these giant leaps or are they supposed to happen I guess.  Now let's say I'm a symbiote with another being living with me in this body.  Whose heredibility takes over.  Or are we as in both symbiote built for this sharing thing?  I dunno", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxlfL7Vk_YR0_mVe8V4AaABAg", "comment": "This guy somehow got 20 on charisma and intelligence.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzn3_YpyiiQVIBLM5F4AaABAg", "comment": "30:19 mountain regions, males born female", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwut7fI-KY7xupHmg14AaABAg", "comment": "As much as I would like to understand this I don’t.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxQXmRx_eg73xjC51N4AaABAg", "comment": "50:58", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg", "comment": "Watching a lecture is great, but reversing it when you drift off in thought,  pausing it to think, or look up nucleotide, triplet genetic code or just see what a protein actually looks like is priceless.     YouTube should make content like this a priority.", "votes": "288", "replies": "6", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyueJYWwDVNbC9Eek94AaABAg.97rPzwzt4DH9AKHvE3Y80T", "comment": "Not necessarily, given \"similar\" appearance is an emerging property of various types of impressions you have (not necessarily accurate for populations you didn't grow up around).", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX669WeY9m3l4hl", "comment": "He probably gets drunk and checks the views just for kicks", "votes": "22", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX669ZlRt0dkqzf", "comment": " @whatabouttheearth  - I get drunk and kick people too!", "votes": "20", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX669qD9Dwr4vPa", "comment": "these lectures are timeless", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX669qn7Otn8NGI", "comment": " @self-righteousideologue9398 nice", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A-77oFMNVlr", "comment": "Yeah he writes books, goes on podcasts and has an Instagram run by him and his daughter.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A-hlZaBWpFi", "comment": "Almost 14 years down here", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A21Utd9sL6T", "comment": "13 anos", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A4Tio5mkyzc", "comment": "Yes, he know's hes prolific.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A4nx80tB8jE", "comment": "13 years... From Brazil", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A56jjIUnoio", "comment": "👋🏻", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJoJcl_JJdkWJHGaN4AaABAg.94vxE7FrX66A6HIrEmkT1-", "comment": "🙋... from India🇮🇳", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugwut7fI-KY7xupHmg14AaABAg.93shCPvWDlk9AKHZXv2chb", "comment": "The first lecture Refrences some of the basics required but he also wrote a book to work on in your own time (if you have time 6 months later https://www.amazon.com/Behave-Biology-Humans-Best-Worst/dp/1594205078", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg.92vJq6cjDDI9G_xC17CLSg", "comment": "Sapolsky is a damn ninja. He moves forward faster than wind, without even stumbling or stopping once. At the same time he juggles with multiple disciplines and throws jokes that hit each time. And then you look and realize that meanwhile he also managed to get in your head and paint there a clear picture of what's going on.", "votes": "6", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg.92vJq6cjDDI9QowCtawGhB", "comment": "Apple Books was supposed to use that idea to create better, interactive educational material. Unfortunately creators of educational material don’t agree", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg.92vJq6cjDDI9Qp2bx00YFa", "comment": " @4philipp  Wouldn't it be amazing if resources like Wikipedia were to not just give an overview of subjects but aim towards adding everything we know about the subjects?", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg.92vJq6cjDDI9SQT3mXfUBt", "comment": "This is a great comment. Thankful to Stanford for publishing and I couldn’t agree more about YouTube. This is where the algos should be pointing people.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg.92vJq6cjDDI9Y1V8Z9yYiA", "comment": "Agree especially a good lecture.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyqhLysrZR-O20h1Vp4AaABAg.92vJq6cjDDI9mdrmMRgJtl", "comment": "@Larry Koopa Is this just some sort of meme? That has nothing to do with my statement. You can't possibly be this bewildered by a single sentence. 🙂", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxNKSyTOOusbtxnHX94AaABAg", "comment": "I just started my Winter break for medical school after an intense bout of finals...and I'm spending it watching a lecture series on evolutionary biology for pleasure. What is wrong with me?", "votes": "14", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxPZ-iYLYY46Ggr0Nh4AaABAg", "comment": "This guy must be really fun at parties!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwVvfPWvfy8htDcpVF4AaABAg", "comment": "funny, 1 hour in, and i havent gotten any ads...", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxt5foUkrfP9c6YHwF4AaABAg", "comment": "EAGLE 1... FOX P2 pewwwwwwwwww", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzdWycmbQMw2vMyYYh4AaABAg", "comment": "Some clowns are so smart! But I hate clowns, they are masters of deceiving.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxyAbnWfcGq6jiCA_l4AaABAg", "comment": "WHO would downvote this video? Lol.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwgJ_hpMeQLIWllVGB4AaABAg", "comment": "1:00:09 What brain was going on inside that fern? 1:00:31 Humans didn't get rid of the trunks and roots they have during spring time?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxwG19WecC6caD9Fmx4AaABAg", "comment": "Starting from 30:02 to 34:02, I think Robert Sapolsky is talking about the guevedoces, which translates to \"penis at 12\" (that is, these \"girls\" turn into \"boys\" at age 12, because they've suddenly developed a penis at that age).  It's not testosterone deficiency that is causing this condition. It's deficiency (lack of) dihydrotestosterone (DHT) that is causing these people (guevedoces) to be born as girls, who then turn into boys. DHT can be regarded as a far more potent androgen (\"male\" hormone) than testosterone. It's so potent, it's what causes the development of the penis, while the child is still in the womb. No DHT; no penis until puberty.  These guevedoces have a lot of testosterone, in fact. Although insignificant, they actually have slightly more testosterone than the average boy, because they lack the enzyme needed to convert testosterone to DHT.  It's not until puberty that the level of testosterone spikes even higher than their pre-pubescent years that they start to develop a penis.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxrklOsuq0i57PMLY94AaABAg", "comment": "A FUCKING GREAT MIND TEACHING FOR FREE!!! I LOVE THE INTERNEEEETTT  THANK YOU PROFESOR", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxft1-s3MEXhzi7eJx4AaABAg", "comment": "Am loving this, 4th video now and it keeps to satisfy me. Great teacher and matter! 👌😁", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyIM5sK4mF_T6HcpJV4AaABAg", "comment": "Enzymes aren't catalysts. They are facilitators that abstract configuration of protein to defeat steric hinderances. Catalysts are more about speeding up chemical reactions.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyiQvEE8UGilAY9wdR4AaABAg", "comment": "Can I jump into Behavioural genetics, skipping the molecular genetics?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyRdNzUs6VJ_zpm3BB4AaABAg", "comment": "hearing 'glove' as an answer was not as precisely describing metaphore as the one with the key and a keyhole, but it was most certanly refreshing", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg", "comment": "Listen, I'm just an artist who wants to listen something while painting. This is the best thing that has happened to me.", "votes": "630", "replies": "18", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgztG_ojq84uj4TaRkx4AaABAg", "comment": "Graduated last year didnt care about school. Now I care ☻", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx90MgLCOSuwN0f5l54AaABAg", "comment": "1:17:02", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQZhwm22hA3hTlSN14AaABAg", "comment": "very interesting stuff,  but why are these lectures cut in the end,  in a middle of a sentence?  very annoying", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5OYafdA8Ol_5_wWZ4AaABAg", "comment": "“This way we have “if-then” clauses there” – yes, this shows we are computer programmed things; there is no “I”. Darwin and Buddha get to the same conclusion. What to do about it? Vipassana meditation, the way out of the Matrix. 🙏🏼", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgydP0UPyaSpsTJMUtp4AaABAg", "comment": "Sin dejarla caer", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz_vNKHavjZrd9VPjx4AaABAg", "comment": "what a beard) this guy like a priest", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxNKSyTOOusbtxnHX94AaABAg.92k6JYFS7Rp95BcExIWmiR", "comment": "LoL bro i watched it in 1 week before my 1 st year med school uni exama and since then i watched it 8-9 times and i am in halfway of my second year its natural we cant ignore data. Eneways med scince is mess. Its just jack of all master of none kinda since but i agree its tough .", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxNKSyTOOusbtxnHX94AaABAg.92k6JYFS7Rp96cwIJ-p3t_", "comment": "I don't know but you make it sound funny!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwG19WecC6caD9Fmx4AaABAg.91lcnDhp7E39Qp3abOcoFd", "comment": "Is that where the phrase “grow some balls.” Comes from ?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR92jMtn7ItKi", "comment": "I would also recomend the Atheist experience or Talk Heathen for the same purpouse. Pretty amusing and educational call-in shows", "votes": "12", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR97whx_J9s-v", "comment": "same thing here, just with music. Practising guitar while listening.", "votes": "8", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9AJylEH1I99", "comment": "\"Crime pays but Botany doesn't \" is also worth some attention (before you value the scenery as much as the educational content), \"the Thought Emporium\" has also been turning out long form content, I enjoy.", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9B67dlCxpIg", "comment": "Saaaaaame", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9BHaaT9Brvc", "comment": "Dude same sketching or doodling and even while completing assignments.", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9BKg6W4-gDk", "comment": "Same- an artist looking to expand my though process. I enjoy these lectures while I work on finishing this silicone mermaid tail", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9BTioK7gLmc", "comment": "I'm listening while delivering for FedEx 💪🏾💪🏾", "votes": "16", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9C7lYALvA3d", "comment": "This relaxes me so much I sometimes use it as a lullaby 😴", "votes": "8", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9EzX8wK6WED", "comment": "Same", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9IAESQ8PTtS", "comment": "You should check out the Feynman lectures on physics", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9IBCLwaY86a", "comment": "Aw yes listening to a lecture about molecular biology while torturing yourself practicing hands, it doesn't get better than this.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9Mjw3ULx7k1", "comment": "Samee :D I'm listening to this while making a scale model", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9Mr2w6njZZh", "comment": "Same, except my canvas at the moment is the Mojave Wasteland", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9O60nU3bHmA", "comment": " @giannistsakalidis85  Thus the luxury of home schooling", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9ONHvexXvQ0", "comment": "wow same!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9PFtyAARmLg", "comment": "Listening to this while doing animation, I fear that I won’t be able to follow the lecture", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwR9R7IC_g80kj", "comment": "Id like to suggest the channel JCS - Criminal Psychology, very enjoyable to listen to during that type of activity.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwkRLPeZ3gbnkfGw9l4AaABAg.907sM0zQrwRA02eYSuaIfW", "comment": "OMG SAME", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwqlBWzrb9shUw63_d4AaABAg", "comment": "Wow how can someone explain so smoothly?", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx51_6gMxGGZtMtECB4AaABAg", "comment": "Too much phenylalanine and you get diarrhea as well :B", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxIVKckSirkZGdrB8x4AaABAg", "comment": "Sometimes you get acne, sometimes you get a penis... no big deal. Just lovely rhetorics", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyB5qWrP4BjfOcSlmd4AaABAg", "comment": "Where do mitochondria and ATP deficiency in the body and brain fit into behavior? What about folded RNAs? How do they cause hearing loss? I've got mtDNA 3243 A to G mutation at 26% in my immune system and 80% in my kidney cell wash off in my urinary sediment analysis. This mutation is the MELAS syndrome mutation. umdf.org/types/ My Japanese doctor says the urinary sediment analysis for DNA testing is no longer used in the US but still used in Japan. Dr Majima at Kagoshima Medical University Hospital knows a lot about radiation affecting mitochondrial DNA. He is opposed to medical x-rays.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzLk30Js7XFcGka-Y54AaABAg", "comment": "Very engaging professor, im shocked", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzND3TrW5ERWfzYtOt4AaABAg", "comment": "I'm an engineering student and hasn't taken a bio class since sophomore year of HS, I wish I found these videos sooner", "votes": "13", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxVaaunHxh1c9ZbVBx4AaABAg", "comment": "1:29:23 what about opioid addiction because you received less endorphins than what your body is supposed to because of bad mothering or random factors?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgysneBBaQ2AwQCKUwV4AaABAg", "comment": "1:03:33 \"Show me the molecular mechanisms. Show me mechanisms for mutations that will promote rapid change\" I just jumping in with a comment and saying this, CANCER. There is strong but easily deniable possibility that cancers are micromutations in the works that are the provoking of a possible future punctuated equilibrium scenario in certain isolated but heavily populated areas of the world, where much like the Neanderthal evolving into the Cro-Magnon and much like the Cro-magnon evolving into Homo Sapiens, it may turn out to be transposable genes working through mitosis and mitochondrial microevolutions attaching new genome sequenced proteins to certain aspects of inherent DNA and RNA as hormones and enzymes become the symbiotic \"carrier pigeons\" of implanting evolutionary stepping stones through modern sickness into the DNA of our offspring in an epigenetical, rather Lamarckian sequence.  Consider this thought: Neurological rewirings are the essential beginning points of cancer strings, being response activities of transposable neural progenitor cells commanding micromutations that work toward short term \"blue prints\" for single punctuated equilibrium moments in evolution, if successful.  It is funny what makes sense in evolution if you consider health science and medical disasters as  potential gene, mitochondria, and protein development points in the process of gradual to rapid changes. Does that sound much like what a \"half an eyeball\" would look like, that evolution is a miserable experience, not a magical fairytale? Add in the thought process that that evolutionary process begins in nutrition, environmental/chemical introductions to biology, and microbiological evolutions occurring a little more rapidly, and it may be a situation where new genetics are always the killing off of the old genetics where the hosts who struggle through the evolutionary processes have it worse in sickness and health complications than those who are born with the completed genes after the number of generations who live with the shortened lifespans.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzqHuVmHDVxNtXmkEp4AaABAg", "comment": "Ross is a paleontologist too.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzI55CMjt7yOg1A_MF4AaABAg", "comment": "It's incredible how he's so informed on so many different fields of study thus allowing him to explain human behavior from the micro to the macro with ease", "votes": "55", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgybEIUkwHmiHmua5dN4AaABAg", "comment": "It's fascinating how DNA is in many ways similar to an artificially created computer program. Modularity (as in RNA splicing), segments dedicated to instructions (on and off switches), segments dedicated to data (the sequences actually coding proteins), the fact that there are many more instructions than data segments. Of course, the two domains, are also very different in other ways - very uncommon for programs to be tolerant of even the slightest changes to the coding.  In a way seems that humans independently discovered some of the useful solutions to the fundamental problem of how to program a complex control system in a robust and efficient way.", "votes": "4", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx5UmKlYDAfueEdstV4AaABAg", "comment": "95% of DNA is the instructions for the 5% which actually encode for the genes - exons and introns allow for the 5% to be arranged in multiple ways to allow for all of the required information to be allowed expression. It's like a knowledge orgasm", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwWYP6X3f3QC6YgcWJ4AaABAg", "comment": "These lectures helped me recently decide to pursue a degree in Biochemistry! Free lectures of high quality such as these is so valuable to the public. Thank you very much for that.", "votes": "145", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyfT_tyQj3tBMsB3IV4AaABAg", "comment": "\"Rats are constantly jabbering to each other in a range we can't hear\".   Idea for a novel, anyone?", "votes": "20", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwhAK5-MYxCiwqL2t94AaABAg", "comment": "benzodiazepine is actually easier to spell than many common english words", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxljT6_ye6FK5EanZR4AaABAg", "comment": "oh molecular genetics you are still young in this planet", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxA1C0oLfsj2yYwfUt4AaABAg", "comment": "If this is him just glossing over the basics I can just imagine the details that are in his head, what the advanced students/studies get to hear/learn. Amazing! (and lucky them, the advanced students)", "votes": "18", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyt2yHnKDYgy_gp_dZ4AaABAg", "comment": "I dropped out of school in 10th grade.  Now, as a 38 year old diesel technician, I find myself hungry for this kind of information.  Help me.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxWKuX9PrEgUonq0LF4AaABAg", "comment": "Can someone provide me a link with great video explanation of the ‘first principles’ to come up with better solutions? Thx in advance.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxs8DZ7YiOJsJdWWmt4AaABAg", "comment": "The thing explained at 1:08:30 is actually code reusability. Reminds me of functions in programming 😄", "votes": "18", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgybEIUkwHmiHmua5dN4AaABAg.8zH6TFbYsGW9Qp1nnBqZla", "comment": "Are programs intolerant to changes? Isn’t that the whole basis of machine learning and AI to be tolerant and variable instead of static?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyfT_tyQj3tBMsB3IV4AaABAg.8yzzW0JQpaS9BRh7ecl5ca", "comment": "Ratatouille", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgyfT_tyQj3tBMsB3IV4AaABAg.8yzzW0JQpaS9OJ1-aK80J2", "comment": "Beware the Squirrels", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwhAK5-MYxCiwqL2t94AaABAg.8yw15x1ECCq9JQ9Pe_zrW4", "comment": "Your write!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgwhAK5-MYxCiwqL2t94AaABAg.8yw15x1ECCq9JQ9q7-nBgJ", "comment": " @boxelder9167  🤣", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxs8DZ7YiOJsJdWWmt4AaABAg.8xteh2w0LOI9QoxmAmxsEa", "comment": "I was thinking coding too. First was a hard drive directory. All fragmented.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgygtMH_vnZMSUJP5jB4AaABAg", "comment": "Is that stuff about benzodiazepenes true?   I think he's means GABA and the GABA receptor.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxU8Fj_2UktDgZJJ2l4AaABAg", "comment": "This is fire that u post this", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwtxr1dvdA9OPQ1kT54AaABAg", "comment": "Genetic evolution and mutations are two entirely different things.", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5KPaPVzh0Skqo4j14AaABAg", "comment": "Technically, rapid evolution and genetics changes are not possible. Sounds like fill in the blanks.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgylaZfnsYX34CKDrOF4AaABAg", "comment": "I feel less stupid now. Thanks!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwuf2KWqozhfJTwOAh4AaABAg", "comment": "What a privilege to be able to watch. Professor Sapolsky is an amazing lecturer! Thank you, Professor, and thank you, Stanford, for sharing!", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyB9fw4LBO8Hl3oXBF4AaABAg", "comment": "First time watching this and never looked at something like this before but called mutations before it was brought up, this professor is very explanatory and clear...", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxj6Ok1dWv45CRTaAR4AaABAg", "comment": "This dude has the sexiest beard.", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzgAAU8kHqX9y9ylkN4AaABAg", "comment": "Oh he is a genectics", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwa0YsD6Xpfw_bIVIN4AaABAg", "comment": "Omg !!!! What is his class docturum", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyBpqayjMW_-2CgXg14AaABAg", "comment": "Human behavioral", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwY7WkFKOCjEd3o_dd4AaABAg", "comment": "What is the classification of his  lass", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwQ831K-18ifDleWtB4AaABAg", "comment": "Thanks for educating me..", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg", "comment": "meanwhile, my biology teacher only knows how to read off the slides and can't answer half of my questions.", "votes": "487", "replies": "14", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxpMKvhC5Oz9b6OJEl4AaABAg", "comment": "'i will now do this'? Nice Simpson's reference on the board.  There are no political views. i don't like hackers. um... Quora questions like 'How does semen feel up the rectum.' Plus October 17, 2014.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwNDWKqUpc_RHI6HHR4AaABAg", "comment": "This Prof carries the Gross Kinky Beard Gene and the Sloppy Dresser Gene.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxS3D6XZR_HSQp8Odt4AaABAg", "comment": "خخخخخخخخ كسم العظمة", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzr89TiBCrV0ZG3wq14AaABAg", "comment": "Robert knows how to reach these kids", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzGUTsNO5LP8Mg2B_R4AaABAg", "comment": "Who here has read his book, 'behave'?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwxZIpFf4a2O1V3loF4AaABAg", "comment": "So many words", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwtxr1dvdA9OPQ1kT54AaABAg.8wz8-swXz6S8xhNHwKW90F", "comment": "Genetic evolution depends on Genetic mutations", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugwtxr1dvdA9OPQ1kT54AaABAg.8wz8-swXz6S8xhbPlf4Ie0", "comment": " @lordtourette6057  Mutation is an anomaly and always causes defects, problems and diseases due to the deteriorated adaptation to environment, leading to the less chances of survival. Evolution is supposedly the improved adaptation to environment leading to better survival chances.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugxj6Ok1dWv45CRTaAR4AaABAg.8wJDWgyRlen905UgjvBlyb", "comment": "Plumage xD", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK95wtWpefbTd", "comment": "That's a world wide scenario", "votes": "23", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK977-LbTrh77", "comment": "Hang on in there buddy! Read your own way! try not to make an arse of him or her... like I did... that didn’t work out well for me in high school BIO.", "votes": "16", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9AHqCWDgEQ-", "comment": "Like Socrates said:  I can’t teach them, I can only make them think.", "votes": "12", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9Ay0yznNPuF", "comment": "Study by yourself", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9D6ESx77k0E", "comment": "Well work toward improving  your education system.  My bio teachers all have been epic (i live in france ) and i was not  in some private high rated school , it  was public school located between poor neighboor and middleclass one. Improving public school is either increasing tax (wich lots of people will bitch about) or better distribution of it. I heard that in the Usa, public school funding is related to income of the area... Wich is obvioulsy a big problem. It should be equally distributated by the state at least ..", "votes": "11", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9DvvgHQeT79", "comment": "I don't know where you are in school, but if you're feeling down because of public schooling then don't. I had below a 3 gpa in high school because I just didn't care and once I got to college I found classes and professors as interesting as this and eventually graduated with a 3.6 gpa in mechanical engineering. I failed algebra in high school due to the lack of drive. Things get better once you get out of public schools. Keep it up man", "votes": "10", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9GyqItP4-7N", "comment": " @TheLouisianan   Same experience, very true.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9JshaI0IAc0", "comment": "I gave up on biology after I got a D in my AS levels. Finally starting to regret that decision 5 years later.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9KiN7CqlaY_", "comment": " @Wohodix  yea dude but you're from France. You got a good education system to begin with", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9KiPy42SLd8", "comment": " @robertpietraru1939  wait for it, solution is to ... protest xD In France we bitch about everything and dont take things as it is. Its a slow process of improvement, and obv only work in the long run. But if you dont raise your voice and do nothing you got 100% chance of keeping the same system or worse. Here we still have to fight to keep what we have, current gov is trying to kill our public college, but students and teacher  dont let them do (and same for many public services )", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9LpbILN5dYr", "comment": "Tbf comparing them to a Stanford professor is setting yourself up for dissapointment.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9M9mf6IT0pQ", "comment": "Solidarity.  My teachers didn't even understand evolution.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9OVDFeq-iXt", "comment": " @xXRandomPianoXx  Given that he's commenting on this lecture, I imagine that's what he's doing.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxwdWusmPnDt1Q7tzJ4AaABAg.8vvq047ubgK9PfUcaOXtey", "comment": "Is your Biology teacher a Stanford professor with a PhD? Give them a break. I'm a high school Biology teacher and I'm watching this and learning new things. And also realizing that I can't teach 1/10th of the information because of the level of background knowledge of my students.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzGUTsNO5LP8Mg2B_R4AaABAg.8up6uY-q_q_8xl559MGflE", "comment": "I did, and Why Zebras Don't Have Ulcers.... Did you ?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxB0KmSuBwfyX1P8ap4AaABAg", "comment": "This is better than watching a movie. You have me hooked Mr. Sapolski.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugzz3ZiCi4b-Y0qKLrN4AaABAg", "comment": "Instead, here. Molekul insister chose up scription. Egentisns form in it, doing ' outside r3gulator. ? Alota lives aginc3s.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzERuuPx-A7LoGIFih4AaABAg", "comment": "43:10 I would imagine the Pinky and the Brain there", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw_PFXeonMwEzGGZXh4AaABAg", "comment": "Amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxVYP_GyqA9ECP_qB94AaABAg", "comment": "How can one guy be so smart, AND be able to share his knowledge..??  Truly flabbergasting....", "votes": "9", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzPgC7ZZO2njbgKwLt4AaABAg", "comment": "\"at puberty sometimes you get acne and sometimes you get a penis\" 😂😂😂", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxld_2SSeKm1kr3RfR4AaABAg", "comment": "Why the fck this turned intense genes form cute storytelling", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyP3lxk_lEv63PM3U94AaABAg", "comment": "He is a great story teller by the way that makes whole class very appealing..I wish I could have been a graduate student in his lab back then", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz758E0t_NSMsqJD094AaABAg", "comment": "i love this", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy83pZ54LjX9QPeocR4AaABAg", "comment": "Can there truly be a zero point mutation?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxzZoYa5je5fa80t_R4AaABAg", "comment": "You creep :)))) he is so funny", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzyCdiJBOJ9mFX39OB4AaABAg", "comment": "Amazing class", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg", "comment": "His style of speaking really helps adhd heads to keep listening! New experience!", "votes": "167", "replies": "7", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwaOiCKkLShjGgkEy94AaABAg", "comment": "Darwin's Finches sorta suggest punctuated equilibrium.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwLlenzMRMrVsFiJ9h4AaABAg", "comment": "36:00", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwUazb8P-aG35u-_pd4AaABAg", "comment": "Sapolsky is a boss.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxZo0IWbsR5sgZLdV54AaABAg", "comment": "I guess I'm not alone leaning in gaining so very much here thank You for making this available to us all", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyCloQMKBrZ0iduqmp4AaABAg", "comment": "so 99", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyLMLbF-OAy7P_G4OJ4AaABAg", "comment": "I have this question please help SOLVE QUESTION -two pure lines (P1:A1A1 ;P2:A2A2) were crossed to produce an F1 population.Individuals lines from the F1 population were back crossed to both parents to produce two large back cross populations: BC11(F1*P1) and BC 12 (F1*P2). These two large back cross populations with the same sample size were pooled together to produce a new population. assuming that the two alleles (A1 and A2) segregated randomly.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw5Ly0-dEfoQeO45rl4AaABAg", "comment": "I’m a huge fan but, I felt that the he explained away the apparent conflict between the fact that we share 98% of our genotype with chimpanzees but only 50% of our phenotype with a sibling, as very week.  Far more than 50% of genes don’t have viable alternatives and so we have much more than 50% of genes expressed in identical ways to all other mammals. So, combining this with his statement that we would lay down our life for 8 other individuals that share an 8th of our genes, would suggest that we would happily lay down our life for a dog, assuming it had flees. So, there must be another mechanism at play!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzERuuPx-A7LoGIFih4AaABAg.8t5azSk4kmb8xl5NCpIm6G", "comment": "Who is Sapolsky's Pinky ? Because he's definitely the Brain 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxVYP_GyqA9ECP_qB94AaABAg.8s6p9gNKhgn901-jc_Eeoe", "comment": "Thanks, now I know a new word!", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb9-iVfuG1OSk", "comment": "🙋 Same here!! 🌌", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb92bezDhOx0D", "comment": "Yes!!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb9Au84rP2RNF", "comment": "listen to the lecture of Patrick winston about how to speak. Robert sapolsky uses a lot of technics to teach. He is really clear, he starts this course telling you the basis of what will u learn and how to learn it. And always repeat a lot of times. Even give examples when gets trickier. The best thing is that this is on youtube. So we can pause. For me with dislexya this is so perfect to study!", "votes": "19", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb9EPvU2g7uuC", "comment": "Yes! He speaks with the perfect speed and flow  to keep a distractible brain focused", "votes": "6", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb9H_5fiOfGnB", "comment": "same! i have crippling adhd and although i need it to be on x2 speed, his teaching style is one of the only ways i ave been able to learn", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb9Lnz35Mhu2u", "comment": "Same here, ADHD and his lecturing is the easiest I've ever encountered", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxIHFMZ0ZW_lI5tm294AaABAg.8pJu562F8Kb9Nks1Z5JQdT", "comment": "Me too! The only lectures I've been able to focus on without needing to resort to sensory stimuli, annoying my partner by tapping my pen on the table or whatever xDDD I haven't even taken my meds yet!", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxYGUyDdiCxdzzQ_rx4AaABAg", "comment": "43:24 joke pretty funny", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz7vejTcKgo9CLlGdV4AaABAg", "comment": "I dont understand this man has lecture about psychology  too.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxTBg9fN4aZxxX7dqd4AaABAg", "comment": "Fascinating stuff, I'm hooked on these lectures.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzLAiywk2QVRALBLPp4AaABAg", "comment": "Did anybody read the chapter for this week?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwkw0uBz64zufz_CIx4AaABAg", "comment": "Gcse student watching this and he is very confused", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzycOA_nWUVHoOc7ft4AaABAg", "comment": "But fossils' re hoax, excuse me, like the carbon 14 dating wouldn't go further than thousands of years, Like you are saying that dinosaurs do exist?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwbLX8bsMAoNKwl-c54AaABAg", "comment": "Consider the following: a. More and more cosmic radiation is going to be impacting the Earth this century. (Hence, more QED and QCD interactions occurring). (And this is due to in part: 1. The Earth's magnetic field weakening, thus allowing more cosmic radiation energy to reach the surface of this Earth.  Currently projected to be at it's lowest around 2035, just 17 years from now. 2. The Sun going into grand solar minimum, projected to be at it's lowest around 2075 - 2080.  Losing some of the Sun's protective shield will allow more cosmic radiation energy to reach this Earth. 3. Our solar system is supposedly moving into an area of the galaxy without a 'dust cloud' protection, thus allowing more cosmic radiation energy to reach this solar system.)  b.  While this cosmic radiation energy increase might seriously contribute to the 6th mass extinction event that has already started on this Earth, it might also contribute to the next jump in evolution of species.  c. Basically, as dark colors absorb energy while light colors reflect energy, AND as a women supposedly has all the eggs in them that they will ever have from birth, AND how electromagnetic radiation energy is stronger at the equator where a large percentage of new species are discovered, THEN while evolution could potentially occur basically anywhere, it has a higher probability of occurring to a dark skinned colored woman that has lived possibly their whole child bearing years along the equator.  Take that 'white supremacists'.  You will be replaced by the offspring of a black woman. (Of which also though, supposedly ALL humans came from the east coast of Africa, so even 'white supremacists' are 'black' on the inside deep down).  Truth is still truth and reality is still reality.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxSquhI3gg0sUNRO-l4AaABAg", "comment": "Molecular Genetics:  Consider the following:  a. Modern science says that ALL matter is made up of quarks, electrons and interacting energy. b. So, a very complex human being with a very complex brain and an outhouse in the woods are BOTH made up from quarks, electrons and interacting energy. c. So now, why can a very complex being with a very complex brain come about, but yet, a simple, even non-functional outhouse in the woods isn't observed as actually existing?  Why can a very complex object come about but yet a much more simple object can not come about?  Basically, why isn't there DNA for an outhouse?  Since it too would just be made up of quarks, electrons and interacting energy. d. Is there somewhere in this universe whereby DNA for an outhouse actually exists? e. Off to search for the naturally formed outhouse in the woods that might exist in this universe.  Time to go.  :-D", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyptImHTf2N-cfhbIx4AaABAg", "comment": "I am an insufferable know-it-all. Watching Sapolsky has made me completely unbearable. No one is interested in what I like to talk about.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzLOKYwvZo_Mxgdch54AaABAg", "comment": "I watched these about 6 years ago. Good that I do rewatch them. I now see many things in different, broader light, given the experience I made in life. A lot of the behavior I see just make way more sense now. Yet I want not to fall down some confirmation bias, given my diletant approach here. I know my thoughs might be just a fallacy, but having noone to talk about these things, who is not some mumbo jumbo ezoteric, makes me really lonely. I hope I will not turn to some ezoteric crazy person, because I have seen some of them. The loneliness is devastating. No wonder I was diagnosed with depression two years ago. I did not start to rewatch these lectures to find out more about myself, yet it is happening. Again, biased approach on my side... Well... At least I am aware of my own bias. But so lonely...", "votes": "10", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzGURbkTyo7sm-5-K14AaABAg", "comment": "I like that it's difficult to determine Sapolsky's own bias with regard to the opposing views between gradual and punctuated evolution. I have a suspicion as to which way he leans regarding the political implications, but it is nice to see that he isn't banging on his political drum.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxmvuzDvWfHFpi2JBx4AaABAg", "comment": "Now, when I was a teacher and someone turned the lights off, you'd hear the sound of COMPLETE chaos and pandemonium.", "votes": "6", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyMk0ah7H9eV-7jNlR4AaABAg", "comment": "// , Today, at 15:46, I learned what \"retroviral\" means.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugxiqp6k5PycznfXrQN4AaABAg", "comment": "This", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxoK6Qy847V2400oW94AaABAg", "comment": "thank you standford, thank you for the amazing course, thank you youtube, thank you to the amazing people out there sharing knowledge.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzoRghqpd540uPTArt4AaABAg", "comment": "This man is a man among men.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx0jzYFR8VVBTUqOb14AaABAg", "comment": "How does a regulator gene pass its discovery of whether the corresponding gene should be enabled to it?", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxMnaDJ_NHzZWT7q1x4AaABAg", "comment": "I had a lecturer like this where you were never sure what you were learning or supposed to be learning and what you'd be testing on. In the end it was a bad experience", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzdaxmKh8DjIlG1fh54AaABAg", "comment": "its is fantastic", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzJFj4yqXy32HCo99t4AaABAg", "comment": "Good lord. I thought genetics was complicated already, and now this guy is coming in and raising the complexity level by three orders of magnitude. I can feel myself hitting the bottom of the Dunning-Krueger valley full-force.", "votes": "1", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwbLX8bsMAoNKwl-c54AaABAg.8miAI4uks-d8qb5qEYv1tT", "comment": "The people along the equator could also be wiped out due to increased cancerous mutations that northerners and southerners aren't going to experience to the same degree.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzLOKYwvZo_Mxgdch54AaABAg.8mH2szitBHM8qb4E85wyFg", "comment": "I can relate.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzLOKYwvZo_Mxgdch54AaABAg.8mH2szitBHM9AKI6OhdnZL", "comment": " Sparkle Plenty  Grate strategy, university Campi and Library green spaces are recommended.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzLOKYwvZo_Mxgdch54AaABAg.8mH2szitBHM9Qozj4ZNzLM", "comment": "I hear you. Everything I learn here I play against behavior I observe. It is fascinating stuff", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJFj4yqXy32HCo99t4AaABAg.8lF15XmGkUa8lGk5Izi565", "comment": "Trust me, this lecture is as simple as you'll get. In med school it's even more fucked up. You're required to know basically every tiny little detail there. Of course this is just one lecture, but it's good enough.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzJFj4yqXy32HCo99t4AaABAg.8lF15XmGkUa9JQCCLyHgri", "comment": " @musical_lolu4811  - Yep. This lecture is like talking about the new car with the salesman and you find out a while later that you should have just went and talked to the mechanic before you bought it.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxdGFncPEJS-MiGXu14AaABAg", "comment": "Papus, Cisera, Hanabi, Phalgus, Zeirna, Tabris, Sialul, Nantor, Rishuch, Sezorbil, Aiglun, Tarab, names of the genii's great  fun leraning text A.T.Mann round art time and space fun with language has lots of science base syllabus filtered out chart making for myself.names of the genii's sound true Riemann hypothesis special general relativity quantum classic physics. in order with astrolog . sacred tree sacred three [ottffssent] proteins origin of life documentary rocks  and minerals +lighting amino acids proteins. I&e mathematics isquare hexagonal cubic/cupid comment comet.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwx8bM7mZl3ozuPHGl4AaABAg", "comment": "I will now do this I will mow do this I will not do this I will nod ot his I will now wd othi", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgykqnOGJuOWdgHQFi94AaABAg", "comment": "thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy0qA5LHVnCDcpQuIV4AaABAg", "comment": "Interesting to listen to a Duck Dynasty player lecture on this.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzSz1v2XhyBukgSFuN4AaABAg", "comment": "I'm officially hooked on this course - I've  just watched the first 4 straight through and really need to take a break on it, but it's addictive. I particularly enjoyed getting a bit more perspective on the \"controversy\" around Steven  J. Gould. I read a ton of his popular essays early in my lie and found it eye opening.Then I became aware he was dismissed by some in the scientific community but never quite understood while. It sounds as if that may have been resolved and it is now appropriate to look at both the time sequence approaches when seeking understanding. (Perhaps this gets more definitive later in the course.)", "votes": "31", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz_iHTjbZuQxbf7Y-F4AaABAg", "comment": "love it!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz4txjCk6nQNBmwRLB4AaABAg", "comment": "Just because I have no money does it mean I am ordinary.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz6AeNpF8LwI0x-mTZ4AaABAg", "comment": "Inaccuracy at 19:35 in an otherwise excellent lecture: the letter of the triplet that tends not to change the aminoacid is at the last (third) position, not the middle one.", "votes": "29", "replies": "5", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugw9LRSlUANv_TZifBt4AaABAg", "comment": "im eating pizza and drinking kombucha!! thank you for yhe knowledge.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzDFbk_j80roIED4AJ4AaABAg", "comment": "at 8:30, the lock and key method is not completely accurate anymore. There are conformational changes that happen when a protein binds to it's receptor. This is from 2010, so I guess its a little dated.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyaIpNGjlVoNaWjnfN4AaABAg", "comment": "such a dude", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugx6oyilgcVp0i9Idxx4AaABAg", "comment": "this jerk is nin love with himself", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxGMcXkR_Nu4zEGi2R4AaABAg", "comment": "I wonder how many Incels walked out when he started talking about testicular feminization. I had one in a class put his hands over his ears the whole time, then never came back, because they were talking about the primordial phallus.", "votes": "0", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxD1vZifYnZJofF6ex4AaABAg", "comment": "Nit someone with a strong background in science but I love this guys lectures.  I wish they would have started science with this and maybe the history of science and then with incentives I have a reason to care about all the memorization of bio class and all the math of chemistry.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzxJZrhPnj8Uy3WK_t4AaABAg", "comment": "THank you Stanford and RObert Sapolsky, this is just fascinating. Spread the knowledge! Big Up from SLovakia", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyt4Jdd_0-zwqXeF2R4AaABAg", "comment": "You are Awesome!    Thank you.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwvGWSTUJD0cKGA_EZ4AaABAg", "comment": "mind blown", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwew-7HjX2CvcQnZFR4AaABAg", "comment": "absolutely love Sapolsky's lectures!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzUk5DYBjwcgsz_SXx4AaABAg", "comment": "Funny parody music video on modular genetics: https://www.youtube.com/watch?v=ydqReeTV_vk", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyDcWbq6A87MqlXlop4AaABAg", "comment": "34:11 \"Some times you get acne. Some times you get a penis.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz6AeNpF8LwI0x-mTZ4AaABAg.8j4vfnPF5R_8sQ1qvkGsMm", "comment": "What are the triplets. That's what I don't get.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz6AeNpF8LwI0x-mTZ4AaABAg.8j4vfnPF5R_8sYKPskgTux", "comment": " @kimberly25christinesmith72  Genetic information in DNA is coded by four \"letters\": A,C,T,G. Each one of them represents a specific compound from the family of nitrogenous bases. Three nitrogenous bases one after another is a triplet. So, three bases code for one amino acid. A larger sequence of nitrogenous bases will code for a certain number of amino acids, which together create a polypeptide chain, which - after it folds - becomes a fully-fledged protein :)", "votes": "11", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz6AeNpF8LwI0x-mTZ4AaABAg.8j4vfnPF5R_98_KgMwsAyx", "comment": "Agree", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz6AeNpF8LwI0x-mTZ4AaABAg.8j4vfnPF5R_9EC5xeMCRyQ", "comment": "Yup, wobble!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugz6AeNpF8LwI0x-mTZ4AaABAg.8j4vfnPF5R_9HUFXo1Sihx", "comment": "Thanks for the corrections", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgzDFbk_j80roIED4AJ4AaABAg.8iYHhqU4XdF8j8zkEFoXQ0", "comment": "yea dude, I stopped watching this one. Kinda cringy if this is your major haha", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugx6oyilgcVp0i9Idxx4AaABAg.8gTKcti8n-58lGk_oWVY2J", "comment": "How is that relevant to anything?", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxGMcXkR_Nu4zEGi2R4AaABAg.8gMIdYDfxsU8l-2YZxnrEY", "comment": "why would a incel walk out of that part, as a man who's celibate without choice i find all these lectures to be great and further supports more incel type of view points i believe.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgxNYug2GvmjZGuOD9p4AaABAg", "comment": "\"If-then contingencies\", is the computational biologists way of using the QM-TIME, mathematical singularity-duality, of frequency-probability shape shifting the numerical multiples of unit vector. Ie it's Quantum Chemistry and \"probably\" one of the best lecture-presentations of advancing the concepts of hierarchical complexity across all science.", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxSGbgvoz6XEs5UAO14AaABAg", "comment": "Wait a minute... you mean Gould  claims he knows exactly what is going on during the periods that he doesn't have evidence for? Like godlike omniscience? That's a sign of insanity.", "votes": "3", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz5AyyZDdW63RHFiHt4AaABAg", "comment": "That testicular feminization thing was known thousands of years ago in Jewish law as a tumtum. It's a male whose male genitalia are hidden. The west never figured this out until they could test for it chemically.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgzH7umwu4kd4f2lldx4AaABAg", "comment": "Great videos!! Thank you Stanford! Thank you Professor Sapolsky!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgwiIXzrsaFrC4shZI94AaABAg", "comment": "These lectures are incredibly dense. I could cut a time of every subject I've studied at the university by half and it would be all the same. In here though, I'd probably up the time by at least 30%.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy2iuFWDRqfxMhOskd4AaABAg", "comment": "Does this course have a textbook? I want to learn more when not connected", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugyrynu313Rnt6wfKAR4AaABAg", "comment": "Prof. Sapolsky is wrong here, I get he wants to give a more compelling narrative and give the students the idea of science as an evolving body of knowledge, but his description of the central dogma is not accurate. In his original paper \"On protein synthesis\" (Crick 1958) Francis describes the dogma as the idea that the only forbidden pathway for information is to go from protein back to nucleic acids or to other proteins. Furthermore he speculates about the idea of RNA being \"transcripted\" back into DNA as can be seen in the famous image of the lecture he gave in 1957 where he first presented the dogma.  Edit: Also, as you can see in any genetic code table, the nucleotide in the third position, not the middle one, is the one that accounts for the redundancy or degeneracy of the genetic code.", "votes": "7", "replies": "4", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxQbuetQzdkTKcl29R4AaABAg", "comment": "Thanks 4 the vid :-)", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy-ZNKHnkVK2z3itZl4AaABAg", "comment": "BIG Thank You from a prospective graduate student", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxGYqccav9-cFfNuvx4AaABAg", "comment": "Fucking dogmatists. They never go where the data tells them, they assert their preconceived notions. RNA-DNA-Protein I wouldn't call a little footnote, everyone should already know that biology is a messy messy science. Biology is information flow, wether or not the ribonucleic acid has a OH shouldn't matter. In fact. I wouldn't be super surprised if we find proteins that can catalyze nucleic acids de novo somehow to propegate their own survival. Biology doesn't care about your theories. To quote a brilliant scientist \"life uhhh finds a way\"", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyALR40TB2ATfopyvh4AaABAg", "comment": "If you want to know more about \"Dialectical Materialism\" and nature: https://www.marxists.org/archive/marx/works/1883/don/index.htm", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugwdk6GUB7dC8Aj4VB94AaABAg", "comment": "its like i got a full ride at stanford lol", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugz6GZzbBT0I7GKWakV4AaABAg", "comment": "Suddenly", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg", "comment": "It is 3 AM and i can't stop listening to this guy, and i have to go to work tomorrow....", "votes": "308", "replies": "8", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgyL-bypP7Q3GfGoLUJ4AaABAg", "comment": "thank you. você é máximo professor", "votes": "2", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugh7tR7XOuceJ3gCoAEC", "comment": "This lecture is blowing my mind so much that I'm angry LOL", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjmEriP8YQR5HgCoAEC", "comment": "Thanks Stafford Sir a lot thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgieBww90Jqzp3gCoAEC", "comment": "Hİ FROM TURKEY :)", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjPLjGZGgz00HgCoAEC", "comment": "It is a great lecture.   :D", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjhSk51TdkxQngCoAEC", "comment": "Awesome!!", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgxSGbgvoz6XEs5UAO14AaABAg.8d98MJNNtVL8yY8JxUewzM", "comment": "No, of course not. It's all about population genetics and simulations.  The way a better gene spreads into a big population. It's very likely, though it's better, that it will be lost by accident after a few generations. Or it will be so scattered that no result on the species even after a very long time.  With small populations, better genes are more likely to spread to the entire species. Thus quick evolution. Excuse my english.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy2iuFWDRqfxMhOskd4AaABAg.8bbZqV_UZu98ci7j_7p6mF", "comment": "The course, not that I'm aware of, but Sapolski has a couple out.  One of them is 'Why zebras don't get ulcers'.  He referred to it at the start talking about reading the zebra book.  Another book which might be classed as a textbook for this is 'Behave'.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy2iuFWDRqfxMhOskd4AaABAg.8bbZqV_UZu99AKHgB4xR8J", "comment": " @HollyOak  https://www.amazon.com/Behave-Biology-Humans-Best-Worst/dp/1594205078 Link to behave", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugyrynu313Rnt6wfKAR4AaABAg.8b2YNn0WtQd8crks0yeB47", "comment": "Adolfo Domínguez actually you both are incomplete.   Yes the third pair is redundant 69% of the time, but often so is the second pair.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugyrynu313Rnt6wfKAR4AaABAg.8b2YNn0WtQd8crmZNTMfUi", "comment": "Oh and I am also massively incomplete, so no need to remind me :-)", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugyrynu313Rnt6wfKAR4AaABAg.8b2YNn0WtQd8crpEj-HT4X", "comment": "No, you're plain wrong. There's only two cases where there's redundancy in others positions, in the codons for leucine and arginine, and it's the first one the redundant in both cases (CU-, UUA, UUG, all code for leucine; CG-, AGA, AGG for arginine ) the second nucleotide is never redundant. https://biologydictionary.net/genetic-code/#prettyPhoto/0/", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugyrynu313Rnt6wfKAR4AaABAg.8b2YNn0WtQd8yo6uP3LEsB", "comment": " @clubadv  I love that phrase \"incomplete\" it seems so much more intelligent than \"wrong\" or \"right\".  I can't comment on what you are talking about but incomplete has just entered my vocabulary when discussing ideas at work.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m8qb1KM8WamX", "comment": "4:30am for me, but luckily, I don't have to work tomorrow.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m8uy4VQnW_vY", "comment": "Duuude....how are now on your job?", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m8vskSGFcd2w", "comment": "* today... :)", "votes": "6", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m930pWWQzwig", "comment": "i love it!", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m9HfTeMJ4ykU", "comment": "Oh im not alone it's 04.30am and im watching this and also i have a class at 08.30am but idc", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m9HgiMWl3Uzr", "comment": " @zoeysvlogs  We have all been seduced :)", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m9Hgid33MIK6", "comment": " @andreeazamfir9713  The same. The only difference now is that my eyes have been opened and I am preaching Sapolsky's word wherever i can :D", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugy6YkFoSWb8Dy8firR4AaABAg.8WDrPBvgJ_m9LOelX1nYR_", "comment": "Some would consider the inability to control your own impulses an undesirable genetic trait. I think it is an advantage in cases like this :P", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UggiaWUlEmbX8ngCoAEC", "comment": "Does anyone know where to find the next part of this lecture?", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UggSyu5NT-j3QXgCoAEC", "comment": "The middle nucleotide point mutation is actually the most likely to change the amino acid. The third nucleotide point mutation will code for the same amino acid, on average, 69%  of the time.", "votes": "38", "replies": "4", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgicMeQeiOfhH3gCoAEC", "comment": "He looks like Robinson Crusoe", "votes": "0", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgiUgYXDTZtkQHgCoAEC", "comment": "Its clear how indoctrination works. No need to look at anymore of these.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjZMhxYaIWzOXgCoAEC", "comment": "Keşke Türkçe altyazılı olsaydı", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ughj_a1oeFwC0ngCoAEC", "comment": "No biologist, but this pretty much confirms Bruce Lipton's theory?", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjduQT4pE8QGXgCoAEC", "comment": "How do the favorable mutations spread if they happen in a low ranking male in a tournament species? Aren't the odds that he'll reproduce and pass it on rather low?", "votes": "0", "replies": "4", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghqkKkzqvwc-XgCoAEC", "comment": "the hormones are just signs that make there way threw other cells and giving the information to every cell where it is needed. It is the same as a part of the \"nerves\" not completely the same but it is the best way to explain it..", "votes": "3", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgiNLGAAYkyhCngCoAEC", "comment": "SO the cell is just trying to survive like every organism does in the same way by using the plasma(everything in it ofc) and the membrane as the senses of the cell. (like the ears, eyes, nose and nose) That give signs to the nucleus(the DNA). That can be seen as the brain of it al. That makes connections with these actions. That make other actions to respond and happend. That will keep the cell from dying just yet. Therefore every cell is just simply surviving from the changes in any environment. Just like we do to. (pretty logical bc) we are just a whole bunch of cells evolved in this way to survive.", "votes": "11", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjkJKWpte8HsXgCoAEC", "comment": "WOW THANKS A LOT SIR.ITS EFFECTIVE", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugg74dtMMimXOHgCoAEC", "comment": "OK, I'm at 1:03:33 and I'm gonna make a semi-educated guess at the solution: natural selection is happening all the time, but as soon as an optimal equilibrium is reached in any species - ideal adaption - all further mutations are absorbed either into 'junk DNA' or by driving their carriers into extinction (the carriers of the particular bad allele, that is). As soon as factors of evolutionary pressures change in any way, mutations that are advantageous in the newly created set of circumstances begin to be preserved, and so speciation occurs, until a new equilibrium is reached.", "votes": "11", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghJ-18Ppo205XgCoAEC", "comment": "excellent classroom presentations!", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjbKxslYAz8CXgCoAEC", "comment": "Molecular Evolution... one of the few courses I paid attention to (i.e. skipped only 30% of classes) and actually did well (managed an A somehow)...", "votes": "4", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjiU4H19_3yRHgCoAEC", "comment": "I only took English and Pscych in College and as interdisciplinary studies for my animation career, but just taught myself how to animate online. I love that I can continue to learn even now that I'm full time.", "votes": "11", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UggE4_Yd6bzmAXgCoAEC", "comment": "This is great!", "votes": "8", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Uggd5JxJ9snpfXgCoAEC", "comment": "You did a great job and service to us lay learners out here, Robert Sapolsky.", "votes": "64", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugia7M3eQ-fe1HgCoAEC", "comment": "Is this a graduate course?", "votes": "0", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UggWZ_Aigy8QmngCoAEC", "comment": "of course its not clear of stephen jay goulds response to gradualism is what happens or a mix of both, in the end it seems that stephen jay goulds view applied really well to haploid, asexual microorganisms! quite impressive.", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC", "comment": "Wow, how is it that just 20 minutes of listening to this Man has educated me more than two weeks of class with my current professor", "votes": "207", "replies": "6", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugg_q4Fw4JJSSHgCoAEC", "comment": "I have a Molecular Biology class for my first year of medical school here in France. It's absolutely fascinating. Thank you, Stanford; when I start my winter break next week, I'll have these wonderful videos to recapitulate the semester with.", "votes": "99", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UggiaWUlEmbX8ngCoAEC.8RtJ9_LqC-58_Ulx1lwl-g", "comment": "You're not ready.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UggiaWUlEmbX8ngCoAEC.8RtJ9_LqC-58cUlfdY_s9q", "comment": "By searching ;)", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UggSyu5NT-j3QXgCoAEC.8RK1cGv8FpQ8vZvNk9EEYK", "comment": "Why is this?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UggSyu5NT-j3QXgCoAEC.8RK1cGv8FpQ98_K_pF9s69", "comment": "Agree, I had to actually pause at that part", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UggSyu5NT-j3QXgCoAEC.8RK1cGv8FpQ9HUFHkrnGd7", "comment": "Thanks for the corrections", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UggSyu5NT-j3QXgCoAEC.8RK1cGv8FpQ9cG01qvFV-0", "comment": " @nate-manlovesgland2347  this allows for mutation to occur without thw change of codon which is important as mutations can have negative effects on function. Having some room for error is ideal.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgicMeQeiOfhH3gCoAEC.8RJeXqobfYm8W6ADqnaDfF", "comment": "Papa Roach a novel character?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgicMeQeiOfhH3gCoAEC.8RJeXqobfYm8lGks2Tq3ej", "comment": "Al Capson don't tell me you haven't read any Defoe. What's the world turning into?!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughj_a1oeFwC0ngCoAEC.8NvuXl9nZKB8fOp30ZhbPD", "comment": "If you like it to", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjduQT4pE8QGXgCoAEC.8NYz783XFDT8OFfvNL7-BS", "comment": "Andres Mugra If the mutation is favourable in the way it allows the low ranking male to better thrive in its environment (perhaps an ability to reach inaccessible fruits due to loss of habitat, in apes for example) then it could be possible that this male is better equipped for long term survival than their non-mutated counterparts. This in turn might lead to the death of said non-mutated male and would leave mutated male at a greater advantage since it is stronger, better fed and would be superior in providing for infant and mother.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjduQT4pE8QGXgCoAEC.8NYz783XFDT8ZJwL0qvwkz", "comment": "Andres Mugra  Another reason why the process takes soooo damn long......", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjduQT4pE8QGXgCoAEC.8NYz783XFDT913TCr81kUQ", "comment": "Andres Mugra  Suppose a disease spreads through a population of deer. You're a low ranking buck with a mutation that makes you resistant to the disease.  After a while many of the higher ranked bucks get sick or die from the disease, and you're one of the few remaining bucks in the area that's suitable for mating.  Now the odds are looking pretty good that you'll reproduce and pass it on", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjduQT4pE8QGXgCoAEC.8NYz783XFDT9Qp6tYaiB2e", "comment": "The low ranking males mutations are irrelevant. You can assume that either the mother or a sister or aunt and niece may carry the same mutation and thereby contribute to the gene pool. Our old thinking is that genetics is based on males passing on their genes when it is much more likely that it’s about the females", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghqkKkzqvwc-XgCoAEC.8LLIdkQleVM8ci76S0JoLZ", "comment": "make their way through there - place or location, their - possession.  Their way or the way of them.  There way vs here way threw - past tense of 'throw'.  through - passage of travel, ie:  to get from the kitchen to the bedroom you go through the hall.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiNLGAAYkyhCngCoAEC.8LLINaUpfwM8pndZIgsc99", "comment": "Is this like the Fibonacci Sequence? If so, what would be the \"bigger\" parts of the spiral in reference to us?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugg74dtMMimXOHgCoAEC.8KBQmDau5e59AK3-rwv4Kz", "comment": "It's not necessary for equilibrium to exist for variations to exist live long.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugg74dtMMimXOHgCoAEC.8KBQmDau5e59Qp1Q7tSdsv", "comment": "“Optimal” doesn’t exist. The moment it is archived it is outdated.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugg74dtMMimXOHgCoAEC.8KBQmDau5e59WeUV7N83WC", "comment": "It's essentially just 'Stabilizing selection', 'Directional selection' and 'Disruptive selection'.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Uggd5JxJ9snpfXgCoAEC.8D6b_ZeNDvn8KGR-Pz25Gh", "comment": "And Stanford U.", "votes": "6", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugia7M3eQ-fe1HgCoAEC.8C2c_u7J-A-8FDi2uH0O1K", "comment": "Surely not. This is pretty much the fist lecture for first semesters.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugia7M3eQ-fe1HgCoAEC.8C2c_u7J-A-8G0toVNuONH", "comment": "The concepts are portrayed as if it's an introduction course.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugia7M3eQ-fe1HgCoAEC.8C2c_u7J-A-9Qp7rXlyDKk", "comment": "It’s 151 - basic stuff", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC.89vSFtq9NKw8AQRVfHXkhE", "comment": "Thanks these videos are gold", "votes": "23", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC.89vSFtq9NKw8k3K3hDbQj9", "comment": "TonySoprano55 He is very user-friendly.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC.89vSFtq9NKw8mv9OwJqy1j", "comment": "Because he actually makes you want to listen to him.", "votes": "6", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC.89vSFtq9NKw92wspCAzuDq", "comment": "Love of their subject. Daily exposure to some of the greatest minds in the world. Quality of education, AND probably somewhere between 20-50 IQ points.", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC.89vSFtq9NKw9QYgKjLdLNt", "comment": "The more you understand a subject, the better and more compact you can explain it. He definitely has research level knowledge of the field and is giving intro classes. So, along with a bit of creativity, he can distill a lot of information into bite size and understandable chunks.  The down side is your brain gets tired because it's just so much information and what feels like almost every other word is actually very important lol.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughq2CgrVddv1XgCoAEC.89vSFtq9NKw9R7IZNpsCkZ", "comment": "Tenure vs. passion", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugg_q4Fw4JJSSHgCoAEC.87WOz8P5exG9ukBWfWo0x0", "comment": "How did it go?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC", "comment": "\"Puberty; sometimes you get acne, sometimes you get a penis.\" - Prof Sapolsky.", "votes": "140", "replies": "12", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjNyBQYRqLuQngCoAEC", "comment": "thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugg_2KaoG3RmPXgCoAEC", "comment": "I love how this professor injects humor in his lecture. Listening to this I find science really cool and genetics - awesome! I missed going back to school. It's interesting how he relates molecular genetics to the study of human biology and disease. How does the cell choreograph the events of cell division so that only one copy of each gene is passed on to the next generation? By what processes do genes become altered to provide the raw material for evolution? The possibility of finding answers to such fundamental questions makes molecular genetics an exciting field of biology. Good job Stanford.", "votes": "139", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghphiaIiqzBW3gCoAEC", "comment": " Well done ! I appreciated the speed for which you covered in this educational review. Honestly,Thanks for not wasting my time ! It's appreciated.", "votes": "1", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgiGvfXJyCMyTHgCoAEC", "comment": "   ", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC", "comment": "good talk...........the biology is dumb down a lot by a whole level. I hope everyone here realizes that bio is the key to all behavior.", "votes": "1", "replies": "14", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjQmzLqMyuq9ngCoAEC", "comment": "Great lecture. - Just a funny slip up: surely those testicles in testicular feminization syndrom are not in the stomach. More like somewhere in the abdominal area.     :-)", "votes": "1", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghotN1kmJx953gCoAEC", "comment": "protein,protein, protein..", "votes": "12", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgjH7AhakzLXyXgCoAEC", "comment": "It's interesting that Crick in his book What Mad Pursuit made a point of saying that he called it a \"dogma\" because it was sort of meant to be violated, as a sort of joke at the expense of religion. I'm a little fuzzy on the details and the book is from 1990, so I'm not really sure how much of that is after the fact, but at any rate he definitely recognized that the reductionist view is both useful and silly. FWIW I thought it was a great read, he's an interesting guy.", "votes": "2", "replies": "3", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UggHPOphSTwBqXgCoAEC", "comment": "Thanks for the courses your university puts out on the web. It's opened my eyes to new horizons.", "votes": "3", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghT4x9nnxkImngCoAEC", "comment": "too bad the last minute or so of this lecture is clipped.", "votes": "23", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghtBDkN9F58l3gCoAEC", "comment": "", "votes": "0", "replies": "", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC", "comment": "This lecture answered so many questions I was left with after completing biology in high school. Why are our school all 20 years behind? That's the new question. ", "votes": "51", "replies": "13", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC", "comment": "20:40 why is the middle letter in the triplet most likely to mutate while coding for the same amino acid ? what makes the ends of the triplet more stable ?", "votes": "0", "replies": "6", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC", "comment": "The phanton cougher, coughs througout the whole 25 video series!!! Onya", "votes": "146", "replies": "28", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UggOAxgli3TzbHgCoAEC", "comment": "this reminds me of my professors I had a Rutgers. But having now graduating I have been looking endlessly to gaining more detailed knowledge on topics I have already learned about. He is amazing!", "votes": "27", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "Ugh4SDYkOUm1xngCoAEC", "comment": "Political views run throughout all of this, but also views on this influence political views. In fact I would say that more often one's views on the heritability of differences is what influences the political views, not political views biasing views on heritability.", "votes": "3", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgicO8yhvdLMz3gCoAEC", "comment": "Stanford and MIT are really amazing. They are without a doubt the best universities in the world. They care so much about educating the world, that they are willing to put their courses on the internet for free, so that ordinary people may become knowledgable. Thank you for these courses! ", "votes": "1.3K", "replies": "37", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgiQ8YIBo36-CngCoAEC", "comment": " Robert Sapolsky is a genius.", "votes": "14", "replies": "2", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgiT3LN8lX3Qn3gCoAEC", "comment": "Hegel conjectured \"evolution is a dialectical process\", what he meant was never properly looked into, but we can draw conclusions, based on our observation of evolution, and how the genome,(in conjunction with the impression of the environment on the brain), bring about evolution. This genome itself evolved from a simpler genome defined by the standard model of particle physics,that cosmologists employ to explain the evolution of the inorganic world of stars and galaxies where elements, molecules, organic molecules, and on to life and intelligence are produced.So what does Hegel's laws of dialectics have to do ?      His laws of dialectics has mathematical representation on a complex plane that defines two different types of opposites: Opposites and duals (defined according to the algorithm of complex analysis). These two types of opposites are the simplest genome, that we can speculate to be responsible for the evolution of everything in the universe. The universal genome is both unchanging and at the same time evolving.This genome delivers without fail.", "votes": "3", "replies": "1", "reply": false}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg370kWMbvWMqL", "comment": "+SpankyTheHippo83 That story made me wonder why pre-pubescent males need testosterone at all. It sounds like you can get away without it, so why spend all that metabolic effort producing it, when you could leave it out till puberty?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg389wFgSmjLty", "comment": "+HebaruSan Because it increases aggression which helps in finding a mate. I can imagine there are many other reasons too; you should probably look it up.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg389wR7_tq_q9", "comment": "Little Leigh Why would you need to find a mate before puberty?", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg389xuA2nCLmL", "comment": "+HebaruSan I can't imagine that testosterone occurs before puberty tbh. As fara s I know, the release of testosterone is something that marks the start of puberty in males. If this is incorrect however, then I can only speculate -- not being a biologist myself-- that in Homo Sapiens -- with out extreme pair bonding -- it would serve to begin the process of finding a pair bond before the male is ready for reproduction as females generally are ready to mate before males. I must reiterate, I am not a biologist, you would probably be better looking this up than relying on me! :)", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38AiSPRU82EG", "comment": "+Little Leigh   Androgens are present while in utero and play a very important role in the development of the gonads, they continue play many other important roles throughout your entire lifespan (not just puberty) including muscle development, bone development and of course reproduction.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38AiYYM9DkZj", "comment": "+Jesikah Logan Thank you! ^_^", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38Av-lop0YlG", "comment": "+HebaruSan Actually we do need testosterone even before we are born. As fetuses, male testes release testosterone which activates the Wolffian ducts (mesonephric ducts) to form male internal genitalia. Additionally, this testosterone is converted to dihydrotestosterone (more active form) to form male external genatalia. So basically, we need testosterone to form our male internal, & external structures. Source: First Aid for the USMLE Step1 2015 (p.567)", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38DYVVSyK9Wd", "comment": "+HebaruSan Ask Bruce Jenner. He had a glitch in his testosterone before birth. That one tiny problem got him a TV show.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38RtK6JCB8g5", "comment": "I searched for that and I'm  buying it, thanks to you.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38XyOd60ijbl", "comment": "In that sentence you're supposed to use a colon, not a semicolon.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg38ZJtZnpltZJ", "comment": "Psilosopher Yep!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgiJAbw2oB4X_3gCoAEC.84ctI5XgUg3A5VxxRaBFpN", "comment": "Such an amazing information 👍", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugg_2KaoG3RmPXgCoAEC.83ioRqOos8a9URyp8xMq72", "comment": " @airkuna  have you?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ugg_2KaoG3RmPXgCoAEC.83ioRqOos8a9UVm_zaLDhk", "comment": " @A.K.00  :D no, i like girls only, so i would see what's under your skirt! your'e a girl , right?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS70BA3ohIF2s", "comment": "Scienceand Reason You do see the contradiction, right?", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS70BwjZYLBTK", "comment": "yup...I wonder why education is like this at that school", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS86YfCY7NmhU", "comment": "\"I hope everyone realizes that biology is the key to all behavior\".  If that's true, then there is no reason to say you  \"hope\" and no one to realize anything.  No one says \"I hope a blind chemical process \"realizes\" something.\"", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS86ZyOQKuzjF", "comment": "duh ", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS86_DvuEi1LA", "comment": "But reductive materialist approaches cannot account for consciousness or mental qualia.  As Thomas Nagel points out, all knowledge of biology will not tell me what it is like to be a bat; that subjective element is not accessible to me.  Since the subjective element is part of the trajectory of biological evolution, purely materialist accounts cannot be true.  Therefore, biology cannot be the \"key\" to all behavior--not the only key anyway.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8AcM9f_Nc0w", "comment": "+Tom J of course. If a chemical reaction A wants to know how it feels like to be chemical reaction B, it would need to actually be Chemical reaction B instead of A. its a material impossibility that i cannot show you what is like to be a bat. but well i guess its an interesting argument anyway, i would like to look deeper into it one day.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8I1EbyIjPrE", "comment": "How exactly do non-\"material\" concepts help at all to explain qualia?  What makes the non-material stuff any more capable of solving the problem of consciousness than biology?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8I1JPmYPsYM", "comment": "A. J. DiGiovanni they don't help at all, whoever you were replying too didn't understand qualia, the beatiful thing about qualia is that the occam razor response has to be materialistic", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8ICIMixEAYs", "comment": "A.J., the non-material elements don't explain qualia (not in the way you mean anyway), they just show that reductive materialist accounts of consciousness cannot be true.  Furthermore, if your thoughts are merely chemical reactions, how would you be able to claim that your chemical processes can identify an abstract, objective \"law\" that binds the processes of other chemicals?  So you have a particular chemical property, there is no way for you to claim that other chemicals should have the same properties: the claim of \"ought\" requires a standard you cannot supply.  Paulo, Ockham's razor is meant to eliminate spurious explanations, not bury contrary evidence.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8ICIcXf4klC", "comment": "Guys, you should know that I'm just agreeing with Thomas Nagel, Bertrand Russell, John Searle, and a lot of others.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8ICTr498fGB", "comment": "I don't see how they show that at all.  You're just arguing from incredulity, and no amount of agreement with some philosophers makes your argument any stronger.  As for \"abstract, objective laws,\" I wouldn't say I believe that physical laws \"bind\" chemical processes.  Laws are a description of how the world behaves, not how it \"ought\" to behave, and nonphysical elements can't explain why nature behaves as it does any better than physical elements do.  So yes, yours is a spurious explanation, so Occam's razor applies here.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8IDZ0Xo-KsT", "comment": "I don't think you have any idea what I'm saying.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8ID_Hl6fugA", "comment": "I mean, honestly I don't, but that's a fault of your communication, not my understanding.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "Ughfa4viFfvLW3gCoAEC.8-tZB1dwGjS8ID_XJK-zSf", "comment": "You're really just begging the question, asserting that \"No one says 'I hope a blind chemical process realizes something',\" without justification.  Just because you can't see how chemical processes can give rise to the emergent property of realization and other mental processes, down mean they can't.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjQmzLqMyuq9ngCoAEC.8-V2uRt-QS38lGjUWW2RKx", "comment": "It's just terminology, don't go anal here. Actually your term \"abdominal area\" is just as vague and not anal enough.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjH7AhakzLXyXgCoAEC.7zsxEz75wdb89wGWjhNn9F", "comment": "+foobargorch Called what a dogma? Sorry, I'd like to know what you're talking about but am lacking context.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjH7AhakzLXyXgCoAEC.7zsxEz75wdb89wGdOciXVO", "comment": "https://en.wikipedia.org/wiki/Central_dogma_of_molecular_biology", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgjH7AhakzLXyXgCoAEC.7zsxEz75wdb89wLTDkHPhR", "comment": "+foobargorch Molecular biology, gotya.. thanks! I haven't seen this lecture in a while! Might have to give that book a read after the Gould one.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghT4x9nnxkImngCoAEC.7-H0Z7-657K8vPzgWcgvgn", "comment": "It got spliced out... ok I'll show myself the door", "votes": "10", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv89wGH-HXwz-", "comment": "+groomedtodie Because school is about educating people just enough to get them into the workforce. Economy is more important than intelligence to the 'powers that be'; can't have everyone running around thinking while there is work to be done ;)", "votes": "18", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8gr-VsFSlPu", "comment": "Sapolsky goes on and on about mutations that rarely happen and misses the behavioral part of the course.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8j8FC-oU4W_", "comment": "Classical and analytical mechanics are very easy subjects if one is a potent student, sure modern students are too dumb to get it even though 240 years have passed since the subject matured.  These people are studying biology for a reason.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8k8rvEFrL8P", "comment": "Why aren’t school students inquisitive enough to procure their own books and study? Hmmmmm.... do we blame nuclear family or “society”? Which one is easier to blame?", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8k8t-wqPP_g", "comment": "Half the population has below average IQ, most are below 115, they are not smart and patient enough for the elaborations of books. I've seen so many people go through books and learn nothing.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8kB0Gt1aSB2", "comment": "Tasos Obscure isn’t the iq test standardized to be an average of 100? Someone of average intelligence can read a comment so they can internalize textbooks, they simply may not want to.  But again, whose fault is that? Marx and Hegel have already argued far more than anyone can on the role of society. Society isn’t amenable enough to be the answer, so something else should be to blame— parents, perhaps... part versus the whole, etc.", "votes": "3", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8kB3KqPDVf9", "comment": "I disagree that they can internalize textbooks, it requires a huge time and effort investment that most people are simply not willing to go through. If one's IQ is high enough, at least the effort is significantly reduced. The biological basis is that one does not need to concern himself, let alone waste energy, with matters that are not relevant to his ability to pass on copies of genes. Some populations have inherited behaviors that are harmful, this is maladaption but it's much harder to find than what is obvious. If there is a large enough benefit(adapted to be valuable  to people because it increases the likelihood to pass on genes) in doing something, people will do it. Society can incentivize people artificially to do something, but unless it comes about in the natural way there is usually no benefit in the practice (this would otherwise be called human error). Even if the immediate result for the people going through a practice has some benefits, there are other issues springing up subject to the fact that government planners(or incentivizing parties in general) have a very incomplete understanding of the complexity of our world. I also want to point out that behavioral research textbooks have some extremely well founded results that most people consider extremely unpalatable or harmful to society(eg high heritability of IQ).", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8kBUSTibXd9", "comment": "Tasos Obscure you really shifted the focus of the discussion to something far more relevant than what the OP comment implies— the humanist element (reproduction/gene propagation) must be considered before the behavioral element (i.e. bickering, spewing judgment) of... behavior. I cannot counter that, thank you for such an insightful discussion.", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv8nHuU3eIQY9", "comment": "To keep the population stupid", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv913Qv1zeHnd", "comment": " @senselessnothing  Actually, there's data showing that the average IQ is going up.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv913Rqd9cIHR", "comment": "Jason Lunden You're referring to the flynn effect, it's long dead.", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv91i_OSK5kWv", "comment": " @LittleLeighVisual you are absolutly correct", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UgilZ1llsOlw-XgCoAEC.7-H0Z7-TZLv9AK-D3LiGwA", "comment": "Hanlon's razor is an aphorism \"Never attribute to malice that which is adequately explained by stupidity  https://en.m.wikipedia.org/wiki/Hanlon%27s_razor  The\" western \" education system has been designed to produce secretarys for an Industrial revolution (or sift out sufficient numbers of those from the general population), not ongoing in the places its critiqued and failing to improve.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC.7-H0Z7-3hAi70Z4u656aM6", "comment": "***** sounds like a possible explanation but pretty speculative indeed", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC.7-H0Z7-3hAi70ZE0z5Rs4y", "comment": "***** ok thanks for point that out!", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC.7-H0Z7-3hAi89wGoAnNJFl", "comment": "+euphemus2 Good explanation. But in future you should probably not say things like \"I'm speculating, I may be wrong\" unless you actually mean it. there is nothing polite about pointlessly lying to someone seeking information on something you clearly understand.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC.7-H0Z7-3hAi89wLDL7OuQn", "comment": "+euphemus2 \"It's not really speculation\" does imply strongly that you were not speculating. There was nothing impolite about my comment; your last one however was rather bitchy.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC.7-H0Z7-3hAi8AbaiatmxlB", "comment": "+euphemus2 I was making an observation, not trying to be insulting. You knowingly mislead the person and admitted it yourself. I had no intention of being bitchy, I was just pointing out what was clearly observable. There is definitely a way to do it gently if the person in question isn't extremely sensitive to someone pointing out what is evident. It had nothing to do with tone and if you don't want to reply don't, I am not detaining you whatsoever.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UginRN7O4DN5lHgCoAEC.7-H0Z7-3hAi8Ac7bJF9b9_", "comment": "***** for the record, i didn't feel \"offended, hurt, traumatized, etc\" by your answer. I guess i'm from the generation of people who can exchange a few comments on a youtube video without feeling hurt, traumatized, lied to, erased, etc lol", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh8zFoEAqZtlX", "comment": "You'll find that happening in every lecture hall all of the time.", "votes": "7", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh8zeqi7pyBCf", "comment": "🤣😂🤣😂", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh908hB_pl2Vl", "comment": "When sick- stay home.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh908jCXtDAOb", "comment": " @ST-yc7uj  - Tell that to the university administration that determined you fail classes if your attendance is <90%.", "votes": "12", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh986D0hIscfU", "comment": " @ST-yc7uj  well I suppose the global pandemic did put this comment in an other perspective. 😀 And hopefully this will change how educational institutions deal with students who feel under the weather", "votes": "5", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AJzVNRqlRx", "comment": " @ST-yc7uj  the economic loss estimated trough \"falking\" illness to get out of work are at 1/5-1/10 the value lost trough being present while sick and still \"protestant work ethic\" insists on keeping people suffering and making it difficult for society to improve.", "votes": "4", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKJ-NTAh8K", "comment": " @TheMrVengeance  doctor's note?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKKUGrufa-", "comment": " @fionafiona1146  god bless corona😄", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKNYPbE6Bq", "comment": " @ST-yc7uj  I get doctersnotes to hand into my professors, without paying more than 500€/term in tuition or additional costs for regional public transport (note the currency)... not all Healthcare systems offer such tight coverage since 1883( and sill most professors complain about having to invent \"make up\" tasks because people need to be working harder while 🤮)", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKPgv1V_ci", "comment": " @fionafiona1146  you don't need attendance then to pass the exams", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKRvXDp-bU", "comment": " @ST-yc7uj  I need \"active participation\" to be admitted to apply for examination (usually requiring passing them within 3 terms, even Corona related spacing, delays and relocation didn't limit the number of \"qualified\" students taking the exams (indifferent of how long they held the qualification))... What counts as \"active\" however is within the Professors judgment (usually governed by the department, appeal able trough the Students Council within 20terms😉) and usually includes a presentation or 4 essays or weekly \"tests\" beyond full attendance (in 11-16 weeks)  TLDR I could write 20 essays (of 4 regular) in order to make up missing one class all term(with some serious diagnosis, as insurance is keeping tight attention on pill/note mills) and if they please get to take the exam.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKTDGqP-cn", "comment": " @fionafiona1146  You say you're not attending but you're writing essays instead?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AKTfThrDde", "comment": " @ST-yc7uj  I could, if my professor was convinced before the time of the class, I couldn't attend.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AL6P3phU4B", "comment": " @fionafiona1146  you do not want to travel. That has nothing to do with being ill.", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9ALAROp9d-Q", "comment": " @ST-yc7uj  So I couldn't get out of attendance that regularly? Must be great to be me 😊", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9ALQWvf8XE6", "comment": " @fionafiona1146  What are you talking about?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9AMAnot3CMO", "comment": " @ST-yc7uj  if I can't get a doctersnotes I must not have any health concerns.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9ANFqxzGME2", "comment": " @fionafiona1146  if you are not ill, why would you get a note for anyways. Go to school! If you are enrolled you are supposed to attend regularily and study. If you are ill,you have the right to a doctors note and not going to school.  Let them decide what homework they will give you,if any,and write it.  Where's the confusion in that?", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9ANGRsnlsN6", "comment": " @ST-yc7uj  If I was coughing 3 weeks a term I would get doctors notes, so Corona put much online and I only have 8 exams to attend.", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9B_LC1m0df9", "comment": " @fionafiona1146  your line of thoughts is a mess", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9DAvfZ9xxfI", "comment": "Freshmen students in NorCal, definitely more likely a stoner cough than a chronically ill person. I've watched about half these at least once, and they're good lecruredveutgervway, but a little THC makes them truly great, if I were a student in his class best believe I'd be chiefin tough before I got there, and I wouldn't just smoke before any class just cuz  Why do you think Rogan loves this guy? He's definitely die fir a return to the podcast , as a side note", "votes": "2", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9E-Xo5BaDAb", "comment": " @nate-manlovesgland2347  i also think its good lecurevgudwedged", "votes": "1", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9JF3KYkhVCI", "comment": "Right???", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9JIhfygG0oJ", "comment": " @sarawest7075  Got Covid...", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9ODg7OCeFo2", "comment": "Reveal: it's the camera person 👀", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9OFGQYe4yoP", "comment": " @Jemppu  Oh. State your source of information...", "votes": "0", "replies": "", "reply": true}, {"vid": "_dRXA1_e30o", "cid": "UghuqMlS1edUWngCoAEC.7-H0Z7-KSJh9OT-WBLYg8V", "comment": "Right. Obviously b4 Covid", "votes": "1", "replies": "", "reply": true}]