[{"vid": "_U6YamvF7BE", "cid": "UgxCXXkroe6urYQrc_h4AaABAg", "comment": "I remember being taught that intensity of light is related to the energy of photons through their frequency, or something like that. And I can find info saying similar things online. But here it sounds like intensity is measuring the amount of photons only? I'm sure the professor is right, but I think I'm misunderstanding something, or different people are conveying this information in different ways that is confusing me.", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyPYsMR4km3-qljgyh4AaABAg", "comment": "12:02", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugw_x7j1cASl9ZJ1seJ4AaABAg", "comment": "Thanks 🤍❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyHFp6RndlraJHK8bd4AaABAg", "comment": "Why did you tell me about ROY G BIV. What have you done.", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwDOLwXEZKlmVAJJih4AaABAg", "comment": "2:29 this nigga has to be an npc", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugzv_TDtJrdyqAo4-1l4AaABAg", "comment": "The ejected electrons from the metal surface are also called [ Photoelectrons ]", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugyna1rXa7l6IrXn80B4AaABAg", "comment": "The creativity in play here is stunning!", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugy7lLkGxGk6kwst3254AaABAg", "comment": "7126D", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzM0i02aiAz7anwO3F4AaABAg", "comment": "Oh shit, prof lookin Hot this week", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyIJaUlpLrHqUoA3-B4AaABAg", "comment": "Excellent lecture!", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgymUbHZ1zmk0orgWzN4AaABAg", "comment": "What a comedy! Who would have thought that AI would deduce the structures of more than 200 million proteins !", "votes": "0", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz5MzqzG4NQLYz_piR4AaABAg", "comment": "No kidding, at Towson university, we didn’t start doing mole calculations until the last month of the course.😂", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxeuCMZMDY6mcxcVXN4AaABAg", "comment": "2:38 3:18 3:25 3:34 3:51 3:58 4:11 4:23 4:35", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzUWxwcWc7hU-bR9Hx4AaABAg", "comment": "muy muy  MUY BUENA PROFESORA, SIMPATICA Y BELLA, BUENAS CLASES SUPERRRRR ELLA.", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugzp_SGdhh_SnI3cZAx4AaABAg", "comment": "Best professor of all times☢", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz-uClAxChYV52MPyJ4AaABAg", "comment": "I literally came to the US after following her classes!", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwrSKL4KrEHKNUg9rN4AaABAg", "comment": "They \"Must\" Be Giants....really?", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxzNI7FIOvkDfcqB294AaABAg", "comment": "I am unclear why photons  loss all the energy  to the ejected electrons ( when Ei > workfunction) - can photons lost part of the energy to the electrons?  thanks in advance for answering.", "votes": "0", "replies": "4", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzbFCVfTint-Ec9xsZ4AaABAg", "comment": "Is there any dumb student at MIT?", "votes": "0", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz6ptvZM2S1xLk4TtB4AaABAg", "comment": "I actually understand wavelength and frequency 😮", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgymUbHZ1zmk0orgWzN4AaABAg.9spsdN7brmi9uxXIT21rWd", "comment": "It didn't, you just don't understand what the science news means. ;-)", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgxzNI7FIOvkDfcqB294AaABAg.9kHienwzsjF9kHjAm9W9up", "comment": "Yes, an electron can absorb part of a photon's energy. That's called inelastic scattering. It's not really proper to talk about \"the outgoing photon\" as the same as \"the incoming photon\", though. And, no, in case of the photoelectric effect not all of the photon's energy is imparted on the electron. Much of it goes to the metal's lattice.", "votes": "1", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgxzNI7FIOvkDfcqB294AaABAg.9kHienwzsjF9kHqE6r1D96", "comment": " @schmetterling4477            thanks. This bring me to another question of this lecture> is it assuming all  photons energy is fully transferred  to the ejected electrons  K.E. = Ei- workfunction ? am I misunderstood ?", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgxzNI7FIOvkDfcqB294AaABAg.9kHienwzsjF9kHr1PX2XcN", "comment": " @ED99LAM  That's correct. If the electron gets all of the photon energy, then the remaining kinetic energy is still reduced by the work function (which is basically just the electrostatic potential energy of the electrons inside the metal). At least that's the simplified theory. In practice there is also a thermodynamic component, which is why thermal emission is possible even without external sources of energy like in case of the photoelectric effect and then we can also lower the work function with an additional electrostatic field, which leads to field emission. And finally the work function can be greatly modified by surface contaminants, leading to both a suppression of emission and active emission centers. And now things get really complicated (and interesting for physicists who like to work on surface physics).", "votes": "2", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgxzNI7FIOvkDfcqB294AaABAg.9kHienwzsjF9kHtpe3ROo7", "comment": " @schmetterling4477   thanks for taking the time to answer my questions.  There are more to learn in Quantum physics.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzbFCVfTint-Ec9xsZ4AaABAg.9igTq5GFhux9kHjOqCwdQ9", "comment": "Probably, although in practice all the MIT folks I have interacted with during my career were exceptionally sharp. That might have been coincidence, though. The numbers are in the single digits, so one can't call that properly statistically significant.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzbFCVfTint-Ec9xsZ4AaABAg.9igTq5GFhux9kHsUPkRG1b", "comment": " @schmetterling4477  thanks, i just soo curious...", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz5VrSaV5Boj0RHZ3t4AaABAg", "comment": "It is not clear to me as to how classical mechanics says that energy of a wave has no relationship with it's frequency. 30:24   Can someone help?", "votes": "0", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxtH-uHDJosWwNaMI14AaABAg", "comment": "These are pretty great. I finished my biochem degree, coming back and watching these to make sure any gaps I might have in chemistry are filled. After seeing a lot of comments talking about their terrible university lecturers, I'm much more grateful to mine. I didn't go to any Ivy, but I certainly did learn and loved my lectures.", "votes": "3", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugymigi1UDvlfn63z6h4AaABAg", "comment": "21qqq2213", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxEoCTecjFohe6cRRh4AaABAg", "comment": "Ytdgg", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyL5PES3AmXuCBeOv14AaABAg", "comment": "15:50 Roy G Biv; 27:48 duality ; PE effect; 30:20 Graph freq vs KE; 31:18 Int vs KE; 33:20 h Planck constant", "votes": "10", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwhZqTu-MrpzhkHOKB4AaABAg", "comment": "4 min energy quantized into  bundles called photons; speed 186K miles /s", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugwrhnn7zKO40ALr60x4AaABAg", "comment": "I'm not from the us but you can't imagine how helpful  was that for me, to see the greatest educational institution offers the help hand to all students from all countries and for free. thank you MIT on behalf of all the students", "votes": "18", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzwJQrQxL_wvbfo_Ft4AaABAg", "comment": "Very average instructor", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyoGQIiaRGWl50duyF4AaABAg", "comment": "The human body is also considered continuous overlaps And sectors  that really relate  to the factor being round We are round until  Applicated shape. The desire will be met by the maker.", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxFI8StumWeeU97i094AaABAg", "comment": "Even in 1.5 speed, it’s fairly easy to follow this teacher", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugwjl7XfsFKegkM-GAN4AaABAg", "comment": "This is an excellent lecture. Thanks, Prof. Drennan. You made me understand the wave-particle duality of light so easily.", "votes": "2", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugx8cZzm4Xo3nCMSx714AaABAg", "comment": "I have a doubt madam. In wave propagation water or sound , how individual particle vibrations are transmitted from particle to particle in the direction of wave propagation? There are gaps between particles in solids,  liquids and gases. Is this not against principle of locality?", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwES3WgSTpgP4FcQxB4AaABAg", "comment": "Stop typin' \"our education system is poor\". If u had good education system and a great teacher why would u come here?", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzFChGadmWYJHkVgAp4AaABAg", "comment": "Thank You Dr. Drenna. Your lectures help me understand General Chemistry better.", "votes": "3", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugxs76ugwsFS4zo2z0N4AaABAg", "comment": "Great", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz3KRIMN99cVNmm5KR4AaABAg", "comment": "she seems soooooo nice", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwG1sCmpCZXkk5qMMZ4AaABAg", "comment": "WHY AND HOW THE CLEAR, THEORETICAL, AND TRUE PROOF OF THE ULTIMATE UNIFICATION REGARDING PHYSICS/PHYSICAL EXPERIENCE IS F=MA AS E=MC2: That SPACE is THEORETICALLY, ultimately, truly, and FUNDAMENTALLY QUANTUM GRAVITATIONAL is proven by the CLEAR fact that E=mc2 IS F=ma. This CLEARLY explains the term c4 from Einstein's field equations (regarding his general theory of gravitation). Gravity AND ELECTROMAGNETISM/energy are linked AND BALANCED opposites, AS E=MC2 IS F=MA; AS ELECTROMAGNETISM/energy is gravity. Great. Time DILATION ULTIMATELY proves ON BALANCE that E=mc2 IS F=ma, AS ELECTROMAGNETISM/energy is gravity. This NECESSARILY represents, INVOLVES, AND DESCRIBES what is possible/potential AND actual IN BALANCE. The MIDDLE DISTANCE in/of SPACE AND the FULL DISTANCE in/of SPACE are thus NECESSARILY LINKED and BALANCED, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. TIME is necessarily possible/potential AND actual IN BALANCE, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/ENERGY IS GRAVITY. (Very importantly, outer \"space\" involves full inertia; AND it is fully invisible AND black.) BALANCE and completeness go hand in hand. It ALL CLEARLY makes perfect sense. Great !!! INSTANTANEITY is thus FUNDAMENTAL to what is the FULL and proper UNDERSTANDING of physics/physical experience, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. \"Mass\"/ENERGY IS GRAVITY. Gravity IS ELECTROMAGNETISM/energy. CLEARLY, I have mathematically, sensibly, and THEORETICALLY unified physics/physical experience; as E=mc2 is CLEARLY proven to constitute what is F=ma ON BALANCE. Gravity/acceleration involves BALANCED inertia/INERTIAL RESISTANCE, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. GRAVITATIONAL force/ENERGY IS proportional to (or BALANCED with/as) inertia/INERTIAL RESISTANCE, as E=mc2 IS F=ma; AS ELECTROMAGNETISM/ENERGY IS GRAVITY. The stars AND PLANETS are POINTS in the night sky. GREAT !!! Energy has/involves GRAVITY, AND ENERGY has/involves inertia/INERTIAL RESISTANCE. It ALL CLEARLY makes perfect sense. E=mc2 IS F=ma. Very carefully consider what is THE MAN who IS standing on what is the EARTH/ground. E=mc2 IS F=ma. GREAT !!! By Frank DiMeglio", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyiAz_WiBein6P4eUN4AaABAg", "comment": "👍🏾👍🏾👍🏾💙💙💙", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyFzjd225UAi_XNAKZ4AaABAg", "comment": "do molecules ever do game theory?", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugwwifr6iTGO3udw9gR4AaABAg", "comment": "roy g biv common its  VIBGYOR", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz5VrSaV5Boj0RHZ3t4AaABAg.9fQd5kxZrDK9kHjnz4kJtU", "comment": "Because the energy of a classical wave is proportional to the square of the amplitude. It is also not quite proper to say that in quantum mechanics the energy of a wave is proportional to the frequency. The energy of the quanta that form a classical wave is proportional to the frequency of that classical wave. It is not proper to say that quanta have a frequency, though. One has to have a narrow distribution of quanta with nearly equal energies to form something like a classical wave packet with an identifiable frequency.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgxtH-uHDJosWwNaMI14AaABAg.9fPIBN2QpvE9kHkIAwSRBp", "comment": "The quality of undergrad lectures differs remarkably little between Ivy League and ordinary schools. The main difference in m experience depends on the lecturer. Some Ivy League lecturers suck at teaching and there are marvelous no-name school professors. I have seen both. One has to get lucky. Good for you if you got lucky with your teachers. Where Ivy League can't be beat is graduate school and funding... if you depend on access to research funding and/or labs, instruments or research collaborations, then you absolutely have to try to get into the best departments there are in your field, otherwise your career will go down the drain.", "votes": "1", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgxtH-uHDJosWwNaMI14AaABAg.9fPIBN2QpvE9zdd9khtEQ6", "comment": "Oh,  I live India and I am in 11th grade. and our syllabus makers thought that it would be great idea to put Undergrad level Physics, Chem and Maths for us.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugwjl7XfsFKegkM-GAN4AaABAg.9X5d5xcHBhL9YXHORf9Gyn", "comment": "That's cool, except that there is no such duality. :-)", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzFChGadmWYJHkVgAp4AaABAg.9TzWUVUksT99xC8AdLtCTR", "comment": "noob", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugy4QaEoyd2qeS8mU2x4AaABAg", "comment": "Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzNMq9V3K6Y8chwMwZ4AaABAg", "comment": "Using the popcorn button on the microwave is some of the worst advice, I thought she was smart /s  Seriously though, don't use the popcorn button, it even says on most bags that the popcorn button will burn your popcorn, which is the opposite of what she says in the video.", "votes": "2", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxSapRNxWRgxYhsqWp4AaABAg", "comment": "Light does not have a speed, it has a rate of induction. Light does not exist, it's perturbations of the Aether field. Until it hits a 3D vortex, so called particle, creates a hysteresis of Illumination.  Visible light is at phi:1 on the EM spectrum. Magnetism is phi:1. Photons and electrons are not particles, they are Vortices. e- >~< p+ = Aether's Hyperboloid, ~ = Inertial Plane = Infinite Capacitance. The smaller the Spacial footprint, the higher the capacitance. Aether's Hyperboloid Apex. Aether decays into e-, ~, p+. p+ enters Counterspace, 1836 p+ in Counterspace = 1 Proton as seen from Space. 1836 e- in Space. Blackhole/Counterspacial Sink is Aether's Hyperboloid into Counterspace. Stars are Aether's Hyperboloid into Space. Space was created for Aether to exist in. Aether was created for Space to exist in. Empty Space does not exist.", "votes": "1", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgziqwM98MVwYhKTGkd4AaABAg", "comment": "Really many concepts were not well explained. For example waves were badly explained as she did not explain what really a wave is? as a traveling pulse not a motion of matter. Also she always taking waves as periodic while it could be just pulses (like Tsunami) generated by an earthquake (the source) in oceans that then propagate in the medium (water). A wave is created by a source of pulses that propagate because there is a medium. The sound is a longitudinal  wave where the source is your tongue moving the air and these perturbations propagate in air (the medium): sound waves cannot propagate in vacuum it need a medium. All waves need a medium to propagate except electromagnetic waves they can propagate in vacuum: Light reach earth even if almost all the distance between sun and earth is empty space except the earth atmosphere. She seems young and she should read more about physics. Also saying the wavelength is the distance between two maximums in a periodic wave which is rather a consequence of the true definition of the wavelength: \"The wavelength is the distance traveled by the wave during a period of time\" so is: lambda = v*T (v: wave speed and T the period). So because the time between two maximums is T and the x axis is the direction of the wave propagation, it matches the definition of the wavelength. Teaching at MIT does nit mean you really understand physics.", "votes": "2", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzZBQ251Hkdkjulb0x4AaABAg", "comment": "it is so figurative teaching system you used", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzdCTuO34SQLj--B_p4AaABAg", "comment": "thanks a lot for video it is extremely helpful.", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugwa3fQqg4D2HE7ZS9l4AaABAg", "comment": "VIBGYOR is better then your song.😀🤣", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzaUJdrPAMrHp194fx4AaABAg", "comment": "I am 55. I chose the development of adults as a career partly because my own experience during my secondary education was horrendous with teachers who simply go through the motions with the focus squarely on grades and not learning. It was \"information passing from the mouth of the one to the hand of the either, without passing through the mind of either\". It made learning an experience most children learned to hate. From a young age I was mesmerized by a set of picture science books my father bought for me. But at secondary school I learned to hate science because it was so boring and tedious. There was no connection between the books I read when I was 5-6 years old and the stuff the rambled off in class... Until now... My terrible experience at school let me to try to help change it and invoke in people again a love of learning. I myself learned to understand that \"Learning is Everything\". As an adult I tried to change this. One day I realized that \"It is very easy to make learning difficult but often very difficult to make learning easy. If you are a Master Trainer it is obvious what you will do..\". Yet more often than not my experience is that the attitude of educators, academic, leaders in business and people in general seem to be the former attitude and not the latter. I can only speculate at their motives but it has sometimes made me sense that it is driven by a personal sense of power and a need to maintain superiority. Watching Catherine Drennan's lectures is inspiring. She is a Master Trainer. Thank you MIT!!! - TJ Bezuidenhoudt", "votes": "8", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxczSki2ME00RGnmlJ4AaABAg", "comment": "Duality of light is occurring due to mass because distance and time are not really exist in space  Because distance in space are no where without any refference 😀😃😃👽👽👽😃😃😀😀😀😃😃👽", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxZkLW7EZUQNw8S6F14AaABAg", "comment": "If you're interested in cryptocurrency you should check out \"pi network\". Its a new app, created by Stanford graduates, that allows you to mine with a smart phone. Its a lot like free money at this point. I get a little boost to my mining power for inviting you so when it asks for your invite code, use (kcwp42). You can find it in your regular app store and theres a ton of info about it on YouTube and google. Its adding about a million new users per month so get in while you still can. You can also follow the link here minepi.com/kcwp42", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwXHSDLxd9_3Zyvy594AaABAg", "comment": "1:08  1% got 24 moles - well, 12+ 12 = 24 so I guess that's their logic!", "votes": "1", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwQ-inNpxc9f5Zof1F4AaABAg", "comment": "I love these lectures, and I love professor Drennan!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugzp9LeIfv48J9Y74194AaABAg", "comment": "that was nice.thanks", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyzjtTrCDgHu9K7ZN94AaABAg", "comment": "Cooler than a Rockstar🙌🏿", "votes": "2", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyFfvIKymSMYbIEo3l4AaABAg", "comment": "While watching the video I have a same feeling that of sitting in MIT.", "votes": "9", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgynEUXD_RHwWX--HCR4AaABAg", "comment": "Wow, these are phenomenal. I wish I had these videos when I was in highschool", "votes": "2", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugw0Bh3UvH0tuHsQho54AaABAg", "comment": "Thank you for revealing the truth. E = hf shenanigan is not the \"internal\" energy of electron. From KE = hf - hf0 we see that speed of the ejected electron depends on the frequency of light.", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz6MWnk6T9c_B5XTq54AaABAg", "comment": "Misconceptions about photons. What if I told you photons don't actually move. They allow photonic energy to travel in the same way air allows sound to travel.  Duality of light is a misconception, particle and a wave. Speed of Light is another misconception or worded incorrectly. It's actually the Speed of Energy. Take picture of a pendulum and see what it does (transfer of kinetic energy from one end of the pendulum to the other) and you'll have a better understanding of why/how light/energy travels so fast. The word you need to get familiar with is propagation.\r Photon is the particle and the energy is the wave. Photon doesn't actually travel the whole distance, that is the whole misconception.", "votes": "2", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzWSYAVinOu12mOpnJ4AaABAg", "comment": "The students that refuse to clap have some personal issues.", "votes": "3", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugx9VM1aqoiJHYY7c2B4AaABAg", "comment": "that was so dope!!!!!! YOUR THE BEST PROF DOC DRENNAN!!", "votes": "4", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxSapRNxWRgxYhsqWp4AaABAg.9KpCJMA2ltK9ev5iFfkBt5", "comment": "O", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgziqwM98MVwYhKTGkd4AaABAg.9KYQ_DLKOZH9UAOJUoAolP", "comment": "I mean this is an intro class that is also taught in high school... Judging to this extent just because of simplifications is kind of weird lol.", "votes": "2", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgziqwM98MVwYhKTGkd4AaABAg.9KYQ_DLKOZH9UPbvx4Wz3A", "comment": "BRUH people don't have the time to  read your little essay . if she has got anything wrong in the subject go to another channel . if don't understand . MIT DOES'NT HAVE TIME TO READ YOUR ESSAY ABOUT WHAT'S RIGHT OR WHAT'S WRONG", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzaUJdrPAMrHp194fx4AaABAg.9HPIv6hdUZu9POM5aNY_YX", "comment": "Just too bad that she is teaching you total nonsense. This isn't physics as it should be taught today. This is physics as it was taught, poorly, in the 1950s.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgwXHSDLxd9_3Zyvy594AaABAg.9EzkmUTL6sL9K9pasrbU01", "comment": "That’s pretty scary considering they are MIT students. I hope it was a troll or a technical failure.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgwXHSDLxd9_3Zyvy594AaABAg.9EzkmUTL6sL9UPc5y9vfVF", "comment": "well i got 2 moles . and my logic is very complex.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz6MWnk6T9c_B5XTq54AaABAg.968BhAO6puL9SbmVnhFL0q", "comment": "No photons can absolutely travel the \"whole\" distance. In fact you can get an interference pattern on a screen (an experiment reproduced multiple times) by firing individual photons", "votes": "2", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugygj85P3pWXHQtZI6Z4AaABAg", "comment": "Maybe I'm just stubborn but I dont understand why we need to think of light as a packet after introducing E=hv.  I visualize wave peaks propelling the electron instead of packets. If the frequency is too low the wave peak can't quite hit the electron in the electron shell. I should do more research about that v0. Is v0 where is becomes 100% efficient? Visualizing a beach ball tied to a buoy \"x\" amount of feet away in the ocean. The wave peak needs to be just right at which it breaks the rope and the beach ball/electron goes flying.", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzHo6kR-666G4bdGxd4AaABAg", "comment": "Either my eyes are super bad or 1 is deff the.... me squinting super damn hard, with my bad glasses of which I cannot afford new ones, noticing there is actually a variable height throughout the chart and you could infact fit pretty much two of a into b ... nvm.", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwNUIeMJbrShPaVRXJ4AaABAg", "comment": "Thank you this vedio is extremely helpful", "votes": "2", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgylLhUHHzIvfWNJ0CB4AaABAg", "comment": "What is the work function here mean? (38:00)", "votes": "0", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz1bJf6paT8WR--GFJ4AaABAg", "comment": "lol that first question is something I learnt in grade 10", "votes": "9", "replies": "5", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugxe_gOZUcbbN1HeJrV4AaABAg", "comment": "It maybe that it becomes a wave do to the weight or interference of shadows or electromagnetic field or dark matter energy event!", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg", "comment": "The more I see these videos, the more I realize that what I receive at school isn't really an education...", "votes": "118", "replies": "8", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwG42nGL-4bzbnpD8Z4AaABAg", "comment": "That was really impressive.Thank you very much!", "votes": "4", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgybBdgmsQ-JLIe2r1t4AaABAg", "comment": "💗", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugzdut6wEhb3AhIgWuJ4AaABAg", "comment": "Latest simplification of text of: Duality of electromagnetic waves,  Einstein’s General Theory of Gravity and Acceleration Negated….Plus - Energy & Matter – Mass & Weight – Centripetal & Centrifugal Force – Inertia – Orbital Mechanics of Celestial Bodies – Magnetism – Gravity. Duality of Electromagnetic Waves.  Proofs: That electromagnetic particles travel in spiralling motions, rather than wave-form motions.   Visual Proof: Obtain and observe a common plasma ball in a darkened room, and you will see that the electromagnet tendrils are rope-like in nature and are comprised of spiralling photons of light that split and radiate outwards in a circular shape on hitting the inside of the glass .  As such this visual demonstration serves to confirm that as with the nature of all projectiles, electromagnetic particles of matter do not (and cannot) travel in an up and down (flat - two-dimensional) wave formation.  Physical Proof: Reference You Tube video Quantum Theory Made Easy [1] Copied and pasted here with a revision of text to simplify the explanation further.  1. All particles of matter possess spin therefore it follows that their outputs of radiation are delivered into the surrounding medium in a spinning motion, which is essentially the same motion as a bowler uses to spin a cricket ball through the surrounding medium of air.   2. Regarding the boy in the video who is creating a wave formation along a length of rope by moving his hand in an up and down motion, if he were instead to rotate the rope in a circular motion (you can use a rope to experience this for yourself) this rotational motion would cause the rope to take on a a spiralling motion along its length within the surrounding medium of air.  Insightful Proof: Since the advent of electron-microscopy we are all aware, what appears to us as to being solid matter, is made up of minuscule units of atoms, which consist mainly of a vast amount of surrounding space, relative to their infinitesimal nuclei and orbiting electrons.  Therefore, if we were able to use an electron microscope to scan the entire length of a rope when it is induced to form a spiralling motion, what we would be able to observe is that every atom and electron within and along the length of the rope is travelling in a spiralling formation.  Sum: Particles of matter do coalesce together to form into (retractile) spiralling coils of forwarding motion, in order to be able to able to travel through their surrounding medium.  (Authors note: Think in terms of a wood screw, there is an applied circular motion of leverage which causes the spiral of metal to retract itself through the wood and so travel into the wood in a forward motion of travel).    GENERAL THEORY: If a lift was taken into outer-space and a torch beam of light inside the lift was shone across it, the beam of light would bend under the force of the lifts acceleration.   The speed of light is 300, 000 kilometres per second  For the beam of light to bend - The acceleration applied to the lift would have to be faster than the speed of 300, 000 kilometres per second.   Which according to Einstein is impossible, because as he said nothing can travel faster than light?   Einstein also said “The photon is considered to be mass-less when at rest”. But only according to Einstein, and both energy and matter are never at rest.   However Einstein did tell the truth on one occasion when he said,  “If the facts do not fit the theory change the facts.   A philosophy Einstein maintained all his life, as a disingenuous but cunning idiot, and an unmitigated compulsive liar.   Of which I am neither.   Open challenge to any so-called theoretical physicist (anyone) to disprove the proof I have provided that negates Einstein’s General Theory of Gravity & Acceleration…   Synopsis: ENERGY & MATTER  Energy: To quote from Mike Flynne’s book “Infinity In Your Pocket” page 68;   Energy is a controversial topic among scientists. Everyone knows what energy does but no one seems to be certain what it is. Essentially there are two models used to describe the nature and behaviour of energy; the transformation model and the transference model.  Rather than rely upon two contradictory theoretical models, we will be relying upon knowledge which is commonly available, and make use of this to take a step by step approach toward understanding energy and matter.  Oxford English Dictionary (Abrv, OED)  OED: Energy: The capacity of matter or radiation to do work: The means of doing work by utilising matter or radiation.  OED: Matter, a physical substance in general as distinct from *mind and spirit*.    All things throughout the universe are made up of two primal things, physical matter and non-physical energy.  As such, matter could not do any work or exist without energy and energy could not do any work or exist without matter.  Physics: There must be an input of energy for there to be an output of energy.   The use of the words input and output determines that there is a vehicle of matter between the energy input and the energy output, and denotes as all matter is made up of particles, that particles of matter are intermediary transit vehicles of energy.  OED: Gravitation: A force of attraction between any particle of matter in the universe and any other”.     It is the input of energy into particles of matter that serves to fuel their motions and to supply their outputs of radiation to do work, and to attract and gravitate toward one and any other particle of matter in the universe.     Quantum Energy And Matter   Every particle of matter of every celestial body throughout the universe requires an immediate and constant input of energy to fuel its motions and its outputs of radiant energy.    All celestial bodies are isolated within their immediate surrounding region of interstellar space, and as they, and all of the particles of matter that go into the makeup of their structures require an immediate and constant input of energy to fuel their motions and supply their outputs of radiation.    So it follows that it is their immediate surrounding region of interstellar space, which is supplying all of their structures energy requirements, and the energy requirements of every particle of matter that goes into their structures makeup.   And as such, this means that the energy incoming from their immediate surrounding region of interstellar space, is all-pervading as it fuels every single particle of their structures, and those of their centres of gravity.   Further confirmation that interstellar space is universally comprised of quantum (invisible) energy and quantum particles of matter.    Physics: For every action there is an equal and opposite reaction.   Space vehicles use of jet propulsion to travel through outer and interstellar space, however, propulsion could not take place without the presence of matter; because propulsion is reliant upon there being some form resistance present, for the propulsive factor to be converted into the power of thrust.   Sum   Universal (Interstellar) space is comprised of invisible quantum energy and invisible quantum particles of matter.  Universal quantum energy is the substance that fuels the motions of every particle of matter in the universe, and acts between any particle of matter and any other in the universe.   Energy is not matter (m)    Matter is not energy (e).    Energy does not equal mass,    Matter does equal mass.   Quantity of Energy + Matter combined, determines the power of their attractant force of gravitation, and their speed of acceleration relative to the same criteria in regard to another quantity of energy + matter combined (bodies and particles of matter)       OED: Matter, a physical substance in general as distinct from *mind and spirit*.  Energy is not physical in nature, therefore it is Metaphysical in nature.  Energy is not physical in nature, therefore it cannot be Any---Thing physical whatsoever.  Energy is not Any---Thing physical whatsoever, therefore energy exists universally in a permanent state of being No-Thing physical or visible.   Sum: The Universe is made up of some-thing called matter, and nothing called energy. The synopses of Centripetal & Centrifugal Force – Inertia - Orbital Mechanics of Celestial Bodies – Magnetism - Gravity is continued as a reply to this comment   www.fromthecircletothesphere.net", "votes": "1", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugy5SWVoIhwciy-j6id4AaABAg", "comment": "RESPECT", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugy6EoLX_LsZ0fXEHMl4AaABAg", "comment": "This makes a lot of sense to me. I got a clear picture when she explained the graph of KE vs Frequency", "votes": "8", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugzh4uf-Mpa4pqncdox4AaABAg", "comment": "Thanks a ton Prof. Drennan & MIT, these lectures are really helpful for my high school chemistry back here in India, and yes I promise 23:04", "votes": "23", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugw_EHnatsS5X24N_w54AaABAg", "comment": "This lecture is a great supplement to my courses at community college.", "votes": "1", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwnbcCiCBrL0poEe3t4AaABAg", "comment": "instead of ROY G BIV, we can memorize VIBGYOR!!!!!!!!!!!!!!!!!", "votes": "4", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugz2-qiAgNVvCJm1nFt4AaABAg", "comment": "wow...you just gotta know this...this is in line with scripture...Bible makes claims and statements about Bible and bibles....pure Bible vs.perverted Bibles...light and darkness....spirit and truth....father and son...and all kinds of proclamations of truth...", "votes": "0", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzsmKlRmTRloHEXlJN4AaABAg", "comment": "OMG I would have so answered that question....!! I want want want that Lego DX", "votes": "4", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwNKf96px5sN92oYLh4AaABAg", "comment": "12:56 The asian girl sleeping", "votes": "6", "replies": "3", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgzXzeQUWtgrc2NwFJF4AaABAg", "comment": "Omg. These are good. You don’t just throw equations, but explain where they come from and why they make sense in a simple manner.", "votes": "83", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyZKVIL0WDQoRo7FxR4AaABAg", "comment": "It seems the most obvious & logical explanation for a #particle acting like an #AxialWave when moving thru space is that it's orbiting something (a dark matter particle perhaps) or visa versa.  It's not unlike Earth being pulled into a wobble by the moon, or a distant star's wobble evidencing planet orbits making our trajectory as we fly thru space have an axial wave (packet) as well.  And since we think we know undetectable dark matter exists but don't yet know where it's distributed, this seems the most logical possibility.  What do you think?  This could explain the double slit experiment results, including with a detector with some interaction between the dark matter and the detector.", "votes": "1", "replies": "3", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgylLhUHHzIvfWNJ0CB4AaABAg.9-HrtNeIX3Z9fM8z0jzLzi", "comment": "Planck constant(h) ×treshold frequency of the metal(v0)", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz1bJf6paT8WR--GFJ4AaABAg.8ynElDIE_hB97SIz_-q9Mk", "comment": "Oo the classic, I LEARNED THIS AT GRADE .....", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz1bJf6paT8WR--GFJ4AaABAg.8ynElDIE_hB99RkmFOH1Yf", "comment": "Im sure everyone did lol", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz1bJf6paT8WR--GFJ4AaABAg.8ynElDIE_hB9BqEyp6E9iK", "comment": "I skipped ten grades.  I basically learnt in the womb.  No, I learnt it as a sex gamete.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz1bJf6paT8WR--GFJ4AaABAg.8ynElDIE_hB9hkpFMGxX1X", "comment": "😨😨😨😨😨scary", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugz1bJf6paT8WR--GFJ4AaABAg.8ynElDIE_hB9hkpt6DWl4K", "comment": " @frank-ek4cy  dude, I am not american so pipe down. We actually learn things in school in the rest of the world instead of having gun violence", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9Bw6TKFKXEP", "comment": "Considering your name, you are probably an Arab, and so am I. Here in Algeria we have the worst educational system you can think of.", "votes": "4", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9C3bxsX7kEq", "comment": "Shinobi San here in America we have an “educational system” but it’s no good.", "votes": "6", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9C3rS8ZpprG", "comment": " @jaykay2218  Compared to ours. Yours is good.", "votes": "3", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9C5pqU-lM-V", "comment": " @jaykay2218  It all depends on the teacher. Physics is the same everywhere, but when I wrote that comment, I was comparing the professor to my high-school physics teacher. My teacher only knew what it takes to solve a problem and that's what he only cared about. But this professor was much much more knowledgeable and that was visible in her teaching. I know that not all teachers in the US are like that, but at least you can find them somewhere. But here, they're very very rare", "votes": "8", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9HPIyuDmc08", "comment": "I am South African. I fully agree with you!!!! My country has been ranked last in the world in 2020 in science education.. Do the math.. (Most in my country cant...)", "votes": "3", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9Q42N2iCjlt", "comment": "It's crazy how that works. If I received this kind of education, I would have thrived - the way they explain everything from the ground up is exactly how they should lecture the sciences everywhere. Everywhere else they kinda just assume since you're not an MIT student, you must not be capable of deeper understanding, so you should just accept law's of nature at face value.", "votes": "3", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_9Ug8F784-KO", "comment": "What I studied was harder to me, this is technically harder than the material I took yet more clear and understandable", "votes": "1", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzeGgkFdDWYUogenSN4AaABAg.8rCKpqCDnu_A4_ra2Z8R8w", "comment": "And exactly why MIT is the best for engineering", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugzdut6wEhb3AhIgWuJ4AaABAg.8llGsGxPTHH8llH6Pe2vyy", "comment": "29/09/2018: Synopses: Centripetal Energy - Centrifugal Force & Inertia – Orbital Mechanics of Celestial Bodies – Magnetism & Electrical Production – Gravity. Synopsis: CENTRIPETAL ENERGY  OED: Centripetal Force moving or tending to move towards a centre (cf centrifugal) the force acting on a body causing it to move around a centre.   All particles, bodies, celestial bodies, and galaxies are made of matter and all rotate around their centres of gravitation, and all particles, bodies, celestial bodies, and galaxies receive an input of quantum energy and quantum particles from their immediate surrounding space.    So-called centripetal force is not a force it is an input of quantum energy and quantum particles of matter that is caused by the 360 degrees of rotational force that is being exerted from the centre of gravity of a rotating body.  E.G. The hammer of a hammer thrower, the faster the rotation of the hammer and chain around the centre of gravity of the hammer thrower, the greater is the input of quantum energy and the subsequent output of centrifugal force (Refer also to later section titled Magnetism and Electrical Production).  All particles and bodies of matter receive a centripetal input of quantum energy from their surrounding space, and generate a power of centrifugal force from their centres of gravity.    The greater the quantity of quantum energy input, the greater is the concentration of energy and quantum particles at a centre of gravity, and its subsequent output of centrifugal force.    Synopsis: CENTRIFUGAL - GYROSCOPIC FORCE  OED: Centrifugal force an apparent force that acts on a body moving about a centre.  OED: Centrifugal moving or tending to move away from a centre. A gyroscope without an input of rotational force to its disc will do nothing.   A gyroscope given an input of rotational force to its disc will stand fixed on its axis without any visible means of support.   A gyroscope given an input of rotational force to its disc will inertially resist being moved from its centrifugally imposed fixed site of rotation.     Mechanics   When a force of rotation is applied to the disc of a gyroscope and stood on end, the rotation of the disc prevents the *inward coming * and downward travelling quantum energy and quantum particles of matter (gravitons) from passing down through the disc, and on toward the Earth’s magnetic core of gravity.  Given a continuous rotation to the disc, the input of quantum energy and quantum particles of matter, continue to build up within the centres of gravity of the atoms of the rotating disc.    The build-up of quantum energy within the disc is excessive to the normal energy requirements of the nucleons of the atoms of the disc, which causes the nucleons of the atoms to spin faster, and as a result the excess build-up of energy within the atoms is being continuously and centrifugally from the atoms throughout the disc.   Simultaneous with this process, the structures of atoms of the disc and their outputs of quantum energy and quantum particles are also being subjected to the power of centrifugal force, as they orbit around the central axis of the gyroscope (think in terms of a hammer-thrower) at high speed.   And the result of this secondary centrifugal force, the outputs of energy from the rotating nucleons of atoms of the disc are progressively passed on in a spiralling motion from one atom to another;  and outward, toward, and out from the rotating edge of the disc in the form of spiralling waves of quantum energy and quantum particles of matter.  This output of energy and spiralling quantum particles around and the edge of the rotating disc, In effect then serves to enlarge the size and area of the disc, as the quantum energy and of quantum particles of matter form an invisible halo of spiralling quantum particle waves around the edge of the rotating disc.    Given this scenario, and thinking in terms of the balancing act of a common seesaw, and that the halo of spiralling quantum particle waves are interacting with the down ward acting force of gravity.    So it is that this halo of quantum spiralling particle waves, in effect becomes a rim of gravitational leverage and balance around the edge of the gyroscopes disc.   As such: As the downward acting force of gravity is universally spread evenly over all surface areas, it is this levelling factor that serves to impose a level of balance to both the gyroscopes disc and its rim of gravitational leverage.    And hence as the disc of the gyroscope is forced to stay level, the body and the axis of the gyroscope are forced to stay vertical.  Synopsis: ORBITAL MECHANICS OF CELESTIAL BODIES  Reiteration   Universal (Interstellar) space is comprised of invisible quantum energy and invisible quantum particles of matter.  Universal quantum energy is the substance that fuels the motions of every particle of matter in the universe, and acts between any particle of matter and any other in the universe.  The Sun and star of our own solar system, is constantly drawing in quantum energy and quantum particles of matter from its surrounding interstellar space, and it is this input of energy and quantum particles of matter that serves to fuel its rotation, its nuclear reactions, and its centrifugal and gravitational imposed inertial position within the quantum energy and quantum particle medium of interstellar space.   Perhaps more simply put the emitted centrifugal energy and spiralling waves of electro-magnetized quantum particles of matter that are being emitted from the rotational equator of the Earth’s sphere, coalesce together to form two hemispheres of gravitational magnetism which are interactive with the surrounding interstellar medium of quantum energy and quantum particles of matter.    And it is this interaction of the emitted spiralling waves of electro-magnetized quantum particles of matter, spread over the 45, 656000 degree surface of the Earths sphere, with the surrounding medium of interstellar space, that serves to keep the Earth’s sphere inertially positioned and fixed within interstellar space.   THE PLANETS   Due to its great size and its great density of energy and matter, the Sun is able to exert a tremendous amount of centrifugal force and gravitational attraction towards its orbiting planets.    And it is this combination of outwardly exerted centrifugal force and counter inwardly attractant gravitational force (As with the nature of hammer-throwing) that enables it to simultaneously repel, restrain and maintain the orbital distances between its own centre of gravity and the centres of gravity of its surrounding planets.   However, due to it being a seething mass of volatile and fluctuating nuclear reactions and explosions, the Sun is not able to impose stable lateral trajectories of orbit for the planets orbiting around its volatile mass    And this where centrifugal force and its counter force gravitation once again comes into play, because as all of the planets are undergoing rotation around their own centres of gravity, so it is that they are able to inertially stabilize their lateral trajectories of orbit around the Sun.       And the distances between their centres of gravity, and the centres of gravity of their own orbiting moons and satellite bodies (Saturn being a prime example).  www.fromthecircletothesphere.net  Synopsis of Magnetism is continued as a reply to this comment", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugzdut6wEhb3AhIgWuJ4AaABAg.8llGsGxPTHH8llHB4TUOjY", "comment": "29/09/2018: SYNOPSIS MAGNETISM & ELECTRICAL PRODUCTIONl                                               Given two common bar magnets, if we try to bring two identical polarities together they will repel one another and refuse to meet.   If we try to bring two opposite polarities together they will attract pull together and are difficult to pull apart.   Nothing visible can be seen acting between the magnets; however as we live in this age of the sciences, we are aware that there is an electromagnetic spectrum of energy that lies below the level of our visual reception.   And given that there is no other agent that could serve to explain this invisible phenomenon, it can only be that of the electromagnetic energy existing below our level of our visual reception, that is acting between the two magnets.   Simplistically speaking, if we had two people at a distance apart and we wanted them to pull together we would have to give them a rope, and if we wanted them to push each other away to keep them apart, we would give them a solid pole.   However, if these two people were undernourished and near to starving, neither of these actions could take place, as they would not have enough energy to achieve either result, as there has to an energy intake for there to be an output of energetic activity.   As such, we have two magnets which we know have an input and an output of energy of electromagnetic spectrum, but unlike two people, who would need a solid rope or pole to pull together or to push away; all magnets exert their own electromagnetic force of energy output which will interact with any other magnets electromagnetic force of output.   Therefore we are left with the mechanistic puzzle, as to how two outputs of electromagnetic energy are able to interact in such a way as to achieve two different results.   Clues   Academic: We are told by physicists that the energy of electromagnetic spectrum travels in waves.   Experience: When we take two magnets and try to push them together several times, what we sense and experience is a sense of bounciness - springiness acting in between the two magnets (Please note, this is how magnetic suspension works in vehicles).     As such we have two pieces of information, a. Academic: The energy output is in the form of electromagnetic waves. B. Practical: The energy output is bouncy and springy in nature.   And based upon our own experiences in the practical world, we know that waves are not bouncy or springy, and they are not a force, they just go up and down as a result of what is happening with the forces above or below them.   Therefore the so-called waves cannot be waves because waves cannot exert a force of bounciness and springiness, as bounciness can only result from the springiness exerted by springs and coils.   As such, the electromagnetic energy of the electromagnetic spectrum that is being emitted from magnets is not in the form of waves; it is in the form of coils, which are the only mechanistic form that can exert a force and a sense of bounciness acting between two objects or two magnets.   Given this additional factor, it now becomes clear as to how the magnets are able to both attract and repulse one another.   When two identical poles of magnets are opposed to one another, then as with the nature of two common springs turning anti-clockwise to each other, their electromagnetic coils cannot intertwine and retract toward each other and come together to form a single double helix coil.   When two opposite poles of magnets are opposed to one another, then as with the nature of two common springs, turning clockwise to each other, the electromagnetic coils of the two magnets intertwine and retract toward each other.   And as the electromagnetic coils emitted from the magnets retract and come together and form a multiple number of double helix coils, so do the two magnets retract and come together to form the single body of a larger magnet.                            Magnetic Bodies & Electricity Production  The planet Earth is a bipolar magnetic body rotating around its magnetic core/centre of gravity at a speed of 1,000 miles per hour.   The Earth’s continuous rotation and input of quantum energy and quantum particles of matter, enables its magnetic core to convert the quantum particles of matter into bipolar particles of electro-magnetism, and form them into the spiralling electro-magnetic wavelengths of gravitation, which go into the makeup of its surrounding magnetosphere.   Essentially and mechanistically speaking, this scenario is the same as that of a common permanent magnet which we use to produce electrical current.  To produce electricity we surround a magnets magnetic field with a conductive coil, and then rapidly rotate the magnet to increase the input and output of quantum energy and quantum particles of matter.    Within the atoms of the magnet the quantum particles of matter are combined into bipolar electromagnetic particles of matter, which are then formed into the spiralling electromagnetic wavelengths which go into the makeup of the magnets surrounding magnetic field (mini-magnetosphere).   Due to the rotation of the magnet and hence its magnetic field the electro-magnetized particles of quantum matter are captured and build up within the length of the conductive coil.    Where given their continuous input due to the continuous rotation of the magnet they are forced to combine and flow along the length of the conductive coil in the form of what we call electrical current.   And hypothetically speaking regarding the Earth’s magnetic field relative to the magnetic field of a permanent magnet: If we could shrink the Earth down to the size of a common permanent magnet, and then place it within a conductive coil, the Earth would produce an electrical current within that conductive coil.   Note: Or orbiting satellite’s serving the same purpose, and microwave technology to convert the electrical current into microwave energy to be transmitted down for re-conversion into common electrical power.     SYNOPSIS Gravity  Given that we have shown that it is an input of quantum energy and quantum particles of matter into the centre of gravity of the Earth's magnetic core, and the centre’s of gravity of permanent magnets, that serve to create their magnetic fields.   And that it is quantum energy and quantum particles of matter that serves to create the gravitational attractions between all particles of matter in the universe, so it is that we can say that it is quantum energy and quantum particles of matter, that serve to create the force of gravity.  www.fromthecircletothesphere.net", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugzh4uf-Mpa4pqncdox4AaABAg.8k5xgX0cdT48wkSam2xfJ2", "comment": "ikr kaysons lessons got nothing over this", "votes": "1", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgwNKf96px5sN92oYLh4AaABAg.8am8r9xy_Hw8tE7Rv2euNZ", "comment": "where was that Asian girl? In first bench, she was searching for something in her bag. Not sleeping.", "votes": "2", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgwNKf96px5sN92oYLh4AaABAg.8am8r9xy_Hw9Bnp16oFTrG", "comment": " @nahidparvez9010  row 2 on the right side of the asian boy. but I reckon that this may be too simple for her so she got bored as it's actually taught in high school", "votes": "1", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgwNKf96px5sN92oYLh4AaABAg.8am8r9xy_Hw9KobrQmQdTh", "comment": "She wasn't sleeping. You can see her eyes open and she is wide awake a moment before.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzXzeQUWtgrc2NwFJF4AaABAg.8acCG_aGlys9X6eiQoZt3K", "comment": "Lies again? Hello Whatsapp", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgzXzeQUWtgrc2NwFJF4AaABAg.8acCG_aGlys9itSiZOuFA2", "comment": " @NazriB  hello hello lies again!!!", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgyZKVIL0WDQoRo7FxR4AaABAg.8YmMfwQmcE88ZCnhrPtOIg", "comment": "sanjuansteve I would HIGHLY doubt that's the case", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgyZKVIL0WDQoRo7FxR4AaABAg.8YmMfwQmcE88ZDOGRvGuft", "comment": "Which particle physics or QM theory do you believe best explains the universe?", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgyZKVIL0WDQoRo7FxR4AaABAg.8YmMfwQmcE88kHr_KJujEr", "comment": "i think if we can see spectrum of an atom then we can assume its change it orbital via force.", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugxp6vnVEXq-QpZBoI14AaABAg", "comment": "I don't see the point of the clickers, it just seems like a time padder", "votes": "2", "replies": "2", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgwMBvncXX4ta0OrKBh4AaABAg", "comment": "This lectures are really good!! Thank you!!!", "votes": "30", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgxiczrB-2lybypT0YR4AaABAg", "comment": "Mais uma aula fantástica.", "votes": "5", "replies": "", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugw7LAmz7QxwxIA5M0p4AaABAg", "comment": "I'm Dutch, but this lecture is easy stuff for people how got electronics education  This glass is very simple", "votes": "1", "replies": "4", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "UgyxhM2K-jTlcGcuqVp4AaABAg", "comment": "It looks like 1 or 2 % of the people with clickers attending an MIT lecture are stupid.", "votes": "3", "replies": "1", "reply": false}, {"vid": "_U6YamvF7BE", "cid": "Ugxp6vnVEXq-QpZBoI14AaABAg.8YlmCDdDy_S8YmiEuLrs3F", "comment": "It gives an instructor realtime feedback on how their lesson is going. She is able to see where there is confusion on a particular subject and cover it more. Here's an educator video on it: https://www.youtube.com/v/VXeTfT8JL0Q", "votes": "9", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugxp6vnVEXq-QpZBoI14AaABAg.8YlmCDdDy_S8eE8uDn_XfQ", "comment": "@mit They're an excellent idea!", "votes": "1", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugw7LAmz7QxwxIA5M0p4AaABAg.8W-tr0w7zGa8ac1533MuQx", "comment": "Henk ten Dolle  What?", "votes": "3", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugw7LAmz7QxwxIA5M0p4AaABAg.8W-tr0w7zGa8sdd6h4YZOF", "comment": "completely agree with you I find this quite easy.", "votes": "2", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugw7LAmz7QxwxIA5M0p4AaABAg.8W-tr0w7zGa8vsbyLkRxUJ", "comment": "Hello dutch", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "Ugw7LAmz7QxwxIA5M0p4AaABAg.8W-tr0w7zGa9KYR-nFLDt1", "comment": "I know for European people this stuff is very easy. This is America education is very easy and all get As", "votes": "0", "replies": "", "reply": true}, {"vid": "_U6YamvF7BE", "cid": "UgyxhM2K-jTlcGcuqVp4AaABAg.8W-YzG9jTsZ8XPMzqG7vw6", "comment": "Nehmo Sergheyev could be that those are book smart, knows the formulas and stuff but don't understand how to visualise these formulas in real life.", "votes": "4", "replies": "", "reply": true}]