[{"vid": "a7oj0REQzpE", "cid": "UgwqqtrOW7MaMUTWNUB4AaABAg", "comment": "Final Exams and Video Playlists:        https://www.video-tutor.net/\r Full-Length Math & Science Videos:   https://www.patreon.com/mathsciencetutor/collections", "votes": "1", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgwoUPqhmaWtpUJ4Rxp4AaABAg", "comment": "by using vi formula for power in the last question,i ma not getting the answer..why do we use i square r formula", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "Ugw_JhuV83bWaKeGtU54AaABAg", "comment": "Amazing teaching style ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "Ugw9HGYp8YQDmWmCPPZ4AaABAg", "comment": "@The Organic Chemistry tutor,I need help with fault calculation in power system", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgzsUFRF49C2KKVujqN4AaABAg", "comment": "Elegant explantation. Thanks a lot", "votes": "2", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgykAX9rXa736FenKpx4AaABAg", "comment": "Et=Eg+ Ia+Ra Line voltage=CEMF+Armature current x internal resistance.", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgxepxeDZLFpNWLpjGZ4AaABAg", "comment": "Back EMF is easy to measure on bare wires with no incoming voltage, just by spinning the rotor and measuring voltage. So, if one connects a 12V battery to a DC motor, and the motor spins up to produce retrograde voltage, what would a voltmeter now measure across the motor? Would you still measure 12V, because anything more would be absorbed by the battery, or would you measure a rippling voltage of more than 12V because the back EMF is adding to the voltage on the incoming side of the motor?", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgxMK-oS4e0VmLrowSd4AaABAg", "comment": "I don't understand why you chose the power formula you did for Number 4 part D.", "votes": "0", "replies": "1", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgzJp8h1LRXg7syk1x94AaABAg", "comment": "there is no word  to describe this man !", "votes": "4", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgwUsh1khdEtUZhkT454AaABAg", "comment": "Understood man,i appriciate coz am doing electricity and magnetism and this is one of the topic we are doing.🙏🙏.From university of Nairobi Kenya.", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgwoXSwgIc9-xKXupE54AaABAg", "comment": "Thanks for the explanation", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgxAtuYYaZ0lhcKXBGp4AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgzvN-k8Z1i4Ee0uoLB4AaABAg", "comment": "A description of load torque always accompanies a discussion on motors. The effect of its imposition on motor torque, and how this causes the motor to draw power from the power supply then follows. The phenomenon of how it is the ‘back emf’ in motors, which regulates the motor torque to match load torque completes the discussion. To understand these ideas, it would be instructive to understand Current, the conduction process and Voltage at the fundamental level. Electrostatics and circuits belong to one science not two as in the following two videos: i. https://youtu.be/REsWdd76qxc and  ii. https://youtu.be/8BQM_xw2Rfo   The \"back emf\" is a trick nature uses which has a regulating effect in determining the amount of current the motor draws and is a natural consequence of the induced emf process when a conductor moves in a magnetic field.  The governing relation for current in conductors is J = σE_net. The back emf is the \"motional emf\" produced when a conductor moves in a magnetic field. It is not possible in this post to discuss in more detail the process of production of the back emf and its regulating effect on motor torque. The last frame References in video #1  lists textbooks 3 and 4 which discuss these topics in more detail using a unified approach and provide an intuitive understanding of the generation of an emf in generators and motors.", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "Ugx9X82qt6saZAobdeF4AaABAg", "comment": "Difference between Back EMF and Backfeeding?", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgwB1BXXxk5OqGzeACp4AaABAg", "comment": "very good fundamental question for understanding BEMF calc, thank you very much. Is it the same for PMSM motor as well?", "votes": "2", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgwoorNIZjTEdly3-Bx4AaABAg", "comment": "you want to move the text down by 2cm , the title is blocking the text when in full screen.", "votes": "1", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgwNA9BAYQ-9sqAjFBx4AaABAg", "comment": "The age old question is - why is that CEMF B-emf counter MMF not also added to the total energy lost from the equation...?!  Remember any electrical and magnetic energy is said to absolutely come for the energy input, we wouldn’t want to violate any of those special laws would we...   So after we calculate the work - motor’s output and we have taken into account the electric energy input, then the remaining energy not converted to motor output is the core and copper losses   THIS HAS NEVER INCLUDED CEMF which is always been described as  ‘the  generator effect’ as a result of Friday’s law of induction, & Maxwell-Faraday law, in maxwells equations    Remember the generator effect can’t come from NO WHERE we are told that energy can’t be created anywhere in the universe  so we have a problem the CEMF is not put into the equation from I/O  In motor data sheet why is this subject not  found in the losses table? along with - copper losses, core losses, bearing losses Eddy losses, hys losses, stray losses... The CEMF is used on data sheets only as you have - to find the running RPM - loaded and unloaded.  Please respond ))   See link below for full equation  https://www.sciencedirect.com/topics/engineering/motor-efficiency   This has been talked about for hundreds of years in alternative energy groups it’s not a new problem, but the fact remains the generator effect (breaking toque) in a electric motor is not accounted for as a loss, yet lol.., the motor is moving backwards and induction is happening. So therefore as many have said this is how a system can be actually measured over unity - over 100% for I/O when it is included  After all it didn’t come from nowhere, if it came from the input (which it did) it must be measured on the output!", "votes": "2", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgzGuJFLzfyMcIOwBtt4AaABAg", "comment": "Guys   for No.2 mine was 8.4V, what happened there?", "votes": "0", "replies": "", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "Ugxf2Mf-ITCXJyZpxSR4AaABAg", "comment": "How can I protect my DC source from Back EMF effect? What kind of circuit should I use and where should I put the components in the circuit?", "votes": "1", "replies": "3", "reply": false}, {"vid": "a7oj0REQzpE", "cid": "UgxMK-oS4e0VmLrowSd4AaABAg.9dfaS6oXzxd9sEB3id18ev", "comment": "Cause that's one of the formulas for electrical power? He already had resistance and current, so using that formula was the fastest solution.", "votes": "0", "replies": "", "reply": true}, {"vid": "a7oj0REQzpE", "cid": "Ugxf2Mf-ITCXJyZpxSR4AaABAg.8wnpGdUU9Vv8x7X-BTCyhT", "comment": "put reverse biased diode", "votes": "4", "replies": "", "reply": true}, {"vid": "a7oj0REQzpE", "cid": "Ugxf2Mf-ITCXJyZpxSR4AaABAg.8wnpGdUU9Vv8x7a--bv-1j", "comment": " @majidmehmood3780  Can I use the same protection for BLDC motor application?", "votes": "1", "replies": "", "reply": true}, {"vid": "a7oj0REQzpE", "cid": "Ugxf2Mf-ITCXJyZpxSR4AaABAg.8wnpGdUU9Vv9ITmCBsqDOw", "comment": "Capture in caps and re-use the energy 😄 they won’t teach you that at school", "votes": "1", "replies": "", "reply": true}]