[{"vid": "AD8D8pAv-8E", "cid": "Ugy0b32xAhGuEL6zwSF4AaABAg", "comment": "Hello, Could you please share the power points. I love the detailed information of every concept and the way to articulate is phenomenal. If you could share your power points that would be great", "votes": "1", "replies": "1", "reply": false}, {"vid": "AD8D8pAv-8E", "cid": "Ugzw5XpOeLN9RPz57Ld4AaABAg", "comment": "14:32 Ma’am I love your lessons, just a little potential mistake that I spotted here. Cholesterol doesn’t affects the fluidity of the cell membrane, it only decreases the permeability to small polar molecules like water, permeability≠fluidity. Cholesterols can actually help maintain the fluidity when temperature drops down, it keeps phase transition at bay. That’s what I’ve read from the book “Molecular biology of the cell, Alberts”", "votes": "0", "replies": "1", "reply": false}, {"vid": "AD8D8pAv-8E", "cid": "Ugwj7Y1gnKSvHKel8KB4AaABAg", "comment": "Concept making tutorial Mam.keep going Mam.Mam please Make lecture series for the Biochemistry and Molecular Biology Section. Mam can you please share the PowerPoint presentation?It will be very helpful if you share this.", "votes": "3", "replies": "3", "reply": false}, {"vid": "AD8D8pAv-8E", "cid": "Ugz6CYYjD_z4l2H8hap4AaABAg", "comment": "tnx keep going", "votes": "1", "replies": "", "reply": false}, {"vid": "AD8D8pAv-8E", "cid": "Ugy0b32xAhGuEL6zwSF4AaABAg.A7s6aV7EW3GA8BNkly_Nc1", "comment": "The pdfs of ppts are available in the description of the playlist for MoCell lectures", "votes": "0", "replies": "", "reply": true}, {"vid": "AD8D8pAv-8E", "cid": "Ugzw5XpOeLN9RPz57Ld4AaABAg.A78GgD8AP9MA7AgFSWAZR9", "comment": "Hi. Thank you for your comment and question. Actually, Cholesterol content in the membrane is extremely important in regulating the fluidity of the plasma membrane, especially with temperature changes. At High Temperatures: Cholesterol tends to stabilize the membrane by making it less fluid. It restricts the movement of phospholipids, which can prevent the membrane from becoming too permeable or leaky. At Low Temperatures: Cholesterol helps to prevent the membrane from becoming too rigid by preventing the phospholipids from packing too closely together. This ensures that the membrane remains somewhat fluid, which is essential for proper cell function and for maintaining membrane proteins’ mobility and function.", "votes": "1", "replies": "", "reply": true}, {"vid": "AD8D8pAv-8E", "cid": "Ugwj7Y1gnKSvHKel8KB4AaABAg.9YaPk1IqlNP9YjHumh8OzN", "comment": "Will upload soon", "votes": "1", "replies": "", "reply": true}, {"vid": "AD8D8pAv-8E", "cid": "Ugwj7Y1gnKSvHKel8KB4AaABAg.9YaPk1IqlNP9Yjd51GPW9h", "comment": " @biologybasics  Thank you Mam.", "votes": "0", "replies": "", "reply": true}, {"vid": "AD8D8pAv-8E", "cid": "Ugwj7Y1gnKSvHKel8KB4AaABAg.9YaPk1IqlNP9xDQKWLA_0k", "comment": "Is this unit 11?", "votes": "0", "replies": "", "reply": true}]