[{"vid": "AKrK2RWdgg4", "cid": "UgyPecXBeNoAlAsz_1N4AaABAg", "comment": "Walker Kenneth Lewis Sarah Hernandez Lisa", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgytmUS61U_aig3uncx4AaABAg", "comment": "Feeling bad for Avery!", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgyxpdDimwGqHcqMSdl4AaABAg", "comment": "Thank you 🙏🏻", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgzAUiwGHwWNd7jpw9J4AaABAg", "comment": "Great lectures:  Why DNA transfered the infection although  protein and other biomolecules having molecular structures but only DNA molecules transfer the information/ infection in mice.....?", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgzD9sDW37jRSymGn7t4AaABAg", "comment": "Which textbook do you use?", "votes": "0", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgxdQoDhwnHCOiDRnVp4AaABAg", "comment": "which book is he refering to ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "Ugx9MX_Yq9r3zrdT56p4AaABAg", "comment": "Would you be able to tell me the textbook that corresponds to these great lectures?", "votes": "0", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "Ugy2WXRwa25DyqNjmQR4AaABAg", "comment": "@38:29: the last statement says \"Avery first showed....\" It should be Griffith (Frederick; 1928). first showed.....Avery, MacLeod and McCarty repeated Griffith's experiment (along with few additional experiments) and discussed in a better way.", "votes": "0", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgxFUDQ4ahNorFTTD4F4AaABAg", "comment": "Hey, professor Mennella what text bk are you using here?", "votes": "2", "replies": "3", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgyPAVJjb9OTFwdm6vt4AaABAg", "comment": "Hi Dr. Mennella.  Your presentation is well organized and very easy to follow.  Particularly the DNA molecules in your presentation were well explained structurally and functionally. In addition, the Avery experiment is very compelling. I agree that Avery should have been recognized and won the Nobel Price for his discovery.  I have not read the grand details of Avery's experiment yet. Correct me if I am wrong. Based on what the diagram shown in your presentation, it appears that the isolated DNA from dead virulent S-strain incorporating with the avirulent R-strain to lead to the change of gene expression of avirulent R-strain which is transformed to a virulent strain. Is it a reasonable hypothesis?  I also wonder if there were enzymes like reverse transcriptase and integrase as cofactors to reverse transcribe the virulent DNA into the DNA of R strain? Thanks for your great presentation.", "votes": "1", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgxNneS_zBn5btBuwUV4AaABAg", "comment": "Thank you so much for your videso! I really save my lives ;)))))) THANK YOU SO SO MUCH!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "Ugy-sOR_I36ZlhGijjx4AaABAg", "comment": "Hello dear sir may I ask where the other chapters of this book, I really enjoy your explanations on that", "votes": "1", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgyhIS21Jje0CE_7guF4AaABAg", "comment": "Why they thought the transforming material should be the genetic material ? like dna could be the transforming material but still not the genetic material ? I don't  know i have put the question in right way or not", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgyqPeIlShzuTKRu5Up4AaABAg", "comment": "exeptionally very nice presentation. soo helpful to me", "votes": "1", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgxP4X1Fne4fRU0BNT54AaABAg", "comment": "So cool that even though you posted this video  about 5 years ago, you still reply to comments dear sir! Thank you very much for posting this lecture online for all students or interested viewers to listen and study. I am a BS Biology student taking up Cell and Molecular Biology right now, and this definitely helps clarify things!", "votes": "3", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgwERNIGlq1tcswOswl4AaABAg", "comment": "26:50 I don't fully understand this yet. why doesn't e.g. thymine make two hydrogen bonds with cytosine and mess up replication/transcription? Is it because the sugar/phosphate backbone would not line up and therefore make the bonds easy to break?", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgyQQy1yqCn6SzPUDWF4AaABAg", "comment": "Which book you covered prof.", "votes": "0", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "Ugxs7fHMOGV9eUQGNCJ4AaABAg", "comment": "Thank you for the clear presentations! What book/reference did you use for these lectures? Thank you!", "votes": "1", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgzHhSLJykmH0dAyZaV4AaABAg", "comment": "Thank you sir. Your videos are very interesting and easy to understand.  Sir... please make videos on RDT also.", "votes": "1", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "Ugzab3CZwh6YCx35Iy54AaABAg", "comment": "dear thomas manella your lectures are briliant and i have enjoyed every single one of them from your genetics to your biochemistry lectures  they have made me understand medicine in these courses i wish you would do immunology and i have no doubt they would be briliant aswell, am currently watching and taking my notes in molecular cell biology which is great  and i can tell you must be a wonderful person seeing you have beautiful family. thank you so much and God bless you sir may you live long enough to keep up the amazing work.", "votes": "3", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgzD9sDW37jRSymGn7t4AaABAg.9lrCs9U8QqX9lxPVdrQWzU", "comment": "For this course: Alberts, et al - Essential Cell Biology", "votes": "1", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "UgxdQoDhwnHCOiDRnVp4AaABAg.9kpP2sY_8Ih9lBEmCHxiSB", "comment": "Albert's essential cell biology", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "Ugx9MX_Yq9r3zrdT56p4AaABAg.9inTJgTkPDl9iq1noW7cw7", "comment": "Sure Silicon. This course is built upon Alberts et al’s Essential Cell Biology. Thanks for the kind words!", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "Ugy2WXRwa25DyqNjmQR4AaABAg.9dKjjXdZKel9dpZ8HDBAhm", "comment": "It’s a fair point, Learn. Griffith proved that “something” could transmit information - and therefore traits - between cells but there was already some empirical evidence of that being possible and a shift occurring in biology that inheritance was somehow chemical. It was Avery and his group that confirmed Griffith’s work and took it to the next necessary level to prove that DNA was the information storing (and heritable) material of life. So, while I agree that not mentioning Griffith was an omission (to save time and simplicity), I still contend that if not for Avery, I wouldn’t have a job 😉 Thanks got an excellent contribution to the conversation and for your interest in my videos!", "votes": "1", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "UgxFUDQ4ahNorFTTD4F4AaABAg.9cAQVVBCf-E9cIupasuho8", "comment": "For this course in cell and molecular biology, I use Alberts’ Essential Cell Biology", "votes": "4", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "UgxFUDQ4ahNorFTTD4F4AaABAg.9cAQVVBCf-E9hSTeNQ0paT", "comment": " @thomasmennella5501  what edition ? Because it’s kinda matter isn’t professer", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "UgxFUDQ4ahNorFTTD4F4AaABAg.9cAQVVBCf-E9hU7sX0lSUu", "comment": " @thomasmennella5501  plz respond", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "UgyPAVJjb9OTFwdm6vt4AaABAg.9bLIG4IyACQ9bLlzNrjZXq", "comment": "Hi Dr. Mennella. You are correct. Since it is all DNA materials used in his experiment, RTase would not play any role. Thanks for pointing that out along with other extra info. Have good evening.", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "UgxP4X1Fne4fRU0BNT54AaABAg.9VxP81OaJ8a9xk_5dP9PHX", "comment": "Very good Sir!", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "Ugzab3CZwh6YCx35Iy54AaABAg.9A4PRLPrG1p9A_7VLKN3pL", "comment": " @thomasmennella5501  thanks i saw it a month ago. but i woundn't mind if you just did one for innate immunty which would be enough and appreciate it.", "votes": "0", "replies": "", "reply": true}, {"vid": "AKrK2RWdgg4", "cid": "Ugw6UHyrq_XZXFWhuFF4AaABAg", "comment": "Thank you for this amazing explanation! I loved your genetics videos and cell Mol.God bless you and your family.", "votes": "4", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgwM9S0gd74NFI8xvGh4AaABAg", "comment": "Thank you sir for this amazing channel on YouTube I really interested in this videos,  but sir could you put test bank or multiple choose quistion or give us a link depend on these chapters and lacture please??🥺", "votes": "3", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "Ugxjb3sJiEUVz-3Dvzx4AaABAg", "comment": "Loved your Genetics lecture vidoes.  Had watched each one twice which helped me understand the material thoroughly.  Now watching your Cell & Molecular vids to prepare for next semester.  If this series wasn't available, I might not have signed up for Cell & Molecular.", "votes": "3", "replies": "", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgwuEP4UuoRk_jtHvft4AaABAg", "comment": "hello, I was watching this lecture on youtube \"DNA Structure and Classic experiments, excerpt 1 | MIT 7.01SC Fundamentals of Biology\" He mentioned that it was Griffith that started this experiment on mice and that Avery and his team continued the work and didn't use mice because it took too long. Thus, i am just a little confused with the conflicting information. Can you please help me clarify? Thank you in advance :)", "votes": "2", "replies": "1", "reply": false}, {"vid": "AKrK2RWdgg4", "cid": "UgwuEP4UuoRk_jtHvft4AaABAg.8gpU5A-B4sg8h-OPYhvL-G", "comment": "Thank you for clarifying :)", "votes": "0", "replies": "", "reply": true}]