[{"vid": "Ao-r2nsib_Y", "cid": "Ugz-5nP81Hf-HCGVU654AaABAg", "comment": "Y not use PowerPoint slides to save time? Stupid.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgyTDSmH92cz4wkF67F4AaABAg", "comment": "What about Epstein Barr Virus and VZV. Fail.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugz8VxrBha_INmSYIex4AaABAg", "comment": "You know you're a geek when this is what you watch in your free time... 😂  Love it, thank you", "votes": "1", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgyWV-pmWA-NaEJkgQd4AaABAg", "comment": "This is a very good education ...I was wondering if you would look at \" The NATURAL WAY TO GET RID OF AIDS\"", "votes": "3", "replies": "1", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugw-pAWrAwKtbTwDE3J4AaABAg", "comment": "Very good lecture mam.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugy0gP76NY2fUyGYO5d4AaABAg", "comment": "Excellent Professor and a very interesting class!! Thanks MIT", "votes": "4", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgyMM21zonkqg-B-xkJ4AaABAg", "comment": "Magical think. For break from science", "votes": "0", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgyiFkxZU7jEs2pAGqp4AaABAg", "comment": "17:00 interestingly enough, descendants of survivors of the plague have modified co-receptors that resisted both Yersinia and HIV and have an advantage over those that were not afflicted by the plague in Europe.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugyn0uG1ZeGDJ3fIlht4AaABAg", "comment": "I am extremely grateful for these lectures. Thank you, sincerely.", "votes": "9", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgxmOYXXCAJ5xMt14eF4AaABAg", "comment": "👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugw0gAa7F28-tt7uYYh4AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "4", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugz3EfzhxzXmwiaSZpZ4AaABAg", "comment": "Truthfully, i was tested HIV + positive last year. I keep on managing the drugs i usually purchase from the health care agency to keep me healthy and strenghtful, i tried all i can too make this disease leave me alone, but unfortunately, it keep on eating up my life, this is what i caused myself, for allowing my fiance make sex to me insecurely without protection, although i never knew he is HIV positive. So last two [2]week i came in contact with a lively article on the internet on how this Powerful Herb Healer get her well and healed. So as a patient i knew it will took my life some day, and i need to live with other friends and relatives too. So i copied out the Dr kanayo  the traditional healer’s email id drkanayonaturalcure@gmail .com and  WhatsApp contact +19093755642 and I mailed and WhatsApp him immediately, in a little while he message me back that i was welcome to his herbal home were all what i seek for are granted. I was please at that time. And i continue with him, he took some few details from me before I bought his 14 days negative. [2]weeks after I finish the herbal medicine as i was coming from a friends house, Dr kanayo called me to go for checkup in the hospital and see his marvelous work that it is now HIV negative, i was very glad to hear that from him, so i quickly rush down to the nearest hospital to found out, only to hear from my hospital doctor called Chris Lewis  that i am now HIV Negative . I jump up at him with the test note, he ask me how did it happen and i recede to him all i went through with Dr kanayo I am now glad. I made a promise to  Dr kanayo that I will share this wonderful testimony at my free time", "votes": "0", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgzxD8jmbWXn0crK02F4AaABAg", "comment": "With the herbal medicine I ordered from Dr alamale here on YouTube, in was finally able to defeat genital herpes", "votes": "0", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugxq1ZtMjPV-T5Wtsq14AaABAg", "comment": "What method is used to identify what receptors on the cell are involved ?", "votes": "3", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "Ugy-emYFjFekTmgqC_R4AaABAg", "comment": "Barbara Imperiali is the best", "votes": "7", "replies": "", "reply": false}, {"vid": "Ao-r2nsib_Y", "cid": "UgyWV-pmWA-NaEJkgQd4AaABAg.9qxGiq_VUQV9wzclJ29kS-", "comment": "Yh ynyhbyhhhy n hbyhhhhh😅h by hihii😊", "votes": "0", "replies": "", "reply": true}]