[{"vid": "apP5SWitnyw", "cid": "UgysM_9RHFY0QMM7s_V4AaABAg", "comment": "Does anyone have any suggestions on what she was going to mention when she said \"barbecue\"??", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgztPaQ48VunXpVDxtB4AaABAg", "comment": "11:35 11:52  There is a mistake done by the ma'am, commonly T is not present in RNA primer, but ma'am says (DNA strands 3'->5' and RNA primer from 5'->3'(up to 8-11Nt. in PK) A of DNA strand bind with T of RNA primer. This is the mistake done by ma'am. I think in place of T there should be U in bonding between DNA and RNA primer strand and after 3' end of RNA primer DNA dependent DNA pol. Carry T to interact with A (double H-bond).", "votes": "0", "replies": "2", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgwOVPlAlTRwL9EYJWh4AaABAg", "comment": "unfortunately she does not explain how telomerase works...", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgwkhURQUYbpqYsxMHJ4AaABAg", "comment": "(On Monday of January 30, 2023).  On the Subject of Biology and the Transcription of DNA (Gene Expression Axis) and Biochemistry therein (Nucleic Acids and Proteins are biochemicals): 1) RNA Polymerase II (Making of Pre-(mRNA; RNAP) Protein Complex which Makes a Single Strand (DNA-Dependent Transcriptions Process) where such Molecule will Nucleovasate (Transmigrate the Nucleoplasm to the Cytoplasm) to the Cytoplasmic Active site (rRNA Complex Protein) otherwise Ribosome (Actual Protein Biosynthesis Locus);  2) TFIID and Complex of Proteins binding on to DNA Molecule (TATA Box; Promoter; Terminator); 3) Splicing and Processing pre-mRNA (Capping and Polyadenylation of pre-mRNA Molecule); 4) Complex of Proteins Generally Governed by Dependent Function And Trancription Factors Ideation (TFs);  PhD Barbara Imperiali, es geht gut aber man muss nicht vergessen die Wohlstand ueberall (Im Wohlstand Leben nicht Gesundheit Leben).  Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgwS0eBopMpbXiMYpUt4AaABAg", "comment": "حاولوا جعلي عاقر من خلال هبه كانت تعمل اكنها بتبكي عليا من الجوع وتعطني اكل وانا معرفش أنه بيحاولوا يغيروا الهرمونات وتقطيع المبايض", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgzAHAUCimb_2KBs38R4AaABAg", "comment": "This was so so so interesting. I only understood the basics of transcriptions and this went more in depth.", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgxQ07zDURedmZvOS_54AaABAg", "comment": "Most of dna replication and transcription starts just 10-12 minutes before lecture end", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugzys2_ZufGcVjH90u94AaABAg", "comment": "I’m taking biology in the fall semester and this is so useful", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgxDSDi5lbDq1l301X14AaABAg", "comment": "This takes a lot of time to digest and understand. Don't get discouraged if you don't understand in one go.", "votes": "9", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgwvF-MoA7S-C9IXYTB4AaABAg", "comment": "A well organized lecture. \r \r As a retired science educator, I am watching this biochemistry series as a refresher on previously studied topics. If I were arriving to this video lecture series with  ‘NOT a lot of previous learning’, but with only a few biochemistry related synaptic connections in my brain, I too would be distracted. \r \r Even with previous background knowledge, when a new slide is displayed, I pause the video, study the content on the slide, them resume playing the video and listen to what the prof has to say, while also ‘taking in’ her various arm and body movements.\r \r For example, with arms spread, the prof makes one side-step… she is mimicking the polymerase sliding one codon along the DNA strand. She is internally ‘visualizing’ and displaying what she has already stored in her long term memory; a visualization that a new learner is trying to decipher and internalize in short term memory, for later long term storage.\r \r That is where sidebar audio statements interjected into the lecture content, within the continuous verbal flow, can become distracting. \r That is where a deliberate side-step to mimic the polymerase, gets confused with other random bodily movements.\r \r As a subject matter expert, the slides, the lecture, and the movement, cognitively flow together fairly coherently.  For new learners, especially for learners that tend slightly toward attention deficit, the changing and switching of sensory input (especially in the online videos) is going to draw attention away from focus on the main content…not great ‘survival value’ for a classroom learner. However in the wilds of a forest, being intensely aware of random movement has huge survival value…just like keen awareness of movement and communication on a basketball court is an advantage.\r \r The prof, herself was taught in classrooms with mainly or only blackboards…computers with animations with audio and visual synchronized is relatively new…and still is not being used in science education to the fullest. However, students sitting in the lecture hall have the advantage of continuous display of content on the projected slide, most of the content on all the sliding blackboards showing, while listening…the classroom students have the advantage of selected focus…and also pre-read handouts. \r \r Actually, great lecture preparation!\r \r However, as subject matter experts, many lecturers have to slow down delivery, and pause between concepts…to give their own brains ‘like’ time to ‘like’ catch up ‘Ya know’ …especially when speaking to students being introduced to content for the first time. \r Even blabbergasting comedians, pause to let the audience get the simplest of ‘jokes’!\r \r We live in a technological society that uses flash advertising, not for understanding, rather for simple product recognition. \r We also live in a culture that overvalues verboseness…’We have mouths that close and ears that stay open…that should teach us something.’ Compare sports broadcaster banter, to an articulate JFK speech! \r Love the MUTE button!", "votes": "8", "replies": "1", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugz8p2if2yj5qX-Wm_14AaABAg", "comment": "Thanks mrs. Barbara for your explanation", "votes": "1", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgzFcfg_xzRg_0vn9sB4AaABAg", "comment": "It’s amazing how a different hair style can change appearance.", "votes": "2", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgytQNYa0c1S9qeewol4AaABAg", "comment": "Whenever I want a refresh of my undergrad topics I just come here. She's an awesome teacher. I'd love to meet her.", "votes": "24", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgyP4a5nuJ4QpVKDtqh4AaABAg", "comment": "great lecture with great teacher", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgwFw36aRPvj4fxg6et4AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "4", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgytMJNHHASI_5dQlvt4AaABAg", "comment": "An outstanding lecture! I love your pronunciation and content presentation! Thank you very much!", "votes": "3", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugy4kf32jxgFdFzHzHt4AaABAg", "comment": "One minor object of note: Professor Imperiali wrote \"α-amantin\" on the power point slide. The correct name of this poison is \"α-amanitin.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugz2whI4bdtXAxNeJuN4AaABAg", "comment": "Estos videos deberían tener más visitas, son buenísimos :) I love Science", "votes": "2", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugyr4Dj4FyR7W8OKJDF4AaABAg", "comment": "Thanka a lot Iam from Sri Lanka", "votes": "3", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugw4BnwUaeTpoLv0e4p4AaABAg", "comment": "35:15 *DNA Transcription* starts from here", "votes": "25", "replies": "2", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgztPaQ48VunXpVDxtB4AaABAg.A17uzjn_2kiA1LV16J18VP", "comment": "No RNA occurred in that synthesis, and thus no U occurs.", "votes": "0", "replies": "", "reply": true}, {"vid": "apP5SWitnyw", "cid": "UgztPaQ48VunXpVDxtB4AaABAg.A17uzjn_2kiA1MRLGYgMja", "comment": " @briseboy I think u need to listen one more time in b/w. 11:34-11:52", "votes": "0", "replies": "", "reply": true}, {"vid": "apP5SWitnyw", "cid": "UgwvF-MoA7S-C9IXYTB4AaABAg.9Hrb4Wwvs3G9Hrby0tc5_q", "comment": "P.S. And the lectures online are free!", "votes": "2", "replies": "", "reply": true}, {"vid": "apP5SWitnyw", "cid": "Ugw4BnwUaeTpoLv0e4p4AaABAg.9F79eLhwhdI9JUHOgGjqUS", "comment": "Thanks", "votes": "1", "replies": "", "reply": true}, {"vid": "apP5SWitnyw", "cid": "Ugw4BnwUaeTpoLv0e4p4AaABAg.9F79eLhwhdIA6MWQN9XtiD", "comment": "*RNA Transcription (DNA is replication, transcription is by definition RNA), but I do really appreciate the time mark! :)", "votes": "0", "replies": "", "reply": true}, {"vid": "apP5SWitnyw", "cid": "UgzZUBYjOJgU_O31wAl4AaABAg", "comment": "Great lecture, thanks for post these videos to public!", "votes": "9", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "Ugwk6uTmLNrLRJtefBh4AaABAg", "comment": "Another superb lecture from Prof Imperiali. She does a great job of explaining complex processes in an understandable manner.", "votes": "8", "replies": "", "reply": false}, {"vid": "apP5SWitnyw", "cid": "UgwGHhauF0UBtG8jVEJ4AaABAg", "comment": "superb teacher with nice explanation thanks mrs barabara", "votes": "17", "replies": "", "reply": false}]