[{"vid": "awdQqF9CFt0", "cid": "UgzjKmUBuP3odT7cz0p4AaABAg", "comment": "Thanks ❤️🤍", "votes": "0", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgyUF7lYctvzZ-dP1wN4AaABAg", "comment": "This is helpful ❤️🤍", "votes": "0", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "Ugy-OVpcMnVzryh0Hzt4AaABAg", "comment": "15:00", "votes": "0", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgwHCMp_TkPlO-bWqhx4AaABAg", "comment": "MIT is the best institute for sure.", "votes": "0", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgzWdKpMjuFvZJOoPJV4AaABAg", "comment": "congratulations to MIT for transmitting these classes, this work is incredible, congratulations to the teacher who is excellent, I am very grateful for these classes, I live in a city in the middle of the Amazon and I'm here watching these classes and learning a lot. I already have a degree in chemistry, and it has been a great review. sorry for the english, because i'm using the translator. Grateful. Thank you very much Mith.", "votes": "3", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "Ugx3X43w-oigY-um3E54AaABAg", "comment": "Thanks for promoting equality  by providing the best classes in the world free of charge to everyone.", "votes": "6", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgwWehR2p9rJsk9a4SV4AaABAg", "comment": "The incessant flow of words is really admirable. It also shows profound knowledge based confidence.", "votes": "4", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgyF0BcGEX0t0IAy8_p4AaABAg", "comment": "Thanks MIT", "votes": "1", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgxaHIKgpTDZSKZdax14AaABAg", "comment": "Thank you MIT, Thank you Prof. Drennan..", "votes": "9", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgxTimBqhKG-KxEwY3d4AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "3", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgzeJI8asEguq25a_z54AaABAg", "comment": "A really great Super Collider is a bit frustrating because it makes a Black Hole from which no information returns, or so the observed wisdom would have us believe, ..all of which deliberately ignores the creation of the information that positions the apparent disinformation location.(as if knowledge destroys itself in a Black Hole to protect itself) Politics, assuming responsibility without liability, is the same technique.?  So the topic of Thermodynamics has these characteristics of +/-Inflation bubble-modes in Totality, of Ideal Gas positioning points, with properties that self-define at the universal balance function that is the ephemeral e-Pi-i-numberness, the logarithmic temporal vector coordination or association phenomena of sync-duration in/of dynamic pure relative motion, a probability spectrum dominance coordinate system. \"Simply\" crystallisation of time, in/of Infinity. (The precise opposite of the Singularity zero-infinity difference distribution is the only actual, accurate statement applicable)  Thermodynamics, the properties of Ideal Gas, describes natural temporal phenomena, derived from the First Principle, Eternity-now Interval Conception Mathematics.", "votes": "2", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgwhHA1x6KFmNIH9FCt4AaABAg", "comment": "By watching your lecture it feels like how dumb i am to fear of chemistry, how easy chemistry is...", "votes": "9", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgwpVKlpeZ1hXvd40rp4AaABAg", "comment": "Finally! I actually got what it means", "votes": "2", "replies": "", "reply": false}, {"vid": "awdQqF9CFt0", "cid": "UgyQAZVvO5o_sYvQocV4AaABAg", "comment": "Incredible!", "votes": "7", "replies": "", "reply": false}]