[{"vid": "BbascVoYf_E", "cid": "UgyYq3DxMZTf_7ahlst4AaABAg", "comment": "Civil engineering lectures please", "votes": "0", "replies": "", "reply": false}, {"vid": "BbascVoYf_E", "cid": "UgzkwVVxt8NK9qPVM0p4AaABAg", "comment": "👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "BbascVoYf_E", "cid": "Ugy1sM4tVggbIDd-yvV4AaABAg", "comment": "Wow I visually learn the definition of annealing thank you for this video It is so helpful", "votes": "0", "replies": "", "reply": false}, {"vid": "BbascVoYf_E", "cid": "UgxSjIplI3XSIqiDJ8t4AaABAg", "comment": "If you want to make this as a toy or art-piece rather than an educational item, consider purchasing 10k \"ball bearings\" (hardened /plated, between 2mm and 3mm in diameter) from a bulk seller e.g. via aliexpress or ebay. These cost between 2 and 20 money-units, depending on gold-plating or otherwise. Avoid the cheapest of the cheap - these have a terrible surface-finish and tend to jam. Next, get two identical picture-frames from e.g. Ikea (with glass panes instead of plexiglass, for extra scratch-resistance) and sandwich the balls between the two glass sheets. Use paper-shims (stacked post-it notes or polyimide tape) to create a inter-glass-gap slightly wider than the diameter of the balls.   Avoid the temptation to use a magnet to contain the balls from bouncing off the glass while pouring - the residual remnance makes the \"crystal lattice\" demo less fluid, as the balls tend to clump up. Alternatively, consider using bronze, brass, ceramic or POM balls.  Enjoy!", "votes": "1", "replies": "", "reply": false}, {"vid": "BbascVoYf_E", "cid": "UgwQWk740Sm3tciXQgp4AaABAg", "comment": "first coment (; mit thanks but if you can add the quatum field theory and relativistic qft or quatum theory or codensate matter or this quantum courses i will be so happy ,please if we can add the qft relativistic 3 i going to be one of the happiest person in the world im 17 years if you want to give me a scholaship (i know some topics about remornalization theory ,quatum loop gravity and others (;", "votes": "0", "replies": "", "reply": false}]