[{"vid": "BBbuj0XpaiQ", "cid": "UgxLj4F80hIIkiLe9Ht4AaABAg", "comment": "smart presentation", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyhbbfkOmi7WOqbRw14AaABAg", "comment": "40:21 nooooo!!!! Hydrogen 😢", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzfMpmjv6apt7qqSRx4AaABAg", "comment": "I loved her explanations on energy levels: I never understood it fully until now !!!", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugzs_T0x4qp0z3FJ5uF4AaABAg", "comment": "Clear❤❤", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxhTqlOyjE4ltRibeF4AaABAg", "comment": "Amazing!!! I wish I had a professor like you!!", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxGnZg3y28VX-iINKN4AaABAg", "comment": "😊", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugwu78ShrkUf_cT85F94AaABAg", "comment": "😊😊😊😊😊😊❤", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzX83fFPIqtmaltgOF4AaABAg", "comment": "Thanks professor you made me understand", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugy3dBgn0J1U6iD6t4h4AaABAg", "comment": "Thank you you so much", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwoiG4QrW18k4GFsRZ4AaABAg", "comment": "4:36- Since a double bond is a σ bond plus a π bond, I suppose the graph of π bond should be asymmetric about the z bond axis, one σ bond and one π bond, respectively, which differ in overlap areas, hence asymmetric?   7:59- one of the 3 2p electrons is from a promoted 2s electron, but this is not reflected in the graph.", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwtiWeG4959Pu-laPB4AaABAg", "comment": "Flabbergasted🎉 to watch this wonderful video 🥰.  Thank you so much, mam, for clearing all of my doubts you are the best 🌟", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzUWQZ-4jILOUUJP0t4AaABAg", "comment": "Help... she told the energy came from the bonding (9.15). However, if we want to a bond , firstly we need hybridization.  So, the energy for hybridization can not come from the bonding. In my opinion, first the hybridization should occure and second the bonding should occurre. So, as far as I can see, energy for hybridization can not come from the bonding. Because The bond could have not occured without hybridization... could you explain me please...", "votes": "1", "replies": "1", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzYzZC1iRUQtvZps5l4AaABAg", "comment": "Thank you for making this available to the world. I was sick and missed a full week of my intro chemistry course and missed hybridization and molecular orbital theory and this is going to save my Canadian bacon.", "votes": "18", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugztbhb8DASHlZPBIvZ4AaABAg", "comment": "I like khan academy's video on these topic much better and easier to follow.i find this one not interesting and easy", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxwyjyG25zeVWANXVF4AaABAg", "comment": "Watching it from a remote village of India lying on my bed.", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzetB0RBaG34rYudLN4AaABAg", "comment": "100% the BEST chemistry teacher ever. I don't think I ever fully understood hybridisation till I watched Catherine Drennan teach it. Please upload lecture videos for your organic chemistry courses as well!", "votes": "16", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugw2dAdPPX06KBFpNwp4AaABAg", "comment": "Love the teeshirts - chocolate this time :-)", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxCAx-6_VM4AZW3_PN4AaABAg", "comment": "Thank you so much for this. I am taking a 100% online, self-teach style chem class for nursing school and your videos are like the veil being lifted so I can see clearly. Well, at least as clearly as I can in a 7-week course!", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxJM8WELK9_nj1npCt4AaABAg", "comment": "38:35 there's one more bond i think ,the Sigma(C2sp ,H1s) 🤔", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzsZOJNgcxNjZjoMgt4AaABAg", "comment": "Teaching tips I have learnt from Prof Drennan; Start from simple challenges then gradually transition to complex ones, constantly remind your students on what you expect in the test, highlight areas where students can possibly make mistakes, Use already known/relatable examples (e.g Vit C)  make excellent slides and scent your lesson with science jokes!  She is an awesome teacher", "votes": "17", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzUWQZ-4jILOUUJP0t4AaABAg.9kfk3_hYO1D9rZ21CegYyr", "comment": "What I undertand is that during bonding orbitals are hybribidized from eneegy we get from bonding. I hope it clarify your queery.", "votes": "2", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgzaGd7VXGIY7D756Hx4AaABAg", "comment": "Where can I find more information about the rule \"terminal and single bonded atoms do not hybridize\"? I am having a big doubt about that", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugwdnlo5AIfD1PBgD3V4AaABAg", "comment": "Look people, I'm over 70 years old and Ms. Drennan teaches Chemistry like no other professor I had.  I just go to YouTube launch one of her lectures and get blasted with understandable information beyond my wildest dreams.  You people at MIT are SO lucky!", "votes": "3", "replies": "1", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyTFjkcx4rIL6NR-1V4AaABAg", "comment": "OMG your lecture is so helpful thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyArRAYA61H9dftAe14AaABAg", "comment": "Question: At 22:45, regarding the sp2 hybridization of carbon, you place the 4th electron in the remaining unhybridized p orbital. But that orbital is higher energy than the three sp2 orbitals, so why didn't you place the 4th electron in the first sp2 orbital to make an electron pair? Similar question at 34:27 for sp hybridization of carbon.", "votes": "1", "replies": "2", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgybxEdI7q4Gxlycpql4AaABAg", "comment": "One thing I cant understand that how carbon can sense when to form sp2 hybridised orbitals and when to form sp3 hybridized orbital?", "votes": "1", "replies": "2", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugwjy0St8vnwVsWCBJt4AaABAg", "comment": "Excellent lecture, very good presentation.", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugy_zgxD7hfp_g1umWV4AaABAg", "comment": "Very very thanks, dear Mam.", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugy737VLHnFfr4PMGVl4AaABAg", "comment": "From Ethiopia i love the explanation 🇪🇹🇪🇹🇪🇹🇪🇹", "votes": "3", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugyk50dKMPb0r8QqcrR4AaABAg", "comment": "Thank you for making this available to anyone for free. I took Chemistry 1A and 1B 30 years ago. This is a great review and deeper learn for me.", "votes": "3", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxYec7Hj3nyB8jzKtZ4AaABAg", "comment": "great job mit it's very useful us", "votes": "3", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugz55rCnIb7U1jjcchR4AaABAg", "comment": "Gazab fantastic video", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyDtcbET5NTRYEm5fl4AaABAg", "comment": "Thank you ma'am for the lecture. But ma'am, Isn't there any difference in Geometry of the molecule and the shape of the molecule?", "votes": "1", "replies": "1", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwGN0FVl5_Mq6SBnxd4AaABAg", "comment": "Thanks for this ❤️❤️❤️🌺", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwUkb0TbedIhL9OpLB4AaABAg", "comment": "Dreaming orbitals this is mad", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwA4EOFiFYksWEji2l4AaABAg", "comment": "https://youtu.be/1pr5XnSkBb0 Valence bond theory /Covalent bond Polar character/ polar non-polar compounds/ Di-pole movement", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwV2H7_gIFuWMrzij54AaABAg", "comment": "Very nice explanation and presentation...Thank u mam", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugz5ffJtfpsmPRy9r7p4AaABAg", "comment": "Space-time is only half QM-TIMESPACE.", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugx59KwZ7be42DtVjp94AaABAg", "comment": "Thank you so much ❤️", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugz70rIh4esFGriGCB54AaABAg", "comment": "Thank you so much from INDIA!", "votes": "5", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugw1CX_Tc3Tj_SphcvB4AaABAg", "comment": "Thank you, Professor. It's an extremely useful video from a very knowledgable instructor. This theory is hard to explain, but you make it transparent. Wonderful!", "votes": "12", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugwdnlo5AIfD1PBgD3V4AaABAg.9XY4O8lLTaMA6YiuTbVTmT", "comment": "Why \"Ms\" Drennan?? She's a Professor; use her professional title. Not that hard. Would you really have said \"Mr Drennan\" if the Professor was male?", "votes": "0", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgyArRAYA61H9dftAe14AaABAg.9TAYafQrv0W9US_kEKGCgC", "comment": "I believe the answer is because like charges repel and when two electrons are in the same orbital, there’s a bit of instability in the orbital. That one electron would much rather jump up to that empty 2P orbital then stay in the same orbital with another electron, even if that means it will take some energy to promote. Any instability caused by the electron promoting is made up for the fact that it is no longer paired with another electron.", "votes": "2", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgyArRAYA61H9dftAe14AaABAg.9TAYafQrv0W9fHIvZe7elX", "comment": "That's hund's rule of multiplicity I guess, which says, before beginning the pairing the electrons all orbitals of that 'l' should be fill with one same spin electrons. Why? Because it's more stable. The electrons exchange their orbitals resulting in releasing of the energy.", "votes": "2", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgybxEdI7q4Gxlycpql4AaABAg.9S1h5_aEc_l9TAYJqqJqqY", "comment": "It depends on the molecule that it is in. Basically, if carbon is in a molecule such that it makes 4 single bonds, then the hybridization is sp3 (4 sigma bonds). If it is in a molecule such that carbon makes 2 single bonds and a double bond, then the hybridization is sp2 (each of the single bonds uses an sp orbital (2 sigma bonds), the double bond uses one sp2 (one sigma bond) and the remaining unhybridized p orbital (one pi bond)). If it is in a molecule such that it makes 1 single bond and 1 triple bond, then the hybridization is sp (the single bond uses one sp (one sigma bond), the triple bond uses one sp (one sigma bond) and the two remaining unhybridized p orbitals (two pi bonds)).", "votes": "1", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgybxEdI7q4Gxlycpql4AaABAg.9S1h5_aEc_l9TBD28e3HPU", "comment": " @debradaugherty8287  Thanx", "votes": "1", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgyDtcbET5NTRYEm5fl4AaABAg.9IJxkt0Haoc9Wk_dPPREYl", "comment": "Yes, there is a difference in the arrangement of paired electrons and shape. It is more clear when we have lone pair species", "votes": "2", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "Ugxpa8oKggfKHxt5q8B4AaABAg", "comment": "The t-shirts are cool🥰   I see a steroid [(of the top of my head, only because of the  center structure, there two rings (wrong wording), the 6 ring bonded to the 5 ring)]. I l💞💞💞 her lectures💞💞💞  Possibly, I'll be more proficient  in Chemisty🙏🏿🙏🏿🙏🏿", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyMXGVTyU2ivv43og54AaABAg", "comment": "So the two bonds shown in the diagram 24:48 ... one is the pi and other is the sigma?  if so... Does is make a difference which one is remaining if one of them is broken along a reaction?", "votes": "1", "replies": "2", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyJaCvqeCmYzUR520Z4AaABAg", "comment": "Hybrodization for N2F4 ,C2F2,C2F6,(H2N)CO", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyuMgptLHrSLHHl8L54AaABAg", "comment": "Good explained.thank you madam by an indian🇮🇳🇮🇳🇮🇳", "votes": "5", "replies": "1", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugw7r8wUhoalrt3PXYN4AaABAg", "comment": "Are these vedios r for engineering??", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugx1H1nd6HlUmlvjMiF4AaABAg", "comment": "Are these vedios r for engineering??", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzXl_mHNVIrCD7TF3J4AaABAg", "comment": "Thank you madam", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugz8YF1URpAa3lXuEkp4AaABAg", "comment": "Good job mit opencouseware offering Good quality education for those who can't afford", "votes": "41", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugx6Is2Rv0jpDcujC2B4AaABAg", "comment": "Why are your videos not available for offline download?", "votes": "0", "replies": "1", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugx1Dkn_-7ytXNBjoOh4AaABAg", "comment": "Thank you mam 💐", "votes": "3", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgzslnxMLUBSWx0ciaN4AaABAg", "comment": "great 💖 🇪🇬", "votes": "2", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxKeyscF7YFCoj__rZ4AaABAg", "comment": "This lecture is amazing she helped me understand a lot!", "votes": "9", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwlZxMZeeMhwXomR8R4AaABAg", "comment": "Thank you very much Prof. Catherine Drennan! Greetings from Sweden :) I'll jump now to the Huckel theory", "votes": "3", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwKOO2yG4NuFddhZn54AaABAg", "comment": "How do you do hybridization of ferric sulfate or iron iii sulfate?", "votes": "0", "replies": "2", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwxNbp5kuy17tBPTXl4AaABAg", "comment": "it is a very big informative lectures", "votes": "1", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "Ugx0gB9OroZ_YdUbA5F4AaABAg", "comment": "it is a very big informative lectures", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxbrrGupxN3aTK_bux4AaABAg", "comment": "I AM DIFFICULT TO FIND ORGANIC AND FHYSICL. CHEMISTRY", "votes": "1", "replies": "2", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxVjx9IQ79yN2cIDhJ4AaABAg", "comment": "nice work ! I am very apolouge to MIT.", "votes": "0", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgwOhUIXvRepbsyIlDR4AaABAg", "comment": "where can I order a Tee Shirt like that?", "votes": "19", "replies": "", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgxAqHYUhXWWXWE-iFp4AaABAg", "comment": "The present work shows the inapplicability of the Pauli principle to chemical bond, and a new theoretical model of the chemical bond is proposed based on the Heisenberg uncertainty principle.  Review. Benzene on the Basis of the Three-Electron Bond.  See pp. 88 - 104.  http://vixra.org/pdf/1710.0326v1.pdf    The Pauli exclusion principle and the chemical bond.  The Pauli exclusion principle — this is the fundamental principle of quantum mechanics, which asserts that two or more identical fermions (particles with half-integral spin) can not simultaneously be in the same quantum state.   Wolfgang Pauli, a Swiss theoretical physicist, formulated this principle in 1925 [1]. In chemistry exactly Pauli exclusion principle often considered as a ban on the existence of three-electron bonds with a multiplicity of 1.5, but it can be shown that Pauli exclusion principle does not prohibit the existence of three-electron bonds. To do this, analyze the Pauli exclusion principle in more detail.  According to Pauli exclusion principle in a system consisting of identical fermions, two (or more) particles can not be in the same states [2]. The corresponding formulas of the wave functions and the determinant are given in the reference (this is a standard consideration of the fermion system), but we will concentrate our attention on the derivation: \"... Of course, in this formulation, Pauli exclusion principle can only be applied to systems of weakly interacting particles, when one can speak (at least approximately on the states of individual particles) \"[2]. That is, Pauli exclusion principle can only be applied to weakly interacting particles, when one can talk about the states of individual particles.  But if we recall that any classical chemical bond is formed between two nuclei (this is a fundamental difference from atomic orbitals), which somehow \"pull\" the electrons one upon another, it is logical to assume that in the formation of a chemical bond, the electrons can no longer be regarded as weakly interacting particles . This assumption is confirmed by the earlier introduced notion of a chemical bond as a separate semi-virtual particle (natural component of the particle \"parts\" can not be weakly interacting).  Representations of the chemical bond given in the chapter \"The Principle of Heisenberg's Uncertainty and the Chemical Bond\" categorically reject the statements about the chemical bond as a system of weakly interacting electrons. On the contrary, it follows from the above description that in the chemical bond, the electrons \"lose\" their individuality and \"occupy\" the entire chemical bond, that is, the electrons in the chemical bond \"interact as much as possible\", which directly indicates the inapplicability of the Pauli exclusion principle to the chemical bond. Moreover, the quantum-mechanical uncertainty in momentum and coordinate, in fact, strictly indicates that in the chemical bond, electrons are a system of \"maximally\" strongly interacting particles, and the whole chemical bond is a separate particle in which there is no place for the notion of an \"individual\" electron, its velocity, coordinate, energy, etc., description. This is fundamentally not true. The chemical bond is a separate particle, called us \"semi-virtual particle\", it is a composite particle that consists of individual electrons (strongly interacting), and spatially located between the nuclei.  Thus, the introduction of a three-electron bond with a multiplicity of 1.5 is justified from the chemical point of view (simply explains the structure of the benzene molecule, aromaticity, the structure of organic and inorganic substances, etc.) is confirmed by the Pauli exclusion principle and the logical assumption of a chemical bond as system of strongly interacting particles (actually a separate semi-virtual particle), and as a consequence the inapplicability of the Pauli exclusion principle to a chemical bond.  Heisenberg's uncertainty principle and chemical bond. For further analysis of chemical bond, let us consider the Compton wavelength of an electron:  λc.е. = h/(m*c)= 2.4263 * 10^(-12) m  The Compton wavelength of an electron is equivalent to the wavelength of a photon whose energy is equal to the rest energy of the electron itself (the standard conclusion is given below):  λ = h/(m*v), E = h*γ, E = me*c^2, c = γ*λ, γ = c/λ  E = h*γ, E = h*(c/λ) = me*c^2, λc.е. = h/(m*c)  where λ is the Louis de Broglie wavelength, me is the mass of the electron, c, γ is the speed and frequency of light, and h is the Planck constant. It is more interesting to consider what happens to an electron in a region with linear dimensions smaller than the Compton wavelength of an electron. According to Heisenberg uncertainty in this area, we have a quantum mechanical uncertainty in the momentum of at least m*c and a quantum mechanical uncertainty in the energy of at least me*c^2 :  Δp ≥ mе*c and ΔE ≥ me*c^2  which is sufficient for the production of virtual electron-positron pairs. Therefore, in such a region the electron can no longer be regarded as a \"point object\", since it (an electron) spends part of its time in the state \"electron + pair (positron + electron)\". As a result of the above, an electron at distances smaller than the Compton length is a system with an infinite number of degrees of freedom and its interaction should be described within the framework of quantum field theory. Most importantly, the transition to the intermediate state \"electron + pair (positron + electron)\" carried per time ~ λc.е./c  Δt = λc.е./c = 2.4263*10^(-12)/(3*10^8) = 8.1*10^(-20) s  Now we will try to use all the above-mentioned to describe the chemical bond using Einstein's theory of relativity and Heisenberg's uncertainty principle. To do this, let's make one assumption: suppose that the wavelength of an electron on a Bohr orbit (the hydrogen atom) is the same Compton wavelength of an electron, but in another frame of reference, and as a result there is a 137-times greater Compton wavelength (due to the effects of relativity theory):  λc.е. = h/(m*c) = 2.4263*10^(-12) m              λb. = h/(m*v)= 2*π*R = 3.31*10^(-10) m   λb./λc.е.= 137  where R= 0.527 Å, the Bohr radius.  Since the De Broglie wavelength in a hydrogen atom (according to Bohr) is 137 times larger than the Compton wavelength of an electron, it is quite logical to assume that the energy interactions will be 137 times weaker (the longer the photon wavelength, the lower the frequency, and hence the energy ). We note that 1 / 137.036 is a fine structure constant, the fundamental physical constant characterizing the force of electromagnetic interaction was introduced into science in 1916 year by the German physicist Arnold Sommerfeld as a measure of relativistic corrections in describing atomic spectra within the framework of the model of the N. Bohr atom.  To describe the chemical bond, we use the Heisenberg uncertainty principle:  Δx*Δp ≥ ћ/2  Given the weakening of the energy interaction 137 times, the Heisenberg uncertainty principle can be written in the form:  Δx*Δp ≥ (ћ*137)/2  According to the last equation, the quantum mechanical uncertainty in the momentum of an electron in a chemical bond must be at least me * c, and the quantum mechanical uncertainty in the energy is not less than me * c ^ 2, which should also be sufficient for the production of virtual electron-positron pairs.   Therefore, in the field of chemical bonding, in this case, an electron can not be regarded as a \"point object\", since it (an electron) will spend part of its time in the state \"electron + pair (positron + electron)\", and therefore its interaction should be described in the framework of quantum field theory. This approach makes it possible to explain how, in the case of many-electron chemical bonds (two-electron, three-electron, etc.), repulsion between electrons is overcome: since the chemical bond is actually a \"boiling mass\" of electrons and positrons, virtual positrons \"help\" overcome the repulsion between electrons. This approach assumes that the chemical bond is in fact a closed spatial bag (a potential well in the energy sense), in which \"boiling\" of real electrons and also virtual positrons and electrons occurs, and the \"volume\" of this potential bag is actually a \"volume\" of chemical bond and also the spatial measure of the quantum-mechanical uncertainty in the position of the electron.  Strictly speaking, with such a consideration, the electron no longer has a certain energy, momentum, coordinates, and is no longer a \"point particle\", but actually takes up the \"whole volume\" of chemical bonding. It can be argued that in the chemical bond a single electron is depersonalized and loses its individuality, in fact it does not exist, but there is a \"boiling mass\" of real electrons and virtual positrons and electrons that by fluctuate change each other. That is, the chemical bond is actually a separate particle, as already mentioned, a semi-virtual particle. Moreover, this approach can be extended to the structure of elementary particles such as an electron or a positron: an elementary particle in this consideration is a fluctuating vacuum closed in a certain spatial bag, which is a potential well for these fluctuations.  It is especially worth noting that in this consideration, electrons are strongly interacting particles, and therefore the Pauli principle is not applicable to chemical bond (for more details, see the section \"The Pauli Principle and the Chemical Bond\") and does not prohibit the existence of the same three-electron bonds with a multiplicity of 1.5.  See pp. 88 - 104 Review. Benzene on the Basis of the Three-Electron Bond. (The Pauli exclusion principle, Heisenberg's uncertainty principle and chemical bond). http://vixra.org/pdf/1710.0326v1.pdf  Bezverkhniy (viXra): http://vixra.org/author/bezverkhniy_volodymyr_dmytrovych", "votes": "1", "replies": "1", "reply": false}, {"vid": "BBbuj0XpaiQ", "cid": "UgyMXGVTyU2ivv43og54AaABAg.98jze5sIZi99BG31UiP0HF", "comment": "A double bond is a sigma + pi bond. And you'll break the pi bond first because it's always weaker than a sigma bond.", "votes": "3", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgyMXGVTyU2ivv43og54AaABAg.98jze5sIZi99BGOC2Mv8Cu", "comment": " @peybak  Awesome, thank you!", "votes": "2", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgyuMgptLHrSLHHl8L54AaABAg.93gceJ38Z1n9VV1cd4oLpt", "comment": "Why does everyone in her comments section post nationality? My god, an Irish person liked my video? Now I am going places!", "votes": "1", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "Ugx6Is2Rv0jpDcujC2B4AaABAg.8oBoqtH3mfr8oCAFRn6Cl-", "comment": "You can use a YT downloader app to grab the files or get files from the Internet Archive ( https://archive.org/details/MIT5.111F14 ) or iTunesU ( https://itunes.apple.com/us/itunes-u/id1188080760 ). See the course on MIT OpenCourseWare for other information and materials at: https://ocw.mit.edu/5-111F14. Best wishes on your studies!", "votes": "4", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgwKOO2yG4NuFddhZn54AaABAg.8lYbxzJt8SU8so7tRmzOc3", "comment": "pinktintin That is an ionic compound where Fe+3 is the cation and SO4^-2 is the an ion. Hybridization is used for covalently bonded molecules (electrons are being shared). You can do the hybridization of Sulfate (which is a molecule) where the Sulfur is sp3 hybridized. For the Iron itself, it will not share electrons with any atom but will be attracted to the negative oxygens like a magnet.", "votes": "1", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgwKOO2yG4NuFddhZn54AaABAg.8lYbxzJt8SU938e6tM_HMO", "comment": " @sergiosaucedo5834  more like hair or pieces of paper to an electrized comb)", "votes": "0", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgxbrrGupxN3aTK_bux4AaABAg.8a6KwY7bf3t8mOKtbbFd3Q", "comment": "vijay patel  physical*", "votes": "0", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgxbrrGupxN3aTK_bux4AaABAg.8a6KwY7bf3t9VV2a7QJ1XF", "comment": " @emanraafat4380  Not the first mistake that popped out at me... I am difficult to find X. ACK nails on a chalkboard.", "votes": "0", "replies": "", "reply": true}, {"vid": "BBbuj0XpaiQ", "cid": "UgxAqHYUhXWWXWE-iFp4AaABAg.8ZPZHLQunXj9BQ1RabS_55", "comment": "Somewhat beyond me. I know of the Pauli principle. My teacher covered it. She did not get intensive, it was more introduction and awareness of the concept. That is  in the realm ofPhysics, is it not?   I need to master the basics; before the advanced💞💞💞", "votes": "0", "replies": "", "reply": true}]