[{"vid": "BIQrnx-vvx8", "cid": "Ugy3evN878Oqh-lWK8t4AaABAg", "comment": "i mean f(x)=5 when x<-2 so you can't put the point (-2,5), atleast (-1,5). but yeah, you are my teacher Dave.", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwtH-HSOCu5bYMd3wp4AaABAg", "comment": "Thanks 👍", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwAOQDCV2pCe1J0aUB4AaABAg", "comment": "Any function with a vertical asymptote must be a \"Continuous\" function, according to my textbooks..  My teacher told me that they will never meet, but that doesn't mean there's a gap, they'll meet at infinity.", "votes": "1", "replies": "1", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwZz7cZX6Ght7yYVi94AaABAg", "comment": "I am literally Speed running mathamatics🏃💨", "votes": "1", "replies": "2", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugx5CRKhtOYB3iE7iPR4AaABAg", "comment": "W you remind me of my younger days in elementary school but for harder math!", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxOzpTaVtImgtCZiKp4AaABAg", "comment": "Good explanation. If a function is discontinuous then why we call it A FUNCTION ANYMORE? it is in the definition of a function that its all domain members MUST have unique image But one of the domain members does not have value then Why call it a function??  If the function is producing Irrational numbers then is it a continuous or discontinuous? if a function outputs Infinity it will be a continuous or discontinuous?  if a function outputs a non-terminating value it will be a continuous or discontinuous? if a function outputs indeterminate forms type values is it a continuers or discontinuous?", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzIIToi4cci5xoRMEx4AaABAg", "comment": "2:45 - so... (x^2-1)/x-1 = x-1 but x cannot equal 1 for the first case but CAN be 1 for the second case of function. Wouldn't that mean that we are \"wrong\" when we say (x^2-1)/x-1 = x-1??? i'm confused...", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzsYybh8bavwmNp6394AaABAg", "comment": "worst math crack", "votes": "0", "replies": "1", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxkHB8vFIJccIb8SMh4AaABAg", "comment": "Great tutorial. I completely understood continuous and discontinuous with just one explanation.", "votes": "5", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugwrdm695Mv5mC7IttR4AaABAg", "comment": "Thank you papa jesus", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxRvmPFQtTwZsQAG6F4AaABAg", "comment": "THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwnnXA1YTqXRwjAVe94AaABAg", "comment": "Can someone please explain me the example of piecewise function..i didn't get how the coordinates (-2,5) and  (-2,-3)were found .", "votes": "2", "replies": "3", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxOxQoxuxSAH4ADyet4AaABAg", "comment": "2:17 can this function be called piecewise function?", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzS4VWg0PwXZMneiwx4AaABAg", "comment": "thank you!! very clear and intuitive; you do know how to teach;", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugx_6gOpGAyOCDUald94AaABAg", "comment": "Very helpful for jee aspirants 🤘", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwX1aXNZ9U0sbZAtnh4AaABAg", "comment": "super helpful!", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzXIvdUkN_5OYM0mMp4AaABAg", "comment": "3:05 that was totally you scratching your beard", "votes": "2", "replies": "1", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzwRI9ltgF1Ja9xoV54AaABAg", "comment": "❤❤", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugyx4ofZ1CkjFjv67AF4AaABAg", "comment": "Thank you Math Jesus", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugz-CV-SmltO8pthSWx4AaABAg", "comment": "Thank You Calculus Jesus", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwAOQDCV2pCe1J0aUB4AaABAg.A5uqvXOC1kIA6tLwr4dV2i", "comment": "Yes this videos is wrong", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgwZz7cZX6Ght7yYVi94AaABAg.A50zSWBqpPGA5B-JrywTTa", "comment": "Bro's locking in", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgwZz7cZX6Ght7yYVi94AaABAg.A50zSWBqpPGA5pYMy7d7ur", "comment": "do you understand how the thing became -3?", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzsYybh8bavwmNp6394AaABAg.9sQx7Zc98mbA1fGLfkR1cV", "comment": "Math is like crack", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgwnnXA1YTqXRwjAVe94AaABAg.9fZ2gZ2ch8K9mOlIaMQNSz", "comment": "do you still need help", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgwnnXA1YTqXRwjAVe94AaABAg.9fZ2gZ2ch8K9ms6JW14KI-", "comment": " @vodiact  please explainnn 🥺", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgwnnXA1YTqXRwjAVe94AaABAg.9fZ2gZ2ch8K9mttHFWmNoH", "comment": " @Butterfly-bs7jp  actually i have no idea now", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzXIvdUkN_5OYM0mMp4AaABAg.9aetkFeHWUTA6YjhErCGCl", "comment": "😩", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgxK6-g_-S3xSturoZB4AaABAg", "comment": "MR PROFESSOR DAVE THANK YOU SO MUCH I DONT KNOW WHAT I WOULDVE DONE IF IT WERENT FOR YOU THANK YOU AGAIN <3333", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzKm1d2y4UV-sW7jfJ4AaABAg", "comment": "Thank you🌟", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugzz89YEtPTJK2Vemlh4AaABAg", "comment": "Done this lesson.", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugw6jEz9V54Q9PBE0Ld4AaABAg", "comment": "Thanks", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg", "comment": "Sorry professor, but I disagree with 2:55 . 0/0 is not undefined, it is indeterminate. Not the same. 0/0 can actually be anything we want, as any real number can be the solution to the equation \"0x = 0\". Therefore, since \"(x-1)/(x-1)\" CAN be 1 for all real values including 1, it can be safely simplified without having to exclude 1.  If I'm wrong and you have the time to explain this to me, please do.", "votes": "5", "replies": "9", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugwit8oMmGkfrVTw2QR4AaABAg", "comment": "Your intro and outro reminds me of some old educational cartoon I use to watch when I didn't go to school as a child. I love that vibe", "votes": "11", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzFLEboO3XieUbY8b94AaABAg", "comment": "The way he Explains.... Like puts effort in his voice..... I get it Totally.... Humble guy 😄", "votes": "2", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzFR5ASIj0l0wPnwEV4AaABAg", "comment": "Thanks for saving me again!", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugz4pyPbV9kQcGCUasx4AaABAg", "comment": "Never seen a better teacher", "votes": "2", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgyD06T3Z_OHv62l1Dh4AaABAg", "comment": "There is a lot of intensity in your voice, your words directly go into my head.😄", "votes": "9", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxDOtwf0MoCoIflTxt4AaABAg", "comment": "Jesus christ", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzEy0g6d6a_GZyEqLt4AaABAg", "comment": "You are one of the best mathematics teachers l have seen ever. Your videos are too helpful for the students like us.We get immense help from your videos.These videos make our topics quite easier.Carry on.", "votes": "29", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxYd6pvHnXCumoiESd4AaABAg", "comment": "Thank you professor dave! Liked and subbed", "votes": "3", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugw7O3sizWvy-ZNMQrB4AaABAg", "comment": "Thank you Sirrrr", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugy4KlTVry-crjWzRtR4AaABAg", "comment": "Professor Jesus Explains", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugwyg45mLCmYSFpL5T14AaABAg", "comment": "📚great video,keep it up!", "votes": "4", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzHYrzGsyPDumamtAx4AaABAg", "comment": "the   function function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfunction function functionfu", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugwk6UTcYER-0HDw7sZ4AaABAg", "comment": "Well detailed explanation. Wasted 3 hr trying to understand my professor 😒", "votes": "6", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgydPoiPC_aahZNt17B4AaABAg", "comment": "Sir please make a lecture on how a discontinuous function is converted into a continuous function with the use of unit step function.", "votes": "5", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugxrh5JLY0-geRm7v_V4AaABAg", "comment": "bro that's about as simple as it gets.  you're a fucgggging G", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9WYtlkdj2S0", "comment": "Nope, you can't do 0/0 simply because you can't divide by 0 because this implies that 0 has an inverse which is false. Because if there's an x such that 0x = 1 that's absurde because for all x, 0x = 0. so for all x, x/0 is undefined in particular, 0/0 is undefined.  We talk about indeterminate when we are dealing with limits (which we were not in this case)", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9WZau9Ya_0v", "comment": " @manaarikicarpentier6038  No, sorry, you are utterly wrong about this.", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9WZuzzYqiTr", "comment": " @longlostwraith5106  why?", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9W_-E0wRhSk", "comment": " @manaarikicarpentier6038   Because \"0x = 1\" and \"0x = 0\" are two completely different beasts. In the first one, \"x\" can't be any real number. In the second one, \"x\" can be any real number you want it to be.", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9W_6D0Bd0nj", "comment": " @longlostwraith5106  exactly, you can't find any x such that 0x=1 so 0 isn't inversible thus you can't divide by 0", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9W_JL9Af1N7", "comment": " @manaarikicarpentier6038   But \"0x=0\" is different. What \"x\" can you multiply with zero to give zero?", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9W_LYkI8iG4", "comment": " @longlostwraith5106  for all x.   But, that's not my point, If you want to write 0/0 You first have to define what is 1/0 Because If such a number exist, 0/0 = 0 * (1/0) And 1/0 would be the inverse of 0 And we define the inverse by : y is the inverse of x if xy=yx=1 But we can't find an inverse of 0 because for all y; 0y=y0=0≠1 So 1/0 is undefine so 0/0 is also undefine (because 0/0 = 0*(1/0) and 1/0 is undefine and 'something define times something undefine is undefine')", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9W_Up36YhGL", "comment": " @manaarikicarpentier6038   \"Because If such a number exist,\" \"0/0 = 0 * (1/0)\"  How do you come to that conclusion?", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgzLhIz-03CMZBUn6Zh4AaABAg.9Ru7n8HAvwP9W_petmMFr8", "comment": " @longlostwraith5106  by définition,  x/y = x*(1/y)", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "Ugyr8S8HfV4o57Z6kO54AaABAg", "comment": "Hello Professor Dave. At 2:54, how would i know that x cannot be equal to 1 if it shows only the simplified function?", "votes": "0", "replies": "4", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxKPSUKxCpbH5dRrzp4AaABAg", "comment": "very helpful ♥", "votes": "2", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgycNRdJ8zw73fAkbV14AaABAg", "comment": "Thank you!!", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwE9UNY0vJGgPr4gOB4AaABAg", "comment": "Very helpful", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwJm-wYXBp8cAufvpV4AaABAg", "comment": "thank you professor", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzXFT5OOYkeQO-8o1R4AaABAg", "comment": "OMG THANK YOU SO MUCH GOD BLESS YOU", "votes": "2", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzHzVlKDJe2iEztBdJ4AaABAg", "comment": "Life saver", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzSH-VQovvnpv6WCaN4AaABAg", "comment": "Superb sir... I understood in a easy way.. 😇", "votes": "3", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugyhdg4IimWq0O5ecgF4AaABAg", "comment": "so most rational functions are discontinuous functions", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugy6-tlXHzZ3DaAS4B94AaABAg", "comment": "At 3:00 how would I know 1 is not a value if I was just seeing the simplified function of x +1??", "votes": "1", "replies": "2", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzX9laok8ZgtFAqoAp4AaABAg", "comment": "Thank you professor Dave!", "votes": "7", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugy8Q8fHuZNSI2NcV4B4AaABAg", "comment": "If we are clever....", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwKicyo67PrRo7D4wl4AaABAg", "comment": "Sir can u give me any application of discontinuity in science", "votes": "2", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzMad5Hn0-cXMPStJB4AaABAg", "comment": "I'm literally gonna puke", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgyziW0E1Px3r1TOjVJ4AaABAg", "comment": "Dave, isn't the function 1 / x - 1 not graphed as it should be? For example, if you plug x = 2, y gives back 1, and the coordinate (2, 1) is not in the curve.", "votes": "2", "replies": "3", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxjB2Y0Xmu2BKX3DAN4AaABAg", "comment": "Thabk you so much!!! This helps me a lot", "votes": "6", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugzq9X7w7aIxCpkp5ud4AaABAg", "comment": "Your intro song was soo funny, it's like retro cartoon song", "votes": "75", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgwfH7dv4hyoe84FA2V4AaABAg", "comment": "you are Jesus christ", "votes": "4", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgzULJ-Uu8HI-6geVp94AaABAg", "comment": "Your a great teacher amazing exmalantion", "votes": "1", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "UgxZFweESqwVBsJkvlt4AaABAg", "comment": "Do u have any video that teach about limit n continuous...", "votes": "0", "replies": "", "reply": false}, {"vid": "BIQrnx-vvx8", "cid": "Ugyr8S8HfV4o57Z6kO54AaABAg.9IAK6WTtB2u9IjEO9m3PYx", "comment": "Then you won't have to worry about it. :)", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "Ugyr8S8HfV4o57Z6kO54AaABAg.9IAK6WTtB2u9IqoCeb5re6", "comment": "The function is (x^2-1)/(x-1) by default hence, 1 is a point of discontinuity. But, if the function is x-1, there is no restricted domain, i.e x€R. Hope this helps you :)", "votes": "4", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "Ugyr8S8HfV4o57Z6kO54AaABAg.9IAK6WTtB2u9_6SQQWffM_", "comment": "Then x + 1 is the only thing you have to be concerned about", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "Ugyr8S8HfV4o57Z6kO54AaABAg.9IAK6WTtB2u9clR8BrgG5K", "comment": "because if x is equal to 1 then we get x^2 - 1/1-1 which here 1-1 makes the denominator = to 0 meaning the function will become undefined and the function would be discontinuous Hope this helped :)", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "Ugy6-tlXHzZ3DaAS4B94AaABAg.98SMHAK9rRY9BLFPx6J0Ye", "comment": "if we put value 1 for x then it will undefined that's why here 1 cant be the value of x..", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "Ugy6-tlXHzZ3DaAS4B94AaABAg.98SMHAK9rRY9_6SKYPEsOx", "comment": "Then x + 1 is the only thing you have to be concerned about", "votes": "1", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgyziW0E1Px3r1TOjVJ4AaABAg.8zTFFjdK-bo8zTGVbnsOyx", "comment": "hmm yeah it's not perfect, the asymptotes are correct but it's not a flawless representation. i don't really have a way to get the curves perfect as i just paste them together from a stock image of a parabola or something, please excuse the approximation!", "votes": "6", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgyziW0E1Px3r1TOjVJ4AaABAg.8zTFFjdK-bo8zTJhDYF3UJ", "comment": " @ProfessorDaveExplains   totally excusable :) Thanks for your work!", "votes": "2", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgyziW0E1Px3r1TOjVJ4AaABAg.8zTFFjdK-bo97dXy0qu4bu", "comment": " @ProfessorDaveExplains  You should use Manim if you know Python for visualisations.", "votes": "0", "replies": "", "reply": true}, {"vid": "BIQrnx-vvx8", "cid": "UgyAG1-eLtSQJ8EuYDt4AaABAg", "comment": "first", "votes": "1", "replies": "", "reply": false}]