[{"vid": "bKmcRfE3I6E", "cid": "UgzHqsIjjwxevZlz5SZ4AaABAg", "comment": "I viewed the full course, and in my opinion until SDEs it was amazing, but I feel that when they started from Martingale Pricing it stopped to be a scientific frame to be instead a belief system, using somehow math as the argument for justify a betting system instead of using it as a tool for reduce uncertainty: as example, it is all based on the Expected Value gived by the Mean Value, but since distributions are skewed (LogNormal if geometric Brownian motions is assumed, like in Black-Scholes eqn.), you have more chance of finding values below the average than on it (mode<median<mean), this is why I hardly believe that the No-Arbitrage theorem is structered in the right framework, even if the math is right: is like having the optimal theory for playing checkers, but unfortunately the game we play is chess, it is the same gameboard, but the results surely don't going to fulfill your \"expectations\".", "votes": "1", "replies": "", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "Ugxtyb6elvkxn5xKNyZ4AaABAg", "comment": "MIT was way ahead of the curve, teach from home in 2013!", "votes": "8", "replies": "", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "Ugw4TxHR14_aIDIU_Et4AaABAg", "comment": "iam here to see the views and compare it first video number and check whos made it here haha", "votes": "3", "replies": "", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "UgxhalBKmDM80dyAKUN4AaABAg", "comment": "👍👍👍👍👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "UgzEWOjTX1ugdP8D9Kl4AaABAg", "comment": "it is interesting that the first video in this series has over 1 million views and the last has over 10k views", "votes": "13", "replies": "2", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "Ugw9FIT4sa7yiU-ethB4AaABAg", "comment": "Thanks Professor. Understood the first half, but lost way when you started talking about Martingale.", "votes": "3", "replies": "", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "UgjsQ4CBwcXr1ngCoAEC", "comment": "what could be a prospective course after MIT 18.S096 for some one focused about risk", "votes": "1", "replies": "", "reply": false}, {"vid": "bKmcRfE3I6E", "cid": "UgzEWOjTX1ugdP8D9Kl4AaABAg.9IkN8sQnYV19Mo7EGOpx7F", "comment": "just look at the difference between the 1st and 2nd video. 2 mil vs 180k lol", "votes": "5", "replies": "", "reply": true}, {"vid": "bKmcRfE3I6E", "cid": "UgzEWOjTX1ugdP8D9Kl4AaABAg.9IkN8sQnYV19tRl15vOxo3", "comment": "The quality of this video is also a lot poorer😢", "votes": "0", "replies": "", "reply": true}]