[{"vid": "CALYA11terw", "cid": "UgwzPhrPCC-QaDi_dpB4AaABAg", "comment": "Thank you 🙏🏼 for telling us what the extra cellular matrix is❤", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "Ugxop6GrweWxfjQ-YpJ4AaABAg", "comment": "I will always pick the Hexagonal structure of glucose over the cyclical structure.", "votes": "1", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgwzwGrz4X0eke_UIPZ4AaABAg", "comment": "Hello! Are the slides shown in the class accessible on the website?", "votes": "0", "replies": "1", "reply": false}, {"vid": "CALYA11terw", "cid": "UgxdGWeZv5iloxh7ASd4AaABAg", "comment": "\"Nature\" = selection processes, with the most favorable being most amenable to survival and/or reproduction in some way. Better to say that evolution or selection favored, than \"nature\" has in place.  The former implies dynamical, the latter creating the illusion that stasis exists. Stasis does not exist, unless for short periods, short meaning  rate of change relative to a described process All the universe, all \"nature\", all systems, are dynamic, whether \" living\" or not.", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "Ugxx_BtOhUd2r598D2x4AaABAg", "comment": "Thanks, Biotech is my liking :)", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgyCn0aErfqa-AaPNWZ4AaABAg", "comment": "Phe w/Parkinson, ect. 1 of many parts to cell equilibrium 💋💯(🧪🐍♠️) 💍 Ephesians 2:14-18 👆🏻Genesis 1:3,14,26,27 & Genesis 2:7/2in1 🌏🧩🫵🏻🤴🏻👨‍🔧😁 🥂 XO❤️🎉", "votes": "1", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgxMNxc5t9qq8kXahPZ4AaABAg", "comment": "Now if she was really into comedy, at 12:19, she would have grabbed some sort of straight edge to help draw the beginning of the curve, while whistling nonchalantly. 😗😇", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "Ugwg-k1WfJlBtqOpSiR4AaABAg", "comment": "(On Sunday of January 29, 2023).  In the OpenCourseWare of MIT in the Domain of Introduction to Biology (More on the lines of Biochemistry): Carbohydrates and Glycoproteins;  1) Biochemical Activity in both the Eukaryotes and Prokaryote is Energy and Structure (In Particular to the Kingdom Plantea (In the Hexose Structure of Cellulose); 2) Ribose Monosaccharide (Fundamental Carbohydrate made Available for biosynthesis of Nucleic Acid and thereafter DNA/RNA Nucleic Acids; 3) Glucose as the Primary Substrate of Energy Producing By-Products (Pyruvate and Acetyl  CoA) in Energy Biosynthesis for Most Animals and Prokaryotes (Photosynthesis of Plants Yields Glucose and as Such Are Primary Sources of Energy for All Life);  PhD Barbara Imperiali is a marvelous Biochemist in the Guise of a Biologist.  Es geht gut zu Lernen und Lehrer Die Chemie Des Lebens mit Ihnen.  Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgwHCSIqgZtq9c1-0gh4AaABAg", "comment": "The goal is the alchemy of communication with my daughter ❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgwcljOM1sRhRzfebJt4AaABAg", "comment": "She sucks! She doesn’t know how to teach and I’d hate to have her be my teacher. She’s all over the place, and just reciting words rather than teaching and making her students that pay her salary really get a comphrensive view", "votes": "0", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgybXwVr5Ia_6ILvO_F4AaABAg", "comment": "Impressive way of teaching, I will surely follow you ma'm 👍", "votes": "2", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "Ugz_pvzqb4sUE_idZ4t4AaABAg", "comment": "Every time I watch a lecture delivered by Prof. Barbara, I just want to say: I love Prof. Barara for showing us such fanscinating biology with great clarity and enthusiasm.", "votes": "16", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "Ugytzy04hEEvaFLwWYR4AaABAg", "comment": "Man, I wish I had biochem classes with this professor!", "votes": "2", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgwjIo1whPYEP8SwwGl4AaABAg", "comment": "Prof. Imperiali teaches, not lectures. Excellent👌🏼👌🏼", "votes": "4", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgyaG5Ag_HxIeKz-Hm14AaABAg", "comment": "Excellent clear lectures. Really helps to give colour and understanding to the recommended reading. Only complaint is I was unable to find copies of the nice summary slides anywhere on the open Mit site.  I’m using this course as prep for a genomic medicine M.Sc but I think it also provides helpful and interesting education for a wide range of biology related subject. Thanks!", "votes": "2", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgxpD-7xBbQNWY3Ijzh4AaABAg", "comment": "22:20 beggining of the title lecture", "votes": "6", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgzgB9_6nGcoXJOa0el4AaABAg", "comment": "No dislikes! You're good, professor! Thanks for posting.", "votes": "3", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgyO9ZWnJvQW3SD7-GB4AaABAg", "comment": "When I was in the university, I was not interested in biology because it is not directly related to my major, computer science. After graduation, I've got interested in biology and started to study biology. These lectures keep me from losing interest on biology. Thank you, professor and MIT :)", "votes": "3", "replies": "2", "reply": false}, {"vid": "CALYA11terw", "cid": "UgxVImlVwGt_64av4JZ4AaABAg", "comment": "Thank you so much for these videos. I've been watching the whole series.  You are an amazing teacher.", "votes": "17", "replies": "", "reply": false}, {"vid": "CALYA11terw", "cid": "UgwzwGrz4X0eke_UIPZ4AaABAg.A432wnz0H0WA43aNE0p77z", "comment": "Sorry, the slides are not available. What we do have is available on MIT OpenCourseWare at: https://ocw.mit.edu/7-016F18.", "votes": "1", "replies": "", "reply": true}, {"vid": "CALYA11terw", "cid": "UgyO9ZWnJvQW3SD7-GB4AaABAg.9O4I5gfPtnu9Yho0P05kYG", "comment": "Same! ^^", "votes": "1", "replies": "", "reply": true}, {"vid": "CALYA11terw", "cid": "UgyO9ZWnJvQW3SD7-GB4AaABAg.9O4I5gfPtnu9niRDzcJR2Q", "comment": "Me aswell 😁 What other biology courses are you watching?", "votes": "1", "replies": "", "reply": true}]