[{"vid": "DEHsvQ3Ylwg", "cid": "Ugzx-mtWueZ4R9q_KIp4AaABAg", "comment": "When facebook showed a bunch of people sad posts they posted sad posts because they proloy thought that sad posts get more likes because facebook algorithms are promoting sad  posts. 😂", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyOf63xwecM4MkNacd4AaABAg", "comment": "How does the bit about eye contact apply to Asian societies though? In many Asian countries direct eye contact is seen as being rude, like you're confronting the person and ready to fight them.", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz4p-hRNQSY8xTURgd4AaABAg", "comment": "3:07 \"we are the ones running the show.. for now\"", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyORzginDGvDE5pmWZ4AaABAg", "comment": "Makes me want to watch Ghost in The Shell again", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzS3oAC5BDRfx6t8B54AaABAg", "comment": "8:01 why TF would you do that", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxeBCkB5VmWbIlVTmJ4AaABAg", "comment": "Cool, there even psychology in Computer Science.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyZuqv-NYvYL0zYmPJ4AaABAg", "comment": "One thing Humans can do that computer can't is lie. And to a point where they lie to themselves.  Humans can deny the existence of an object say a hat. However that leaves a logical gap. If the hat is not a hat then what is it. In which the human can superimpose it as a plant. And like that a human has turned a hat into a plant. Something both computers, and animals can't do.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugwf2OqL1Tl3XrKsoh54AaABAg", "comment": "The best part was with the guy skyping in his rose petal bathtub.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyAk9XwTY5ZrBOTcGF4AaABAg", "comment": "We're the ones running the show.. for now", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugyj15OcTcAWO8fVFyN4AaABAg", "comment": "That man in the flowers top is killing me 🤦‍♂️🤦‍♂️", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugyuvx8sKyjmx49PpMJ4AaABAg", "comment": "Nature goes on forever for everyone and everything to return as everyone and everything an infinite number of times through evolutionary processes.😢 😢 😢", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwsdVf5ta9IdL52JJl4AaABAg", "comment": "A lot of this is more about social control but presented in a positive frame.", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwuFbCrvSpyYbBJGex4AaABAg", "comment": "- Welcome to our \"Windows 10 course for absolute beginners\". To start, click on the Start button with your mouse. Or press the Windows key. - Where are they? - The Start button is the thing in the bottom left corner of the screen. It does not say Start, or look like a button, but you'll figure it out... - And the Windows key?  - Easy! It has a picture on it. Looks like 4 tiles, or maybe a flag. - Thanks! I don't know what I would have done without you! It's not like this thing has a tutorial... - Of course not! We are in the 21st century! Tutorials are so 1995!", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz6_B_Z650Cm6ql0pN4AaABAg", "comment": "More videos about computer science.", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxnAvFjEEKdVg1nf9Z4AaABAg", "comment": "Since about 95% of posts are mere reposts, is it really surprising that supplying negative posts results in more negative posts?  I expect that this has nothing to do with altering the users' behaviors.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzRCttYKl7_2Oc7ua54AaABAg", "comment": "I'm a psychology and comp sci double major, and affective computing and HRI sound so cool!", "votes": "3", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxMDC_BVhIjOYNHb0h4AaABAg", "comment": "I love that stock footage of the guy in the rose bath. Always amused when I see him.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwRBm8zQ9eNCrThMjB4AaABAg", "comment": "\"Delete? Remove? Trash?\" You know what, command line interfaces are still common, used even by non-technical people, in the form of bots in chat rooms. These bots do various things, some for fun (eg. !roll -> rolls a dice), some have a practical use (eg. !faq shows some commonly asked questions of a software). Even it's simple as that, there can still be design choices that improve usability - the easiest one being allowing aliases (i.e. alternative names or spellings) of commands. I can make my bot delete something if you type \"delete\", and I can make it do the same if you type \"del\" \"remove\" as well.  It'd be very annoying to fail to see your !coins for five minutes only to know the correct command is !coin .", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxndKopZqaRD-JpoS14AaABAg", "comment": "Hmmm.... The mutual gaze thing is definitely valid.  As someone with ADHD it definitely makes a difference if the speaker in a video is addressing the camera, though I've never thought about it before this.", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyH0W8K0zDwO4ArsTx4AaABAg", "comment": "8:48 - David J Malan of Harvard", "votes": "8", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxjXFZQdYcCR1TQ6814AaABAg", "comment": "I believe the only emotional influence a computer should have is to help you know how it works and nothing beyond that. It is a tool to use, not a tool that uses you.", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyiCzfZfrzMY1_OOR54AaABAg", "comment": "sudo rm /boot reboot   The Linux version of \"delete /system32\"", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwFr0_Qr4jPAfop8el4AaABAg", "comment": "This video is more interesting than my HCI course.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwfSLwCbrTovUYB8yR4AaABAg", "comment": "Very Informative!😁🎓", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzzqA6nLWttZvSATDl4AaABAg", "comment": "No wonder why I’m bad at remembering phone numbers, I never separate them in group", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzIqLW8zVLWaVMDwEJ4AaABAg", "comment": "Seems very few care enough about usability. Things were getting better for a bit, but now they're getting worse again.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyWIKVsTgJdVFY_G_R4AaABAg", "comment": "Broadcast quality videos make a great revision method. Not sure if its as learnable from scratch?", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyC-Rgb8rqBFRXvmCF4AaABAg", "comment": "i have seen basic to understand doors say push or pull on them  i think people just dont know how to use doors  thx for this interestingly ha bisky vid i loved this a lot and even with automatic doors you can sometimes push them or pull them so they still have directions on them", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyUmPtNVNvdA0BZ4Xt4AaABAg", "comment": "I hate looking people in the eye. Most people say they are uncomfortable around me because I don't look at them. It makes me a mutual gaze failure. I find it intrusive - I want to give others their privacy and feel ashamed to interfere in their lives.", "votes": "7", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyC3udIThnr69Jpm6x4AaABAg", "comment": "\"A good interface once you gain experience is one that offers multiple paths to accomplish the same task.\" Reminds me of a job I once wasn't hired for: I had an online skills test for Quickbooks and I guess I didn't use the normal path the online test expected me to use to accomplish the ask.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxM8kQ1ExPHsqGvkL14AaABAg", "comment": "I'm afraid I can't afford that, Dave. You see, I'm neither empathetic nor predictable.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxQSQSWbNJvT3evC-14AaABAg", "comment": "Telephone numbers of the Public Switched Telephone Network were not invented to be in chunks for our memory. They are a combination of Area + Exchange + Trunk + Line. The primary consideration was not memorability - it was clarity when spoke, the way we say \"charlie, bravo, sierra\" back when switchboards were operated by an operator. Exchange names were alphanumberic  (my family's number was \"Bixby\" for 14) on the keypad, and area codes were assigned based on time it took to dial on a rotary phone, with Los Angeles (213), New York (212) and Chicago (312) getting the fastest numbers to call. The area code was grouped by function (you didn't need to call it if you were on the same exchange, not as a memory tool.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxEfLnaiHF7LCMV2IR4AaABAg", "comment": "psychology dont exist ,  chemistry and fizics  yo", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwECqUd0BKAqiBCQOd4AaABAg", "comment": "Thank you for the video. I really appreciate it!", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzrMeUMbMVO9geBmX14AaABAg", "comment": "Saw David", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz91fAUkGHB_4L8HwJ4AaABAg", "comment": "Is your gaze augmented carrie anne?", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugzs59NCMRDoJjQpVgp4AaABAg", "comment": "I have recently finished a instruction to HCI (human computer interaction) in my degree. In this video, it did mention, areas I've been tought, a good video from crash course.", "votes": "3", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwAoMvV1A83a80Dy394AaABAg", "comment": "Is there any way to find the source material they use or no? I'm doing an apa paper and need sources lol.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxMaBlVOPPlZcxxU6Z4AaABAg", "comment": "You have to talk to 8-Bit Guy about that yellow Macintosh in the background", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz3ez2gjeO8ko9r2h14AaABAg", "comment": "Multiple choice easier than fill in the blank? What university did you go to? Multiple choice are often considered the hardest type of question (excluding things like essay questions) because they are often designed to trick you, or at least cause you to \"recognise\" multiple answers, and second guess.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugx6Tpv1yFoOF550KlF4AaABAg", "comment": "please make a video about bioinformatics", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugy-KQQPwJ5ZTnwgAkN4AaABAg", "comment": "The man who doesn't exist ^^ (;)", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzUdhArF2rJQRjyDdF4AaABAg", "comment": "jsut by reading the title, I didn't expect this episode to be this entertaining and useful! great stuff", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugwuekf6WcNmD0P0bhl4AaABAg", "comment": "\"So badly design that you just gave up\" - So anything on linux or within the Microsoft office suite of programs.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxVwhRPcfODoUjhUEd4AaABAg", "comment": "I am doing a major in psychology and artificial intelligence. This was some good information", "votes": "83", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw1zhHBpaNx4C9Kuch4AaABAg", "comment": "Grace is bangin' Well done Hank xD", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzqU9FGO1PbMIpywQt4AaABAg", "comment": "As for humans treating robots as if they are human and getting mad when they break social norms; we already have a built in solution to this, pets. If the robots seem more like intelligent pets (they are small, they are kind of cute, and they talk in simple sentences) then we will likely give them more leeway.  When my dog steps on my foot and doesn't apologize I'm upset, but not as upset if my wife did it.", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwzNxBoV4r4Dk96mZZ4AaABAg", "comment": "Yeah this works for the west...what about the east?", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxINDi8N8Y3SokDa954AaABAg", "comment": "I love the shoutout to ZORK.  Oh that brings back memories of my childhood.", "votes": "5", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMkvhJnhRAEBu7a5J4AaABAg", "comment": "Apparently YT comments do not support any line breaks anymore. Leaving no space after the . makes me look like a moron, unable to write properly.", "votes": "0", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwFjiSSQ1nEfIVAdGt4AaABAg", "comment": "This video is RIDICULOUS!You careen in highspeed through a topic called ERGONOMY?You bang bang bang display bang bang bang text on bang bang bang the screen bang bang bang without bang bang bang giving the viewer the bang bang bang chance to bang bang bang read and bang bang bang understand what you display while at the yadda yadda yadda time you yadda yadda yadda dump tons of yadda yadda yadda into the yadda yadda yadda viewers yadda yadda yadda ear? You do not give the slightest chance for the audience to connect the seen and heard information!THIS is NOT ergonomy!This is just a noisy, yet colorful tsunami of merely nothing, a huge pile of waste, that cloggs the brain.Its a big fail.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugwv1gDdmw61OsK-vkN4AaABAg", "comment": "I can tell you one thing about Facebook though.  seeing \"Ad coming soon\" when I'm passing by a video, make's me immediately close facebook, and absolutely mad...", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugzh_5fhXssnM4agK3B4AaABAg", "comment": "This series is sooooo good watched every video in one day THANK YOU!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxtgvOlpe05I-0NA7d4AaABAg", "comment": "I thought the Facebook study was controversial because they didn't have consent to experiment on the users in the first place. Not telling your subjects that they are participating in an expirement is preaty unethical.", "votes": "44", "replies": "2", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyNg-1a1cD-m3wlmAJ4AaABAg", "comment": "When she said that computer can seem to be looking at us, the video pause and her eye is looking at the camera wide open.", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz2co6IX4pqHY0MBZt4AaABAg", "comment": "Love the triangle wave in the background instead of the sinusoid lol", "votes": "8", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugy2ElH09VGdxh8jIjd4AaABAg", "comment": "I wish the developers of ANSYS workbench would watch this. It's a piece of software used for various types of computer simulation. It combined several different pieces of software. The user interface changes constantly from product to product. Even things like which mouse button you use to click drag to rotate the view constantly changes. It's so bad.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxeWYWpWUczzl5RcmB4AaABAg", "comment": "The discussion of gaze made me think: are you going to cover adaptive technology? As an educator I have to think about the blind, for instance, when designing online learning.", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyntBYul4bExQwupVJ4AaABAg", "comment": "Because we're the ones in charge, FOR NOW.", "votes": "24", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxxfOq1ghSRaouuRsV4AaABAg", "comment": "Not directly related to the topic. Mention should be made of the psychology of programming. I just want to mention an interesting book worth reading if you are thinking of becoming a programmer. \"The Psychology of Computer Programming\" by Gerald M Weinberg. It is dated in many ways but the insights on what makes programmers tick and the common management issues still seems relevant.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxVwhRPcfODoUjhUEd4AaABAg.8_w1c5TIwXG8qbvnyOfSno", "comment": "That's interesting. Can u pass some wisdom to me lol", "votes": "7", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMkvhJnhRAEBu7a5J4AaABAg.8_ucUuKXOss8_yRaxrVft3", "comment": "northwesteneer  Is this the new YouTube interface? I am still using the old interface.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxtgvOlpe05I-0NA7d4AaABAg.8_u53TW-SiW8hYxTX84WmM", "comment": "\"preaty\"...", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxtgvOlpe05I-0NA7d4AaABAg.8_u53TW-SiW91ABJjqLHW_", "comment": "I do agree with you. But if they told people about this experiment. It would have affected the results of it.", "votes": "4", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxuZMtCG9WNSlQjwAV4AaABAg", "comment": "That guy in the tub with the Mac makes me so uncomfortable", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxvHpcxTOld7CcaMCh4AaABAg", "comment": "it's \"affect\" with the accent on the first syllable", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UggqT9W2xEUWXXgCoAEC", "comment": "That guy in the bath.", "votes": "1", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugwfn2n-GMci_Z-zhVJ4AaABAg", "comment": "Is it just me or should there be more operator training involved in this technology revolution instead of making \"miracles\" a moron can use?", "votes": "4", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwPqqlOOtJYiTWlQjR4AaABAg", "comment": "Its not blue!! Its purple!! :(", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw1v-TND6ymrVKZteB4AaABAg", "comment": "Wait a minute, am i colorblind or this circle is definitely purple?", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugxpy9APKqGvKwqUX_h4AaABAg", "comment": "Finally! A comsci episode i can understand.", "votes": "4", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxKjq8GkuQ7w_XphsR4AaABAg", "comment": "That was amazing and deserves its own series.  There were a number of things I didn’t know, and I thought I was keeping up to date. Thank you!", "votes": "8", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwYHSDzEYjls5m1zYp4AaABAg", "comment": "I felt I saw the Avengers when the Green brothers showed up 😆", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw19ypGDY_c9dXIWm54AaABAg", "comment": "What's the name of your roomba? I've called mine Dobby ^^", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyKebrASNgHyP5TUb94AaABAg", "comment": "I think that multiple paths can slow down the gaining of expertise. Disconnecting your mouse while using vim will force you to learn effective commands quicker. Really important commands, like ctrl+{Z,C,V} in windows standard, shouldn't exist as menu items, because it enables people to keep wasting their time.", "votes": "0", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugx4yC6IZZjec0hzZwt4AaABAg", "comment": "What? Social sciences are useful to STEM fields and shouldn’t be thrown out or dismissed?!?! Color me surprised.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxMHThU6s3569TmfWV4AaABAg", "comment": "Phone numbers like 0118 999 881 999 119 725 ... 3?", "votes": "0", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyUv5J870ok9eDUrB54AaABAg", "comment": "Since we're the ones running the show...for now...? Who would run the show later?", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzXlcGgsszos2TKp7h4AaABAg", "comment": "Relevant anecdote: I once took a uni course on professional writing for grant proposals, and one of our projects was to basically write an actual grant proposal for whatever field we were studying. As a comp sci major, I went with the idea of using pathfinding algorithms to optimize dynamic workflow layouts in software suites with the goal of enhancing usability and productivity. (Translation: having windows and panels optimally rearrange themselves when you open and close them to maintain your preferred layout without creating overlap for you to have to deal with.) Little did I know that my writing professor had studied human-computer interaction back when she was at uni, and she loved the idea!  I didn't consider it a worthwhile goal, since I was just trying to pass the course (and honestly, I'm not so sure it was actually a good idea), so I never sent the proposal out to anyone. I do occasionally wonder if anyone would fund that research, though; I don't have more than the basic programmer's experience with HCI, though, to really know for sure.", "votes": "12", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxIo35c_lzsWKn1jot4AaABAg", "comment": "This course has grown to be one of the best crash courses ever, IMHO.", "votes": "83", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwnzbKwHKqgcf_dP154AaABAg", "comment": "A trash can or recycle bin as a place to put files to be deleted.  Yet so many users get mad when the files in there are deleted, because that's where they were saving their important documents...  x_x", "votes": "0", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzIRxrDQ9gVa0ks9cV4AaABAg", "comment": "I find command line interface more convenient for everyday tasks.", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzffZUGeobrGK6-LMx4AaABAg", "comment": "Modern GUIs have generally gotten pretty crappy affordances with the rise of minimalism. Buttons no longer have rectangular beveled outlines and even regular looking text elements often offer some interaction. Often times the only way to know if an element is interactive or not is to try to interact with it.", "votes": "28", "replies": "3", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxTvRxnZimD6sLS0PJ4AaABAg", "comment": "The argument that people reveal more personal information in a Computer-mediated communication is a flawed conclusion (or interpretation) of the research. When people use CMC they have to use more detailed emotions (emojis, voice modulation, and turn-taking) as compared to a face-to-face interaction where the information is richer in quality (you could get more information of body cues, clearer facial expression, and contextual information).", "votes": "1", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UggqT9W2xEUWXXgCoAEC.8_suV5hQv998jnKcCMMs1v", "comment": "InsecureWifi don't try it at home!", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyKebrASNgHyP5TUb94AaABAg.8_s85IT2vq88_uba-mAIGM", "comment": "hmm, it still seems possible? But I think there's a big opportunity for misclicks. The big reason windows 8 was hated is because getting your mouse anywhere near boarders just started to make stuff happen, when you didn't want it to.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxMHThU6s3569TmfWV4AaABAg.8_s6-LG6zBU8_yRtObdR9_", "comment": "Coffee Abernethy  The IT Crowd !", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwnzbKwHKqgcf_dP154AaABAg.8_roUWWUwe48_rwAFCjObI", "comment": "If I ever had a client who was saving important documents in their recycle bin, I'd give them a full refund and fire myself from their job. I don't have the patience to work with people like that.", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzffZUGeobrGK6-LMx4AaABAg.8_rczhBqYI78_ver6q09uC", "comment": "Part of that is because we as users are becoming more accumulated to computers and so don't need as many affordances.  The red \"X\" at the top of my browser is no longer red nor does it look like a button. However, since I've used so many programs for so long, I don't need those affordances and understand how it works.", "votes": "13", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzffZUGeobrGK6-LMx4AaABAg.8_rczhBqYI78_wglDPSBas", "comment": "Sure, adults/teenagers who have used computers for a decade have that experience to rely on, but still need to try it out with clickable text elements like the door that has the same style handle on both sides. For kids its worse though, they didn't grow up with all the affordances turned on and I see them \"pushing a door that you need to pull\" in a ton of situations that are clear to me because the GUI used to inform what actions you could take. A worse interface is not an issue for those who already are experts, it's a barrier to become an expert.", "votes": "6", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzffZUGeobrGK6-LMx4AaABAg.8_rczhBqYI78_yQnQtMVHc", "comment": "remuladgryta  I just turned on the option on this iPhone to show buttons and underline links.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxTvRxnZimD6sLS0PJ4AaABAg.8_rcAf0OrY88_rwXr4fGh3", "comment": "I think they were talking about the content of the things that are revealed, not the emotionality of the presentation.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw8NiYlP6i1Ft3WTal4AaABAg", "comment": "David!!", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwmfRKZMy5mStlLiOx4AaABAg", "comment": "Don't you mean \"rubbish bin\"?", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgynK6smvRUO3ZiWymN4AaABAg", "comment": "I wish YOU the host of most scishow space videos than the girl who IS, your voice actually carries intellect and confidence in sharing it. Space girl just... feels like I'm listening to an overly excited but poorly informed 9th grade science fair contestant.", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMQn1WOHGv0qsaU_J4AaABAg", "comment": "Are we just gonna ignore the triangle wave running in the cro in the background?", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyX_H6yHJer-peYoix4AaABAg", "comment": "Please do an episode on open source software", "votes": "20", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyPybe3oF6d8okiyfN4AaABAg", "comment": "Don Norman would call virtual buttons having the appearance of real buttons a signifier - he now uses \"affordances\" for something more specific (I think that virtual buttons can be clicked, even when it doesn't look like it can, would be one example).", "votes": "6", "replies": "1", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg", "comment": "Poor usability = every Apple product ever.  Just yesterday I discovered with my rarely used iPad that I can't just copy a single file from my PC to the iPad without using iTunes to sync files over.  But I no longer have the computer where I did the first sync, so it would delete all the files on my iPad if I tried to do a sync now.  That is effectively an unusable device.  And I have a whole litany of equally disastrous experiences with Apple products.  How is this such a big company with such a popular following when their devices are basically unusable?  boggle", "votes": "40", "replies": "6", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwaAufPZJrEVmFvtv14AaABAg", "comment": "Anyone else think that the Zork screengrab was a subtle Ready Player One reference?", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyzE4cD9f_yblXMmfl4AaABAg", "comment": "Code is also an interface and if you write code, be kind to those who will read it, including your future self.", "votes": "187", "replies": "2", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMP3Vv0COk5-RNNOt4AaABAg", "comment": "How to make eyes appearing correctly pointing to the camera if they are not?", "votes": "0", "replies": "3", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz4GUBjQEej-EAeWZt4AaABAg", "comment": "Very nice subject ! There is a lot more in Donald Norman books about Human interactions with interface, he spoke a lot about errors prevention. For eg, imagine you have a form to fill. Rather than let the user badly fill it and sent it and then send it back on the form page if it has a missing field, prevent sending if there is empty fields. Prevent filling with erroneous data in a first place. This is way less frustrating for the user... and safer ! :P For the door example, Don explained that door which are on the street should open to the outside, so that people can escape fire inside the building faster and without having to think. Good error preventions can save lives :P Very good reading I recommend !", "votes": "12", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugx-LjQz4P2MxzRqIyJ4AaABAg", "comment": "Way to go Carrie Anne!", "votes": "1", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgztoHODEcjClSuZXY14AaABAg", "comment": "Interesting map re. the light to dark recognition example - looks a strategy for Democrats might to be to smuggle vegetables in to red states (or Republicans to steal them from blue states though that sounds harder...)", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz9OyWsvouMjnaaiZx4AaABAg", "comment": "To error is human. git use to it .", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg", "comment": "Video conferencing with a laptop in a bath...  Ballsy or stupid?", "votes": "110", "replies": "11", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz6Zq9LdFmhjJljjSR4AaABAg", "comment": "The Facebook study wasn't controversial because of what it showed. It was controversial because Facebook didn't even do a minimum of ethical approval. Participants did not consent to a study (at least not knowingly). So while it was legal (because the law doesn't care about whether you are aware of what you agree to) it was definitely not ethical. TL;DR: The FB study would have had the researcher kicked out of any accredited school anywhere for ethical violations.", "votes": "242", "replies": "4", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyqvvIs6K2S2g9yQ5Z4AaABAg", "comment": "Did she call The purple blue", "votes": "29", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxRANuYnPwJRissijd4AaABAg", "comment": "34th!", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzE7HlWQZbR8DJFuJF4AaABAg", "comment": "Any science or computer themed book suggestions for an 11 year old who is really into all things Science and Technology? I was thinking something from Carl Sagan or Nick Bostrom but I'm not sure if they are going to be over her head...", "votes": "0", "replies": "2", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw_uM59jYccNF3h3zx4AaABAg", "comment": "<3 knurling", "votes": "2", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyPybe3oF6d8okiyfN4AaABAg.8_r-R6BTZUB8cNINxLXMNa", "comment": "Exactly! An affordance is a \"can\" relation between a user and an object (\"I can drag this to change its size\"). A signifier signifies the affordance, but isn't necessary to be able to afford it.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg.8_qukS19Q968_rChvGo8cK", "comment": "FYI that was steve jobs idea. and people still praise him, if steve wozniak was given more chance apple would have been way better/common.", "votes": "11", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg.8_qukS19Q968_rYx181_-4", "comment": "Apple optimizes for the most common use cases entirely within their ecosystem, and nothing else. I imagine that as long as you buy into their ecosystem fully and stay on their rails, everything seems great and they optimize the hell out of it. I had the displeasure to have to use a mac to do software development once and I couldn't believe how terrible it was. All the seams start to show immediately as soon as you go outside of the normal happy path that my mom would use it for. Like you, I still have no idea what the hell their appeal is.", "votes": "13", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg.8_qukS19Q968_rdDY3gfYq", "comment": "There are non-apple software that solve this problem. iTunes is possibly the worst of the programs that offer iTunes' functionality.", "votes": "4", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg.8_qukS19Q968_rvhz1zDeY", "comment": "I don't like Apple, either, but in your case, the work-around is to use a third-party app like CopyTrans to do your sync.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg.8_qukS19Q968_ryPW-OMMs", "comment": "The thing about Apple is that they want their customers to use only Apple products most of the time so the PC <-> iOS or Android <-> macOS interactions are made a tad more complicated. If you were to use a Mac and an iPhone then the file transfer is rather easy, just open AirDrop and drop the file there.", "votes": "6", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxXS0khfaAFY0Qv1Vl4AaABAg.8_qukS19Q968_tK642600X", "comment": "well your a classic idiot who thinks he's a genius,", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyzE4cD9f_yblXMmfl4AaABAg.8_qp9KMKQlm8_rwe6sT4Ca", "comment": "Comment. And if you name all your variables \"a\", \"b\", \"c\", \"something\", \"anotherThing\", etc., you're fired.", "votes": "24", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyzE4cD9f_yblXMmfl4AaABAg.8_qp9KMKQlm8rqOs2sNmRW", "comment": "Also people who never comment anything should be banned.", "votes": "5", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMP3Vv0COk5-RNNOt4AaABAg.8_qoMshuGvq8_rwkN4es04", "comment": "First detect the eyes (pretty simple these days). Then warp the image so the pupils and irises are rotated towards the camera.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMP3Vv0COk5-RNNOt4AaABAg.8_qoMshuGvq8_tHULpYbke", "comment": "IceMetalPunk thanks, makes sense", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwMP3Vv0COk5-RNNOt4AaABAg.8_qoMshuGvq8_yS3BmZqT6", "comment": "Jane Black  Then the camera will looking be looking up the person's nostrils.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV8_qyNMzE-U2", "comment": "Both", "votes": "12", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV8_qzo-lo5t3", "comment": "Depends, is it waterproof?", "votes": "5", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV8_rvbmTSo6I", "comment": "I agree with Rodrigo: it's both. And it gave me a mini panic attack just seeing it. That poor laptop... if only it was more self-aware, it would be terrified.", "votes": "9", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV8_tJBHfx11K", "comment": "He disturbs me. I see him every episode", "votes": "6", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV8aIpOaEXiex", "comment": "I like the rose petals tho", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV928HvA9T09s", "comment": "The guy is a legend.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV94bP0DMO3-0", "comment": "He’s practicing mindfulness, but also kinda asking for it.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV97rTthcOlaX", "comment": "ballsy is most times stupid", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV98gZHUEojyh", "comment": "2 years later, its now necessary", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV99-lxXzMdPO", "comment": " @xdtimetoastergaming273  xDdDXxD", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzdkfATkVdj7pjrrUd4AaABAg.8_qkWu-LgaV99s6xnWHtXm", "comment": "Maybe he needed an excuse to buy a new one", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz6Zq9LdFmhjJljjSR4AaABAg.8_qirRpJaiG8_qp2c9HvnA", "comment": "treymedley would it have been perfectly ethical for facebook to have done those same things to people without trying to understand what they were doing?", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz6Zq9LdFmhjJljjSR4AaABAg.8_qirRpJaiG8_tDTno4j5K", "comment": "treymedley Although it may have been unethical it's not as unethical as the Tuskegee experiments for one example of real unethical experimentation. Also observation bias might have tainted participant posts because they're unconsciously altering their posts because they their activity will be monitored by the researchers. If anything this study has more external validity than most ethically conducted social media studies because of this fact. If you don't believe you're being studied you act naturally it doesn't take a masters in psychology to understand that. Social media is the ultimate tool for social manipulation, that and it's a profitable business since users aren't your customers; advertisers buying access to personal data is more unethical and yet it's legal. Despite this being public knowledge major segments of society still use facebook like the mindless sheep they are. Buying the brands they're coerced into thinking they chose to buy on their own and the same can be said about their changing views on social/political issues. You think you chose your values but they're the result of selective exposure to a mix of outrageous stories that de-legitimize one side of an issue while being exposed to equally provocative stories that frame the alternate side of the issue in a positive light or as the victim of the other side. But this isn't unethical, it's facebook's primary business model. Paranoia doesn't mean someone is crazy, paranoid people only appear crazy if they're wrong. Question everything. Irrefutable evidence exists but lots of \"evidence\" is hidden only to be revealed by whistle blowers or anonymous individuals who have their own motives for revealing truth. Questioning the legitimacy of the FB study because of a lack of consent is noble in theory but it's also a great way to ignore the important fact that it reveals about human behaviour: many ideas we think we mad won our own may be the result of manipulation designed to make us think we're the ones making our own choices and that we're too smart to be manipulated.", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz6Zq9LdFmhjJljjSR4AaABAg.8_qirRpJaiG8_tDmLfXVpJ", "comment": "treymedley TLDR: Hubris is an intellectual exploit that can be used to inject and/or promote whatever idea/behaviour the manipulator desires. The FB study may not have followed proper procedure they didn't compromise the collected data, so don't ignore the conclusion.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugz6Zq9LdFmhjJljjSR4AaABAg.8_qirRpJaiG8bnQ7hwXjbE", "comment": "It's not evil, it's effective", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzE7HlWQZbR8DJFuJF4AaABAg.8_qh_n7FxOE8_qjRIyBgR_", "comment": "Well, there is Carl Sagan's novel \"Contact\". Not so much science, but it includes other issues that might come up if we discover that we're not alone in the Universe.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzE7HlWQZbR8DJFuJF4AaABAg.8_qh_n7FxOE8_qkQy2aUXe", "comment": "Not sure about books but I can give some YouTube channel suggestions if that's helpful.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg", "comment": "See that tiny dislike bar? This is what happens when you speak about real science. Please stick to it.", "votes": "7", "replies": "20", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxcHRKTEXHvmDjB1aJ4AaABAg", "comment": "Speaking of a bad GUI: Facebook (in general) settings (in particular)", "votes": "54", "replies": "2", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg", "comment": "ughh she's so god damn ugly", "votes": "5", "replies": "12", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxWXNqMz4XeTNw5ljd4AaABAg", "comment": "1 like = 1 Power Up in programming skills ❤️❤️", "votes": "30", "replies": "2", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugzsr9r2_SVeYltDcrh4AaABAg", "comment": "I couldn't help but stare into her left eye... drugs man", "votes": "4", "replies": "3", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw3jtBU-YCJym7NiC14AaABAg", "comment": "Humans will soon be obsolete.", "votes": "2", "replies": "3", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugy24LjQEzBNKmq2CId4AaABAg", "comment": "Hope that happens!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzO-HLHOJ3ZcwWwvF54AaABAg", "comment": "I like psichology and computing and what to do both!!!", "votes": "6", "replies": "3", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgyfIMkcEkuzqK1V4c94AaABAg", "comment": "Yo yo yooo", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwdiGaGJ4zaMfXI9u14AaABAg", "comment": "Twitter is good to", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgwoVCfqm3rnruhTb794AaABAg", "comment": "im stupid", "votes": "0", "replies": "", "reply": false}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_qzE8682bn", "comment": "...as opposed to?....", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_qzOmGPzaC", "comment": "Look up the controversy around their recent sociology series.", "votes": "3", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_r9xiKvpzu", "comment": "Lucas Melo, quite the opposite in fact. Crash Course suddenly decided to pander to the snowflake crowd, in their sociology series. The dislikes went through the roof.", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_rUexekqEV", "comment": "TheZapan99  Sociology naturally deals with controversial topics. Yes sometimes it takes a stance as science sometimes does. It is the study of human interactions and structures so it may seem very political but that wasn't the goal.", "votes": "7", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_s5ItnSdfp", "comment": "Likes and dislikes are not an indicator whether the science behind the topic is right or wrong.", "votes": "7", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_sFDeq8x0R", "comment": "And yet strangely the dislike bar seem to be linked to the amount of pseudo-science they put in their videos.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_sILoiXsL0", "comment": "Lucas Melo yep the planets going around the sun was pseudo-science at one point", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_sL6WrvSPX", "comment": "washing your hands and mosquitos transmitting diseases was literally considerate pseudoscience (hygiene and microbiology)", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_srfcBtzs6", "comment": "TheZapan99 admdkodkdj", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_tBx-G4C0I", "comment": "A big thank you to everyone here who defends science against detractors who want to dismiss it as not real when it goes against their worldview! Crash Course can be proud to have people like that.", "votes": "3", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_thEoTfRdo", "comment": "The Crash Course sociology series had statements like \"I think we all agree\" and \"it is generally accepted\" without even citing sources. In other words, thinly veiled militantism, and heavy-handed PC hogwash. You don't get to call yourself anything else than a sneaky activist, sir.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_trggG6yRv", "comment": "I'd hardly consider psychology real science.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_tsB1ULf79", "comment": "fortunately you are wrong, queen of insects", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_tu7miJ6ya", "comment": "Is that an absolute fact? Even though psychology is mostly just speculation?", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_tw7GGghs2", "comment": "and what make you think it is just speculation, have you ever stopped to actually study it?  yes it is a fact, you don't get to be ignorant of a subject and proceed to completely dismiss it based on your ignorance", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_tx_afkyZS", "comment": "What makes you think I've never studied it? I even have a family member who is schizophrenic. You see, she has this way of using logic to try and fill in the blank when she is unsure of something. She ends up building upon her conclusions until she has created her own reality of what absolutely must be happening and there is no telling her otherwise. This happens until she has a break with reality and thinks the Russian mafia is trying to get her, at which point she has to be hospitalized.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_uRe9FO2Nk", "comment": "Schizophrenia has nothing to do with it. Which shows you've never studied sociology. What she says is based on more than a century of studies to test various theories and hypotheses.Same as any other science. Nothing she says is really controversial for those who know the science behind it (except when she's pointed out that something is controvercial), Just because you don't understand it doesn't mean its not true.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_uaF2RMmcz", "comment": "there's one thing I can actually say knowing history.   If everyone ALWAYS agrees with you, you aren't doing something right.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8_ub1nLuc0N", "comment": "Lucas Melo,       hmm, I like how over the course of an argument, you've pitted yourself as superior to someone with a different opinion. In the process you've basically turned to ad hominem calling the one you argue against ignorant and un-knowledgable instead of actually trying to argue your point.  Isn't this blatant ignorance of the related field of philosophy describing logic?", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzKTZlobU4yom4bM2h4AaABAg.8_qh8bnpCdx8aQlKsIChDi", "comment": "+Queen of Insects  Since all human learning involves heuristics (using logic to fill in or compensate for blanks), people nest their conclusions into other conclusions, and resisting opposing views to one's observations... That sounds quite normal.  The Russian Mafia thing may not seem normal but, given the amount of suspicion, terrible events portrayed in media, and how often it could seem that people are watching us... That could be kind of normal, though usually there is enough evidence to discredit that for non-schizophrenic people.  Psychology is useful and has quite a bit of great, scientific understanding behind it. However, there is point (like in quantum mechanics) where there is a breakdown in defining things (position and motion of an electron) like classifying someone according to the DSM.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxcHRKTEXHvmDjB1aJ4AaABAg.8_qf5HfH9xU8_rF9LYeyhR", "comment": "They're bad on purpose. They don't want you to change your privacy settings ;)", "votes": "20", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxcHRKTEXHvmDjB1aJ4AaABAg.8_qf5HfH9xU8_srjXdLfzv", "comment": "Paul JAPP jmtmdwdad", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_qfZ923Ixw", "comment": "I think she is perfectly charming, even cute.  Different strokes.", "votes": "15", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_qgSWin2i7", "comment": "Torudro and this is relevant why?", "votes": "15", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_qgp9pqS6E", "comment": "Plenty of over irrelevant comments, and you only choose to comment on mine.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_qiK0O9mQf", "comment": "She is a good host, very engaging. Please delete your comment.", "votes": "13", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_qix0TDGfa", "comment": "Torudro because this deserves being corrected.  If you think you can provide better, more attractive content than crashcourse, then why don't you make it yourself.", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_qjDjqbSdf", "comment": "Her intelligence is sexy tho", "votes": "5", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_r5G6_AAVV", "comment": "Torudro, of course you'd rather say that online than in person.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_rDZjFL5Rs", "comment": "@T1H2T3 - Obviously I meant ugly as in her physical appearance. Of course a human is not \"only body\" in your sense. You are trying to make it seem like I said she was stupid/uncharming with her personality. I just pointed out her physical looks.", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_rDlc54NLt", "comment": "@Orson Welles - I'd say it in person, too. Trust me on that one. Don't assume that just because I'm saying this online does not mean that I wouldn't say it to her in person. I like the assumption to try to draw about some sort of non-existent agenda of mine those, ha.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_sZ9AqlUZk", "comment": "Torudro i admire your consistency and honesty.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_vjMvH7dNW", "comment": "@T1H2T3 I admire your quote.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzN_GbGgHCTpQSoZ2Z4AaABAg.8_qea8zWmoQ8_yRO5iuNNB", "comment": "We will get you drag queen to host a series next time.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxWXNqMz4XeTNw5ljd4AaABAg.8_qeXvwzeo38_qvfPajYYc", "comment": "Oscar Alsing oops I just lost a programming skill point.", "votes": "6", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgxWXNqMz4XeTNw5ljd4AaABAg.8_qeXvwzeo38_v4tGj8FUU", "comment": "Shut your Bitchass up.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugzsr9r2_SVeYltDcrh4AaABAg.8_qe6qExVE-8_qgUJ4z3st", "comment": "what is wrong with her eyes?", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugzsr9r2_SVeYltDcrh4AaABAg.8_qe6qExVE-8_qgpN509Ng", "comment": "The drugs I am currently on caused me to stare at one of her eyes is all. I think if I had to say her left eye is kinda wonderful actually", "votes": "1", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugzsr9r2_SVeYltDcrh4AaABAg.8_qe6qExVE-8_rMkczgHVv", "comment": "Your left or my left?", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw3jtBU-YCJym7NiC14AaABAg.8_qe61uecbN8_qhNnNhiyu", "comment": "They already are and have always been.", "votes": "2", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw3jtBU-YCJym7NiC14AaABAg.8_qe61uecbN8_qjNznbgp8", "comment": "To whom?", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "Ugw3jtBU-YCJym7NiC14AaABAg.8_qe61uecbN8_qjni8nfr9", "comment": "We could be obsolete to AI as Elon Musk fears. We're also not nearly as necessary for our own survival anymore. Most of our efforts are put towards buying luxuries.", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzO-HLHOJ3ZcwWwvF54AaABAg.8_qe-jOUU0m8_qeTeMBCma", "comment": "Boško Nikčević same cause they are really are the same. Predictable reactions am I right", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzO-HLHOJ3ZcwWwvF54AaABAg.8_qe-jOUU0m8_qfBU2KXma", "comment": "Become an UX designer", "votes": "0", "replies": "", "reply": true}, {"vid": "DEHsvQ3Ylwg", "cid": "UgzO-HLHOJ3ZcwWwvF54AaABAg.8_qe-jOUU0m8_rw3y-ThNe", "comment": "I agree with the enjoyment, but I don't personally want to do it for a living. I'll stick to just the programming side of things :) But if you really want to combine the two fields in your career, you can get into UX design or human-computer interaction research :)", "votes": "0", "replies": "", "reply": true}]