[{"vid": "E8BihX2hGss", "cid": "Ugyw1QAokv8u120Oj_N4AaABAg", "comment": "Protozio loved sulfure fixing thing", "votes": "0", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgzMESZpLxi13vZ8lfZ4AaABAg", "comment": "There were not really liked sulfure", "votes": "0", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "Ugx3B7eK5NuxHm4uzsh4AaABAg", "comment": "How many Indian are here", "votes": "2", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgzY73XQCYn-4zNrciJ4AaABAg", "comment": "I am so impressed by the quality of the lectures by prof Imperiali!", "votes": "5", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "Ugzg-lUo6jmep-4mcA94AaABAg", "comment": "The fact that I am listening it after COVID-19 and it looks like she is talking about it an year earllier i.e., 2018.", "votes": "7", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgxzJi7DX27dPxp0FrJ4AaABAg", "comment": "👍👍", "votes": "0", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgyXOpYeoPP-PibPE954AaABAg", "comment": "Amazing lecture mam", "votes": "0", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgxzjYf4MUN0siANU854AaABAg", "comment": "21:00 the spanish flu originated from Asia (as almost every single history recorded flu) if i recall correctly the logs. However, as we have seen with the re-emergence of H1N1, it wasn't that scary. The conditions at that time both in terms of quality of life and healthcare were quite mediocre.", "votes": "0", "replies": "4", "reply": false}, {"vid": "E8BihX2hGss", "cid": "Ugz8Gs2M-0UKUx6NQux4AaABAg", "comment": "I tested positive to genital herpes virus (HSV 2) in 2002. I was having bad outbreaks. EXTREMELY PAINFUL. I have tried different kinds of drugs and treatment by the medical doctors all to no avail. Three months ago I was desperately searching for some helpful remedies for genital herpes (HSV 2) cure, when I came across some helpful remedies on how Dr. Sani have helped so many people in curing genital herpes (HSV 2) with some herbal treatment, I believe too that there is someone somewhere in the world who can cure herpes completely. In the past 2 months, however, I've been following his herpes protocol Via (perfectherbalcure@gmail.com) or WhatsApp: +2348118184266 and it stopped all outbreaks completely! To my greatest surprise I was cured completely by following the protocol of his herbal medicines. Don't be discouraged by the medical doctors. There is a cure for HSV with the help of herbs and roots by a herbal specialist called Dr Sani, he is so kind and truthful with his herbal treatments. Kindly contact him for more information Via Email: perfectherbalcure@gmail.com or WhatsApp on: +2348118184266 You might be lucky as I am today.", "votes": "0", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "Ugw8-BF8USv_3IR94HZ4AaABAg", "comment": "At the risk of going off topic for a moment, it's funny to see the forest of various adapters and dongles required to be close at hand when you're working with a new and \"improved\" Apple laptop. That functionality and adaptability used to be built-in.", "votes": "7", "replies": "1", "reply": false}, {"vid": "E8BihX2hGss", "cid": "Ugxd1AqMEY7zj8PSIV54AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "5", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgxPWvVUHJu9Ayomyz14AaABAg", "comment": "I am so happy right now that I am cured from herpes1&2 by Dr.Oko-Oboh, , he is legit,  understanding and supportive , he sent a package to me from Nigeria to Germany through DHL after taking so many drugs and treatment from different hospitals and all the doctors kept saying same thing to rub . Not until I got an email from my dad friend to contact Dr.Oko-Oboh, now I am  totally free from that deadly DISEASE. I thought all hope was lost. Don't die in silence Email; doctorokooboh234@gmail.com, OR WhatsApp: +2349131601786...", "votes": "0", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgynY3spdJKU00upi1V4AaABAg", "comment": "I like the way you teach 😻", "votes": "8", "replies": "", "reply": false}, {"vid": "E8BihX2hGss", "cid": "UgxzjYf4MUN0siANU854AaABAg.9SvMhh82aCx9WuPB9pH2m0", "comment": "That is a false claim that is not backed up by any scientific studies. No one 100% knows where it originated from, so I don't see any reason for you to claim as if you know the answer.   Most scientists theorize that the place of origin is likely to be in the United States, specifically from a US Army training camp, as there is consistent data linking its origin to the training camps. Other virologists and epidemiologists linked it to British Army camps in mainland Europe, so this is still a disputed topic. The origin is unknown, and there are a few hypotheses surrounding the virus' origin, but it is well established through research that it is unlikely that the virus originated from Asia.", "votes": "0", "replies": "", "reply": true}, {"vid": "E8BihX2hGss", "cid": "UgxzjYf4MUN0siANU854AaABAg.9SvMhh82aCx9WuecKF83d6", "comment": "It isn't, and to this day, we still calculate genetic drift mutations in seasonal flu based on samples from Asia.  Genetic shifts also occur in asia where the majority of farms house waterfowl and pigs and where the conditions are deplorable enough for mixing.  I don't know what you think \"British army camps in mainland Europe\" is, but sounds like failed propaganda. We use the term \"Continental Europe\"... And as usual, microbiology wins because no matter how much you want to wash history, you can't, because microbes can't lie...", "votes": "0", "replies": "", "reply": true}, {"vid": "E8BihX2hGss", "cid": "UgxzjYf4MUN0siANU854AaABAg.9SvMhh82aCx9ZAq8XCZJ76", "comment": " @philzan3627  1. Genetic drift has nothing to do with the origins of a virus. And if you want to play the smartass game, then the proper term is called antigenic drift. Both has more to do with the evolution of an organism or a virus than the origin itself. The response is even more brain damaging when you know what genetic drift means. Genetic drift is not something that you \"calculate\", it is something that you observe. For example, there is one species of squirrel with two phenotypes: black fur and brown fur. One day, a group of poachers eliminated 90% of the squirrels that exhibit the black phenotype, and as a result causes a loss of genetic variation in that population. This is what genetic drift is, but more specifically, it represents the bottleneck effect. Bringing up genetic drift in an argument that questions the origins of a virus poses absolutely NO relevance.   2. \"Failed propaganda\" If scientific hypotheses are propaganda to you, then I'm afraid I can no longer continue this discussion with you. It's obvious you are politically motivated behind that statement, and there is no reason to include unnecessary politics that again, poses no relevance to the topic at hand. Do note that \"British army camps in mainland Europe\" came from an article published in Oxford Academic. And not to mention, a quick google search says that \"Continental Europe, also referred to as mainland Europe\", so I really don't know what you're smoking.   Have a good day; no point in continuing this discussion when you include information that poses no relevance to your original statement. This also serves as a reminder to do your research, because clearly it's lacking.", "votes": "0", "replies": "", "reply": true}, {"vid": "E8BihX2hGss", "cid": "UgxzjYf4MUN0siANU854AaABAg.9SvMhh82aCx9ZHH-mv4fTt", "comment": " @tomato-v8x  Oh ok buddy.", "votes": "0", "replies": "", "reply": true}, {"vid": "E8BihX2hGss", "cid": "Ugw8-BF8USv_3IR94HZ4AaABAg.9Ig_tXINR7V9PbszPAXFLS", "comment": "haha i had a good chuckle as well", "votes": "0", "replies": "", "reply": true}]