[{"vid": "EJ6Sjn1c04Y", "cid": "UgxXap0lu2F883DL_dV4AaABAg", "comment": "organoids are cool", "votes": "0", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgxHFEdlSD40h9MUV754AaABAg", "comment": "(On Wednesday of February 8, 2023).  Stem Cells, Apoptosis and Tissue Homeostasis: 1) Epithelia (Histologically significant Tissue Type) and Epithelium Specific to the Intestinal Mucosa (Most Turnover Rate of all Tissue); a) Regeneration Rate at about 4-5 Days (Gastric Mucosa possible Daily); b) Highly Specialized Tissue Type and Therefore Differentiation Investigation Mechanism is possibly highly lucrative in Outcome (as Yamanaka Showed in 2012); c) Columnar Intestinal Mucosa (Villi, Crypts [Intestinal Stem Cells Growth Area], Microvilli and Enterocytes et al) is distinctly Structured as Parenchymal Tissue And Function are arranged along an Apical-Basal Polarity (similarly to Axon-Dendrite Polarity of Neural Tissue in Neurons) along with a Juxtacrine Adhesion Proteins critical and specific to Epithelium; d) Tissue Homeostasis State would be Rapid Regeneration for A Rapid Turnover Rate (Death Rate); e) Adult Stem Cells (Different from Developmental Stem Cells or Embryonic SCs [Totipotent and Pluripotent Capability]) are organ specific and Multipotent/Pluripotent Potency would be able to differentiation into a) Enterocyte, b) Enteroendocrine Cell Type; c) Goblet (Mucus Secreting Cell), Paneth Cell and another Stem Cell (SC) in order to maintain a Regenerative Capacity with a Niche (Site of Stem Cell Renewal usually towards the Base); e) Terminally Differentiated Cells within the Intestinal Epithelium Aforementioned; f) Cytoplasmic Membrane Markers are the Definitive Molecular Mechanism of Typification of any Cell; g) Cytokine Signaling functionality to Regulate differentiation and Specialization (Wnt Ligand [Frizzled Receptors are Specific to Wnt Ligand] for Differentiation via Wingless Dorsophila Mutant Investigations);  h) Regulatory Logic via Transcription Factor Kinetics (Enzyme Kinetics) of Beta-Catenin Degradation Signaling by Poly-ubiquitination (E3-Ligase Recruitment) and Proteolysis (Destruction Complex) thereafter, a non-Developmental Gene Expression while Positive Wnt Expression goes on to further Gene Expression therein (Stabilization of the Protein Complex Molecular Mechanism); 2) Apoptosis (Death Signaling of Functionality or Programmed Cell Death); a) Cellular Morphology is Characteristic in Shape, Size and Molecular Staining Properties (Pyknosis, Blebbing are examples); b) DNA Damage or Repairing Incapacity will Stimulate Signals for Apoptosis; c) Survival Signals are opposite to Death Signals (Signaling Progression of Cell Cycle or Other Mechanism); Nf-kB signals inflammation and is understood as a Survival Signal; d) Growth Factors (GFs) are protein Ligands specific to Cell Survival (growth and Proliferation Mechanism Activation); e) Transit Amplification is rapid replication and Mitoses Acceleration (a Risk Factor for Malignancy); TBC....PhD Adam Martin, es gut ist zu wachsen und verwachsen aber es muss zu ueberleben nur sein,  Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgysZgohHRLIFgPoH3Z4AaABAg", "comment": "Grow your own body parts Its your body . Why Die.", "votes": "1", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "Ugyc1LKQmyG1IcLbPkV4AaABAg", "comment": "Phase out the chalk boards. MIT 🙄", "votes": "0", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzXwEEzNQ-mEoPVB3l4AaABAg", "comment": "YOU might want to review David Schmidt's new technology where he used basic single cell organisms and frogs, removed limbs, put them in this: Double Helix Conductor (produces a novel blend of electromagnetic and non-electromagnetic fields to improve the speed of wound healing) and within 1 day, not 14 as was previously noted in other lab experiments, regrew a fully functioning limb. Trust me, if this man gets his way...humans will be next!", "votes": "1", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgxTGfmqqT4zzC3XeWR4AaABAg", "comment": "network", "votes": "0", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzxgTpmucTMs0tfAzl4AaABAg", "comment": "Heavy chalk hand. Thorough lecture.", "votes": "1", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "Ugx6UEFYogrmpZqvSWV4AaABAg", "comment": "nicely explained thank you sir.", "votes": "1", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzN04msWqCDyXlJXa14AaABAg", "comment": "Thank you Professor Martin for clarifying stem cells and apoptopis. Is there any lecturer regarding relationship regarding HIV, cancer with apoptosis", "votes": "3", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzO8NN_IeuojmMM3294AaABAg", "comment": "interesting lecture, thank you so much prof and the one who filmed this video", "votes": "4", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgxDELJeWFIPPS0gxc94AaABAg", "comment": "Awesome lecture…thanks!!", "votes": "3", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzBNfA4dGYAmXiSoOZ4AaABAg", "comment": "To the camera operator, or anyone else in a similar position: please stop zooming in and out, and tracking all over the room, it’s not a feature film. Your job is to absorb and transmit information, the longer one is exposed to the information without transition, the more likely it is to be absorbed and transmitted", "votes": "1", "replies": "3", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgyK-3taBBiaJC0EWUN4AaABAg", "comment": "if every class was conducted in this format, the class would only need to be taught once, MIT is really somthing else :)", "votes": "22", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzKlzlEP6Tcxgje9u94AaABAg", "comment": "The adventurous atm neurochemically punch because aries positionally reduce past a helpful refrigerator. utter, embarrassed multimedia", "votes": "0", "replies": "2", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzLnRIlD2cRQOwy2fZ4AaABAg", "comment": "👍👍👍👍👍👍👍👍👍", "votes": "0", "replies": "", "reply": false}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzBNfA4dGYAmXiSoOZ4AaABAg.9Oams67or8m9TT1XXy1Z3J", "comment": "I don't think a human is doing that... It's camera tracking software 😆", "votes": "0", "replies": "", "reply": true}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzBNfA4dGYAmXiSoOZ4AaABAg.9Oams67or8m9TT2oA3zbkH", "comment": " @nemcaz , I’ve seen MIT lectures on this channel where one camera records the students and there are multiple camera operators in the student area, not to mention the camera operators who are filmed onstage recording experiments close up  Don’t be so rude to laugh at others, it’s rude and will get you into trouble down the line", "votes": "0", "replies": "", "reply": true}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzBNfA4dGYAmXiSoOZ4AaABAg.9Oams67or8m9Ter13EDjYM", "comment": " @user-nm9fk7cb4b  Ah sorry that my comment offended you. My apologies, I should have been more sensitive to your emotions.  Rest assured that I'm not laughing at you. I'm laughing at how absurdly the camera is tracking, and comparing it to the type of tracking you would get from software (which conventionally does not do well in tracking objects, although newer software has improved significantly).  It was meant to be humorous, but it seems that it was taken in a negative light. I hope you can see what I was trying to say now. Sorry for the confusion.  p.s. I understand you, sometimes I take things too personally too. Especially nowadays with online communication, it can be quite easy to misinterpret words on a screen.", "votes": "0", "replies": "", "reply": true}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzKlzlEP6Tcxgje9u94AaABAg.9KMFmfs4Psd9_Wm9H2B1i-", "comment": "ha ha...you guys and your codes...people decipher these constantly.", "votes": "0", "replies": "", "reply": true}, {"vid": "EJ6Sjn1c04Y", "cid": "UgzKlzlEP6Tcxgje9u94AaABAg.9KMFmfs4Psd9roSSkf3v0M", "comment": " @thatguy-fq4mz  whats the code", "votes": "0", "replies": "", "reply": true}]