[{"vid": "ERIToctYUcQ", "cid": "UgxTGxeFj1P-8OVC0LF4AaABAg", "comment": "Full 1 Hour Video AC Circuits:            https://www.patreon.com/MathScienceTutor\r Direct Link to The Full Video:              https://bit.ly/3vEFYjI\r Physics PDF Worksheets:                   https://www.video-tutor.net/physics-basic-introduction.html Final Exams and Video Playlists:       https://www.video-tutor.net/", "votes": "2", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxZ0Lfifxag6yyXG7d4AaABAg", "comment": "Why do we multiply by root 2?", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzBcRpFZTH-CsQNaSB4AaABAg", "comment": "Good explanation of peak versus root mean square current and voltage and nice discussion of peak power and average power with thorough discussion of how all of the equations inter-relate!", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzNIdiN216I4EbtJGN4AaABAg", "comment": "when your physics teacher says that there are 150 minutes in 1 hour, explains basically nothing all the semester, and puts the hardest questions possible on the exam, this guy is a real life savior", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxVf61lvmAQd7B1-Fd4AaABAg", "comment": "Please for the question 3,how come the 200 watt is not the maximum power but rather the average power?", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxNuN5hOOAKOf9oqYp4AaABAg", "comment": "Well the issues come when they are not purely resistive circuits", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyZXQNjUMIs0dMWtYx4AaABAg", "comment": "I’m watching these and these formulas are entirely different than the ones they’ve taught me on I’m so lost", "votes": "3", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzK5IN01vaYiIvoxJt4AaABAg", "comment": "Conventional, - negative to + positive...", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugxrpbtx4EIFMxFvG4t4AaABAg", "comment": "Thank you so much for your videos. Your videos are very helpful 🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugza9I1_CfFiTCJ41Z14AaABAg", "comment": "Best Bester Bestest video on this topic", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxuTU0paF3RK1ded154AaABAg", "comment": "Damn I'm gonna pass 12th grade physics, maths and chemistry all thanks to you", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxjWuh0v9fIHdJSH8N4AaABAg", "comment": "A small thing, but i like hearing the calculator in the background.", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwIdpKGYMTLQeGIQvB4AaABAg", "comment": "I don't like the coldness of his explanation.. I feel like I'm gonna fall asleep", "votes": "0", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugz8BWvNypUPorMTKrR4AaABAg", "comment": "You a the great teacher I've ever known.", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyzgHmcJHFav9hMMKJ4AaABAg", "comment": "May I ask why question no.3 the vrms are equal to 240V?", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzRgEpZ3glTf_9deXB4AaABAg", "comment": "Bravo", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwzBSOG4Zp1AnXUVgd4AaABAg", "comment": "11:28", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugy-8DVjVImz-j62R-x4AaABAg", "comment": "Wish he did real current direction", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwfQV4eeswqAutXZRF4AaABAg", "comment": "What does peak power means and what is the formula to find peak power", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwhWccRpvxvvJQHRI14AaABAg", "comment": "Sir, you have video on every physics topic and so very very clear and simple. Thank you so much and God bless you richly.", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwIdpKGYMTLQeGIQvB4AaABAg.9vw3j9V-HffA42Q7kamIzm", "comment": "Then you are not a serious student because he's just the best......I just learnt a lot from this Man over the years till date 📅🤲🤲🤲🤲", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgwGc9ah81VD0e5q-Z54AaABAg", "comment": "Hello Thanks a  lot for helping to refresh my knowledge :) 14 years ago I learned, but never used :) Today I use it :)", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyBXZOZcCDUf0HOIp94AaABAg", "comment": "Thanks for everything, very helpful 🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugxu2mXAIUPSC8AERCp4AaABAg", "comment": "Vrms is stay the same calculation no matter of how many resistances?  Because i wonder about how to calculate Vrms in 4 resistance and Vs= 30V peak...", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxBvMIeTYyNlnNS-BF4AaABAg", "comment": "Best explanation. My lecturer has been struggling to make me understand for like over a month but now just in 10mins i have understood whats going on Thank you!!!!!!!!!!😍😍😍", "votes": "7", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyTj3oxBeW_75VgHr54AaABAg", "comment": "I am in computer science majorand chemistry minor", "votes": "0", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwePJOyC1pQ8papuHR4AaABAg", "comment": "I got a B In This course just a day after watching this video thank you so much, God bless you I can't repay you 🤲🤲🤲", "votes": "2", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxFa41pvIw_QzApvTt4AaABAg", "comment": "You're my life saver 🥰🥰🥰", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugz3qm8inlQFszpQkS94AaABAg", "comment": "Thanks for easy explanation, but I have a question to you. In the 3rd problem, in other you mean there that Rms and Average currents and powers are all same things. Cuz you calculate Average Power with Rms current and Voltage. So, can I say that they mean actually the same things everywhere ?", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwnwhbLQVuoqVt7eop4AaABAg", "comment": "I thought (IR)I=I^2(IR)", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugy4e3APx1MrpXeawFF4AaABAg", "comment": "The answer to no.4 500 right", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyFPb4gq2-JbbAEgUp4AaABAg", "comment": "Can't express my gratitude for you!", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxYF6DKAwfEyUBwTx54AaABAg", "comment": "Thank you very much, the best professor I’ve even met!", "votes": "3", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugynt6AIM5gt1OlS2kx4AaABAg", "comment": "Thanks sir but we would like you to discuss for us film and ceramic capacitor s in an embriodary machine", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxSEzmNcMz9_78Z_PZ4AaABAg", "comment": "Helpful af", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxjTGMox1LT8I5iehR4AaABAg", "comment": "Thank you so much for what you do you have helped me you have no idea❤️", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugxs5e1mm2WMWvHdn9F4AaABAg", "comment": "I just feel so happy when I search for some concepts and get to see that u have a video abt what I have already searched, I just know that it's done and dusted thank u so much master", "votes": "5", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzALQpqkuk84niT9FN4AaABAg", "comment": "A sinewave depicts movements in the form of waves. It has a datum, rapid, slowing and steady growth in one direction for a quarter cycle with reference to a datum (a reference), and then slow and faster decay in one direction for the next quarter cycle, and all these elements again in the opposite direction (reversal) of the forward movement for the next half-cycle. It has peaks and valleys.   In essence, the sinewave is a perfect embodiment of oscillatory movements like springs and quantities like voltage. It retains its waveshape when added to another sinewave of the same frequency and arbitrary phase and is the only periodic waveform which has this property.   The charges in a resistor subject to a sinusoidal voltage do not migrate elsewhere on the average. They merely slosh back and forth, so to say, over each cycle without a change in their position when the resistor was not energised.   Electrostatics and circuits belong to one science not two. To learn the operation of circuits it is instructive to understand Current, the conduction process and Voltage at the fundamental level as in the following two videos: i. https://youtu.be/TTtt28b1dYo and  ii. https://youtu.be/8BQM_xw2Rfo   A sinusoidal voltage generator operates by separating charges for the positive half-cycle in one direction initially rapidly and slowing down and momentarily halting when its voltage is at the positive peak, and then gradually reuniting the separated charges to make the separation zero; when all charges reunite, the generator voltage is zero. The negative half-cycle now commences, when the generator operates by separating charges in the opposite direction initially rapidly and slowing down and momentarily halting when its voltage is at the negative peak, and then gradually reuniting the charges to make their separation zero; when all charges reunite, the generator voltage is zero. It then begins the next positive half-cycle followed by the negative half-cycle and the process repeats.   The last frame References in video #1  lists textbook 4 which discusses these topics in more detail using a unified approach and provides an intuitive understanding of sinusoidal steady-state voltages and currents in capacitive and inductive circuits.", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxaxJq452R1GkcCVud4AaABAg", "comment": "Current in a resistor is a start-stop motion of conduction band electrons due to their collision with the rocking lattice ions, and this causes a resistor with a sinusoidal voltage applied, to produce heat. The polarity reversals of an applied sinusoidal voltage (with the direction reversals of the applied electric field) do not affect electron collisions with the lattice ions. Electrons colliding with lattice ions from either direction will continue to produce heat and there is no cancellation of the heat developed! Mathematically, the average value of a sinusoid is zero, and so, the average value of the current will also be zero. The average values cannot therefore represent the heat developed in a resistor with a sinusoidal current.   A resistor cannot develop heat due to a current in one half-cycle and then cool itself by a like amount of heat during the next half-cycle! It develops heat either way whether the current is positive or negative. The lattice ions vibrate from collisions irrespective of the directions in which the electrons collide with them. Therefore, since the average value is zero, it necessitates the use of the root-mean-square values of the voltage and current to compute the power, which is a statistical measure of the magnitude of a varying quantity and is the square root of the arithmetic mean of the square of the sinusoidal function.   Electrostatics and circuits belong to one science not two. To learn the operation of circuits it is instructive to understand Current, the conduction process, resistors and Voltage at the fundamental level as in the following two videos: i. https://youtu.be/TTtt28b1dYo and  ii. https://youtu.be/8BQM_xw2Rfo   It is not possible in this post to discuss in more detail average and rms values. The last frame References in video #1  lists textbook 4 which discusses in detail using a unified approach sinusoidal voltage, current, their average and root mean square values.", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgySw8grnZ81xBdgq-Z4AaABAg", "comment": "poggers", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwzJyTqJxJaVmznrL94AaABAg", "comment": "Great explanation I like it you are versatile and competent.", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyTj3oxBeW_75VgHr54AaABAg.9jKgNk9izRm9jKgOcc52lO", "comment": "And you can teach me anything I need", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "Ugyg5_uZnLUsyDI30TJ4AaABAg", "comment": "Will my tester indicate a voltage on the negative line in AC at the moment flow of current is reversed ?", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxxCCvcs_Hc3YtxVC14AaABAg", "comment": "Bro......I don't know how to express how grateful I'm watching ur videos..... Indeed u save lives Thanks man🤗", "votes": "23", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzlDTgphDAx6mYZnal4AaABAg", "comment": "what is rms voltage", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugy_xS8yU3tvXEKYlUd4AaABAg", "comment": "Thank you once again.", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugw4LIbexGDAxAbe4194AaABAg", "comment": "I was hoping for AC to DC converter voltage, and amp drop.", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwuGFWLVkChYi86Nvt4AaABAg", "comment": "I feel like it's either a hit or miss when teaching physics. This video definitely a hit... My school lecturer a definitive miss!!   So helpful, thank you!!", "votes": "81", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzKmor_HPay0G6nXkd4AaABAg", "comment": "I love you man, you are awesome.", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzATY737kf5r3D1zVR4AaABAg", "comment": "I think this is my third or fourth time watching this video this school year", "votes": "3", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxxsFohuUor7MTLQB14AaABAg", "comment": "very good tutorial, thanks for sharing", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugwowywj8BixaY8T0GJ4AaABAg", "comment": "What does 0.637 & 1.414 mean when dealing with sine waves", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugw39xKm3syd4rMlGhl4AaABAg", "comment": "I didn't know Mark Wahlberg was an electronic professor!", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzZRw1HtZ4OG11K0lR4AaABAg", "comment": "Please help me with this question because I have been trying solving it since almost ten years now but still couldn't solve it. This is question;  A lump of gold is suspected to contain some aluminium. If d gold sample has a mass of 500g and is found to av a relative density of 5.2, find what mass of gold is present if d relative densities of gold n aluminum are respectively 19.3 and  2.6", "votes": "0", "replies": "2", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwjfIwkV-QxDGsnN794AaABAg", "comment": "Can somebody help me pls in this direction do i use the battery symbol or the (AC) symbol  like  \"Draw a shematic diagram of four bulbs connected in parallel controlled by a single pole switch using alternating current\" PLS HELPP NOW             ________              |     |    |    |    | Ac sym.    ○   ○  ○   ○              |     |    |    |    |              |__switch__|                          Or               ________                |     |    |    |    | Bat sym.    ○   ○  ○   ○                |     |    |    |    |                |__switch__|", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzqUy_FqgkChGmmUpd4AaABAg", "comment": "Ac dc is rock band😊🤘🤘🤘", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwIZTJ_vw8R0zviyet4AaABAg", "comment": "Irms = I / root 2 is only applicable for i = iosinwt current if you want to find your own relationship you have to use (irms)^2 = (iavg)^2 where iavg= ∫i^2 dt / t", "votes": "3", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxMAzZVCUpqWI656194AaABAg", "comment": "I have a question about the derivation of the instanteous power - specifically when the current phase is shifted by thetaI. If I went to phasor land and multipled the original volts (120cost(wt+thetaV)) time amps (120cost(wt+thetaI)) I would get V*I@angle(thetaV+thetaI). After doing the phase shift according to the demonstrated calculation  (and the formal published power formula) I am now at (thetaV MINUS thetaI). How do I reconcile this mathematically?", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugzxiz448W9y7Ynwnxt4AaABAg", "comment": "Hi...  Respect for selfrespect,    Complaint to United distance  Nations (Today known as UNs) about to secure lives, living life and rights of citizens  of republic distance nations from monarch or emir containing distance nations those are united.   Defination of  Nation:    A large body of people united by common descent, history, culture, or language, inhabiting a particular country or territory.    Without any security for work, It is not  considered as domain work (work which is according to governmental procedure.).   Why satellite humen surveillance ( humen machine interface) of Mr.Suraj Murlidhar Pharande and its sensation to sensable brains and from bioterrorism ( COVID-19 coronavirus infection become as pandemic ?)   Machine humen interface satellite involved machinery operates voters also to  vote.    Why peoples in the world are not United to fight against COVID-19 till it causes death?      Timely report to respective place to cheack status of complaint.     Donation of rights are worlds biggest crime (an action or omission which constitutes an offence and is punishable by law.)😀😀😀😇😭     Crime corrupts every things life.                               Yours faithfully,      Mr. Suraj M Pharande .               Respect for selfrespect.   Spread this message.   Take care to avoide and spread of pandemic COVID-19 coronavirus infection. Corona virus is not spreading through water such information I read but humen saliva contains 99.5%  of water so use disinfectant in water to avoide COVID-19 coronavirus infection.            Respect for selfrespect,      My name is Mr.Suraj Murlidhar Pharande from Nimbut,Baramati,Pune,Maharastra,Citizen dependent India.      You well known about me as satellite  humen surveillance and its sensation to sensable brains as like you.      Write application to IHRC or such organisation which gives relief from such satellite torture to me and you also. If possible then give news about surveillance and its sensation to sensable brains in the world.       First secure yourself before messaging to another peoples.        Spread this message to other peoples.       I know what is tomorrow for this crime?,  They make some laws and restrictions to others for satellite use and maintain there position as like today to do such crime again.    From childhood I am not known  about what happens with my brain but at starting of teenage and at the 21st year of my life they try to kill me to show you peoples as these things are happened here but these things when I saw on TV as they show me surveillance is going on and every humen sensable brain in the world sense it, but this time span is too and no  government   or peoples complaint against so it stay on but my starting days of teenage too much torture were done by these peoples I felt in exam which causes my educational failure.      I don't have right to fullfill my sex need (as it requires partner or I see on internet pornography they impaired my digestion also brain functioning.) At age of 21 in college they do such things with me by satellite and one girl  from thers community come to ask about marriage then they try to kill me as I drink insecticide after that I complete  my master degree they again harash me at college and after completion of degree course I run for job and simultaneously for marriage I register my name    at mali marriage beuro then I contact with girls and there's parents some positive response I got about marriage in that days I write about surveillance to get relief to NHRC,IHRC and various Presidents and prime ministers of various countries but again they try to kill me but this time they broke my hand and head by 4 persons and admit at mental hospital for six months out of them three months I stay in my house but tablets by force and satellite torture they feed me (by black mailing again we will admit you at mental hospital).    Today, Neuro phones sound and show name and photo of Mr.Sharad Pawar and his family members and give warn like past we will kill you.       Because I write about reservation for member of parliament of citizen dependent India and legislative assembly of state for every category that gives for every five years new respective candidate from every community possible  and better regulation as they secure my living life (of every citizen other than elected members) from these elected  members. If necessary then you also do in your Nation.    If Monarch ( supreme powers has single monarch onely)  having nation or republic nation supreme powers both have peoples and elected representatives also If these type of two Nations are working together use or safety for that work (and representatives) gain onely by monarch having nation while elected representatives get changed after respective period so efforts and money invested is more of these peoples while assurance of work completion is not there (wastage) but that monarch can interfere with regulatory affairs of republic nation (People's know why representatives  newly elected is necessary, for regulation onely.) as today.      Whole this directs to create a social hindrance for those peoples who are not in theres fever to use there rights govern by government and always fight to represent (To stay with they without any means of living life I.e.onely life.).Divine power gives meaning about rights of living life onely thers genes have while others are retainers or slaves (others are alive because of there means onely) for they.      Timely report to respective place to cheack status of complaint.    Donation of rights are worlds biggest crime (an action or omission which constitutes an offence and is punishable by law.)😀😀😀😇😭    Crime corrupts every things life.   Spread this message.                              Yours faithfully", "votes": "0", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzCkKog0_x7upr3U7V4AaABAg", "comment": "Of course my professor and the textbook we're using makes this appear 100,000 times more complicated than it needs to be.", "votes": "5", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwHETkuURntfZttrcR4AaABAg", "comment": "Oh man excellent. Where are ru from bro?😂", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugxm4VTSKSD8j-MPPel4AaABAg", "comment": "Anh em VN đâu rồi, tây học dễ hơn ta nhiều phải không", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzZRw1HtZ4OG11K0lR4AaABAg.9IbJXFBrSBg9Kl6wDlAlwz", "comment": "the answer is 78g", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgzZRw1HtZ4OG11K0lR4AaABAg.9IbJXFBrSBg9KreLU1d9hs", "comment": " @BonuolaBakir  please can I get the solution to the questions", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "Ugzxiz448W9y7Ynwnxt4AaABAg.9Efj-qLV3l49bH-4WJdEtD", "comment": "Hi...     Voltage  Rock n Roll!", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgzKFzc7049JDJ2UaOx4AaABAg", "comment": "why the 240 V is equal to Vrms??", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugxhur4agzRG4-5VKR54AaABAg", "comment": "✨✨✨✨✨✔️✔️✔️✔️✔️🌟🌟🌟🌟🌟", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugx_a3wJGfQIi1DfbYh4AaABAg", "comment": "Hi. First of all, thank you for sharing. I have a question, for a step down transformer, that will be used to convert 120V rms to 5V DC. Do we use the Vrms or Vpeak to determine the ratio for the transformer?", "votes": "5", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyxZIGwEXXimdBSRvl4AaABAg", "comment": "I love this video but when I see in your videos including this you did 't response even questions are........you...alive", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzCs2olqNjX-S7JVj94AaABAg", "comment": "Good easy explanation", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwC7oRtCKkHpVUB08Z4AaABAg", "comment": "Learned my bachelor 6 months of electrical basics AC current in few minutes. Thanks :)", "votes": "2", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyTdkWDseFZb1UFV7Z4AaABAg", "comment": "Thank you for the help bro", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugzz0w4QyMSLQ8IX8SV4AaABAg", "comment": "flow of current is from -ve to +ve right? because electron, as we know negatively charged so, are attracted to +ve end of battery. Correct me if I am wrong. Tq", "votes": "1", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugwo257rD23EpCTnnPB4AaABAg", "comment": "Thaaaaannnnkkkkkk youuuuuu I am in Portugal studying Renewable energy and this couldn't get into my mind. Neither in Portuguese or other videos.. this explanation killed it! All made sense now! I appreciate it!!! Thank you so much!", "votes": "3", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugxc0qskjBZ7OCaKKKF4AaABAg", "comment": "I know ur voice your name is john fish is that right !!", "votes": "0", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxhT3EpTuJTPkJTjbd4AaABAg", "comment": "Who else is here due to corona?", "votes": "44", "replies": "4", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzfyA8hooZpzl2viUp4AaABAg", "comment": "you are the best of all!", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzsK4FvfC3-SL6gMop4AaABAg", "comment": "Thanks 😊", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugw69iLs-2mjPA3mTSh4AaABAg", "comment": "Wait...serious question and I mean no offense, but why wouldn't you solve it the easy way?   V = I * R; 5*10=50V P = V * I; 50*5=250W  Does breaking it down the way you did benefit more for more complex problems? It was kinda confusing me until I realized I had easier formulas to follow. I'm genuinely curious to know. Just diving in to trig and this stuff for work so I'm doing crash course for it all via YouTube lol", "votes": "1", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyJ-YmAkUjBS5Dc9CZ4AaABAg", "comment": "He sounds like mark wahlberg", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgytGvU2WQwKCI5xn694AaABAg", "comment": "I didn't realize you cover like every subject known to man. Great content.", "votes": "331", "replies": "5", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzxPMm_dGkHQtnzvVh4AaABAg", "comment": "Dude, in my student years at school I thought these are very complex topics. It seems that my teacher was a bad teacher or you are a good teacher, I dont know anymore.", "votes": "113", "replies": "2", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxMqYchaCFc9ehnpuR4AaABAg", "comment": "Really great. Thank you for posting. I'm new to this. I get it, but it still racks my brain! :)", "votes": "5", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugyg9DNvWFrUgzvtoLB4AaABAg", "comment": "really help full", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugzue3Bpr6X6LWHNGFl4AaABAg", "comment": "How the f u know everything u are so smart", "votes": "19", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugx_a3wJGfQIi1DfbYh4AaABAg.99OnaHynx9_99bhPZQDQSf", "comment": "Vrms it is...", "votes": "2", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "Ugzz0w4QyMSLQ8IX8SV4AaABAg.983DC9H1Jzf9BY5rckQ__B", "comment": "The path of electrons is opposite of the current flow.", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "Ugxc0qskjBZ7OCaKKKF4AaABAg.96aUe_Q_HcY9FhurrTrpfM", "comment": "no...", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgxhT3EpTuJTPkJTjbd4AaABAg.96YlWpCYLeH98YPe-VY0sG", "comment": "Ya cuz the I dont understand these damn assignments", "votes": "2", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgxhT3EpTuJTPkJTjbd4AaABAg.96YlWpCYLeH9NiB_D9w0gh", "comment": "1 year. Time flies, feels like yesterday.", "votes": "1", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgxhT3EpTuJTPkJTjbd4AaABAg.96YlWpCYLeH9wLI2hjwlTF", "comment": "You", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgxhT3EpTuJTPkJTjbd4AaABAg.96YlWpCYLeH9y0_lYlnuX9", "comment": "Covid was about 4 years ago mate", "votes": "2", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "Ugw69iLs-2mjPA3mTSh4AaABAg.95ZZyYjbwN195Zb7liMj_o", "comment": "And does this rule work across the board too:  IRMS = A*.707 ?? 10*.707=7.07  Also this one:  Vrms=V*1.414?", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgytGvU2WQwKCI5xn694AaABAg.940qY0XO4-Y9dUw9ud9x4c", "comment": "He started off as a Rubik's cube teacher (he could solve in about 13 seconds)", "votes": "2", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgytGvU2WQwKCI5xn694AaABAg.940qY0XO4-Y9mGXNoKjg9f", "comment": " @afridnishad6617  is that true JG", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgytGvU2WQwKCI5xn694AaABAg.940qY0XO4-Y9mGYYqOsNs_", "comment": " @christianakanbi2960  i did my reasearch and I'm sorry to say i had the wrong guy. I was talking about a youtuber named badmephisto who later went on to become the head of Tesla ai. Both had the same voice and personality. So it wasnt him.", "votes": "5", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgytGvU2WQwKCI5xn694AaABAg.940qY0XO4-Y9mOlYWE9Ra_", "comment": " @afridnishad6617  he’s a electrical engineer major I think", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgytGvU2WQwKCI5xn694AaABAg.940qY0XO4-YA0t_asnbEgT", "comment": "What about religion 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgzxPMm_dGkHQtnzvVh4AaABAg.925IcDTTdx79ok4NtnXf7c", "comment": "You answered in yourself, \"in my student yrs\". As the brain develops, and we age, we start to understand materials that we did not when we were young. You just simply started valuing your own knowledge and education as opposed to other things when you were young", "votes": "4", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgzxPMm_dGkHQtnzvVh4AaABAg.925IcDTTdx7A8HjUQTta2o", "comment": "Exactly the same reply I was about to give​ @mysterio5837 ", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "Ugx1etlkceN280rqlPt4AaABAg", "comment": "your good", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzryqenhCO2WgAWHkZ4AaABAg", "comment": "How do I do this if I only have hertz", "votes": "0", "replies": "2", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgwSlWw68NwFVnNmwd94AaABAg", "comment": "I love you", "votes": "2", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugw4AA8MOmAWJZX3liR4AaABAg", "comment": "You make everything so much simpler! Thankyou", "votes": "30", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgxOBfGPgH9WuFzKQJ14AaABAg", "comment": "Can any  body help with this :  When 100v DC is applied across a coil , current of 1A flow through it.When 100v, 50Hz A.c is applied to the same coil, only 0.5A flows ,The Inductance of the coil is __", "votes": "0", "replies": "1", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgyeIqHxYPR2ZNIGiwx4AaABAg", "comment": "Amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugy1O3GKQU70iDOUrjN4AaABAg", "comment": "By far the best explanation of RMS on YouTube! Others way over complicate things.", "votes": "18", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzRBheRJUvzfNsdj9d4AaABAg", "comment": "Thanks a lot Sir!", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugw0UKG12znLqvYkjcN4AaABAg", "comment": "Super 5/5 rating for your magnificent teaching...... Great teaching skills", "votes": "10", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgztpXv3H51GIRa_qJN4AaABAg", "comment": "Thank you so much", "votes": "0", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugyr5so_o7CgwKDS_Pd4AaABAg", "comment": "Very appreciated it. Thanks.", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "Ugwbgax9ppjqKSJtE_x4AaABAg", "comment": "Tnx sir could please elaborate some mechanism physics lectures", "votes": "1", "replies": "", "reply": false}, {"vid": "ERIToctYUcQ", "cid": "UgzryqenhCO2WgAWHkZ4AaABAg.8z05lUZ-ZpX939pVn9c7UX", "comment": "You can't, there's simply not enough information.", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgzryqenhCO2WgAWHkZ4AaABAg.8z05lUZ-ZpX98la46Wdju7", "comment": " @Jess_Atomoxetine  V = Vosin2πft where f is the frequency in Hz or rad/s.", "votes": "0", "replies": "", "reply": true}, {"vid": "ERIToctYUcQ", "cid": "UgxOBfGPgH9WuFzKQJ14AaABAg.8s8ZD02sFJ49U2-Sf-q8ob", "comment": "Inductive reactance", "votes": "0", "replies": "", "reply": true}]