[{"vid": "Ey25vULQ6YM", "cid": "UgxDZUn0yc9peBSHaEl4AaABAg", "comment": "Classical Physics might not be wrong when it says that electrons will fall into nucleus in some 0.1nanoseconds. We might be having wrong concept of time. Time may also be a Quantized entity and not continuous! The electrons will fall into nucleus if we update our concept of time. Quantized nature of time can be proved. To prove this, watch a movie that was released some 50 years ago from now. suppose it was of duration 3 hours at the moment of its release. If we watch this movie TODAY, it will take us more than 3 hours of TODAY! It means that we are not able to watch a movie of 3 hours (which was released 50 years ago) in 3 hours of today. This clarifies that TIME is PASSING RAPIDLY.  The rapid passage of time can explain that electrons can fall into the nucleus provided time start passing rapidly so much so that this phenomenon of electrons falling into the nucleus could be OBSERVED. Supposed a quantum of time is of X years, then, it remains of X years only as the time passes but every phenomenon might be having its own specific and well-defined time passage rate for it to occur...The phenomena of electrons falling into the nucleus would occur when time passes so rapidly that it becomes equal to its defined time passage rate...", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwzxSo-gNXd-ng8rMZ4AaABAg", "comment": "They have to look into CBSE book.....", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzipMO7mQpwH65WbIR4AaABAg", "comment": "In case it helps others watching, please listen carefully to the instructor's words at 44:18 (transcript below).\r \r \"Any frequency can't have an energy ... (you have to 'uh is) ... you don't have a continuum of frequencies that are of a certain energy. It is actually punctuated into these packets that are called photons.\" - Misleading, because it implies that it is frequency that is quantized and not energy.\r \r The words \"frequencies\" and \"energy\" should be swapped around,\r \r The correct phrase should be:-\r \"Any frequency can't have an energy ... (you have to 'uh is) ... you don't have a continuum of energies of a certain frequency. It is actually punctuated into these packets that are called photons.\"", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwxbhNYk_g0jMFNtCp4AaABAg", "comment": "28:50", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgycIigftP5omQHCM6B4AaABAg", "comment": "Her lectures are so polished and so polite.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugzu7DNWv_JE7VW72S14AaABAg", "comment": "必ずコンプリートだからねー早くしろ！💢", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgystwYCna9Xjjws0A94AaABAg", "comment": "Matter wills 1:0333_2", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyT0ZwBEj5CGPe8xuJ4AaABAg", "comment": "Angstroms equals protom By 10/18 infinity", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugz7MgWbjNx1QEgNzMJ4AaABAg", "comment": "It is generally recognized that I have surpassed Newton and Einstein. Check around.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwkRZ2_EDkxDeVA1v14AaABAg", "comment": "WHY AND HOW THE CLEAR, THEORETICAL, AND TRUE PROOF OF THE ULTIMATE UNIFICATION REGARDING PHYSICS/PHYSICAL EXPERIENCE IS F=MA AS E=MC2: That SPACE is THEORETICALLY, ultimately, truly, and FUNDAMENTALLY QUANTUM GRAVITATIONAL is proven by the CLEAR fact that E=mc2 IS F=ma. This CLEARLY explains the term c4 from Einstein's field equations (regarding his general theory of gravitation). Gravity AND ELECTROMAGNETISM/energy are linked AND BALANCED opposites, AS E=MC2 IS F=MA; AS ELECTROMAGNETISM/energy is gravity. Great. Time DILATION ULTIMATELY proves ON BALANCE that E=mc2 IS F=ma, AS ELECTROMAGNETISM/energy is gravity. This NECESSARILY represents, INVOLVES, AND DESCRIBES what is possible/potential AND actual IN BALANCE. The MIDDLE DISTANCE in/of SPACE AND the FULL DISTANCE in/of SPACE are thus NECESSARILY LINKED and BALANCED, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. TIME is necessarily possible/potential AND actual IN BALANCE, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/ENERGY IS GRAVITY. (Very importantly, outer \"space\" involves full inertia; AND it is fully invisible AND black.) BALANCE and completeness go hand in hand. It ALL CLEARLY makes perfect sense. Great !!! INSTANTANEITY is thus FUNDAMENTAL to what is the FULL and proper UNDERSTANDING of physics/physical experience, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. \"Mass\"/ENERGY IS GRAVITY. Gravity IS ELECTROMAGNETISM/energy. CLEARLY, I have mathematically, sensibly, and THEORETICALLY unified physics/physical experience; as E=mc2 is CLEARLY proven to constitute what is F=ma ON BALANCE. Gravity/acceleration involves BALANCED inertia/INERTIAL RESISTANCE, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. GRAVITATIONAL force/ENERGY IS proportional to (or BALANCED with/as) inertia/INERTIAL RESISTANCE, as E=mc2 IS F=ma; AS ELECTROMAGNETISM/ENERGY IS GRAVITY. The stars AND PLANETS are POINTS in the night sky. GREAT !!! Energy has/involves GRAVITY, AND ENERGY has/involves inertia/INERTIAL RESISTANCE. It ALL CLEARLY makes perfect sense. E=mc2 IS F=ma. Very carefully consider what is THE MAN who IS standing on what is the EARTH/ground. E=mc2 IS F=ma. GREAT !!! By Frank DiMeglio", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzbsDDVwksa_treUTN4AaABAg", "comment": "Hi Iam online student and I want to know how can I get the text or the book that I suppose to read from ..please answer me.", "votes": "0", "replies": "3", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwIucg8J2UckzX4dfF4AaABAg", "comment": "5:50 With all due respect this professor does not seem to have understood the reason why an electron cannot keep rotating the nucleus. A perfectly good classical model would be with the Coulomb attraction supplying a rotating electrons acceleration towards the nucleus exactly like the gravitational force works for the planets round the sun. However it can also be shown on classical electrical terms that such an accelerating electron would radiate and hence lose energy and quickly fall into the nucleus. This is not the same as just considering an electron at rest falling into the nucleus. A good example of a chemist not really understanding the physics.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxaeMe-8DbhdiVV1N14AaABAg", "comment": "7:00 paraphrased: \"an electron would plummet into the nucleus in a fraction of nanoseconds due to Coulomb's law\"  The reason is NOT Coulomb's law. The classical reason why the electrons should plummet is the classical energy loss due to classical radiation of accelerated (circular motion of the electrons) of charged particles. Without that loss, charges could rotate around each other like the Moon and the Earth.", "votes": "2", "replies": "2", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwIAO1hl6oYsf5LdPZ4AaABAg", "comment": "Reconciliation with quantum physics and classical physics. Great class - a model for our future in these times.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugy4ejGt5Cm7f9EjYQB4AaABAg", "comment": "All the scientist of the world  Are you able to make a 10000000 cubic feets volume barometer so we turned a turbine and make electricity anywhere in universe", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyvKe0jv2mCELLrVgB4AaABAg", "comment": "Very informative", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzFuKN_eMmFhfEuNfJ4AaABAg", "comment": "Electron can revolve at some speed around the nucleus at some speed, causing the centrifugal force to balance the coloumb force.  Why are we not considering this hypothesis", "votes": "0", "replies": "1", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugywug1n6Kyn7dsaj_J4AaABAg", "comment": "This class should be called \"Chemistry for the Music Major\".  Very weak subject matter.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxfVWEE_aQ3lJQ83J54AaABAg", "comment": "Now she is saying that the electric field in a light wave is a Coulomb field.  It is not.  The Coulomb field is an electrostatic field.  The electric field in a light wave is generated by a changing magnetic field, not by a Coulomb effect.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugw93j31K1JsnUXJEzR4AaABAg", "comment": "Jeeez, she has simple stuff wrong.  A charged particle will not in general collapse into the opposite charge, unless the tangential velocity is zero.  What causes the collapse is that the particle is radiating away energy, something quite different from the Coulomb force.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzbsDDVwksa_treUTN4AaABAg.9LbdzB4RvNt9LeEWGY-hCK", "comment": "The readings are from the required textbook: Atkins, Peter, and Loretta Jones. Chemical Principles: The Quest for Insight. 4th ed. New York, NY: W.H. Freeman and Company, 2007. ISBN: 9781429209656. See https://ocw.mit.edu/5-111F08 for more details and materials. Best wishes on your studies!", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgzbsDDVwksa_treUTN4AaABAg.9LbdzB4RvNt9LgHlB1QodM", "comment": " @mitocw  Can I have it as a PDF ? if it is possible so from where exactly?", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgzbsDDVwksa_treUTN4AaABAg.9LbdzB4RvNt9Lt2J1tDbpA", "comment": "We do not have a PDF of the textbook available. It might be available somewhere else.", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgxaeMe-8DbhdiVV1N14AaABAg.9EGJRBugjTU9Ep3iBPg4kX", "comment": "So I guess you know more than an MIT instructor?  Protons are positive and electrons are negative and so the force would be due to Coulomb's law from F = Ke (q1*q2) / r^2, where Ke is Coulomb's constant, q1 and q2 are the signed magnitude of the charges, and r is the distance between the two charges.  You cannot apply Newtonian mechanics here though, so F = ma cannot apply.  It's in the quantum realm and so you have to use probability, i.e. the Schrödinger equation.", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgxaeMe-8DbhdiVV1N14AaABAg.9EGJRBugjTU9EpB7xgMEwe", "comment": " @BitwiseMobile  “Blind belief in authority is the greatest enemy of truth.” Albert Einstein. Take the Earth and the Moon instead of an electron and a proton. They attract due to gravity in the Newtonian theory. (Einstein said that they each move without acceleration in spacetime curved by gravity). Would you now say that the classical Newtonian theory is invalid because the Moon and Earth would crash? The argument why classical theory doesn't work with atoms is not that the particles would crash because of their attraction. The classical theory would work if they would circle around each other like the Moon and the Earth if you are not taking into account that Maxwell's equations say that accelerated charges (circling charges are accelerated) radiate energy. The latter is the reason why classical electrodynamics fails. So the MIT instructors argument is flawed.", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgzFuKN_eMmFhfEuNfJ4AaABAg.97SgXq4dyge9F-8Q1lLOUz", "comment": "Well you are right  - that is what she should be considering. It still would not be stable and go on rotating,  because - on classical theory - it would radiate energy, lose momentum and fall into the nucleus. I can only think that she did not fully understand the problem herself.", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgyFZFixBJy2km63bTp4AaABAg", "comment": "writing on the board is the majestic experience specifically with chalks , this is no good", "votes": "2", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyBeYOdYhgyCBktyZ14AaABAg", "comment": "It seems the most obvious & logical explanation for a #particle acting like an #AxialWave when moving thru space is that it's orbiting something (a dark matter particle perhaps) or visa versa.  It's not unlike Earth being pulled into a wobble by the moon, or a distant star's wobble evidencing planet orbits making our trajectory as we fly thru space have an axial wave (packet) as well.  And since we think we know undetectable dark matter exists but don't yet know where it's distributed, this seems the most logical possibility.  What do you think?  This could explain the double slit experiment results, including with a detector with some interaction between the dark matter and the detector.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugw2RkrjCvzAOtZEmnJ4AaABAg", "comment": "WHAT an incredible place mit might be all sorts of interesting craziness might be going on.", "votes": "2", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyYTuk-USdPlSYNNHN4AaABAg", "comment": "the real secret is to test neutonian law on a smaller and smaller scale until it fails. when it fails you have reached the difference between general relativity and quantum mechanics. there should be an equation which Einstein searched for in the later years of his life. I would simply get smaller and smaller measurements on a mass via neuton laws until the math fails then add back until they work . then it is a simple difference between two weigths a (it works) and b ( it failed).", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgjhY05i_t8WoHgCoAEC", "comment": "i like you", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UghlJlVKpYJNj3gCoAEC", "comment": "The classical model of the atom is unstable if you take into account that fact that an orbiting electron would emit radiation according to Maxwell. If you don't take that into account the electron could circle the nucleus basically forever.", "votes": "2", "replies": "1", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgijpE_wL4E3y3gCoAEC", "comment": "What a load of old bollocks. The concepts of wave and particle are mutually exclusive. Only the insane can combine them- enter the quantum physicists...  Exploring the nature of Magnetism, with regards to the true model of atomic geometry   and field mechanics by  means of rational physics & logic. Ken L. Wheeler https://ia8022502.us.archive.org/31/items/magnetism1small/magnetism1small.pdf  Demonstration Resolving Wave-Particle Duality Paradox. Photon Model Fails Eric Reiter https://www.youtube.com/watch?v=3YHaWHwJHWo", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugi8g5gfJ0D8h3gCoAEC", "comment": "4:35 The equations are correct.. the explanation was not.  \"But of course we want to go all the way to distance so we take the second derivative and we have this equation....\"  The second derivative of r does not give you distance, it gives you acceleration. I'm assuming she meant say to take a second integral of a(t) to get to r(t).", "votes": "1", "replies": "1", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UggVDRlN-lwxf3gCoAEC", "comment": "I want Sir Walter Lewin to explain this to me. But Unfortunately they deleted his Videos. And Anyhow I found it. lol", "votes": "5", "replies": "2", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgjQTE9N7d2uJHgCoAEC", "comment": "Such incredible classes people get at MIT.", "votes": "13", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgheOWRGq2wXwHgCoAEC", "comment": "light is an electromagnet wave that DOES change speed depending on the propagation medium... just like radio, radar, infrared etc. people who point out particle properties don't understand what light is. Photons are a myth", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UghZOeozw5SUX3gCoAEC", "comment": "That explanation for why classical mechanics fails when applied to atoms is horrible, incredibly misleading. Using a nearly identical equation (gravity instead of electostatics), you could \"prove\" that planets should fall into the sun. Your only allowing 1 dimensional motion, and not allowing initial velocity in the circular direction. The reason planets don't plummet into the sun because they ORBIT. C'mon MIT, that physics isn't too hard.", "votes": "2", "replies": "2", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ughgze0ne0iO2ngCoAEC", "comment": "Please consider this falsifiable option as a better solution to light particle-wave duality.  https://www.youtube.com/watch?v=iSNYJ4rM1IM&feature=youtu.be", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgjCGBk8pWUx5ngCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again.", "votes": "6", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UghWNSqiD4LfLXgCoAEC", "comment": "I like how at 6:50 she says as you can see our atoms are not collapsing and then the lights go out for like a second.", "votes": "11", "replies": "1", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugj6S9KK6B4L53gCoAEC", "comment": "Where can I download the problem sets and solutions? The course website only has the exams and solutions", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UghwoU87U9ipHXgCoAEC", "comment": "I wonder if the reason that MIT isn't showing all the images is because they appeared in journal articles and the professors can no longer publish them whenever they want. ", "votes": "2", "replies": "3", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgiyR86CQX79N3gCoAEC", "comment": "Of course, light is purely a wave phenomena. Photons are not particles but the amounts of energy that electrons can emit or absorb when they change their energy, and hence their frequencies.  The addition and subtraction of energies follows from the fact that electrons are also waves and the trigonometric identities involving the products of sines and cosines.  I explain all this in my series starting with Demythologizing Quantum Theory 1: Wave-Particle Duality in Light.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Uggq2vFpMmAb53gCoAEC", "comment": "I do light too. post-doctorate program studying spatial relationship to light vision and brain nerve cells. its so fun! Dhag was here.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgiYRRNNLCZ_hngCoAEC", "comment": "she made this soooo boring", "votes": "8", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UghlJlVKpYJNj3gCoAEC.8P7yi1-_Zqo8fy2SAfxeaw", "comment": "I have a question regarding the radiation made by the electron while in motion around the nucleus. I have read that this radiation (B) is a result of a lost energy by the electron. That means that after a certain time delta t the electron should stop moving around the nucleus and thus falls into it. I know that this is untrue because of Heisenberg's uncertainty principle. I would like to know however if this (electron movement --> radiation --> lost energy) relationship holds.", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "Ugi8g5gfJ0D8h3gCoAEC.8MQGIE8WlEz99yDIGr_STr", "comment": "No her explanation was correct   F = ma is more of an algorithm than an equation. Sum of measured forces represents as functions on the system = mass • x'' This case it is Coulombic force = mass • x''", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UggVDRlN-lwxf3gCoAEC.8J69hs5sQSd8PxUalo8gTk", "comment": "Where?", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UggVDRlN-lwxf3gCoAEC.8J69hs5sQSd8PxW5TItOBe", "comment": "Just type sir walter lewin and the following topic (physics).", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UghZOeozw5SUX3gCoAEC.8AbzNa_OOw78AlWZXmVsA9", "comment": "+Aeroscience *You're only allowing...", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UghZOeozw5SUX3gCoAEC.8AbzNa_OOw78cogjIhWLFz", "comment": "My small view [3:55] about \"[Coulomb's] DOES NOT tell us how r changes with time, t\"... OK!   But following by shed word as assert, why should it do or how should it show likewise? Is it merely then a shorter formula or might it be finer so to speak? At least implicitly THERE IS already time, t (as always along and across the Physics all, say parametrically) involved... So she lecturing meant very likely in aim for the electron particle's trajectory / time-path orbit that we would be better looking firstly in the F big to get from so then subsequently finding out that there is no way to go without another resource to turn to.  \"[Coulomb's] alone CAN NOT tell us how r changes with time, t\"... Now!  Of course this quote issue altogether would be also assuming the lasting lot: one, that the force F hence showed velocities or other derivatives of r with respect to time, t (so let them be straightforward for further integration as {ordinary} differential equation); two, that the good force F itself was newtonian just by definition in terms of action-reaction (Newton's 3rd law) and this is why there is only implicit time, t (in the starting equation).  Coulomb's law (as for good Electrostatics given) should keep OK either way however here after this (comment) above. \"Infinity... in our brains (?)\". Thanks.", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UghWNSqiD4LfLXgCoAEC.80vR8yqQK8c9CTKPJia9hK", "comment": "Yeah that was weird", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UghwoU87U9ipHXgCoAEC.7-H0Z7-Gcix7-Lr-1Sclbu", "comment": "You are correct, some images were not shown because of IP issues. All of our work published before 2009 was under a Creative Commons license (BY-NC-SA) and no exceptions were made for works that could be under Fair Use. If we couldn't secure permission to publish it under our CC license, we removed it. Some of the works removed were replaced by commissioned work that could be published under our license. In this case, this course has a number of commissions in the lecture notes. See the course on MIT OpenCourseWare for the full materials: http://ocw.mit.edu/5-111F08 As of 2009, we now allow for works under Fair Use.", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UghwoU87U9ipHXgCoAEC.7-H0Z7-Gcix8HU5p_lfRos", "comment": "Hello MIT OCW, can you guys upload videos for Organic chemistry. It's out of context here but I really need it. All the organic chemistry elsewhere is very fundamental. Even UCI OCW organic chem was oriented towards the biology people. MIT would surely have a decent organic chem course.", "votes": "2", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UghwoU87U9ipHXgCoAEC.7-H0Z7-Gcix9LbfJTs2Wzv", "comment": " @mitocw  Hello MIT  Please How can I get the text or the book to read .In the notes PDF there are some lines pointing to pages in some books so how can I get them and is it allowed or not  please answer me.", "votes": "1", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "Ugg0CmCmI62aK3gCoAEC", "comment": "@dionstrezlecki  Actually the more secular a nation is, the more functional and successful they are on many indices relating to societal well-being and educational achievement....  Then again I may be misunderstanding what you're trying to convey there.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyfW9NdK8pAZzp2INV4AaABAg", "comment": "Or you could just pause the video...", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxJGEUBPvKL9v63VAZ4AaABAg", "comment": "The wave-particle duality of light could be acting like the zeros and ones of a computer forming a blank canvas that we can interact with turning the possible into the actual! Quantum physics represents the physics of ‘time’ as a physical process with the future coming into existence photon by photon! Quantum uncertainty ∆×∆p×≥h/4π is the same uncertainty we have with any future event within our own ref-frame. This is an invitation to see an artist theory on ‘time’ as a physical process. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxzkGrznPzxzw0hR9B4AaABAg", "comment": "Abir mukherjee i was saying that even if you use newtonian mechanics then also it wont collide with the nucleus, because although electrostatic force is operating. This will be because electron will have a tangential component of velocity also and it wont collide, and please go and study circular motion", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwtmLHGI_iqJTolyPV4AaABAg", "comment": "dude seriously??are you in class 1??she is saying that it should collide according to newtonian mechanics...but in reality thats not the case since newtonian mechanics dont work here....", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxzZdlrHujMu8DB5lV4AaABAg", "comment": "at 6:30 the professor is telling that electron should move into the nucleus in 0.1ns, but that's not the case because the electrons are revolving around the nucleus.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzOVn9Jg5GikjR00Ox4AaABAg", "comment": "Shame that the quantum dots image was blurred out due to copyright. Naturally, I can find it elsewhere, but that interrupts the flow of the lecture.", "votes": "2", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyRXxNCjj1u9rH9est4AaABAg", "comment": "The United States has the second lowest public acceptance of evolution in the world. Hmm that seems proportionate to your \"lowest/poorest standard of education on the planet\" claim.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugzh0fv06h2DDKqAPwF4AaABAg", "comment": "oh sweet jesus. i just lost all respect. google \"religion and IQ.\" im gonna pm you now. i dont want to start a religious debate on this video.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzrcQbV1jv03aBNxm14AaABAg", "comment": "obviously there are multiple ways of getting KE lol. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgydLvDaDkgP8DXhOMF4AaABAg", "comment": "holy shit. you are so misinformed. no public school in the United States teaches creationism as mandated by the government. every biology textbook i have had since i can remember has had evolution. religious people are always the ones associated with a lower IQ. the less inclined you are to changes, the less likely you are to learn and adapt to something new. simple as that", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugw73eIHeE3VSO5NGi14AaABAg", "comment": "a good or bad correlation? teaching evolution means poor grades and bad societies?", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgztB1Y52IdnD0ANkPN4AaABAg", "comment": "lol wtf. what kind of a question is that? dude india doesnt have an issue with fundamentalist religious people. the hindu religion is totally different from christian theology. in india, religion is seen more as a philosophy than something taken as completely literal. saints in hinduism preach more philosophy of human life rather than \"heed the word of God otherwise spend an eternity in hell.\" we use the word \"God\" very loosely.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwG_sh9aowBsnNgtE54AaABAg", "comment": "in terms of pure knowledge, yes. other aspects like social skills and shit? not at all. this is coming from an american indian (not native american... lol)", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwyEVkoxicvCBZDR7N4AaABAg", "comment": "good sound", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxbhDbIU49N_VvSAhB4AaABAg", "comment": "why did the censored the headphones lol", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugwwwp1RfvSfxTGDe9x4AaABAg", "comment": "Is it just my computer, or is this video really choppy?", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzjpKNvXS4AYG6Xtu54AaABAg", "comment": "You don't need to know the mass of the electron to measure its kinetic energy.  All you need is its charge and a potential difference.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxGR3jCzaWu78IXhjV4AaABAg", "comment": "Her argument is a bit misleading.  Just Coulomb's law could lead to a stable Rutherford atom if the atom is moving around, just like a planet around the sun.  The problem is that Coulomb's law alone does not account for radiation, and with radiation the electron would be losing energy and collapse.", "votes": "2", "replies": "1", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzM8vnIiVU5wBCK9c94AaABAg", "comment": "lol we in the physics department chew Quantum Mechanics in our sleep.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxGR3jCzaWu78IXhjV4AaABAg.8GbbKrrIdVb9QbkrtIGsOI", "comment": "WHY AND HOW THE CLEAR, THEORETICAL, AND TRUE PROOF OF THE ULTIMATE UNIFICATION REGARDING PHYSICS/PHYSICAL EXPERIENCE IS F=MA AS E=MC2: That SPACE is THEORETICALLY, ultimately, truly, and FUNDAMENTALLY QUANTUM GRAVITATIONAL is proven by the CLEAR fact that E=mc2 IS F=ma. This CLEARLY explains the term c4 from Einstein's field equations (regarding his general theory of gravitation). Gravity AND ELECTROMAGNETISM/energy are linked AND BALANCED opposites, AS E=MC2 IS F=MA; AS ELECTROMAGNETISM/energy is gravity. Great. Time DILATION ULTIMATELY proves ON BALANCE that E=mc2 IS F=ma, AS ELECTROMAGNETISM/energy is gravity. This NECESSARILY represents, INVOLVES, AND DESCRIBES what is possible/potential AND actual IN BALANCE. The MIDDLE DISTANCE in/of SPACE AND the FULL DISTANCE in/of SPACE are thus NECESSARILY LINKED and BALANCED, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. TIME is necessarily possible/potential AND actual IN BALANCE, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/ENERGY IS GRAVITY. (Very importantly, outer \"space\" involves full inertia; AND it is fully invisible AND black.) BALANCE and completeness go hand in hand. It ALL CLEARLY makes perfect sense. Great !!! INSTANTANEITY is thus FUNDAMENTAL to what is the FULL and proper UNDERSTANDING of physics/physical experience, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. \"Mass\"/ENERGY IS GRAVITY. Gravity IS ELECTROMAGNETISM/energy. CLEARLY, I have mathematically, sensibly, and THEORETICALLY unified physics/physical experience; as E=mc2 is CLEARLY proven to constitute what is F=ma ON BALANCE. Gravity/acceleration involves BALANCED inertia/INERTIAL RESISTANCE, AS E=mc2 IS F=ma; AS ELECTROMAGNETISM/energy is gravity. GRAVITATIONAL force/ENERGY IS proportional to (or BALANCED with/as) inertia/INERTIAL RESISTANCE, as E=mc2 IS F=ma; AS ELECTROMAGNETISM/ENERGY IS GRAVITY. The stars AND PLANETS are POINTS in the night sky. GREAT !!! Energy has/involves GRAVITY, AND ENERGY has/involves inertia/INERTIAL RESISTANCE. It ALL CLEARLY makes perfect sense. E=mc2 IS F=ma. Very carefully consider what is THE MAN who IS standing on what is the EARTH/ground. E=mc2 IS F=ma. GREAT !!! By Frank DiMeglio", "votes": "0", "replies": "", "reply": true}, {"vid": "Ey25vULQ6YM", "cid": "UgxRSKWCFST_SZoq-rp4AaABAg", "comment": "as expected of MIT", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwqpffMB6ZyWsdat6B4AaABAg", "comment": "you have some great stuff here", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzEqmjIFUUmWbxLrnt4AaABAg", "comment": "I Really Like The Video Wave-particle duality of light From Your", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyCp0WSsueL4s7ZKOV4AaABAg", "comment": "35:30", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzrrSTyfRH0_aQbQ_h4AaABAg", "comment": "at 35:34 did she mean to say wave instead of particle?", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzQvbMWZugCUKKrN5x4AaABAg", "comment": "@brian5446 Except it's chemistry.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugx1hYAmMLzPvrt2jXB4AaABAg", "comment": "can some one point me out to a lec. on the law of super positioning?", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugx1ifQvwHcR-WOSibt4AaABAg", "comment": "Science is sexy. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwoZZs_VcctGxYiynx4AaABAg", "comment": "Man she is hot. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugxgjt9IzrE8C8IGDFx4AaABAg", "comment": "@mrallankey \"awesome lecturer! I have never found chemistry this interesting and easy﻿ to understand\" . Sure! That's probably because no one has ever (tried to) present Physics to you with a different name, which is what this lecture is about. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgwSmSfuOnR_HdCw32d4AaABAg", "comment": "(T)thats not the reason (why) we need quantum mechanics at all. (T)that(Thats)'s like saying (that)the (N)newtownian mechanics (doesn't)don't work because the moon is not (i think you mean (crashing))crushing into the earth. (E)ever heard of (B)bohr's model of the atom? (C)chemists...﻿ :P", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgycwTxLhe6hYmKFWeZ4AaABAg", "comment": "@rustyscrapper Yea, cause that's how you get to be a professor at MIT.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgxTUbbkF2VsCyYQ7Z94AaABAg", "comment": "I guarentee the lecturer was a career student now in her 30's having attended universtiy her entire life and being hired as a profesor after 12+ years of university education, the only reason being hired. Puking out what she was taught, not really understanding it but able to re produduce the lecture. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyugUKupBvYNn0Hq8N4AaABAg", "comment": "@bonnarj7 sounds like someone got a bunch of rejection letters.", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgyWXgByRffQEJclLIZ4AaABAg", "comment": "@bonnarj7 Oh wow yet another genius that's wasting time here on youtube.  You really didn't get what was the point to that exercise mate.", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzYx7NTN4Wsmg45JL14AaABAg", "comment": "But clearly this lesson is a lot much easier than the real ones for the undergraduate at MIT, I suppose... Can anyone confirm to me this aspect?", "votes": "1", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "UgzlonPU88FZZHp7giF4AaABAg", "comment": "7:20 thats not the reason we need quantum mechanics at all. that's like saying the newtownian mechanics don't work because the moon is not crushing into the earth. ever heard of bohr's model of the atom? chemists... :P", "votes": "0", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugwm-L4HJOc52Z8oE054AaABAg", "comment": "nice lecture...reminds me of my childhood crush.", "votes": "2", "replies": "", "reply": false}, {"vid": "Ey25vULQ6YM", "cid": "Ugwm50q8_KKGS_-PfGx4AaABAg", "comment": "perfectttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttt", "votes": "0", "replies": "", "reply": false}]