[{"vid": "eYzBJPSSFpk", "cid": "UgzEBTxLyyGeqkTQ1wx4AaABAg", "comment": "👏👏👏👏👏👏👏👏", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "Ugji4pYGSDgvhXgCoAEC", "comment": "you are such a good teacher...you get me engaged in ur lectures..i hav never concentrated in my chemistry lectures in my life...but i can keep watching ur lectures...they are perfect.....thank you..u r great...  :-)", "votes": "1", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "UgiQixuxRoezkHgCoAEC", "comment": "This is great, in 9 videos you covered an entire chapter from my book. Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "UgiUYOIMh9BBy3gCoAEC", "comment": "Thanks you, Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "Ugx545WiY8BmoiEVJnh4AaABAg", "comment": "Great! Best of luck, it can be a challenging course! Let me know if you have questions :)", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "UgzEVaJqdTtfyvs7T3J4AaABAg", "comment": "I am taking Chemistry at Oakton Community College in Des Plaines, Illinois.", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "Ugwa3MfB0aTGUGfUk7h4AaABAg", "comment": "By the way, where are you taking chemistry?", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "Ugx8-iXh9_PqHpfdt6F4AaABAg", "comment": "Hey! Thanks for watching! I am actually working on a website right now. YouTube is horrible with organize videos and topics. If you go to the inroganic chemistry playlist, all those videos are in order. So just check out the next video in line. I believe it should be the one on effective nuclear charge. Let me know if I should message you the link to the playlist. ", "votes": "1", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "Ugy52SUbo65qna4Xzfp4AaABAg", "comment": "I can't figure out which video is the next in this series - please post a link if possible. PS thanks for all the work you have done.  It has made Chem 122 much easier to understand (still not easy)", "votes": "0", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "UgxUgMlbieSho5v_uxx4AaABAg", "comment": "Just because we go down a group, does not mean that we necessarily gain another electron shell. Like in this case, the number of shells remains the same but the number of protons changes. Your statement would be correct if we were talking about a normal situation where the next atom after Neon  gains a proton AND an electron. The addition of that electron would in fact add another shell level. But this is not what we are talking about at the end.", "votes": "1", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "UgyY3K9mtNw-JmGgdId4AaABAg", "comment": "Actually, what I said in the video is correct. We are talking about isoelectronic atoms here. That means, by definition, the two atoms have the SAME number of electrons but different number of protons. So, the next atom after Neon gains a proton but does NOT gain an electron. That means, since it has the same number of electrons but more protons, the nucleus pulls the SAME number of electrons closer, thereby decreasing the radius. ", "votes": "1", "replies": "", "reply": false}, {"vid": "eYzBJPSSFpk", "cid": "UgyybALS2DqTC97NJkt4AaABAg", "comment": "The only flaw in this video is at the end. An atom with ten protons is Neon, meaning that the next atom up should actually get bigger rather than smaller because it gains another valence shell (because it goes down on the periodic table) ", "votes": "0", "replies": "", "reply": false}]