[{"vid": "f7RRqxv2pzg", "cid": "Ugy3uj1cff0zP73JnlB4AaABAg", "comment": "37:33", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgwkiOEiG58nnG4hgzh4AaABAg", "comment": "33.31", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgyD_V3ZsBp9ZRL5dMR4AaABAg", "comment": "I have a question about the effective charge. At 25:09, the calculated Zeff is 1.34, however, on Wiki or other textbooks, the Zeff is around 1.65 according to Slater's rule (but they didn't show how it's measured). Why they are different?", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgyoHTwb522rpiLbkil4AaABAg", "comment": "Around 25:45. Why is it necessary for Zeff to be between 1 and 2? Couldn’t electron that is closer to the nucleus repel the other one and not only shield the positive attraction?", "votes": "1", "replies": "1", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgyARLAyK45ROaLxklJ4AaABAg", "comment": "H, He, Li, Be, and B are important wrt studies in fusion power generation, as in the ITER research unit. This lecture tells one clearly on filling electron portal orbital for elements.  Thank you.", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgxdCFzjjK_eZv_bTTt4AaABAg", "comment": "What an amazing lecturer. If I had had teachers like this in college I would’ve been a scientist. Oh well, maybe in my next life…", "votes": "2", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgwybDG8F9Nhy97hBgV4AaABAg", "comment": "I am watching 3 different chemistry professors (Yale, MIT, Georgetown) teach the same material, and comparing/taking_notes. The story behind this lecture: Clementi & Raimondi were at IBM c.1960. They had access to IBM supercomputers to work out multi-electron functions, but they developed this Z-value modifier method for chemist who could not expect to ever have access to IBM's hardware vault. Basically, they just tweaked the value of Z for every orbital configuration until the outputs most closely matched what their computers said. You can google their names to get their values tables. Source: https://youtu.be/WEg0HGo5tUA?list=PL3F629F73640F831D&t=292", "votes": "1", "replies": "1", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgxCvsswDXtDDCtBBMR4AaABAg", "comment": "only 37,000 views?", "votes": "1", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UghbeAjSjWDAO3gCoAEC", "comment": "why subtitles? she has such a perfect speech", "votes": "1", "replies": "1", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UghCdD4Sf2AI_HgCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again", "votes": "1", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "Ugg4TaA5MO5VYXgCoAEC", "comment": "The final point concerning formation of positive ions is also ad hoc, not to say plain incorrect.  www.ericscerri.com   Please see blogs on these issues on this website The order in terms of energy IS the same as the order in which it fills contrary to what is stated in the video.   See E. Scerri, Education in Chemistry, November, 2013, p.24-26.  ", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UghpyDBh9Pz8aHgCoAEC", "comment": "On the question of the second transition, the speaker carefully avoids mentioning the other 4 anomalous configurations and makes it sound like half-filled subshell and full-shell as in Cr and Cu respectively are necessary and sufficient condition for anomalous configurations.  They are not.  That's why W is not anaomalous and so on.  www.ericscerri.com", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "Ugja9UD-m86tg3gCoAEC", "comment": "Nice presentation.  However, 4s is not lower than 3d for Sc and successive atoms.  The 4s does not fill first in any of the first transition atoms.  Please see \"A Tale of Seven Elements\" or article in Education in Chemistry, November, 2013.    www.ericscerri.com ", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgxHDW885Yd32L515aF4AaABAg", "comment": "mit teacher are so awsome i got a asian teacher in my uni who really cant speak english very broken english ", "votes": "2", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgwFKA5zb48hfzPXsit4AaABAg", "comment": "Keep in mind that this is their first time learning the subject material. I feel the same, but I understand that they are learning it for the first time.", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgwovJVHIxRDmnIObXd4AaABAg", "comment": "after watching this lecture i actually realize how crapy my uni is compare to mit, thank you 'mit' thank you for uploading this video, you have indeed shown a great deal of excellent world class quality education, for many many ignorant people like me that didnt even have a chance", "votes": "17", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgwvlZMHMW9V1xbiH_l4AaABAg", "comment": "@brickfacade  same here", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "Ugx_mug7ZvhJo01D5iZ4AaABAg", "comment": "@pghaffari lol, I'm watching this b/c of UCLA chemistry. Agreed", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "Ugw7OT66inuRRs8Qrbh4AaABAg", "comment": "@qiqi9057033 Each d orbital can hold 2 electrons:  5*2=10  1:35 ", "votes": "0", "replies": "", "reply": false}, {"vid": "f7RRqxv2pzg", "cid": "UgyoHTwb522rpiLbkil4AaABAg.9DBTWWoC2Rf9Ek4ic2XrJ_", "comment": " Dirk Knight  A (what I assume) very good answer although it is completely above my understanding of the topic. Nonetheless, thank you a lot!", "votes": "0", "replies": "", "reply": true}, {"vid": "f7RRqxv2pzg", "cid": "UgwybDG8F9Nhy97hBgV4AaABAg.8eYD_5AkCHH9cVMAAMvel_", "comment": "Interesting thanks for sharing this 4 years ago! hahaha", "votes": "0", "replies": "", "reply": true}, {"vid": "f7RRqxv2pzg", "cid": "UghbeAjSjWDAO3gCoAEC.8DKwPrijWjm8Ueyus2M27c", "comment": "deaf people, berkleys stuff got taken down because not all of it was available for deaf people", "votes": "3", "replies": "", "reply": true}]