[{"vid": "h5KiY9lvHc4", "cid": "UgxMAw-IZVbBFhfdUex4AaABAg", "comment": "The goat 😢", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgwtNl9g1_b4JFPEDYl4AaABAg", "comment": "Great explanation of eigenvalues and eigenvectors at 21:49", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugzbka_TooAnb4swtRx4AaABAg", "comment": "One suggestion for the camera person, don't follow Prof. Strang around too much, or zoom in too far into a single part of the board. We can see the board fine from afar. It's better to pan out onto the whole board or 1.5 boards to get a better picture of the overall picture.", "votes": "0", "replies": "1", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ughhaj5n-NXkeHgCoAEC", "comment": "the te^(lambda.t) is when you have roots with index multiple. In control engineering, we call it multiple pole.", "votes": "2", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ughx1sew8_n7gXgCoAEC", "comment": "This course is for graduates, but for now nothing new comparatively with usual Linear Algebra at the first or second year.", "votes": "2", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgigqwxbbYaaZHgCoAEC", "comment": "for the real similarity should be said: -(du^2)/dx^2=Delta(x-a) corresponds to (K/(h^2))*u=((column of I)/h)", "votes": "1", "replies": "2", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ughecqn_a1jaMHgCoAEC", "comment": "33:00 Why do we look only at the real part for continuous when it's the modulus for discrete?", "votes": "0", "replies": "2", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UghssIEESGZJGHgCoAEC", "comment": "4:30 thru 11:00 - I get how these numbers correspond to the picture. Why does drawing the picture correspond to the matrix inverse? And why do some of the inv(K) columns peak at 6 whilst others peak at 4?", "votes": "1", "replies": "4", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugyc1_C-ftEIstW1S1F4AaABAg", "comment": "I'm jealous, all our lecturers use PowerPoint. PowerPoint makes anything boring and hard too understand. This lecturers method is way better.", "votes": "2", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugxlpv_55_7TtSlyZU54AaABAg", "comment": "typical youtube nobody ; )", "votes": "1", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugx-ZtM_O-tLidIzF8l4AaABAg", "comment": "typical pointy headed logician", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgyI-xuvWVecCfNza0J4AaABAg", "comment": "every word of him is treasure!", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgyLZCoFfNKphdSFrHd4AaABAg", "comment": "Don't watch it if ur being childish about it so Booo you !!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgxSQRIFL5DmGJX-9GR4AaABAg", "comment": "This guy's a boss", "votes": "1", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgyNnK9NFWUg5iT0CVV4AaABAg", "comment": "Thanks for sharing,\r \r From Colombia.", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgzjO9fUozWmdNgc9oV4AaABAg", "comment": "... not followin ya hehe. I promise to watch all the lectures in the expected order.", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugy7nExbRM7lBp4OOzh4AaABAg", "comment": "lol they kept it real back at you", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugyajw9tBBdtIkk3IrR4AaABAg", "comment": "He ind of reminds me of Jimmy Stewart.", "votes": "1", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "UgyirBwKovPK1J_fRxR4AaABAg", "comment": "great video mit\r thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugy2efXcKyL853xZ4Ol4AaABAg", "comment": "why would you rate this one star???", "votes": "0", "replies": "", "reply": false}, {"vid": "h5KiY9lvHc4", "cid": "Ugzbka_TooAnb4swtRx4AaABAg.8kxrhCSLAht9IXy2TSSg0V", "comment": "Camera got me crazy at 19:28 lol", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "UgigqwxbbYaaZHgCoAEC.7-H0Z7-GoPK8RiKACUyhfN", "comment": "Exactly right.  For some reason, he frequently omits the /h part of the RHS.  Even in his book, it's presented at the end of this section almost as an afterthought, yet you can never get the discrete solution to match the continuous one if you don't recognize this.", "votes": "1", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "UgigqwxbbYaaZHgCoAEC.7-H0Z7-GoPK9F0Ftm1idV0", "comment": " @davidlovell729  is there an explanation of why the RHS is divided by h in the book? I worked the example in the video through and was out by a factor of h", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "Ughecqn_a1jaMHgCoAEC.7-H0Z7-J4w18RiOkrHwl3R", "comment": "For the continuous problem, e^(a+bi)t can be factored into e^at x e^(bi)t.  e^(bi)t is a sinusoid.  It oscillates steadily, forever.  The only thing interesting about it is its frequency and phase.  If a>0, then e^at grows and grows, so the product grows and grows; e.g. the oscillations get larger and larger.  If a=0, then the answer is the sinusoid itself.  If a<0, then e^at is always decreasing, so the product is always decreasing, so the oscillations get smaller and smaller.  He explains the discrete case quite clearly.", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "Ughecqn_a1jaMHgCoAEC.7-H0Z7-J4w199_aO3PbO7K", "comment": "Modulus is correct. When you exponentiate a complex number, the e^(real part) becomes modulus. Eg 3+4i modulus is 5 but for e^(3+4i) modulus is e^3", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "UghssIEESGZJGHgCoAEC.7-H0Z7-9Mto7-ogWb-e3vc", "comment": "you should look at the real columns displacements. if you load a column (real column made of steel) at some height the displasement differs as the greens functions. Factor of 1/5 for inverse of K is also make sense. Just draw the graphs of green functions and figure a for the matrix entries. its simple and clear.", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "UghssIEESGZJGHgCoAEC.7-H0Z7-9Mto7-ogbaXLMyE", "comment": "for K matrix the steel column is fixed at the top and at the bottom.", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "UghssIEESGZJGHgCoAEC.7-H0Z7-9Mto7-ohDy6znjF", "comment": "if you load the steel column at different heights the maximal displacement is different. If the load is closer to the top, for example, you understand that the displacement at the loaded point is smaller.", "votes": "0", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "UghssIEESGZJGHgCoAEC.7-H0Z7-9Mto8RiM88RGOzT", "comment": "Suppose you have any invertible matrix K, and you have its inverse.  The equation KK^-1=I can be broken down by individual columns of K^-1.  K times the first column of K^-1 gives you the first column of I, which is also how we're representing a discrete impulse at the topmost position.  K times the second column of K^-1 gives you the second column of I, which is how we represent a discrete impulse at the second discrete position.  And so on.  In other words, the columns of the inverse represent the response that this system would have to the columns of I, e.g. to discrete impulses placed at all of the possible locations.  Since the inverse is used to determine the response to ANY discrete vector, what this is saying is that you can decompose any discrete input into linear combinations of discrete impulses, and the response for that input will be the same linear combination of the columns of the inverse matrix.  This is linearity and the superposition principle.  To your second question, if instead of a 4x4 system we had a much large system, you would see that the diagonal entries in the middle of the matrix are larger, and they get smaller as you get to the top or bottom of the matrix.  K represents the fixed-fixed situation, so the endpoints are constrained.  Thus, if you put the load closer to one end, rather than in the middle, there is a limit to how much it can stretch the bar.  The stretch is maximum when you put the load in the middle. You could also pose yourself an interesting geometry problem: if you have two line segments, one starting at (0,0) and one ending at (1,0), and they meet at an intersection inside [0,1], and their slopes must differ by exactly 1, what location should the intersection have to maximize the height of the intersection?  The answer will be exactly at x=0.5.  Since the left slope is 1-a and the line runs until x=a, its height at its peak is a(1-a).  For what value of a is a(1-a) maximized?  The answer is a=0.5.", "votes": "2", "replies": "", "reply": true}, {"vid": "h5KiY9lvHc4", "cid": "Ugz1S0gLgEwHcX24f6h4AaABAg", "comment": "third", "votes": "0", "replies": "", "reply": false}]