[{"vid": "h9wxtqoa1jY", "cid": "UgzyUJV2foD2U3BZEfZ4AaABAg", "comment": "One major point of this lecture is Graph Coloring. Winston had an entire lecture on Graph Coloring in 6.034 that is extremely good: https://www.youtube.com/watch?v=dARl_gGrS4o&list=PLUl4u3cNGP63gFHB6xb-kVBiQHYe_4hSi&index=8  This is a bit strange as 6.042J is a pre-req for 6.034 . Why is same topic covered twice?", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw1bwBFlAQKxrol_Dx4AaABAg", "comment": "The term 'opposite-gender partners' is not the best choice for the example discussed in the lecture. The example is actually about comparing the average number of opposite-gender sexual relations, not the number of distinct opposite-gender sexual partners.  The lecturer mentioned that the sum of the degrees of the F vertices represents the total number of opposite-gender partners for all females. However, this isn't entirely accurate. Imagine a scenario where all females have the same male partner. In that case, the total number of opposite-gender partners for all females would be just one, which doesn’t reflect the actual total number of edges in the graph.  A more accurate description would be to say that the sum of the degrees of the F vertices represents the total number of sexual relations with opposite-gender partners for all females. This phrasing correctly accounts for the actual number of interactions (edges) in the graph, rather than just the number of distinct partners.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwrCeD-zsn6yG6jnbx4AaABAg", "comment": "I just ge a bit frustrated when I notice there are empty chairs in the room... If I had known I would have taken a flight from Sweden just to attend...", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugyx3AdKV5stkKrBbjd4AaABAg", "comment": "damn. guy does the university's job for them and saves the day. and having himself a stess-free christmas. a real chad", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgysoioNmGl0bx2CO0N4AaABAg", "comment": "If the study is on the median instead of avarage number of partners then it's not that trivial. Also the surveys still tell a story. Men tend to overexaggerate the number of partners they had much more compared to women.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzzjLH9DnJ_x9lqt5V4AaABAg", "comment": "World class teaching ! this is MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugxn7E85-C-7wIq6hwR4AaABAg", "comment": "It'd be nice if the videos from this playlist had the subject in the title and not just in the description.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugy4H0wHV3KJTBKFjFl4AaABAg", "comment": "Ik this is 10 years late but this was a great lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwkOy60QHA3jcSeONN4AaABAg", "comment": "28:48", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwwAwHZg4C2bng2USR4AaABAg", "comment": "24:30 I think he meant to write Vw over Vm but he wrote Vm twice", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx2Fqd3FYNZPB_A18Z4AaABAg", "comment": "49:18", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzkIoAhJiAGSTFdNpl4AaABAg", "comment": "I watched  the whole lecture and answered the questions as a real student  it's really fun to learn from  MIT OCW", "votes": "2", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyleYFYbqkW18oPItF4AaABAg", "comment": "At around 52:19, the professor said that induction on d didn't work and would be a nightmare. But I can prove it by induction on d only. First, pick a the vertex whose deg is d + 1, removed it and all the edges containing it. If the remaining graph stil has a vertex whose deg is d + 1, then keep doing like above untill we get the final graph such that each degree is <= d. (remember each step we removed not only the vertex degree d + 1 but also the edge contaning that vertex ).   Notice that there are no removed vertices adjacent each other. We can prove this by contradiction. Assuming there are two removed vertices called a,b such that a and b are adjacent. We can also assume a is deleted first. After deleting a, the degree of b would be d ( as b is adjacent to a). This means the vertex b, as a result, will never be cleared. This contradicts to what we are assuming above (a,b are two removed vectices)  Applying the induction hypothesis on the final graph, we need <= d + 1 colors to colors this graph. Now rejoin all of deleted vertices and edges. We can choose a color to color so that all removed vertices have the same colors (we can do so as they aren't adjacent to each other). Whether this color is old or new, the number of color we use is still <= ( d + 1) + 1 = d + 2.", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxltmfzAFBq5T4ou5Z4AaABAg", "comment": "At first, we proved that the basic algorithm will use at most d + 1 colors on any graph. But then in the star graph, the basic algorithm could only color it with two colors no matter the order but according to the theorem we should be able to color it with d + 1 colors using the basic algorithm but we can't color it with more than two colors using basic algorithm.  Isn't this a contradiction? Plz, help me understand.", "votes": "0", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwGi84uP6o1NahoOCB4AaABAg", "comment": "I like this approach to graph theory, but the population statistic cannot sufficiently analyze the social patterns studied in a real survey. The graph theory assumes the maximum amount of edges based on the maximum amount of nodes. A real survey is a statistical method for refining that graph theory, therefor the opinion of a professional statistician would be that the 2500 samples from the University of Chicago survey is a better estimate than universal graph theory. The graph theory would estimate a minimum average by virtue of the population of the universal set.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugy00rwVFVbalsYCC5V4AaABAg", "comment": "I have became your fan! Thankyou very much for you wonderfull lecture", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgybfqAZjGfhPZ1KPdF4AaABAg", "comment": "The promiscuous example is oversimplified and  interpretation of the problem is incorrect. Here it is an example of the proper interpretation: Let it be a set of 2 males and a set of 11 females. One male has 10 females, the other male has only one female. So. There are 11 edges in total over 2 males that is an average of 5.5 edges per male, and an average of 1 edge per female. That is, promiscuity is 5.5 higher in the male side. And no promiscuity in the female side. Promiscuity is not the ratio of populations but the degree of the node.  I believe that mathematics is an excellent tool to study nature but we need to be very careful how we translate natural phenomena into the language of math, otherwise we could get erroneous information.", "votes": "0", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx9fc-oHpJHL3dMb114AaABAg", "comment": "WOW. Simply amazing from CEO of Akamai. He also linked these problems to what was solved at Akamai.", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw1vxlqAx5gScNzpbl4AaABAg", "comment": "This lecture is really entertaining, spent some nice time.", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyxArZ5mtJ6s4DgWfV4AaABAg", "comment": "The sex partner ratio still tricks me. Is the calculation involving average relationship telling the true stats story?", "votes": "0", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxltmfzAFBq5T4ou5Z4AaABAg.9brP9Mr3rE49cw8pZZcuHu", "comment": "it is atmost d+1, d+1>2 so the theorem still holds for this case.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgybfqAZjGfhPZ1KPdF4AaABAg.9a4xvc0DELn9yRZMzXpBwy", "comment": "You just explained what was done in the lecture. Same analysis and same figure (#females/#males = 11/2)", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyxArZ5mtJ6s4DgWfV4AaABAg.9WPqh02qzOK9WiuzmD8_V5", "comment": "It would be a different story if we used median instead of average, and I think this is what the surveys are telling us.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyxArZ5mtJ6s4DgWfV4AaABAg.9WPqh02qzOKA26yPYPFrlv", "comment": "True but misleading, one can draw completely lopsided graphs where M or W have way more more connections (increasing the number of \"singles\" on the other side) and still get the same average. The median however, will tell a completely different story.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugy7iEj4gaujF3a2jMV4AaABAg", "comment": "I'm amazed this guy hasn't been cancelled", "votes": "4", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxLaEvXUz2A6wNFoP54AaABAg", "comment": "I think the last two lectures by that other professor are put in just to remind us how good this one is.", "votes": "3", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw_UsbfSOtbhQkcBpR4AaABAg", "comment": "Much more interesting than some netflix tv series lmao", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzQueTiAh9u4MHhdhZ4AaABAg", "comment": "Awesome lec 🔥🔥", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzIPLC06_vHJdOCPWR4AaABAg", "comment": "Stupid question: isn't the fixed wall behind the two mobile blackboards, a third blackboard as well? Because they always write on the two mobile ones only.", "votes": "3", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx2KeLnoWiUu3T9_JR4AaABAg", "comment": "Can confirm I've tapped at least 50 broads", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx5KWXJKH4kl5F4CId4AaABAg", "comment": "This is a solid quality of teaching by MIT professor Tom  Leighton. The introduction to Graph Theory and Coloring is the backbone of Computer Science. There are many application of Graph Theory and Coloring in the world in which we live.", "votes": "6", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw67vsfEuBQdh5bUMV4AaABAg", "comment": "Awesome professor.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyLFNpZ8moa82xXfGR4AaABAg", "comment": "This session reminds me of junior high school mathematics. Too bad my college profs were not as fun and interesting as Prof. Leighton. This was a fun watch, even for an old guy like me. I bet he made the mistake at the end to make sure the kids are paying attention.", "votes": "8", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugziy_tcUPPv3bnJw694AaABAg", "comment": "Feels like I'm studying from Mobius. A great teacher indeed.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxgPMFJ0uXltfKRu5B4AaABAg", "comment": "0:25 dude sitting in the gray shirt shares meme with his friend", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzSqhbLsZherTnL6Qp4AaABAg", "comment": "Can I watch just graph theory lectures skipping the first 5", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzKbcNWK4IRwAgQu2V4AaABAg", "comment": "Example :    11:00", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzsytxUQg8yy2f8pot4AaABAg", "comment": "Now i learnt graph theory. Amazing lecture", "votes": "5", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxaD_oIfwj062zSlV54AaABAg", "comment": "Where are lectures 1 to 5?", "votes": "0", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzE25cMSokL1zSvtUp4AaABAg", "comment": "Great Course  Basic Graph Coloring Algorithm :   43:00", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw68OmbCSXdjNWZfHZ4AaABAg", "comment": "This is pure gold lying here for free!", "votes": "2", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgymkEFhpfgxPOqUuMJ4AaABAg", "comment": "In that first example involving two opposite genders, you are assuming that everybody in the population performs that \"act\". So, I think it is important to note that.  I write act because I think my comment got auto removed multiple times for using the original word.", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyBtnCLBnqU3NQbKt54AaABAg", "comment": "Imagine teaching this exact class to a group of \"SoCiAl sCiEnCeS\" students in a highly liberal university.", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugz8G4XW6zbvsL6S6P54AaABAg", "comment": "This was an awesome lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugy7iEj4gaujF3a2jMV4AaABAg.9WLc4Ztlgl19WSe7GriX6K", "comment": "I don't understand... why do you say that?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugy7iEj4gaujF3a2jMV4AaABAg.9WLc4Ztlgl19WVAyEI5iuK", "comment": "Why do you want him cancelled?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugy7iEj4gaujF3a2jMV4AaABAg.9WLc4Ztlgl19WVh0d5T3f9", "comment": " @Nora-bv2el  I don't want him to be cancelled, I'm just amazed someone wasn't \"triggered\" by his discussion of two genders", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgzIPLC06_vHJdOCPWR4AaABAg.9TlXOywmUMX9mcfS7e3c__", "comment": "Yes(I went there). Sometimes, but not usually, profs would use that *forbidden 3rd back blackboard*. To answer your question, when they did that, then you couldn't follow lecture as good bcuz part of the board was blocked", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxaD_oIfwj062zSlV54AaABAg.9OSacnIeBxk9OT19qLK_tN", "comment": "https://www.youtube.com/playlist?list=PLB7540DEDD482705B", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxaD_oIfwj062zSlV54AaABAg.9OSacnIeBxk9OTWl3Doq5P", "comment": " @mitocw   Thanks. I got to this video through a different playlist which started at lecture 6.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwPmWOW6uQXHySbBfh4AaABAg", "comment": "5 min into the lecture, I've had to grab my earphones 👀", "votes": "3", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzAufAINakPjYcpy4F4AaABAg", "comment": "37:37 millenial problem", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxTivOVj7ArY8IvzdZ4AaABAg", "comment": "There is only one problem with the \"promiscuity calculation\": The assumption is that all men and all women find at least one partner. However, everyone who understands biology/behavioural science should know that not everyone will. Moreover, there will be always more men than women who cannot find a partner. Therefore - in a realistic scenario - there will be fewer \"male\" nodes than \"female\" nodes in the graph. And, I guess, no one wants to admit what that implies...", "votes": "1", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwwSOgoOChUvusVV2N4AaABAg", "comment": "Are there any recitation videos for this course?", "votes": "0", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwN8y1zPNQxnOdZeTd4AaABAg", "comment": "The average for women is more evenly distributed, the distribution for men is heavily skewed, the average for the top 20% would be miles higher than the average of the bottom 80% which is close to 0. The way its set up, if you randomly picked a man and woman off the street, the chance that the man has more than the women is extremely low as theres an 80% chance the man will be in the bottom 80%. Thats the only useful observation you can make.", "votes": "2", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwluXlLACnZ-c05vJZ4AaABAg", "comment": "i should be paying MIT for classes instead of my local college. they just gave us modules and expect to read and understand them without any guidance.", "votes": "3", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwHe-0Ohyy25h0iAy54AaABAg", "comment": "52:12 can somone explain why should i prefer working on n instead of d, and is this generally a good approach? i didn't understand very well.", "votes": "2", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugz0QuiQhPwv9S1zcWd4AaABAg", "comment": "Jefe", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugwylna0uM9ueHXs_D94AaABAg", "comment": "Loved this.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyjarnpLYgvgzDn5FR4AaABAg", "comment": "@1:02 he says we are working with d+1, so I'm wondering where is this coming from?", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugz7kTvfviRZ0m2-jRZ4AaABAg", "comment": "if teacher == \"This Great at Teaching\":     blow(mind)", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxH8l3OqIbeRUJAupt4AaABAg", "comment": "Lol,just when you think this guy cant get any better at teaching,he comes in and says today we are going to talk about sex in a math class.The other guy certainly knows his math but is not cut to teach.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwM6lKqiRsBFBUBbzp4AaABAg", "comment": "He has nice hand writing - chalk boards aren't the easiest surfaces to write on. But in the end, it just goes to show that \"elite universities\" in the US aren't more advanced (or even inferior) to your run-of-the-mill average German university. I feel sorry for the people who had to pay top dollars to attend this class.", "votes": "1", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwaJrIgAUdH8gzQfOZ4AaABAg", "comment": "Damn, He is the coolest Prof ever. I wish he is the Prof all through collage", "votes": "8", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxwlkAfWyVJzovALz14AaABAg", "comment": "I love MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgydR5VVblXXKmWbAaV4AaABAg", "comment": "Assignments with solutions : https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-fall-2005/assignments/", "votes": "7", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwJ4m-YssU01pXpdgV4AaABAg", "comment": "I wonder what exactly do Vm and Vw cover. I think it's only correct if they are the number of men and women who was once in a relationship... it can't be the total number otherwise it's not correct. Taking an extreme example, if there are 100 men and 100 women, but only 50 women have ever entered into a relationship, then it should be the number 50 that is used here rather than 100. But how can we know this number?", "votes": "1", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyfzkkHJOvp8vRZI7R4AaABAg", "comment": "omg my mind was blown when the cardinality of the edges cancelled out", "votes": "24", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwB1qi8fbDh2SXsqS54AaABAg", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs? Please help", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugy2ULYgJuSKM4inRKt4AaABAg", "comment": "I'm here because of Zach Star.", "votes": "1", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxTivOVj7ArY8IvzdZ4AaABAg.9KB3tSn8DBH9KKMSGKzSv6", "comment": "There is no problem with his calculation even then, it's just that average is really useless indicator here. Manually calculate some extreme examples to convince yourself of this", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxTivOVj7ArY8IvzdZ4AaABAg.9KB3tSn8DBH9QK32NDA8yx", "comment": "That should not be a problem, The degree can then be 0 , and the thing is for every woman who finds a partner, there is a man, So the logic holds", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwwSOgoOChUvusVV2N4AaABAg.9JrCd_1zBI89JuX8emynvU", "comment": "There are not any recitation videos but there are recitation notes: https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-fall-2010/recitations/. Best wishes on your studies!", "votes": "4", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwluXlLACnZ-c05vJZ4AaABAg.9GMtJDUDQKK9L9bsldTe7F", "comment": "Same problem", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwluXlLACnZ-c05vJZ4AaABAg.9GMtJDUDQKK9Sb3xISsSJb", "comment": "Same for me. They just gave me a text book and basically said good luck you have a quiz at the end of the week. I understand absolutely nothing from this class.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwHe-0Ohyy25h0iAy54AaABAg.9FIF0xPp4HV9cw8eiZQq71", "comment": "we have to consider degree of each node if d is in predicate, which is pretty hard whereas in case of nodes, it is pretty to prove the induction hypothesis", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwM6lKqiRsBFBUBbzp4AaABAg.99ouGeMFlhd9D-d_rd0WCS", "comment": "It doesnt matter what tech you use to teach your students as long as it gets the job done,Some like learning with traditional chalk board ways because of subjective reasons(familiarity, distractionless,tangeable) Which makes it easier to pay attention to.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgydR5VVblXXKmWbAaV4AaABAg.98kvKUMacBE98kvponD4yu", "comment": "@Michael Nesler You're welcome :)", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwJ4m-YssU01pXpdgV4AaABAg.98fr4SOn3D89KKM8I4q387", "comment": "Writing this for future people cause I was confused about this too. He is correct even in extreme examples, write out simple extreme example (with say 10 women and 10 men) and follow procedure he did, and calculate AVERAGE NUMBER OF DIFFERENT PARTNERS manually too, compare results, it checks out", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwJ4m-YssU01pXpdgV4AaABAg.98fr4SOn3D89LAMApt-D9A", "comment": "Well, he is just drawing numbers. The exercise means nothing and it is unscientific to model life this naively with no argument whatsoever. He puts axioms that oversimplifies the problem, thus the result is (as he says) stupid. It's a good example for studying graphs though.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugy2ULYgJuSKM4inRKt4AaABAg.97uItl3eNsR9Awc24K0wd2", "comment": "Zach Star?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgzPhtH19UWfX9Sd86l4AaABAg", "comment": "That's excellent.... outstanding..", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwBq0lohn2Th4RgPYB4AaABAg", "comment": "Great professor! Learned a lot today!", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzBx_Cr7NESBVB_U754AaABAg", "comment": "Vera level!!!", "votes": "2", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugz9gxcQ0ZeZLlIsWzd4AaABAg", "comment": "Dad: What are you learning? Me: Who shagged who.", "votes": "56", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyW9vkSj7UZGFYko7d4AaABAg", "comment": "This guy has to be the best mathematics lecturer in the world.", "votes": "15", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxBCdnCAZ2JWa7jGr94AaABAg", "comment": "Robotic cameras siting in the classroom.", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugz7Zy_1nTj7TCgmuaF4AaABAg", "comment": "Doesn't he ask the wrong question? Instead of finding the average number of edges per node, shouldn't he be comparing the percentage of nodes with an incidence of 1 in both groups. That would be a better modeling of promiscuity i believe.", "votes": "2", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyLjz1AbKWLAPvFcrF4AaABAg", "comment": "I have been watching videos on Graph Theory but this is the first time some one is providing an actual real life example and I now finally understand what the heck graphs are good for. Man, why are maths professors so bad? Instead of showing their ability, they need to focus on actually teaching aka transmitting real knowledge to students with real life examples. Thank you!", "votes": "33", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyOJt1oLGoUQ5ybLwJ4AaABAg", "comment": "Wouldn't single people be considered in the male and female population aka nodes with zero degree?", "votes": "1", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzCgnInj6JYm1IkDxJ4AaABAg", "comment": "teaches like a God", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwVkA-WKEzLUa-2BEd4AaABAg", "comment": "is your daughter at MIT now??", "votes": "3", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxvWfkCzwurdd57wY94AaABAg", "comment": "The ABC News poll was 233%, or 2.33 not 3.33 as written by the summation and equations on the board. Also, if Avg men is the numerator and Avg women is the denominator (cancellation does not imply cross-multiplication), the ratio would be 96.85%,  not 1.0325 or the 3.25% proffered in the lecture. A little coffee for the professor would be good.", "votes": "0", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxxYkL9yImHcjkA0d54AaABAg", "comment": "this is why MIT is ahead of IITs.  teachers do matter", "votes": "11", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx4v0KyjwPZ73uhdgJ4AaABAg", "comment": "The professor is really good! Thanks MIT!", "votes": "45", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyOW6PPpUBn9_QMhcF4AaABAg", "comment": "Awesome learning experience, sir. Thank you.", "votes": "3", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyVapsMhk3-olayUqd4AaABAg", "comment": "Perhaps the Chicago University and  ABC News studies looked at the median and not the mean?", "votes": "7", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw36Cy9mOCDnEA9msZ4AaABAg", "comment": "I know this was explained for the purpose of learning graphs but suppose only one man had sex with the entire population of women and the other men have never had sex. The average would've still be 1.03.  Wouldn't some more meaningful indicators be the mode and the median in this case?", "votes": "8", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugxm5w6DEh30EsRhq1h4AaABAg", "comment": "I’m surprised how simple these lectures are compared to other lectures. Is it because the material is simple, or is it because the presentation is clear?", "votes": "24", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwWlk_rkXj88UWPrlF4AaABAg", "comment": "Students were totally right when they said the worst case situation because this was as well how lecturer proved by adding one p(n+1) as it has d adjacents.", "votes": "2", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxJ4gxiMl2SGiXNeiF4AaABAg", "comment": "I think at 1h5m the alternative proof suggested does work. The student is saying that as d+1 is the maximum chromatic number for the clique case, other cases can't be higher since any other case is just the clique with one or more edges removed.", "votes": "4", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugz9gxcQ0ZeZLlIsWzd4AaABAg.954KaugtTaH9E9s7IP9xgn", "comment": "Dad: Oh okay! Just make sure you are not watching anything about sex.", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugz7Zy_1nTj7TCgmuaF4AaABAg.8zl7X7NI-7h8zry_38sVox", "comment": "He is just doing what those research claimed to do.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugz7Zy_1nTj7TCgmuaF4AaABAg.8zl7X7NI-7h9LAMsOFk9cR", "comment": "He's talking out of his ass. He presents an awful model all around.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyLjz1AbKWLAPvFcrF4AaABAg.8zEC6JrkF8V98GEwerTa_g", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs?please help", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyLjz1AbKWLAPvFcrF4AaABAg.8zEC6JrkF8V9gUFPpMPxw6", "comment": "mathematics does not need real life examples", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyOJt1oLGoUQ5ybLwJ4AaABAg.8y4rSd2EgWI9-AMw9cJkBG", "comment": "They wouldn't even be in the set of people who had heterosexual partners.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwVkA-WKEzLUa-2BEd4AaABAg.8vv2ktlRI2e8vv4Wu7Zsni", "comment": "Haaha", "votes": "2", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxvWfkCzwurdd57wY94AaABAg.8tOHthvTEx18tT-1LZaKFm", "comment": "Hey, Am/Aw meaning (1 + 2.33) / 1 = 3.33. I thought the report say greater than meaning addition to the men, not by ratio. BTW it's not a problem here.", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugx4v0KyjwPZ73uhdgJ4AaABAg.8qmcsO9AN7F98GEtleyuzE", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs?please help", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyVapsMhk3-olayUqd4AaABAg.8o6q9xW5xsJ9Cq9jhVQv5m", "comment": "The issue with the studies vs. the calculation is that the calculation is on a closed, self-contained set. The studies are not, because there are certainly partners who are outside of the study universe ... what impresses me about this video is how much material is covered in a relatively short time. I am an MIT grad from many many years back and it is a reminder of the fast pace and intensity of those days.", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyVapsMhk3-olayUqd4AaABAg.8o6q9xW5xsJ9CrRocfvvfy", "comment": " @bobnewell7888  Ha, it's been so long, I don't even remember what my comment was about.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugw36Cy9mOCDnEA9msZ4AaABAg.8o32dLEx-Qe9-hQcIn25sS", "comment": "I am not sure I understand what you mean. Could you elaborate with examples on how median or mode are more meaningful indicators?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugw36Cy9mOCDnEA9msZ4AaABAg.8o32dLEx-Qe95hExKCoyPE", "comment": " @satishchandrachitrapu6471  I think he means that average does not take into consideration how the data is distributed, because it's just sum over frequency. On the other hand Median gives us number of relationships the person in the exact middle of the distribution would have. So that is a better indicator of how the distribution is.   For example let's say values are - 1,3,2,1,3,4,99999,8,5,2 now the average would be - around 1000 and this would lead you to believe that on average everyone has 1000 relations...   On the other hand median would be 3 which is a much more reliable metric in this scenario.", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugw36Cy9mOCDnEA9msZ4AaABAg.8o32dLEx-Qe9LAMOdu76Cf", "comment": "The teacher presents an oversimplification that basically means nothing. Just a graph example.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugxm5w6DEh30EsRhq1h4AaABAg.8o-dKvqXlhd9EatUDJ6rBO", "comment": "He just talks more than what he writes so it gives you enough time to keep up. Past 2 lessons were so much writting on blackboard that you have to pause a lot", "votes": "8", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugxm5w6DEh30EsRhq1h4AaABAg.8o-dKvqXlhd9GCmDRZgj9w", "comment": "Given it is a introductory course on mathematic proofs, it is well explained; but yeah it is not very in depth considering the material.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugxm5w6DEh30EsRhq1h4AaABAg.8o-dKvqXlhd9JICWyUzbV-", "comment": "The lecturer does more talking that writing, which is easy to keep up with. You could even follow along with audio only.", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxJ4gxiMl2SGiXNeiF4AaABAg.8mek16pEbv39G8UncWgoLk", "comment": "Other cases include graphs with more elements, too.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwbNiXaVlxyJYgvpM94AaABAg", "comment": "This is one of the best displays of academic arrogance and ignorance. Sociologists  know better than he does.  A human society is not a set of dots linked by lines. Is he a node liked to his wife through an edge? Probably not all the time.  The Chicago study he quotes is based on the network theory developed by a physicist who knew better than him that nodes have attributes.  In a human society all nodes have different attributes, so the behavior of each node can be different and any time. That is what we call culture, race, ethnicity, socio economic status, sex preferences. This phenomenon is what engineers are unable to get: social complexity.  He twisted also the report about minorities, which says that minorities tend to study with minorities despite the fact that they are fewer in number.", "votes": "2", "replies": "4", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzJ_LK8v4OXGDt2aV54AaABAg", "comment": "Thank you MIT for sharing such quality teaching", "votes": "8", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx56icTaD1Jvps88Z94AaABAg", "comment": "1.07.55 at this time indian student is asking doubt # proud of it", "votes": "5", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugx_KK5as0semVWMuy94AaABAg", "comment": "This is pretty old, is this still up to date and everything?", "votes": "2", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgxZLi6J8ANndN81iiR4AaABAg", "comment": "But the assumption that every woman has dated and that every man has dated is flawed. If so, then the ratio of men to women dating would be tipped, and so greater numbers are possible", "votes": "1", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugzkw2RJMdGCzwrSdzB4AaABAg", "comment": "This is really fun! I studied in many classes about graph theory but only this lesson gave me examples which are similar with real life.", "votes": "8", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzxXZb3HrnvFYQ3Gq14AaABAg", "comment": "thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugw2hif4rC2xeIFtR854AaABAg", "comment": "18:45 \"In the US there's about 147.6 men\"  xD", "votes": "7", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugzfxg0K9hFC0m7vLCB4AaABAg", "comment": "27:01 because minority !", "votes": "15", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugzgxo59E1ynjnFJBZJ4AaABAg", "comment": "That is an execellent teacher", "votes": "72", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzuwzgrHvYzGdhgIUh4AaABAg", "comment": "Professor Leighton is wrong.  He only solves for the ratio of male vs. female promiscuity.  He does not solve for the net number of sexual partners.  Men having 3% more opposite partners could mean that men sleep with 1.03 women and women sleep with 1 man OR it could mean men sleep with 103 women and women sleep with 100 men.  The ratio is the same, but the net number of parters is completely different.  Leighton's comments are intellectually dishonest, and quite arrogant.", "votes": "3", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugybv13E83RNiQMdn7p4AaABAg", "comment": "Oh yeah. Zukerberg", "votes": "0", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwSV-phmo43n3-mD614AaABAg", "comment": "Thank you sir ...really awesome", "votes": "1", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzY0mGMVGj9_veuyMB4AaABAg", "comment": "Wish he taught at my school, I'd live in office hours 😊😊😊", "votes": "2", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgyX-vMqvsaHPg9bbPR4AaABAg", "comment": "Only result here is that men exaggerated the number they dated in the interviews :D", "votes": "20", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgiL3MsUKGOrG3gCoAEC", "comment": "That's very interesting lecture, I really enjoyed watching.", "votes": "4", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugi0Alg7aOL4tHgCoAEC", "comment": "So it means that the study from U Chicago is bullshit? LOL", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UggPBuHEpBpzWXgCoAEC", "comment": "Mind blowing", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugj8XJSXuJTBPngCoAEC", "comment": "at 1:05:19 of the video The student claims that Kn-complete graph is Worst Case. In fact, it is true. You give me any graph with n-nodes, and I say it is the subset of Kn-complete graph with n-nodes Because you could some edges from Kn-complete graph to form your own graph. Now let say Kn-complete graph require at max X colors to get legally colored, it means your graph has some X colors. Hence it is the proof to theorem. I think, it is better than Induction Method.", "votes": "0", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgiGJuN_5mPZpngCoAEC", "comment": "我没有嘲讽的意思，但那个印度口音蹦出来的时候我真的笑了。", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgwbNiXaVlxyJYgvpM94AaABAg.8l6jj6xcwxy99VV5iX-SfI", "comment": "don't always trying in finding faults, his main objective was to teach graph theory which i guess was pretty well done", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwbNiXaVlxyJYgvpM94AaABAg.8l6jj6xcwxy9LANMXGfL8y", "comment": "Yup , classic compsci arrogance at play. He has no idea what he's talking about. I feel sorry for the untrained students that think his unscientific attitude is funny or makes him cool. It's embarrassing how much he's talking out of his ass.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwbNiXaVlxyJYgvpM94AaABAg.8l6jj6xcwxy9LLHrrdERSc", "comment": " @karen-7057  You sound dumb, the whole point of this was to teach graph theory, not make a political statement. We all know women sleep around way more than men in the real world. Who cares? We came here to learn graph theory.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgwbNiXaVlxyJYgvpM94AaABAg.8l6jj6xcwxy9OCFLucbgJj", "comment": " @banguard856 Its name is literally Karen, dude. Why are you even trying to reason with it? At best it's a troll.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugx56icTaD1Jvps88Z94AaABAg.8kFyYL8m2DC98GF7bNyAmm", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs?please help", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugx_KK5as0semVWMuy94AaABAg.8kC_IS4gidj8mRw7uk2S6T", "comment": "Indeed it is. Graph theory actually changes very little. Just compare a 20 year old book, to a current one.", "votes": "7", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugx_KK5as0semVWMuy94AaABAg.8kC_IS4gidj9AkZOftjpeE", "comment": "Fundamentals in maths rarely change.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugx_KK5as0semVWMuy94AaABAg.8kC_IS4gidj9JICl0jZLye", "comment": "pretty much. I use these this as supplementary material for my course and its in 2021.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxZLi6J8ANndN81iiR4AaABAg.8jbybCduonO8pu1grNSD_A", "comment": "he makes no such assumption", "votes": "4", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxZLi6J8ANndN81iiR4AaABAg.8jbybCduonO8zGNWSnzaR0", "comment": "But the metric is average number of partners. To get the average you need to divide by the total number -- all men, not just all men who have had partners.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgxZLi6J8ANndN81iiR4AaABAg.8jbybCduonO98GF9Cz3gGm", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs?please help", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgzuwzgrHvYzGdhgIUh4AaABAg.8g-0DaBTBzp92Uuy_fV6Ls", "comment": "Thank you. Everybody else seems to think he's a God. Great lecture tho.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgzuwzgrHvYzGdhgIUh4AaABAg.8g-0DaBTBzp9OCF82esFRP", "comment": " @backendtower6580  Correct.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugybv13E83RNiQMdn7p4AaABAg.8epO8XtnjAc8oGDnRTj-KG", "comment": "bhaji ki hogea zukerburg nu??", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyX-vMqvsaHPg9bbPR4AaABAg.8Wq9GaWrE-n8ZhiEJa3pz7", "comment": "Or women were lying about the amount of men they slept with", "votes": "33", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyX-vMqvsaHPg9bbPR4AaABAg.8Wq9GaWrE-n8cPGmCi5q-5", "comment": "Meserret great teaching", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgyX-vMqvsaHPg9bbPR4AaABAg.8Wq9GaWrE-n8ip4pflRwGu", "comment": "Or effects of polling and having non-American partners, or having partners which moved to another country (since that would give extra edges, but not extra U.S. population). I don't know how large is the effect of demographic shift on the mathematical result (in which a fixed population was assumed), but it could be significant.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgiL3MsUKGOrG3gCoAEC.8SLi_5yoqFg9X330vXK09d", "comment": "Lies again? MRT MIT", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugj8XJSXuJTBPngCoAEC.8P9EynjufXL8P9GQZeFeH6", "comment": "EDIT : Because you could REMOVE some edges from Kn-complete graph to form your own graph. Now let say Kn-complete graph require at max X colors to get legally colored, it means your graph REQUIRE AT MAX X colors, TOO. Hence it is the proof to theorem. I think, it is better than Induction Method.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugj8XJSXuJTBPngCoAEC.8P9EynjufXL8T7VRuhvU9G", "comment": "Then that's another theorem you have to prove first, and then you have to prove that this n-complete graph is the worst case.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgiiXvNaHmdDs3gCoAEC", "comment": "lol~!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugg-lc4d1t0bQHgCoAEC", "comment": "Thank you Prof. Tom. GOD bless", "votes": "3", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC", "comment": "are np completeness solved or not yet ?", "votes": "0", "replies": "6", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjVGByShuBeVHgCoAEC", "comment": "How did he deduce 3% out of 1.0325?", "votes": "1", "replies": "5", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjdNcUlGqbYfHgCoAEC", "comment": "When I studied law I had several sociology classes; the laugh I had because of 26:25 reminded me why I hated them, and turn myself to science. :) Great lesson, MIT, you should be awarded for spreading those classes online. This is really some true human behaviour. Thank you from someone living far away.", "votes": "251", "replies": "4", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UggzBKZTQbFhe3gCoAEC", "comment": "The proof only works for ALL Men that have had an opposite sexual partner compared to ALL Women that have had an opposite sexual partner.  It has nothing todo with the population of the US.  It assumes that every Am/Aw has an \"edge.\"  It could be that males create edges at an earlier age than females so the ratio would not be 1.03....If males lose their virginity earlier, its back to Stats and Sociology.", "votes": "0", "replies": "5", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UggORx_zYtY1WXgCoAEC", "comment": "Amazing :o !", "votes": "0", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugj-FAX8yqS3X3gCoAEC", "comment": "If the video would have been named ' MIT teachings on sex studies ' like the professors daughter pointed out it would easily have more then a million views.  :D", "votes": "109", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC", "comment": "Is'nt that minority study quite a bit different? In that case you can have edges going along on the same side of the graph. So the result that 'minority students studied with non-minority students more than the other way around'  wouldn't be true if say, the minority students studied way more often than non-minority students and mostly studied among themselves. There would be biases because of the difference in numbers of course, but the study isn't complete trash. Or have I made a mistake?", "votes": "2", "replies": "10", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjQpW1pFgFbNngCoAEC", "comment": "Sociology PhD from down the street(a.k.a Harvard) xD", "votes": "149", "replies": "5", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UghORiWQD5KLNXgCoAEC", "comment": "Average partner problem, women have more on average because there are less of them; Am/Aw=(E/Vm)/E/Vw)=Vw/Vm < 1! Mistake by the teacher", "votes": "1", "replies": "3", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UggSnN60zn_UrXgCoAEC", "comment": "If my graph theory course was this interesting, I wouldn't have skipped all but 6 of the lectures :D", "votes": "72", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjC4g1yST8spXgCoAEC", "comment": "mind.blow();", "votes": "44", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjT9_X---le6XgCoAEC", "comment": "4 boy and 4 girls. if 1 boy is partner with all 4 girls, the other 3 boys have no partnership with any girls. on average, Am=4/4, Aw=4/4, Am/Aw=1. But IN REALITY(the example), Am=4/1,   Aw=4/4 . Am/Aw = 4. which means a few number of males have partnership with a large number of females, and a large number of females have partnership with a few number of males. am I right? ", "votes": "1", "replies": "1", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgjdQv1yOqQU3XgCoAEC", "comment": "Curious that a question that would seem to be entirely empirical turns out to be a priori, given one empirical bit of information: the ratio 'number of men/number of women'.", "votes": "5", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UghXucjaOLo5angCoAEC", "comment": "assume 4 girls and 4 boys ,,let 4 edges from one girl to 4 boys be the only edges ,what is the average ratio of diff partner of girls to boy ? ans is 1:1, looking at the graph ,we can tell a lot but nothing from observing ratios.", "votes": "1", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UghHDWY1sCBQqngCoAEC", "comment": "mind blown at 23:21", "votes": "14", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzX5w24CaMdv_Xlfd54AaABAg", "comment": "I loved it, really useful lesson.", "votes": "3", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugxilmwut6UbbFphF3F4AaABAg", "comment": "Graph coloring starts around 31:00", "votes": "6", "replies": "", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "UgzMu1BhC2fT5Tyv0Up4AaABAg", "comment": "Actually, it can't simply divide the number of nodes, because there can be nodes with zero degree, so they shold be excluded first.", "votes": "1", "replies": "2", "reply": false}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC.8GRnFCsEFzM8H1dNjYZTcW", "comment": "Unlikely, otherwise it will be such big news you'll hear about it.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC.8GRnFCsEFzM8J4mWWlSpdd", "comment": "i have no idea what is a quantum satellite ... how did you get this information ?", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC.8GRnFCsEFzM8URrZeMUwJZ", "comment": "Bessalah Amar you will never find out because hazard77 was kidnapped by the chinese government because he released their secret .", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC.8GRnFCsEFzM94T0pFy4Vk_", "comment": " @hazzard77  how the hell do you know that.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC.8GRnFCsEFzM97Hqf_0oTi0", "comment": " @thangible  r/woooosh", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugg2PUjnvZyAKHgCoAEC.8GRnFCsEFzM9AkZXEogg5W", "comment": " @chappie3642  Go back to reddit, the cancerous place where you belong.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjVGByShuBeVHgCoAEC.8DDYQ-c-JNj8DDgNYD21mB", "comment": "+Roy lee (1.0325-1)/1=0.325=3.25% 1.0325x is female population and 1*x is male population.", "votes": "4", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjVGByShuBeVHgCoAEC.8DDYQ-c-JNj8DDlB12Ey1y", "comment": "+Akshit Sharma thanks for the answer, I understand what's on your first statement, but I got a little confuse with your second statement: 1.0325x is female population and 1x is male population.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjVGByShuBeVHgCoAEC.8DDYQ-c-JNj8DDpgX2_67E", "comment": "+Roy lee 1.0325 is the ratio of female population to the male population", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjVGByShuBeVHgCoAEC.8DDYQ-c-JNj8_DzrBrU113", "comment": "Roy, i think those lectures are a bit too advanced then for you))", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjVGByShuBeVHgCoAEC.8DDYQ-c-JNj8cePdJp-Q8c", "comment": "Roy lee it's not difficult. 1.0325 = 103.25% (decimal to percentage conversion) That means the number of opp. gender partners men have is 103.25% of that of women. That's the same as saying men have (100-103.25)% = 3.25% more opposite gender partners than those of females.", "votes": "2", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjdNcUlGqbYfHgCoAEC.8CtlBBCqYpF9Uzb67To8aq", "comment": " @alskfaslkfjkl  no, it doesn’t. Sure, one subgroup can have more promiscuous men on average but this has to be evened out by the same number of equally promiscuous women in some other subgroup (or across multiple subgroups) assuming the same # of men and women. And vice versa. So on average each subgroup must have an equal number of romantic relations for men and women.   For minority and non-minority studying groups, this is even more so the case since studying with people outside of one’s subgroup (people in the same university or class) for a midterm makes less sense. So minority students must study with more non-minority students on average than the reverse because there are fewer of them. That’s it.   And making any generalized conclusion based on an outlier subgroup would be the very definition of tendentious.  Or if the subgroup refers to \"minority\" and \"non-minority\", it's actually the other way around. In \"an absolute sense\" each subgroup studies with the other exactly the same number of times. It only becomes \"more than\" when that number is taken relative to the subgroup sizes (the average).", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjdNcUlGqbYfHgCoAEC.8CtlBBCqYpF9V0tcumUEOx", "comment": "​ @alskfaslkfjkl  Okay, so you just don't understand the point of this lecture, the question, or maybe just the math in general. Here is the Boston Globe's finding applied to your scenario:  1 out of 10 is 10%, true, however we are calculating the average number of non-minority students each of the minority students studies with and vice versa, not how many minority students have studied with non-minority students at all. That one student studied with 100 non-minority students. (100+0+0...)/10 = 10, i.e. on average each minority student studied with 10 non-minority students.  The 100 non-minority students each studied with exactly 1 minority. (100)/100 = 1, i.e. on average each non-minority student studied with 1 minority student (obviously, since they all studied with exactly 1 minority student the average is also 1).  10 is greater than 1 (I can't prove this but trust me). Thus minority students studied with ten times more non-minority students on average than the other way around.   So sorry, no, you're wrong. Minority students do indeed study with more non-minority students on average than the other way around. Now I said I don't think you understood the point of the lecture, question, or maybe simply don't understand the math, because your example would probably be a more useful statistic than the example in the lecture. Why? The reason minority students on average study with ten times more non-minority etc. etc. IS BECAUSE there are ten times more non-minority students than minority students. If just one minority student studied with just one non-minority student this would still be true. Mathematically the statement \"minority students study with more non-minority students on average than the other way around\" is equivalent to \"there are more non-minority students than minority students\".   That's it. There's no social commentary, no hidden psychological phenomena, nothing. That's the point, the professor is saying that it's a very dumb question whose solution can have no meaningful implications besides \"minority students are in the minority\". Yet the Boston Globe still published this \"explosive survey\" to draw some sort of groundbreaking conclusion.", "votes": "5", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjdNcUlGqbYfHgCoAEC.8CtlBBCqYpF9V4JnuFoV3E", "comment": " @alskfaslkfjkl   Wow, I really hope you’re a professor at a community college at best and not a prestigious university like MIT. And I’m not sure what to tell you, your “counterexample” doesn’t disprove anything. I literally wrote out all the math for you in my last comment, look at it and disprove me if you’re so confident about your obviously incorrect notions. Otherwise, I want you to rewatch the video and think about the mathematics, work it out for yourself, and take the time to understand why the professor brought up that headline. And why your “counterexample” is totally, 100% irrelevant. As I already said, taking the Boston Globe’s findings and applying it to your counterexample demonstrates that it only proves the Boston Globe’s headline. And I’ve done all I can to show why that is the case.   What mathematics field do you teach and where? Normally I would not be so presumptuous as to think I am more capable at math or logic than a professor, but for you I make an exception. You clearly do not understand the point the professor and I are making and your blatant disregard for all the math and explanations I presented in my last comment reflects that.   “Hold yourself to a higher standard than respected MIT professors”, yeah okay alksfaslkfjkla.", "votes": "2", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjdNcUlGqbYfHgCoAEC.8CtlBBCqYpF9V8i6yQNIkw", "comment": " @alskfaslkfjkl  No, I tried to help you understand by thoroughly showing and explaining the math. You did nothing of the sort.", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggzBKZTQbFhe3gCoAEC.8A7hRU9a19b8Zhmo9oQgyl", "comment": "Someone doesn't understand what average is", "votes": "5", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggzBKZTQbFhe3gCoAEC.8A7hRU9a19b8ceP3KS0N9i", "comment": "Paul Burns It doesn't assume that every male Vertex has an edge. The number of edges simply gets cancelled.", "votes": "2", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggzBKZTQbFhe3gCoAEC.8A7hRU9a19b8ip5U9S6eXX", "comment": "If the meaning of an edge is \"have had a relationship last year\", for example, the differences in age in which men and women have partners will be irrelevant, because if A has had a relationship with B last year, the B has had a relationship with A last year, there will be an edge between them regardless of age.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggzBKZTQbFhe3gCoAEC.8A7hRU9a19b8kJjtqpu-5J", "comment": "What are you talking about?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggzBKZTQbFhe3gCoAEC.8A7hRU9a19b8kQi969azfR", "comment": "You don’t understand the math.    If a node had cardinality of 0 it still factors into the average.   Based on this, it proves that the result must be the ratio of men to women.  Even if it’s extreme, one man slept with all the ladies and no other man slept with anyone.    The average is the ratio of men to women.   You can then start adding edges and prove by induction that no matter what edge you add the result remains the same.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugj-FAX8yqS3X3gCoAEC.83Zg3SDLp9f8YSQ8h16pWy", "comment": "Christoph G. Exactly", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugj-FAX8yqS3X3gCoAEC.83Zg3SDLp9f8bJOi_2HlbM", "comment": "im not sure if pimping out science is the right idea, people are either interested in this stuff or they're not...", "votes": "9", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugj-FAX8yqS3X3gCoAEC.83Zg3SDLp9f8kAAXAVCw1s", "comment": "Thats called marketing brother!", "votes": "4", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8N80Zaw2VZK", "comment": "I was thinking this too. The tendency of minority students to study with non-minority students is a completely different question from the average number of partners men and women have.", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NPcQmn1lNC", "comment": "It is indeed the same principle. In this case a partnership between a man and a woman is the same as a 'study session' between a minority and a non-minority. Each partnership or study session creates an equal number of degrees to the nodes on either side of the spectrum. As demonstrated in the lecture, this makes the result come down to a ratio of the populations of each group of people.  The reason why this statement, \"if say, the minority students studied way more often than non-minority students and mostly studied among themselves\" from Paul Clarke is irrelevant is because it is the same thing as considering same sex partnerships in the lecture's example: irrelevant to the question \"Do minorities study more with non-minorities or vice-versa?\"", "votes": "3", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQ4S8yJ_Kq", "comment": "Your reasoning only proves that on average, minority students have more non-minority study partners than the other way around. I don't believe this is what the Boston Globe's study was saying. They say, \"minority students tended to study more with non-minority students more than than the other way around.\" I would interpret this to mean that a higher percentage of minority students study with non-minority students compared to the other way around. This isn't necessarily always the case! For example, let's look at a situation with 3 minority students and 5 non-minority students. Let's say the only study session that occurred was 1 minority student studied with 4 non-minority students. Then only 33% of minority students study with non-minorities, and 80% of non-minorities study with minorities.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQ8CL8Boze", "comment": "I agree with your arguments and see that the issue comes from whether or not the study is examining all minorities/non-minorities or just minorities/non-minorities that study with others of the opposite classification. I believe this professor believes it is the latter which would make it analogous to what he is trying to prove in the video. However, now I see an issue in his original proof because he used a rough estimate of the entire population of the USA rather than the population of people who have been in at least one partnership. If we define marriage as this partnership, only ~79% of Americans should be represented -reducing 300 to 240-250.  I still think Paul Clarke is arguing the wrong thing because it is not a matter of \"edges going along the same side of the graph\"- because this would be same sex partnerships or same classification students studying with one another- but a matter of which population (all students or just minorities/non-minorities that study with others of an opposing classification) one is considering.  I'm not sure which the Boston Globe study was trying to accommodate, but I still think this method of graph theory  could be applicable - just with the appropriate population.  Please correct me if I've gone wrong somewhere!", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQAHBKFdnw", "comment": "I agree with you that Paul Clarke's argument that the \"edges going along the same side of the graph\" isn't relevant. I was just agreeing with him that the situations were not comparable.  I believe, but don't know for sure, that the Boston Globe was considering the percentage of minorities that study with non-minorities and vice-versa. The proof of sexual partners is concerned with the number of male/female partners. I think percentage vs number is the key distinction in the situations. I believe the professor simply made a mistake in overlooking that distinction.  If you only consider the people who have had a sexual relationship or a study session with minorities/non-minorities, then obviously the percentage that participate in these partnerships would be 100%. So, then the pertinent question would be the average number of partners, in which case study partners and sexual partners would be comparable, and this method of induction would be applicable.  But, I don't think there is an issue with the original proof about opposite sex partners. The ratio of the number of opposite partners is applicable whether you're looking at the entire population or only people that participate in those partnerships.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQD_ybljne", "comment": "Alright, I agree with them not being comparable.  I may have overlooked something, but I still am seeing something wrong with his proof. When he applies math to get the answer to be the ratio of populations, he says that the average degree of each node on the men's and women's side both equal |E|, and then they cancel out in the division. Wouldn't the average degree only be equal if he is considering the population of people who have been in these partnerships? If he uses the 300 estimate for the population, he is also considering people who have not been in a partnership i.e. degree of 0. The only way now for both degree averages to be the same is if the ratio of 0 degree men to 0 degree women is the exact same ratio of men to women in the population. Just from looking up some stats, I find that of the 25% of men and 18% of women have never been married. Using his numbers, .25*(147.6)/(152.4*.18)=1.345 =/= 147.6/152.4.  See what I mean?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQHFiR5gWj", "comment": "I think you are confused with the definition of the average degree of each node. He says the total degree of all the nodes equals |E|, not the average degree of each node equals |E|.  The average degree of each node is |E|/V_m or |E|/V_w. The total degree wouldn't change whether you are considering all the 300 million people or only the people that have been in a partnership, but V_m and V_w would adjust accordingly and the average would therefore change accordingly. The proof works either way.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQIeFp5CH0", "comment": "Ah, I see now. You are right. Thanks for your time.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT8NQIuHpIWGK", "comment": "No problem. I enjoyed discussing this with you!", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjORgg7QdDzr3gCoAEC.82EPzBqDfxT9LAMcRGF3MK", "comment": "The teacher is talking out of his ass about it. Sad that gullible untrained students consider his unscientific baffoonery as enlightening", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjQpW1pFgFbNngCoAEC.7-H0Z7-B0Rt89Xs8ejwYoa", "comment": "You'd be better off with a degree from a community tech school, it's still sociology...", "votes": "7", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjQpW1pFgFbNngCoAEC.7-H0Z7-B0Rt89XymI0abSr", "comment": "John Waas What? :\\", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjQpW1pFgFbNngCoAEC.7-H0Z7-B0Rt8DDYC5C7Aiw", "comment": "+xXxBladeStormxXx Just be nice, and humble. If you lost a character, you lost 8 bits.", "votes": "35", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjQpW1pFgFbNngCoAEC.7-H0Z7-B0Rt8Oo6hTNdgR8", "comment": "that's negligent given I spend billions of bit on random crap. there are better motives out there.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjQpW1pFgFbNngCoAEC.7-H0Z7-B0Rt8mRvkGmfWsJ", "comment": "Literally, just down the street :-)", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UghORiWQD5KLNXgCoAEC.7-H0Z7-QXP979Tpd3hIgT8", "comment": "xXxBladeStormxXx so blunt. Love it", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UghORiWQD5KLNXgCoAEC.7-H0Z7-QXP98xoYU2De5Wl", "comment": "You got it flipped. |F| = 152.4M, |M| = 147.6M, women have less on average because there are more of them", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UghORiWQD5KLNXgCoAEC.7-H0Z7-QXP998GFETHdV_J", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs?please help", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggSnN60zn_UrXgCoAEC.7-H0Z7-KaUi98GEmsydpWV", "comment": "I have encountered a graph problem, that is not degree constrained, but there exist an matching, how to identify that for big graphs?", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UggSnN60zn_UrXgCoAEC.7-H0Z7-KaUi9DiW91rBQex", "comment": " Susuya Juuzou  I'm sorry if I'm wrong but isn't this an introduction to graphs and graph theory", "votes": "1", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgjT9_X---le6XgCoAEC.7-H0Z7-B_Nu8vv7Lp1Drzu", "comment": "Ye", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UghXucjaOLo5angCoAEC.7-H0Z7-OdTo7O3660RaKOb", "comment": "The average, for every 4 girls, are 4 relationships (1:1). For the four boys there is also a 1-to-1 ratio. if you exclude the unconnected nodes, it would be 4 relationships for every single girl but you've created a universe with only 1 girl and 4 boys so it would make perfect sense if that were the case.   Now do we know exactly how many relationships every individual will have? Of course not, but that's also not the point. And these sociological studies can't make that claim either. If anything, these survey studies only suggest that men either exaggerate the number of partners they have or women understate the number of men they've been with. Societal norms suggest it's a bit of both.  Also if you study sociology, abandon ship. It's the most counterproductive area of research to be in. People only pay attention to certain studies that conform to the general biases of the field which lead to a snow-balling effect. Sociology is supposed to teach us that many of our fears are the result of misperceptions, but unfortunately sociologists themselves are a big contributor  to such misperceptions.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UghXucjaOLo5angCoAEC.7-H0Z7-OdTo8g-1VkMyZWP", "comment": "Science must provide falsifiable explanations, and make falsifiable predictions.  Without falsifiability, we are left with completely empty and meaningless induction.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgzMu1BhC2fT5Tyv0Up4AaABAg.8Gch7B8enMl8fmhmVf9bjl", "comment": "Does not matter.", "votes": "0", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "UgzMu1BhC2fT5Tyv0Up4AaABAg.8Gch7B8enMl8naDbldeG5b", "comment": "we are looking for the average", "votes": "4", "replies": "", "reply": true}, {"vid": "h9wxtqoa1jY", "cid": "Ugx3rn2KLznDxjRNSOp4AaABAg", "comment": "Excellent lecture.. ", "votes": "0", "replies": "", "reply": false}]