[{"vid": "HsgZM2TXXy4", "cid": "Ugxn3iwRpkaHzQFiEBR4AaABAg", "comment": "Next Video:  https://www.youtube.com/watch?v=PoG14wRRQmM&list=PL0o_zxa4K1BU6wPPLDsoTj1_wEf0LSNeR&index=159 Final Exams and Video Playlists:        https://www.video-tutor.net/\r Full-Length Math & Science Videos:   https://www.patreon.com/mathsciencetutor/collections", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgwySarxHqwEV1hljwF4AaABAg", "comment": "absolute lifesaver. thanks a lot man", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugxr911BC0ogMayhnE54AaABAg", "comment": "Is there any difference between Lift Force and Upthrust", "votes": "1", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzIIZYspx5VgrtgKwd4AaABAg", "comment": "Lift: Because the air moves faster over the top of the wing, it is less dense (more spread out). Less dense air means lower air pressure.  The air pressure difference between the top and bottom of the wing is what causes the lift. This is the principle behind Bernoulli's Equation, which says the energy in  the air between its pressure (the outward expanding force of a parcel of air and a form of energy density) and its kinetic energy (as given by the v squared terms) are conserved.  What causes a decrease in lift by ice buildup on wings? The drag on the air causes it to slow down, negating the pressure difference. Moreover, it causes turbulence at the trailing edge of the wing due to less airflow over the top of the wing.", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxzBGgteVDWUjnQ0Id4AaABAg", "comment": "Wonderful your explanation", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgwMxufKZb5I5rJT08p4AaABAg", "comment": "You’re an animal ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgysF1J7HS8v37xafyB4AaABAg", "comment": "I like your videos about chemistry, but in this video, you get things wrong.  In example 1, you say that low pressure is formed over the top of the house. How? A lower pressure means the velocity of the air over the roof top must increase. Bernoulli's principle does not say \"when the velocity is high, the pressure is low\" and vice versa. Bernoulli's principle says when the velocity of an airflow changes, the static pressure changes in accordance with Bernoulli's equation. Therefore, you cannot use Bernoulli's equation to compare the airflow outside and inside a house with walls. You must compare the velocity of the air ahead of the house with the velocity of the air over the roof. With a flat roof, the lifting force will be very low.  In example 2, you describe lift in accorance with the \"equal transit\" hypothesis. Sadly, this idea is taught to student pilots all over the world, but it is not correct. Think about it: How can an air molecule that was separated from another air molecule by the wing know when the other air molecule will reach the trailing edge of the wing? Wind tunnel tests show that the air flowing over the wing reaches the trailing edge before the air flowing under the wing. If you search for \"Prof. Holger Babinsky\" and \"Lift\" you will see how it works.  Your drawing shows a wing with a flat undersurface and zero angle of attack. Therefore, the velocity of the air under the wing will have the same as the velocity of the airplane, and the static air pressure under the wing is the same as the static pressure in the atmosphere. To get a higher static pressure under the wing, the wing must meet the airflow with an angle, called the angle of attack. And don't forget when a wing produces lift, it deflects air downwards in accordance with Newton't third law of motion.  For a better understanding of Bernoulli's equation, I recommend the channel of The Efficient Engineer.", "votes": "1", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgznXqhxlxj1rqlkf0B4AaABAg", "comment": "There is an equation called \"Lift Force Equation\" and in that equation, there is no velocity differential. Instead, there is only one velocity, which is aircraft velocity. Why are they ignoring V2-V1 and write only V ? Additionally, we know that lift force increases as aircraft speed increases. How can I understand it through this equation you wrote? V2 will increase to the same extend V1 does. Doesn't it?", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgybxUz6T9L_ZkIov2h4AaABAg", "comment": "Sir i have a doubt , that we can use Bernoulli theorem in any point of a single streamline But you used Bernoulli equation in two different streamline. Why??", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugz8oWtKAC1u1Rz70op4AaABAg", "comment": "thank you good sir this actually helped a bunch", "votes": "1", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxDRmk_qTvzBQjjj-l4AaABAg", "comment": "The authors have two wrong scientific approaches: researching the creation of Lift force and Low pressure at upper side of the wing, relative to the ground surface and Earth. I explain the aerodynamic cavitation and existence of Lee side aerocavern, and creation of Aerodynamic force. Low pressure creates force normal to the cord (contact surface), and it name is \"aerodynamic force\" because is made from the air (aero) in motion (dynamic), or wind relative to the wing (object).", "votes": "0", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugzt21L0ICsuOoVsAgx4AaABAg", "comment": "Why it takes me so long to find this YouTube Channel... Great video my freind.", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgwAPT-jF4R94fv0rgR4AaABAg", "comment": "Nurse here. Bad at math. Love math anyway. Love your channel. subbed.", "votes": "1", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzF_4kC6j281A95eiR4AaABAg", "comment": "You are a hero bro", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgyCtgDWhHnyY4mC3XF4AaABAg", "comment": "Thank You, this is EXACTLY the stuff I wanted to know.", "votes": "7", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugxw7rNaalVTGAoJlCp4AaABAg", "comment": "What an absolutely amazing video. I'm in the third year of my degree now, and was a little confused with the direction of lift. This helped so, so much. Thanks a lot!", "votes": "8", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgyRbx9WPsLmQ1FbwS14AaABAg", "comment": "so the wind goes under the house????", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxZqqdXPoWGQ_ZVTuB4AaABAg", "comment": "I don't know if I have too many missing variables but I cant solve this problem.  Rectangular Object:  Object is slanted at 25 degrees. Object has height of 65  inches. Object has width of 36 inches.  Object weighs 180 pounds in weight.  Density of air surrounding the object is 1.3  Do we not use Coefficient of Lift when dealing with an airfoil shape? What is total velocity if Lift equals weight?", "votes": "0", "replies": "2", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgwECAJAwOyIqUAu_TJ4AaABAg", "comment": "How about the Symmetric airfoil ? at 0 angle of attack the V of wind are  the same on the lower and upper airfoil ? Please tell the lift force with >0 angle of attack !", "votes": "0", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugzlm8ccOVwVWYlAD2V4AaABAg", "comment": "Doesn't Bernoulli's  theorem work on the pressure difference along the same stream line????", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugxr911BC0ogMayhnE54AaABAg.A-pS7QAtSiSA4onIb7w7bX", "comment": "Lift Force is caused by motion of a fluid over a surface area like explained here in this video, whereas, Upthrust is caused by displacement of fluid by a body like a block of wood in water or Helium balloon in air (Here the density of Helium is far less than air so the balloon rises). I hope this helps.", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgxDRmk_qTvzBQjjj-l4AaABAg.9fBZyKXSI2X9fcjMaYGjUy", "comment": "The force object receives is always normal to the contact surface and air pressure always acts normal to the surface of the body. This has long been well known, and I don't know why in flight theories and aerodynamics books this is (mostly) omitted.", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgxZqqdXPoWGQ_ZVTuB4AaABAg.9F-zXFzk1JJ9J_45EjRFIS", "comment": "The difference in velocity describes the shape of the airfoil. Each airfoil performs a different delta v with respect to its shape. This is why delta v squared was places instead of v and cl", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgxZqqdXPoWGQ_ZVTuB4AaABAg.9F-zXFzk1JJ9J_4Dm3vYt7", "comment": "Knowing that cl is a description about the shape of the airfoil and the angle of attack of the airfoil and delta v is also effected by shape of airfoil and angle of attack", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwECAJAwOyIqUAu_TJ4AaABAg.9EhQLiice_e9EmGybri7iI", "comment": "There is no lift force in this situation.  This would be the case for the vertical stabilizer, for instance.", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgymC19AG5JIndxkxoB4AaABAg", "comment": "This is probably a stupid question, but I cant phrase it right to get google to return and answer.  What effect would jet engines exiting force have on a wingspans lift if situated in front of them, far enough for them not to melt? Would it increase lift or is there some paradox I'm missing.", "votes": "1", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgyM0YFzpNresq7s0Bl4AaABAg", "comment": "In these, would you not also need to consider the weight of thr roof (F=ma) and deduct that weight in Newtons from thecalculated lift force as that counteracts that force cancelling it partially out", "votes": "0", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugxn_44dSsB4-t1n3vd4AaABAg", "comment": "All your videos are really great. Please continue to make them", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxTR-N65JC25Q5nH1p4AaABAg", "comment": "How do you get such big difference in speed over and under. for example if a  Clark Y foil is 100cm under, it will only be about 104cm over. and this makes the FL very little. please help me understand", "votes": "0", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzbisOapQf9QuN51514AaABAg", "comment": "Sir in question no.2 there are 2 wings but you calculated only one wing", "votes": "1", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgyvPijLn3HSTPbIHxp4AaABAg", "comment": "How do you get your result in Newton at the first calculation, if your dimensions are: 1/2*[m/s]^2*[m^2]*[kg/m^3 ]?", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgwFbfhItwOsU-uIJBt4AaABAg", "comment": "At 6:22 you state the \"wind has to travel a greater distance at the top part...it speeds up.\"  This is incorrect.  The flow of air over the top of the wing is created by squeezing the streamlines together over the wing. The conservation of mass and the continuity equation state that the mass flow rate into and out of a stream tube of streamlines has to speed up as area between the streamlines is reduced.  Or, if you'd like to prove it to yourself, put your thumb over the end of a garden hose...area is reduced and velocity is increased.  m_dot1 = m_dot2, or  entry density x entry area x entry velocity = exit density x exit area x exit velocity.", "votes": "15", "replies": "3", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugwn5mp5piwT0NRLggN4AaABAg", "comment": "Does the area refer to total surface area of the wing or the surface area of the top face of the wing?", "votes": "1", "replies": "2", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxBcxK9meEQGAavMHd4AaABAg", "comment": "Nah", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgyMx22vB7LwWpL457N4AaABAg", "comment": "Funny that stunt planes have symmetric wings, so no Bernoulli force ... and yet there they fly. By compressing the air below them.", "votes": "1", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgymHEWV_y9LH_gX8E94AaABAg", "comment": "Thanks for the video man. Really appreciate it, but I was wondering why g @ 9:55 is 9.8 sorry 😅 new to physics", "votes": "1", "replies": "2", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzWueN4bvNedE40-uZ4AaABAg", "comment": "This video is awesome! I only wish I wouldn't have spent so long trying to figure it out on my own before finding your video.", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgwYbYEueX9jzZNcB0J4AaABAg", "comment": "Thanks! How do I work out velocity of air over and under the wings?", "votes": "2", "replies": "3", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugzacjd5xw4k63w_smN4AaABAg", "comment": "So technically, Bernoulli's equation applies to streamlined (non-turbulent), non-viscous flow, for any two points along a streamline. No streamline goes along both the top and bottom of the roof. What is the justification for applying Bernoulli's equation in this way?", "votes": "1", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugx9pQph02lvt7cdJQ14AaABAg", "comment": "Why is the gravity is 9.8, not -9.8", "votes": "0", "replies": "2", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzMnwmi96LwxotQ-Yx4AaABAg", "comment": "Can you explain these inconsistencies?", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgydKhxKdh1v3u5yJ5p4AaABAg", "comment": "Thank you so much for explaining the lift force  and validation using basic equation. Could, you please advice if same can applied under water cases.  I would like to know, if same physics fundamentals can be applied for underwater scenario.", "votes": "2", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxX8SAh0_WWAJUFc8p4AaABAg", "comment": "Hello. Why you don’t use lift coefficient?", "votes": "4", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "Ugz_xfwbxvGxRygg_s94AaABAg", "comment": "Thanks.. You are great man", "votes": "1", "replies": "1", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzT8yD9mjhxwNgRGdV4AaABAg", "comment": "you’re a lifesaver!!! this is great", "votes": "2", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgymC19AG5JIndxkxoB4AaABAg.9E4b0tfmbGE9F3CATPLflk", "comment": "Damn smart question. I have another question. If what is wanted is for the top of the airfoil to have more pressure so that the air moves faster and generates lift, why don't some planes or jets have their propellers on top of the wings instead of beneath it? Wouldn't that reduce the need for so much power from propellers for take of or just flight in general?", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgyM0YFzpNresq7s0Bl4AaABAg.9DXGlF5HzMo9QYnvy1CCw4", "comment": "I would say yes, but the problem is asking for the lift force not the net force on the roof.", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgxTR-N65JC25Q5nH1p4AaABAg.9CE0FNk8iuB9F3BW28yrvX", "comment": "when the air is pushed up, there is higher pressure. When there is higher pressure, the wind at the top flows faster. That is if what you have is an airfoil shape. Sorry thats all I know. Im new to this. Hope that helped at least a little", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwFbfhItwOsU-uIJBt4AaABAg.977a6Sa7uyJ9CnWEZDM91C", "comment": "You are correct, also note that there is low pressure spot on the back side of the curve which also speeds up the air flow.", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwFbfhItwOsU-uIJBt4AaABAg.977a6Sa7uyJ9DYZ6Tt7gg2", "comment": " @8.2deck  bruh , when did u learn this . I'm a first year , first semester engineering student and what you guys said ,passed right over my head", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwFbfhItwOsU-uIJBt4AaABAg.977a6Sa7uyJ9DY_e2-K7Ks", "comment": " @bilalrahim2076  to be honest I'm not an engineer but I make fiberglass wings and aero bumpers for my cars. I'm a big fan of Jim Hall (chaparral creator) and Peter Brock (Shelby Daytona). I'd suggest watching Chain Bear's videos also.", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "Ugwn5mp5piwT0NRLggN4AaABAg.96c2Rl6cR3y97uA9l6Dfue", "comment": "just the surface area of the wing my love", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "Ugwn5mp5piwT0NRLggN4AaABAg.96c2Rl6cR3y9F3BBiJwhfo", "comment": "I think just one side", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgyMx22vB7LwWpL457N4AaABAg.954hDzKVsAi9EckpOQ-_NR", "comment": "Newtons III law is also responsible for lift, not just Berrnoulli!", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgymHEWV_y9LH_gX8E94AaABAg.94rdODHu7wq94y0AjTdYqj", "comment": "All objects that are affected by gravity fall at an acceleration of 9.8m/s^2 downward, regardless of size or mass (shape may affect it because of air resistance but most of the time we ignore that or don't work with such materials). This means that if you dropped a big rock and a small rock at the same time, they will both increase their velocities by 9.8m/s every second (so after 1 second, their velocity is 9.8m/s, after 2, it's 19.6m/s, etc). Although the acceleration caused by gravity is the same for every object, the force depends on the object's mass. Newton's 2nd Law states that Force = mass * acceleration, so to calculate the force of gravity on an object, you multiply the object's mass by g, or 9.8. The force of gravity on an object is also known as its weight. When two forces are in completely opposite directions on the same object, they can cancel out to some extent, just like subtraction. After subtracting the two (or more) forces from each other based on direction, the remainder is called the net force. In this particular problem, he is trying to figure out the vertical net force on the airplane. There are only two forces acting on the airplane in the vertical (up or down) direction: lift and gravity. Lift pushes the airplane upward, gravity pushes the airplane downward. I mentioned earlier that the force of gravity on an object is its weight, so what he does is he subtracts the weight and the lift force. I tried to include as much information as I could but am aware it may be too much to handle, so please feel free to ask about anything that confuses you. Hope this helps!", "votes": "2", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgymHEWV_y9LH_gX8E94AaABAg.94rdODHu7wq950oLS_fjtN", "comment": " @lidiaprokopovych4695  Thank you so much Lidia this really helped. As I am in year 10 and I'm switching curriculum I'm learning physics for the first time properly. Cheers :)", "votes": "4", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwYbYEueX9jzZNcB0J4AaABAg.90OBjUdKHKw93YTeB99VR8", "comment": "Determine the distances of the wing above and below the cord line along the direction of the wind. Multiply the number of times increase in distance by the air speed below the wing v1 and you get the speed of air above the wing v2, v1 is calculated by multiplying the increase distance of the wing below the cord line to the distance of the cord line itself by v.", "votes": "2", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwYbYEueX9jzZNcB0J4AaABAg.90OBjUdKHKw95frZS9v7-M", "comment": " @geoffreywoodyear1585  how is this formula called? It sounds very interesting", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgwYbYEueX9jzZNcB0J4AaABAg.90OBjUdKHKw95gC9fMBj4v", "comment": " @davidscandurra560  Bernoulli's equation..", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "Ugzacjd5xw4k63w_smN4AaABAg.9-nM9cH6xa39EckI6OTAAJ", "comment": "Exactly what I thought???? I'm confused!", "votes": "1", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "Ugx9pQph02lvt7cdJQ14AaABAg.9-FTIqCoGzL97uACM9WRFJ", "comment": "i cant tell whether ur joking or not", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "Ugx9pQph02lvt7cdJQ14AaABAg.9-FTIqCoGzL9Mvk00lQPZK", "comment": " @robertowisconetti2732  aw man don't do that, people need to ask questions. Shit I'm just a nurse with a weird obsession with math. And I suck at math. I can barely tackle basic algebra! I would appreciate it if you could answer the question for me too 👍", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgydKhxKdh1v3u5yJ5p4AaABAg.8v5WX6td8c08x94he04CUp", "comment": "This is wrong. See my explanation in comments. However, the correct fundamentals apply to fluids in general.", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "Ugz_xfwbxvGxRygg_s94AaABAg.8nQoUpVqSrp92yPDywPwUt", "comment": "Mulle", "votes": "0", "replies": "", "reply": true}, {"vid": "HsgZM2TXXy4", "cid": "UgzI94xmaIb6YM618nZ4AaABAg", "comment": "thanks a lot sir....can you please add a few changeling like pitot-tubes", "votes": "0", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgzuGQktiU_cFR2tw0V4AaABAg", "comment": "Fabulous! yr the man! Nice 2 meet u! Pls, never stop, we need u! God bless u!", "votes": "3", "replies": "", "reply": false}, {"vid": "HsgZM2TXXy4", "cid": "UgxrYcE_8jJUJRarYK94AaABAg", "comment": "before this video blows, just wanted to say thanks for these videos. love you my man!", "votes": "13", "replies": "", "reply": false}]