[{"vid": "htYyCEdc8B4", "cid": "UgwzYkoWuVX06sFG_yp4AaABAg", "comment": "Thanks for making me laugh ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwqO28srm-UO4Fldzp4AaABAg", "comment": "The end scared the shit out of me but I've been doing so much studying the last 3 weeks I just needed that lmao", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxJwew9ClLmm8qVfyt4AaABAg", "comment": "Menarik. Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugxw06ZV59mgvF4wzuF4AaABAg", "comment": "12:58", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgzylxEVeb2vyUqZAG54AaABAg", "comment": "LEARN THE TRUTH ABOUT VACCINES, AIDS, CANCER,  IMMUNOLOGY - become human again; stop behaving like prey sheep:               https://www.youtube.com/playlist?list=PLitHnhXqbuBsu6kz4DCm-jiNN3Xou1VXU", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgySBkrAw-49pXG86014AaABAg", "comment": "I really enjoy this series but i just can't stand the chalk board. Really, no overhead projector? No document cameras?", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwtUMvaEx4vk_dckNR4AaABAg", "comment": "🤣🤣🤣apple juice", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxhOG1TE75U1NBRGD54AaABAg", "comment": "Its insane...", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgzdqoNKQK4ToHS0psp4AaABAg", "comment": "it's my good luck to see MIT classes from India. Thanks to MIT opencourseWare to give this opportunity..", "votes": "3", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgjYKxCtln6aCXgCoAEC", "comment": "There is a lot of excellent logic behind going slow in implementing new science. Many efforts at healing usung retro viral Dana have killed the recipients.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugj8WHqxvnSJPHgCoAEC", "comment": "Alina Gavrilyuk well if you're so clever why waste time and watch this?", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugh6PO3SszKzkHgCoAEC", "comment": "absolute un useful", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugz4VmeBQOuRfHn7CMJ4AaABAg", "comment": "THANK YOU MIT!", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugzwj9M4Yrvihnooik94AaABAg", "comment": "Overview of Recombinant DNA, Excerpt 2 (00:22:17)", "votes": "2", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyLyTih_buzDbZlLUh4AaABAg", "comment": "Hahaha. Seriously I thought the end was real. I was surprised when the lab assistant brought in the pathogenic bacteria and he drank it. Lol.", "votes": "2", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugz3Kp9-EAtNaDM3WJ14AaABAg", "comment": "AHHHH I LOVE SCIENCE!!!!", "votes": "3", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwGy0hGcWU5xuH_cgB4AaABAg", "comment": "depending on which type of engineering, some are more boring than others", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugwg6FepmltH9BKN7tN4AaABAg", "comment": "what a boring specialist the engineering is more interesting and also more complicated ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgztWGP4QxjZiXuCSol4AaABAg", "comment": "Detracting from scientific definition and moving to a more philosophical stance, the human body and its constituent fluids act as a vector for HIV transmission. The notion of HIV transmission via an engineered vector ignores mainstream science and enters the realm of conspiracy theories. Is it possible that scientists discovered the use of recombinant DNA technology before the 'official' discovery? Yes. Is it likely? No. ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyK-E0NQNKggD2rOth4AaABAg", "comment": "Frankly I don't care if you ignore me, but I do care about facts being right. Most diseases spread by contact, water or air. STD's like Aids all spread by intimate contact only. They have no vectors. Cold and flu and measles all spread by air. Cholera and giardia by water, etc,,,", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgzdrLspCwKqlW-Q1m54AaABAg", "comment": "I know, about Lytic and Lysogenic viral replication. I have taught it at times. That has nothing to do with what you have been talking about. HIV has no pathway like that. Nor would that be a particularly good way to spread it. You would have to give a dangerous and noticeable radiation burst to the population to trigger the lytic phase.   Operation paperclip had 1 bacteriologist to my knowledge and zero molecular biologists. Nazi biologywas retarded by their ideology. It yielded nothing.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyHfiNaiRyzK2elnBl4AaABAg", "comment": "If your responses were legitimate & academically engendered, this question would not have been asked. Therefore, review General Biology 101: lysogenic & Lytic cycle.If after reviewing the two methods of viral reproduction and you still choose to be persistently diametrical in your opposition, then we should agree to disagree. Also, If you are unable to elevate this dialogue & continue presenting vacuously unsubstantiated  statements & questions, I'm afraid you will be ignored. So Choose wisely!", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxymCOfifz05Mtg7LB4AaABAg", "comment": "Operation Paperclip was the Office of Strategic Services (OSS) program used to recruit the scientists of Nazi Germany for employment by the United States in the aftermath of World War II (1939–45) Some of the brightest Bio-weapon experts were selected.. in order to develop the US Bio-weaponry program etc. The Nazis were also very familiar with working with Visna virus.    ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugw_60SOa2l8g3PWPAB4AaABAg", "comment": "(Biology & Pathogenesis of Lentiviruses of Ruminant Animals) \"..maedi-VISNA, a slowly progressive pneumoencephalitic disease complex, caused by a conventional virus that is the biological prototype of a group of viruses that include the etiological viruses of progressive pneumonia of sheep, caprine arthritis encephalitis in goats, equine infectious anemia of horses and AIDS in humans.\" From Dr Gallo's book: Retrovirus Biology & Human Human Disease.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugy8ljGtYX8m5GH0pmR4AaABAg", "comment": "No its not related to the visna virus that is antiquated finding, the resemblances were superficial. The closest viruses are all from higher primates. This all happened at leasts a decade too late. In general, DOD biology is pretty bad, behind the civilian sectors because they never had a a big push with real scientists from academia like they did with nukes and aerospace.The technology for viral engineering did not appear into at least the 80's. PCR for one.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxTOdDdXogZx39SNEN4AaABAg", "comment": "What makes you think HIV has a vector. Most diseases don't. ", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyrryB_07_qDBkliPx4AaABAg", "comment": "It is the HIV vector that I'm trying to determine.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugw7YbxpAUsMh9qldeZ4AaABAg", "comment": "The HIV Virus is a chimeral assembly of Bovine Leukemia virus, Visna Virus etc. \"1969 the Defense Department secured funding from congress to perform studies on immune system destroying agents for biological warfare. Soon thereafter, the World Health Organization began experimenting with Lymphotropic virus that was produced in cows.. that could infect humans.\" (Thru freedom of info act) Replication of HIV occurs within the T-cell following its delivery by a \"vector.\" ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxQj3zTxsjW5BgnaqZ4AaABAg", "comment": "Yes, bacteria could be engineered like that but if you are implying that was how HIV was made that is a ridiculously difficult way to do it and is inconsistent with the fact that we know that it was not engineered because HIV has been found in human blood samples dating back to 1959. Google origins of HIV. Very close strains are also found in a variety of primates.   Further even if HIV could Doc wroth and engineered e.coli it could not possibly replicate using the e.colis machinery.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgzC7pwVMeukTUbnyx54AaABAg", "comment": "1951: Esther Lederberg discovers the lyosgenic bacteriophage lambda in E. coli K-12. I think this is enough evidence for one to conclude that considerable knowledge on E.coli was attained decades before the advent of HIV/AIDS and could have been used to modify the bacterium (E. coli) to deliver the genome of HIV in to T-cells. Keep in mind that these are just academic speculations and I am in no way presenting scientific facts. I am just raising questions that I think needs answering.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyFEPy13iw4cECgKdl4AaABAg", "comment": "Gregor Johann Mendel (07/20/1822 – 01/ 06/1884) was pioneering with his early work in genetic engineering on plants. Francis Peyton Rous  (10/5/1879 – 2/16/1970)  was involved in the discovery of the role of viruses in the transmission of certain types of cancer.1898 mycoplasma was used to cause epidemics in cattle. In 1972 Paul Berg created the first recombinant DNA molecules by combining DNA from the monkey virus SV40 with that of the lambda virus.. 10 yrs before the advent of AIDS.  ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugx7nmmAv6AyixopvuR4AaABAg", "comment": "Hmm...this independent study is awesome. I applaud that. The thing is that the first genetically modified bacteria was synthesized in 1973, and the first commercialize genetically modified bacteria appeared in 1882. So in 1990 recombinant DNA technology was still new.To genetically engineer E.coli to serve as a vector of HIV DNA for T-cell gene transfer is like reinventing the wheel.HIV already has the mechanisms of doing this transfer.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugxx-AMZTv3RDdry42d4AaABAg", "comment": "Research Visna Virus, Bovine Leukemia Virus, Feline Leukemia Virus; especially Bovine Leukemia Virus and I think you might innerstand why I'm asking questions that may seem outlandish. Also, view  \"the strecker memorandum\" & Dr. Boyd Graves on youtube if you can not read the books by Dr Horowitz and Dr Gallo. Dr Gallo is the person who many claim created the HIV virus. Gallo stated in his book that \"most retroviruses are laboratory creation.\" ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwtuJfXYcogYbdeep54AaABAg", "comment": "What I'm presenting is outside of the box ideas based on what I read in Retrovrus Biology and Human Disease by Robert C. Gallo & Flossie Wong-Staal 1990  Emerging Viruses: AIDS And Ebola : Nature, Accident or Intentional? by Leonard G. Horowitz, Youtube video by Dr Robert Strecker: \"the strecker memorandum\" and other General Biology & Microbiology college classes I've taken. These classes doesn't in anyway provide the information i'm seeking or that's found in Dr Gallo's or Dr Horowitz book. ", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugz98nQXoSafbRaEvkl4AaABAg", "comment": "\"Many infectious viruses coevolved with the vertebrate immune system. During the assembly of enveloped viruses, lipid ordered domains of the host cell plasma membrane, called lipid rafts, frequently function as a natural meeting point for viral proteins. The role of lipid rafts in the organization of complex combinations of immune receptors during antigen presentation and T cell signaling is widely recognized.\" Specific genes (through manipulation) could cause this to also happen in bacteria.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxYcDb-WyPYKDZiuCV4AaABAg", "comment": "I am glad the feeling's mutual. Oh please do lol.", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwLLfcmF_ZZFh-ITjt4AaABAg", "comment": "Through genetic engineering, bacteria could be designed to perform any function; the same is true for viruses. For instance: \"Direct stimulation of T lymphocytes by immunosomes: Virus-like particles decorated with T cell receptor/CD3 ligands plus costimulatory molecules,\" (Immunosomes= immune cells envelope proteins or virosomes... ) It is the ligand of the virus that binds to CCR5 delta 32 receptor of the host t-cell. E. Coli is the most common bacteria known to cause blood infections... ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugwh0HBnKK1SPvFchYV4AaABAg", "comment": "I know the feeling, I deal with hundreds very bizarre ideas every year. It is amazing what is out there. If you want a few good laughs I can point you to some videos. ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugxi9if8lJm2Yl6E3Hd4AaABAg", "comment": "But HIV directly infects t-cells through the CCR5 receptor. This can be done invitro. E Coli have no CCR 5 receptor.  We get transmission of HIV in blood to blood where there is no E.Coli We have no fecal transmission of HIV though we have the highest levels of E.Coli in feces.   So your idea would seem to be unnecessary and contrary to the facts. ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugx-RfEnWNMg_lm9wZ94AaABAg", "comment": "In the presence of another viral strain, recombination occurs a second time giving rise to a third strain. The expression of viral DNA or RNA-- following the hijacking of a viable cell machinery--- is by definition a function of DNA/ RNA governed by biological law. Nonetheless, my hypothesis [based on the lecture etc.]is it seems plausible  that e. coli might have been genetically manipulated to create a vector--- for the delivery of viral genome into T-cells, as it relates to HIV. ", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgzuMWTneldI3Hxqv_x4AaABAg", "comment": "Viruses recombine once inside cells. It is not even a  function, just a side effect that when you mix rapidly reproducing DNA strands in they same place accidental crossovers happen due to annealing between homologous strands from different sources followed by DNA repair. ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugwj_mHcNVZLVETVYPZ4AaABAg", "comment": "If you know for certain (not based on opinion) that E. coli is not the vehicle used in the transmission of the HIV DNA into the T-cell upon docking its receptor site ( ccr5 delta 32) , then what is? Viruses on their own are unable to perform any function, therefore a living organism is needed. What organism that has a symbiotic relationship with the human body would provide the machinery for recombination? Bovine leukemia virus sequence etc. recombined in this vector could cause infection.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugy_99PAT9gGotmNYux4AaABAg", "comment": "NOO.(I can't believe this is happening on a video with Dr.Tyler Jacks,an amazing cancer researcher using methods in recombinant DNA technolgy to investigate events leading to cancer development).The only evidence of the claim of zoonosis (this claim needs more evidence in my opinion)is a species of monkey that is genetically closely related to humans can have HIV-like viruses.E. coli have absolutely nothing to do with the HIV infection process. If you want to continue with this, then message me.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyU9Tq2r60LRJ9PL0t4AaABAg", "comment": "Sounds like a lysogenic cycle involving a bacteriophage to my, based on your statement. Lentiviruses do remain dormant for long periods, which brings into the equation zoonosis. I do understand the enzymatic mechanisms that are involved in retrovirology, however, I'm trying to determine-- based on extensive use of e. coli in recombinant DNA-- if it is possible that E. coli was manipulated to initiate HIV infection in any way.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwtPPTuJtCPX8MlrTd4AaABAg", "comment": "(facepalm)...the only vectors involved are the organisms/things that got the HIV into the host organism in the first place. Once the virus has access to those specific cells, the HIV has its own mechanisms available to integrate its own DNA into the host genome. That virus is a lentivirus, part of the retrovirus family that is known to use reverse transcriptases to make DNA from its RNA, then incorporates its DNA into the host genome via the integrase enzyme. ", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgzirvbS5n1Fe_voC2Z4AaABAg", "comment": "Given the scientific definition of a Virus, what vector is used in order to transfer the DNA sequence of HIV into T-cells of the host? Also, can you identify the organism or cell that's responsible for transmitting the HIV DNA if-- as you've said-- it's not a bacteriophage?", "votes": "1", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwJBQJSlcOEwuKddhB4AaABAg", "comment": "The SUN can genetically modify us.  o.0  Sun-damaged DNA is actually caused by DNA dimerization by ultraviolet rays. This damaged DNA can be replicated and create genetic mutations, possibly leading to cancer. Some organisms for scientific research undergo induced mutations through controlled ultraviolet ray exposure.  **(cue mass panic and paranoia)**", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxQ7RcxwDOFPKfMzbl4AaABAg", "comment": "the HIV virus is not a bacteriophage. Number 1. HIV infects specific immune cells. Number 2. HIV depends on a reliable host with a lifespan that typically outlives E. coli given the virus's long incubation period. Also to point, HIV transmission happens in a variety of ways", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgwC7EOWy2se6Eg8yUJ4AaABAg", "comment": "Could it have been through genetic manipulation of e.coli, that the HIV virus synthesis was made possible? Considering that the bacteria e.coli is found mainly in the gut--- which includes the anus--- and the transmission of HIV occurs through anal intercourse, it is reasonable to conclude that e.coli is the vehicle through which infection occurs.", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "Ugwd8a6cs_b04QbD_ZR4AaABAg", "comment": "I was like Are they stupid at MIT???? hahaha", "votes": "0", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgxJ2fsuXKnc1TaK2xx4AaABAg", "comment": "Wow I honestly thought he was gonna have to run for the emergency shower or something", "votes": "10", "replies": "", "reply": false}, {"vid": "htYyCEdc8B4", "cid": "UgyumzLb5nFQyWMqOBV4AaABAg", "comment": "get a load of this guy", "votes": "0", "replies": "", "reply": false}]