[{"vid": "iWZDVWdtjMY", "cid": "UgwK7mKAJOho-vyC1Ot4AaABAg", "comment": "Minor, but the image removal due to copyright restrictions is annoying... was it not possible to add an overlay with the name of the book instead or something like that?", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugx6-tUfHJDhk1EweUV4AaABAg", "comment": "J'ai le livre dédicacé par Stephan Hawking une merveilleuse histoire dû temps chez moi", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzG6J16RusScr59esF4AaABAg", "comment": "LOL, in science you have causality and effect by this causality. In this case, you have a man, do no want to open , for see if a Cat is dead or alive. Causality is man no want to say, no question for response, only nothing,, effect is have no response if the Cat is dead or not, only by causality, man are idiot. now you have this dream, the Zombie, walking dead, and now the Cat is a Zombie. You say is not possible, but you, the causality, do no want to say that. in this case the duality wave/particles are ok...Many say this duality is ancien science, the particle is only a wave at other state and not really duality when you eject that no?....., cause wave, effect particles,  is the same...New science ?  for me, science of idiot, cause for a zombie Cat...", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzPNs6uy0JuGbYkfBJ4AaABAg", "comment": "31:52", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugw8qX_xv2LHVyVkwcN4AaABAg", "comment": "必ずコンプリートだからねー早くしろ！💢", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzxmWb6UCuCUZSxKEd4AaABAg", "comment": "I think electrons are made of an electron neutrino entangled in orbit with a dark matter muon neutrino, explaining their erratic orbits around nuclei and explaining superposition and uncertainty.\r \r I think photons are a pair of electrons entangled in orbit together in apparent an axial or helical polarizable wave-like movement depending on the direction of their rotation as they travel.  This explains the double slit experiment for example and the speed of the rotation explains electromagnetic wavelengths (and visible colors, etc).\r \r What do you think of this Mudfossil University video?:\r ‘’Light Duality Solved and Seen’’, Sep 29, 2022\r https://www.youtube.com/watch?v=ROrFdPiancw", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugx8RxoRqgvCaw55f-d4AaABAg", "comment": "34:45 Nice question", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwTQf9RYc3Tlidh1yl4AaABAg", "comment": "Sounds like a lot of bullshit. Let's just talk about electrons for a sec. You do realize no one has ever seen an electron, right? No one has seen an atom, either. And while I'm on it, Corona Virus is also too small to be seen with a 'light' microscope. 500 nanometers is the smallest that can be seen, according to public info. And how big is the Corona Virus? 40-50 nanometers. So, yeah, that is bullshit too. Also, you have to ask, if it is too small to be seen, then how would you even begin to know what size it actually is? LOL. I feel ripped off. Where is REAL SCIENCE? Faculty just make it up, get their cousins in the media to promote it and award it, and then the propaganda machine kicks in, STARTING AT THE COLLEGES. Drop out and don't pay your student loans. ARE THERE ANY REAL SCIENTISTS OUT THERE? HELLO....HELLOOOOOO....HELLLOOOOOOOOOOOOOOOO....ARE YOU OUT THERE?...", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugx-tXAMPUkF8oeiPrZ4AaABAg", "comment": "Only mainstream science could turn a joke about the absurdity of a theory intended to dispute it into open support for it.  It makes you wonder what is going on in the minds of these people.", "votes": "0", "replies": "2", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugz2b6a85-2bO4aORdt4AaABAg", "comment": "Physicists need to chew some peyote and read Castaneda. Then we can move on from \"duality\" and just understand energy.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugy7GyDIDf6TOK5WURx4AaABAg", "comment": "Electrons are escaping from sharp edges on the zinc plate. Zinc sphere would be a better shape for the experiment", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgypZtOefFb1m6TMRDl4AaABAg", "comment": "👌👌👌nice lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwDyUAd7HZl-Vungf94AaABAg", "comment": "These lectures are going to save my chemistry grade this term. MIT, Please keep providing this resource. I have built my foundation of mathematics, computer science, and now chemistry through these open courses and the positive feedback I have gotten from my Professors have been directly correlated to when I began taking advantage of this. Thank you!", "votes": "3", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgyFnQi2K9thCCavNC94AaABAg", "comment": "I have never seen the photoelectric effect taught accurately or recapitulated accurately.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzJzs6YDpO7CEqLZDJ4AaABAg", "comment": "Falacy for free...", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgyMwL-1nDEqpA4t_pt4AaABAg", "comment": "There must be a proportionate value to emit an electron, which insists the same for spectral emissions in a gas, which is based on resonant frequencies, which is based on a wave, not a particle. Thus, the particle aspect to the photoelectric effect is nonsensical.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugw9_Nk8Suz_nWgoImB4AaABAg", "comment": "Calculated wavelength of baseball is incorrect.  Also, on slide 38:51, \"Thompson\" should be \"Thomson\" and \"Noble Prize\" should be \"Nobel Prize.\"", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwJOep-aEv9ImDXH0d4AaABAg", "comment": "https://www.youtube.com/watch?v=C5z75wjFA2Q", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxHd7BZUOvutIobYI54AaABAg", "comment": "Shooting electrons at 150kw at the anode and collimating at 1sq/ft all of those photons popping out of the crash, then BOOM...You got a Chest X-ray lol", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzZSsbLN-tOaJ8AoKl4AaABAg", "comment": "75% of studends are asians..LOL", "votes": "2", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugx-tXAMPUkF8oeiPrZ4AaABAg.9KLBppJqlE59w7UFzjZaq1", "comment": "?", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugx-tXAMPUkF8oeiPrZ4AaABAg.9KLBppJqlE59w7c87VOJLS", "comment": " @asdfafafdasfasdfs  Are you telling me that you are unaware of the origins of Schrodinger's cat?  Schrodinger did not mean it as a compliment, and was instead being critical of the absurdity of qm.  They took that criticism and adopted it ad a fundamental principle.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgxXGwVrGJFTumm_tUd4AaABAg", "comment": "The question was raised of very high significance and improperly answered.  The question was related to the DeBroglie equation and why given the momentum approaching zero the wavelength dramatically goes to infinity.  Clearly, the equation is improper in its interpretation or applicability.  The speaker could not answer the question which shows the lack of true understanding of the wavelength concept and what it really means.  The truth is very few people understand the proper interpretation of the wavelength significance and applicability.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxBjZKG9nxKymxTniF4AaABAg", "comment": "Really amazing, way over my head, but a great description of things and lecture.  Thank you for this!", "votes": "3", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgyLkaMEYvesgpn6G_N4AaABAg", "comment": "Curious as to how this person qualifies as a knowledgeable about anything? Seriously, people pay premium dollars for this school? Seems like MIT accepts throwing bullshit on top of garbage and calling it education is acceptable as long as you're wearing a skirt and are physically repulsive to the opposite sex. And what's the deal with letting her inject her feminist garbage throughout the entire \"presentation\"? This is not acceptable in any forum, much less something posing as an education environment.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugz-E6_0A9Ois9QlH7t4AaABAg", "comment": "when that guy asked about what happened if the ball speed was 0, i thought what would happen if we change the relative point of view   the Ball on earth may have a velocity of 0, but the earth is moving around the sun, the sun around the Galaxy and the Galaxy is moving (presumably) Away from what i call \"Absolute Relative Point\" or the center of the Universe where the big bang happened (hence absolute)   the most straight forward prediction i have is the wavelength varies depending on the point of view   let me explain   since P=h/Wavelength  then wavelength = h/p and p=m*v  the Wavelength = h/(m*v) v begin velocity   This states that the Relationship between Wavelength and Velocity is inverse, increasing the Velocity would result in shorter wavelengths and decreasing it will result in Longer wavelengths (all that is in the video) (also i imagine that if the object Velocity is 0, then the wavelength approach infinity then is pretty much a straight line)   But Velocity Varies depending on the Relative point of view  the ball velocity may be 0 on earth  meaning its wavelength approach infinity   but if we see the ball from the sun it is moving along the earth around the sun, therefore its velocity is equal to the velocity of the earth moving around this point of view, therefore it's wavelength is shorter than if we see it on earth   then it will be even shorter if we look at the ball from the center of the galaxy, because the sun moves way faster around the Galaxy than the earth around the sun  and i can only imagine how fast the Galaxy is moving from the Absolute center of the Universe, and how short that ball wavelength would be, or even the earth wavelength because its mass is bigger than the ball's mass  well my conclusive predictions of this is again, the Wavelength Varies Depending on the Relative Position of the observer", "votes": "0", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugxnolw8fgJ2XmBYX3V4AaABAg", "comment": "This is what we indian learn in class 11th 😎😎", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugwezhc2-5r5vimfM7h4AaABAg", "comment": "thank u or the lecture  im from india and im learning this in class 11 it helped me a lot", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugx76M2pjDPmCU3Njed4AaABAg", "comment": "Perfect  Would you provide the notes with each video? That would be a great help", "votes": "0", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugw1H2snmvslxctQGf14AaABAg", "comment": "The subtle jab about de broglie", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxdLXlNNrU6dr_UGPF4AaABAg", "comment": "What happened to videos with the topics before this lecture?", "votes": "0", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxeaBpQrrvl3gMs8aJ4AaABAg", "comment": "Maybe it would be easier to charge up the apparatus using a Van de Graaf generator?", "votes": "0", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugz7ICt9zZ4qKGaEl6R4AaABAg", "comment": "Thompson son \"rebellion\" 38: 50 approx", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwUGWKge1KeCDXoocB4AaABAg", "comment": "wow very clear and enjoyable", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgyFNWaKrKe6oteF3ft4AaABAg", "comment": "what about e = hv >- if hv is equal but not greater than theta will it eject ?", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjeuA94aUfq1HgCoAEC", "comment": "2017", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC", "comment": "in India , this is taught to us in high school, 😂", "votes": "11", "replies": "15", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgisPWnmuCHIaHgCoAEC", "comment": "What happens when the velocity is 0? What will be the wavelength? infinity?", "votes": "2", "replies": "3", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggkvyycyuujaHgCoAEC", "comment": "This is why you pay $50,000 a year to go to MIT.  They have good professors, unlike the crappy state school I went to.", "votes": "1", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugjx-Ffu-Ncg-3gCoAEC", "comment": "Concerning that question at around 35:00.  Velocity (v) cannot be zero without violating the uncertainty principle. Since  delta(x) times delta(mv)>~h-", "votes": "2", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggAnyoDfFox73gCoAEC", "comment": "Isn't the SI unit of intensity j s^-1 m^-2?", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwRLQqH9u0LDdNYAOZ4AaABAg", "comment": "If that stupid opening question was asked at IITs, almost 100% would have given the right answer, it is seriously ridiculous to see such a low percent of people choosing the correct option.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugz-E6_0A9Ois9QlH7t4AaABAg.8lc_IRqnQkd8lca1mk77ve", "comment": "there are lots of assumptions by the way, i assume that the ball Velocity would be equal to earth if we see it from the sun, the earth not only moves around the sun but also rotates around itself, meaning that the ball varies it velocity viewing it from the sun  the same analogy for everything else, but since those Velocities may be Pretty much meaningless in the calculations, i assumed the Velocities to make the analogies much easier", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugx76M2pjDPmCU3Njed4AaABAg.8e1mEF6ZuRt8e3BBNx_CCu", "comment": "+Mahmoud Omar You can find the notes and other course materials on the OCW course site: http://ocw.mit.edu/5-111F08.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgxdLXlNNrU6dr_UGPF4AaABAg.8c7o06LXcaW8c84EsImllM", "comment": "We are not sure why YouTube keeps breaking the official playlist functionality... but they keep breaking it. Here's the full playlist for the course: https://www.youtube.com/playlist?list=PL2902385153144A26", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgxeaBpQrrvl3gMs8aJ4AaABAg.8a28JuoTUmi8b6Z82qfYQV", "comment": "Not sure why they were expecting the charge to hold. Once they remove the wand, the electrons will redistribute themselves and the polarization disappears.", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68VgI_FBGmLN", "comment": "ya", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68bRuzIl5Zvn", "comment": "This was an introductory course by the way. Students can take any course they want to.", "votes": "3", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68e0It0G08Dc", "comment": "Not only in India but other countries as well; inclusive those in South America!", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68fX4V0PZS2i", "comment": "Perhaps you guys can apply this knowledge to finally figure out how to  make plumbing accessible across your country.", "votes": "28", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68g_x4_vecZw", "comment": "We have this in 11th grade", "votes": "3", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68gegR9Zk5_d", "comment": "Pape You better ask for food and not wave particle duality.", "votes": "5", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68nv4JyV4KQZ", "comment": " @pape1256  woah dude back off!", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68o66Tv3adoo", "comment": "Really...i must have missed class that day..lol...understanding Schrodinger equation, needs a foundation which cannot be taught in High School...", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68oJUJ_zejvs", "comment": "That's because we waste our schools budget on football uniforms and have 9th graders that can't even multiply two digit numbers - my parents pulled me out of school because of our asinine public education system.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68oJ_YQOJ0T2", "comment": " @purple6932   Dude I'm in 12th grade and i was taught the Schrodinger equation in 11th. I'm pretty sure that's high school.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68oJcDVofe5V", "comment": " @sibisebastian404  ...yeah right...good for you...all the best for your Nobel Prize pursuit...duh", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68oJio5K6EKJ", "comment": " @purple6932  You don't have to be so sarcastic about it. I'm just stating a fact.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68oJl3DN7l7u", "comment": " @sibisebastian404  ... yes, you made yourself clear, now move on thank you.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68p5k35ZdqAL", "comment": "Also taught in high school in the U.S.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgifADNsyVcBLXgCoAEC.8UxvuvxW7Y68pOjAkJ2AzK", "comment": " @pape1256  no that's for creating world class scientists and researchers to send some shit people like you to Mars.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgisPWnmuCHIaHgCoAEC.8U6IUVTedNI8ULFV9K-hyK", "comment": "Chasmewali yes it can be observed in the de broglie equation", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgisPWnmuCHIaHgCoAEC.8U6IUVTedNI8ULFZHxgvW4", "comment": "It will be a wave of infinite wavelength.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgisPWnmuCHIaHgCoAEC.8U6IUVTedNI8ULFjl3ba6f", "comment": "also i think it is not possible for the velocity to be 0 without violating the uncertainty principle", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UggkvyycyuujaHgCoAEC.8Tyt7LTCr7u8jwV28vll9y", "comment": "Bill Nolastname lowla", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgjScB1WB9YnDHgCoAEC", "comment": "Wavelength has Nothing to do with mass, and everything to Do with pulse Frequency and Velocity. Axiom.  Though Gravitational waves Will be affected by mass.  1 Wave can have infinite length(and does). More than one wave is Not infinite in wavelength.", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjEUb0TsSb0DngCoAEC", "comment": "That's a really great electroscope design. Balanced and simple enough to make at home. Less gravitational resistance on the meter arms, which can better be extended. Could combine that with floating mirror, already reflective.", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgiCHJ22mgSglXgCoAEC", "comment": "she has got the physique of a wrestler........", "votes": "3", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UghpJsPniIXrX3gCoAEC", "comment": "inception lecture", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugha0eojGPzHKHgCoAEC", "comment": "What's the difference between frequency and intensity?", "votes": "1", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UghLJqe9KYSaeXgCoAEC", "comment": "great lecture delivered in a clear, relaxed and friendly manner", "votes": "34", "replies": "2", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggZ9ao5lKf7hngCoAEC", "comment": "Thank you very much for this lecture.", "votes": "6", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggsGO9dDRIhf3gCoAEC", "comment": "Amazingly clear lecture... Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgicattyZRtj3XgCoAEC", "comment": "45 minutes into this lecture a student asks a naive question: What happens to the DeBrogie Wavelength when the baseball stops? and the professor can't answer the question. If you are curious about the answer too, then look up Ground Potential Theory by Steven sesselmann", "votes": "6", "replies": "3", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjCtfuc96EbEngCoAEC", "comment": "how can i get the  full lecture about Schrodinger wave equation  by MAM Elizabeth ? just send me the video please", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjOcSG06Aghg3gCoAEC", "comment": "...online", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggQAwBxRxDr7HgCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again.", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjTKd8drQjF73gCoAEC", "comment": "The demo was very embarrassing, they were using a insulator to transfer the electrons from the fur to the metal. They needed to scraped the electrons off, touching would only transfer a small amount of electrons and holding it near just pushed the electrons inside the metal around which made the rod move when she held it close. D:", "votes": "5", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC", "comment": "Just checking, that's a typo on 32:13 right? should be 1.11*10^-34, not 1.11*10^-31", "votes": "15", "replies": "6", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugha-A2Z88caEXgCoAEC", "comment": "Seems crazy that MIT cannot fill the seats for these lectures.", "votes": "3", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ughs0DKFWEd2-HgCoAEC", "comment": "Awesome 1 !!!!!!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugjqif7G3SZlj3gCoAEC", "comment": "This lecturer is awesome!", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjdqIWmcTj5iHgCoAEC", "comment": "She is hilarious, I appreciate this video, thank you very much. ", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UghpD8JwQuun_HgCoAEC", "comment": " At 35:00, awnser to that question is straightforward. If the ball doesn't move it still contains momentum, because of the non zero temperature. The constituents are moving and do in fact have momentum, based on thermal physics. So the ball still has a tiny amount of momentum in the order of 10^-24 but this is still insignificant compared to planck's constant. Only when you get really really close to 0 kelvin you will have a macroscopic ball with quantum mechanical properties.", "votes": "10", "replies": "5", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggnXrfOzuOBjXgCoAEC", "comment": "I really wish she was my Instructor..this was not just easy to understand but enjoyable..I felt like a member of the class", "votes": "33", "replies": "2", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgiCHJ22mgSglXgCoAEC.8MD-kLWhzNE8OLNHCXJwfI", "comment": "Hahaha", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugha0eojGPzHKHgCoAEC.8KKynX73Bi-8KopDjxksdZ", "comment": "Frequency is the number of oscillations per second (like the oscillations for an ocean wave, for example); intensity is the amount of power (joules per second, or watts) delivered per area unit.", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghLJqe9KYSaeXgCoAEC.8IccJjNXypS8JhU2NZzB1f", "comment": "love the comedy , ! I guess it was lost on all your other fans !", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghLJqe9KYSaeXgCoAEC.8IccJjNXypS8aiqLggjd_E", "comment": "( . ) Y ( . )  that's all.", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgicattyZRtj3XgCoAEC.8BhAE50UUmu8Ww4PBrvC15", "comment": "That's a stupid question. The basketball is not standing still, the atoms inside it are still oscillating and the de Broglie wavelength is proportional to the mass and the temperature. So since non of those change neither does the wavelength.", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgicattyZRtj3XgCoAEC.8BhAE50UUmu8iUPHLKd5xd", "comment": "as you know, a circle of radius infinity is nothing but a line. hence, when a ball stops, its wavelength does become infinity, which means it is not moving in comparison to the average wavelength.", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgicattyZRtj3XgCoAEC.8BhAE50UUmu8lcc80UxwFJ", "comment": "is not like she couldn't answer, if not is because she may did not wanted to give an over-complicated answer to a guy that may dont know about those matters", "votes": "2", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC.80dSLC3bfPG894zqKTwIl7", "comment": "+Timothy Chang I also got 1.11*10^-34. I'm not sure if its a typo but I'm glad I'm not alone!", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC.80dSLC3bfPG8e0IFTPZC2H", "comment": "It is a typo; they divided by 142 kg instead of 0.142 kg", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC.80dSLC3bfPG8lcbp_FxE_N", "comment": " @Cassiro  lol a really heavy  ball! still it means that very heavy objects still get very long wavelengths", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC.80dSLC3bfPG8lccNEwstcJ", "comment": "Elinzar LOL indeed!", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC.80dSLC3bfPG8p5nvNbxBc2", "comment": "I concur.  The slide is incorrect.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugg-OiGWOq5dWHgCoAEC.80dSLC3bfPG8uMdvTKXz65", "comment": "Stared at my solution (also ^-34) for 10 minutes until I thought to check the comments for errata... thanks all :)", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghpD8JwQuun_HgCoAEC.7-H0Z7-1Rpd72vJjLQnsv8", "comment": "How did you calculate the momentum to get 10^-24 ? Also, has it been shown that macroscopic objects at near 0K display quantum mechanical properties?", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghpD8JwQuun_HgCoAEC.7-H0Z7-1Rpd73W2ztsJvkI", "comment": "Andrew Valmonte In the case of a solid ball it's actually quite hard to calculate cause it's a solid so we can't apply E = (3/2) n k T as in an ideal gas and it would even depend on the properties of the solid.  What you would want to know is the heat capacity of the bal i.e. how much energy do I need to raise the temperature of the ball with 1 degree. That bit of information is needed here, I did some research on google but I wasn't able to find the heat capacity of the type of ball mentioned here. Now we can assume most internal energy is kinetic, at least if we're not too close to 0K. If you have the heat capacity c you can multiply that with T(say 293K, room temperature) and that would give you a rough estimate of the internal energy.  When we have that we can assume that's the kinetic energy of all the molecules moving around in that ball, when we have the kin energy we can calculate the momentum using E = p²/2m and with that we can of course calculate the wavelength. In this case im not able to give an exact awnser/good approximiation because of lack of info about the ball's heat capacity, but it's still a lot of orders of magnitude above planck's constant. And we should not forget the heat capacity itself depends on temperature, it's only approximiately lineair on temperatures in every day life, so depending on how accurate you want an awnser it can get very tricky.   And about that 0K story, no this hasn't been shown. The reason is no one has ever come close enough to 0K for these effects to get significant, im not going to calculate that now but you would have to get incredibly close to 0K for those effects, orders of magnitude closer than what today's technology can do. However you could get those effects with intermediate objects like large molecules that as a whole may not be really behaving quantummechanically at normal temperatures but can experimentally be cooled to sufficiently cold temperatures. So within the technological limits this has been proven experimentally. Hope this helps you further, and in any case you could even experimentally determine the heat capacity of a given ball if needed :p   EDIT: something went wrong when I applied this to a piece of iron of 1 kg. The value for the momentum of a (macroscopically) stationairy piece of iron get's too high, even higher than what it should be at low speeds. Probably my assumption on the composition of internal energy is wrong, if most of the energy isn't kinetic the above description doesn't work. Damn, by explicitely trying to work this out it turns out to be harder than I thought.", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghpD8JwQuun_HgCoAEC.7-H0Z7-1Rpd76YOwvWiriN", "comment": "Dirk-Jan Toot Andrew Valmonte Experimental scientists have been able to get materials to temperatures extremely close to zero kelvin (0 K), although because of vacuum energy it is impossible to actually reach 0K, they've gotten things to less than 1 kelvin (within hundredths of degrees above absolute zero). It has been observed that yes macroscopic objects start to have quantum mechanical properties and verry, verry odd properties like super-conduction and properties of super-fluids. (i would recommend researching it a bit, it's really cool stuff )", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghpD8JwQuun_HgCoAEC.7-H0Z7-1Rpd8Ww5AzEUUuw", "comment": "I think it's like 0.25 miliKelvin at my university.  The De Broglie wavelength is kind of a measure of how Quantum mechanically an object is. you can express it in terms of temperature and mass. Then you just have to get the Basketballs wavelength down to around the size of that of the electron.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghpD8JwQuun_HgCoAEC.7-H0Z7-1Rpd8lcb_IhYaKe", "comment": "Also the Wavelength Varies depending on the point of view, if the ball Velocity is 0 viewed on the earth, its Velocity would not be 0 if viewed from the sun, therefore its wavelength gets shorter or longer depending on where you look at the object and its Velocities relative to those points of view,   thats pretty cool too", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UggnXrfOzuOBjXgCoAEC.7-H0Z7-QP9p8TTiFh0k3Ol", "comment": "ABDULMUJEEB   ONAWOLE", "votes": "1", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UggnXrfOzuOBjXgCoAEC.7-H0Z7-QP9p8V_Oy_VfpS6", "comment": "And hot...", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UghcO6KCfSb4DXgCoAEC", "comment": "Need help.  Should not the UV laser eject electrons from the Zn plate- and the added static electrons are not necessary for the demonstration?  and also, do the static electrons added in the demo have the same work function as the bound orbital electrons of Zn??   I would not think so.", "votes": "0", "replies": "1", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjITp0NC4_usXgCoAEC", "comment": "NPTEL is better than MIT OCW", "votes": "1", "replies": "5", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UggSOkuSwDO3T3gCoAEC", "comment": "Good question from the student: \"How about the wavelength of the ball as it stops ?\" To answer this, we need to recite Heisenberg's uncertainty principle. The speed would never be ideally zero since you know the position of the ball to a certain precision (for example 10^-6 m) . This lead to the uncertain in speed, and the wavelength of the ball is still very small. Do the maths to verify!", "votes": "5", "replies": "2", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugh5WalwUjvJGngCoAEC", "comment": "How come the slower pitcher has a shorter wavelength --think the calculation goes wrong somewhere ?", "votes": "1", "replies": "2", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgjIlHPvubbaQ3gCoAEC", "comment": "I love her jokes!! The humor of the joke passes on to viewers like me with great ease in awesome fashion while she elaborately explains the actual lecture contents! If all the professors were as good a lecturer as she is, the whole world would be smarter. ", "votes": "25", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwDs59pdzW3u8EtOvN4AaABAg", "comment": "Yes,a slight disappointment but she is an excellent and exciting lecturer like Herr Professor Schroedinger.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgyIRwyKg0D96SDrvRN4AaABAg", "comment": "I learned the material in this class in high school as well but I definitely enjoyed the way this professor approached the topic. This is great for both reviewing and learning for the first time.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugwk2dbW17Xs0dV8ZHF4AaABAg", "comment": "whats funny is that I learned this stuff in my IB course in high school and I understand the lecture very well. ", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugy333-6TyqtmxZJAdp4AaABAg", "comment": "no i'm just a purist", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgyCjhSfvHFtCZi6nhx4AaABAg", "comment": "u must be an indian then :D", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzSzJT87IodRmtkUYh4AaABAg", "comment": "If someone doesn't know, you can get lecture notes here - ocw.mit.edu/courses/chemistry/5-111-principles-of-chemical-science-fall-2008/readings-and-lecture-notes/", "votes": "5", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzzgMqr_plXxhHVoTV4AaABAg", "comment": "Im in the nerdy part of youtube again", "votes": "3", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxpiFCoZChdAS6ZVT54AaABAg", "comment": "She mispronounces Schroedinger and Planck.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "Ugx4UAkjfy9_XJr7Ch54AaABAg", "comment": "The convention is the same in physics for the polar coordinates, but not in math.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxBEFod3Odl6_cj7s14AaABAg", "comment": "Wavepackets have a finite size, and when the wavelength is larger than this size, the simplified picture breaks down.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxwULA5g-D2bk4KOm14AaABAg", "comment": "Lol you can see the online dropout rate with the number of views.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwHiEVllTixY9ypNgV4AaABAg", "comment": "Her voice is young and sweet. For me, it's mismatching voice to maturity..", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgxNoGnfdAiRPTsnHWB4AaABAg", "comment": "I JUST LOVE HER SHE IS A REAL TEACHER JUST A PURE PROFESSOR TEACHES        VERY SINCERELY ", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgzF6ZPG_viGUGuKrY14AaABAg", "comment": "If you really want a waving derivation of Schr. Eq. without the bad historical mistakes of callig particles \"waves\" and so on, go to youtube's Leonard Susskind's Lecture 9 on Modern Physics: Quantum Mechanics and carefully listen to his speech besides watching the equations he writes on the white board.", "votes": "1", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UgwQ6kIxX4EcKIXnmAZ4AaABAg", "comment": "It's de Broglie like destroy. Think deBroy.", "votes": "0", "replies": "", "reply": false}, {"vid": "iWZDVWdtjMY", "cid": "UghcO6KCfSb4DXgCoAEC.7-H0Z7-OXq58YPV6DQfHmH", "comment": "The frequency of light is inversely proportional to the wavelength of the light. Red light has the lowest wavelength and energy in the visible spectrum and it's work function is not enough to unbound the electron on the plate.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgjITp0NC4_usXgCoAEC.7-H0Z7-KXUz73NljXMI5FV", "comment": "then what are you doing here?", "votes": "5", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgjITp0NC4_usXgCoAEC.7-H0Z7-KXUz7541s8pxy2r", "comment": "NPTEL is awful", "votes": "2", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgjITp0NC4_usXgCoAEC.7-H0Z7-KXUz8TgqCAE0zAr", "comment": "Bullshit. Indian professors do not care about the making the educational process enjoyable. They intentionally make the classes dry and joyless. It's not about the education to them. It's about passing exams. Plus, Oh my god that accent.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgjITp0NC4_usXgCoAEC.7-H0Z7-KXUz8bRusCj2RH1", "comment": "I completely disagree with you! I only enjoy some lectures of NPTEL, but OCW lectures are on another level.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UgjITp0NC4_usXgCoAEC.7-H0Z7-KXUz8bzoUabV0oV", "comment": "Nptel is highly boaring.dont talk shit", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UggSOkuSwDO3T3gCoAEC.7-H0Z7-FwNl7Be-T25DmpE", "comment": " I thought about temperature. Bc of the non zero temperature the particles in the ball are still moving and you can calculate this internal kinetic energy then convert it into momentem by E = p²/2m and then use the p found there to get the awnser. If the temperature approaches 0K and the ball is stationairy, only then does the heisenberg uncertainty come into play. At least that's my pick.   Btw, any comments on my analysis in the comment above, I know something went wrong.", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "UggSOkuSwDO3T3gCoAEC.7-H0Z7-FwNl922ow7u3BfA", "comment": "I think wavelength doesn't get into picture as of putting the velocity of ball limit tending to 0  would give undefined value of it , mathematically ... But thinking to the core your point is valid !", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugh5WalwUjvJGngCoAEC.7-H0Z7-41gN7-WWEVCTQmB", "comment": "Al-I agree with your re-statement  of the relationship she is using ,yet somehow she states that Wakefield --the slowest pitcher at 74mph - returns the shortest wavelength by a factor of around 1000 ? ", "votes": "0", "replies": "", "reply": true}, {"vid": "iWZDVWdtjMY", "cid": "Ugh5WalwUjvJGngCoAEC.7-H0Z7-41gN7-WWa1aRQeo", "comment": "Ok.  I misread your post. If that's the case you're absolutely right.  ", "votes": "0", "replies": "", "reply": true}]