[{"vid": "iz7rWK5cqjE", "cid": "UgyoJEJR_X18B_bTjeR4AaABAg", "comment": "When you find out Miles & Malik are twins. 🎉 Way too much MIT biology youtube", "votes": "0", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgyDulaJy4kH-Qyxizt4AaABAg", "comment": "i appreciate miles/ malik for the comedic relief lmaooo", "votes": "0", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgzPLG1H3K8aQcvvi0l4AaABAg", "comment": "Hey MIT , is saw Professor Barabara and ADams email on your website, is it okay to email them?", "votes": "1", "replies": "1", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugxq6KOe0BQTXigx4q94AaABAg", "comment": "Miles and Malik confusion 😂", "votes": "1", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugzf6nHFI3aahGX3k894AaABAg", "comment": "(On Wednesday of February 8, 2023).  On the Matter of MIT Biology and the Subtopics of 1) Cell Cycle (Phases within this Growth Mechanism) and 2) Checkpoints (Regulatory Phases and Chemical Reactions Therein) Functioning to Arrest the Cell Cycle Pending (Cytological Rectification) or Progress the Cell on towards the Finalization of Cell Cycle Of Duplication: 1) Cyclin Dependent Kinases (CDKs; Proteomics of Cell Cycle Progression and Regulation); a) Cyclin Protein and Specificity to Cell Cycle Phases: Regulated Proteolysis (mitotic Cyclin in G2-Mitiosis Phase) where Ubiquitin (76 Amino Acid Protein) attachment to Lysine(s) of a Protein (a Protein Misfolding Indicator and Regulation Protein Synthesis); b) Xenopus leavis (Frog) In Vitro egg Extraction; Specifically Tissue of Cytoplasmic Extract (Egg extract); c) Messenger RNA (mRNA) Parameter Specific due to Variable Dependency; d) Cell Cycle Arrest Specific to mitotic cyclin Dependent Variable showing Specificity to Arresting Mechanism (Hypothesis of Genetics); 2) Dysregulation of Checkpoint Regulation is Hypothetically the Preferred Mechanism of Disease (MOD) in Proliferative Disease (Otherwise Malignancy Neoplasia);  PhD Adam Martin (Actin/Myosin Cytoskeletal Geneticists) is Herein Revelatory of the Most Plausible Mechanism of Disease in Neoplasia and/or Development Dysgenesis (Dysmorphogeneses). Gut aber was koennen man haette verstellt dass auser die Hoelle ist?  Heil!", "votes": "1", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgwBiKTL9QtIL5ldie54AaABAg", "comment": "Please where can we get other parts of the lectures?", "votes": "0", "replies": "2", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgxFjeAD9driLABEiSN4AaABAg", "comment": "thank u very helpful", "votes": "1", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugz45WAJbtv-BAogGCB4AaABAg", "comment": "Lack of Cyclin makes cell cycle get stuck, too much cyclin cause NO cell cycle )?", "votes": "0", "replies": "1", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugxz3DlgV4SZcNkN42d4AaABAg", "comment": "You  really  explained like a pro cause you are pro 😅", "votes": "5", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgzxDnUNe_TPA3wru2t4AaABAg", "comment": "very interesting lecture", "votes": "2", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugy2Xdb2Vz6E63O8gBB4AaABAg", "comment": "brilliantly explained.", "votes": "5", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugxrqyr6ey90tEFRptd4AaABAg", "comment": "If Miles/Myles doesn't get an A in this class, I'm suing.", "votes": "31", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "Ugw4OicBUxm9CtfOXbd4AaABAg", "comment": "Amazing Lecture!!! This lecture is a great refresher for my Molecular Biology Course", "votes": "11", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg", "comment": "I still didnt find the reason of occurence of haploid & diploid cell ..", "votes": "2", "replies": "6", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgxoGhY3ji-H_TMufWB4AaABAg", "comment": "Amazing lecture!", "votes": "3", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgyRRlEGEsmFfw1xTjt4AaABAg", "comment": "👍👍👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "iz7rWK5cqjE", "cid": "UgzPLG1H3K8aQcvvi0l4AaABAg.9uEHLz03X7H9uHT0ahBX_O", "comment": "You can but don't expect an email back As you can imagine, MIT professors get a lot of email. Doubly so right now... classes are about to start. 😉", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgwBiKTL9QtIL5ldie54AaABAg.9indqKbOkAk9iz9NHrWvqL", "comment": "View the complete course: https://ocw.mit.edu/7-016F18 YouTube Playlist: https://www.youtube.com/playlist?list=PLUl4u3cNGP63LmSVIVzy584-ZbjbJ-Y63 Best wishes on your studies!", "votes": "5", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgwBiKTL9QtIL5ldie54AaABAg.9indqKbOkAk9j-VcaaYHFP", "comment": " @mitocw  Thanks", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "Ugz45WAJbtv-BAogGCB4AaABAg.9VHgvri_LVh9Y9UzH3Wuuv", "comment": "Cancer", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg.9MsXBMJQHD29Qsblb-4Ls8", "comment": "Haploid cells (sperm in males and egg cells in females) are needed for sexual reproduction where two haploid cells are combined together to make a diploid cell.", "votes": "1", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg.9MsXBMJQHD29QuTWyarRgh", "comment": " @veeru4jnu  thats the result but whats the cause🧐", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg.9MsXBMJQHD29TGQrU-egii", "comment": " @Ousdoo  Meiosis generates haploid cells. We have haploid cells so they can fuse together during sexual reproduction to produce diploid cells. The reason is to keep chromosome numbers in somatic cells as diploid or 2N.", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg.9MsXBMJQHD29gS3rvJlvy5", "comment": "S. cerevisiae The mitosis/meiosis decision is arguably best understood in the budding yeast, S. cerevisiae. The IME1 transcription factor acts in late G1 or at the G1/S transition to activate the transcription of genes in the early meiotic genetic program and to initiate meiotic S-phase (Mitchell 1994; Vershon and Pierce 2000; Kassir et al. 2003). The regulation of IME1 is accomplished by nutritional cues and other inputs. For example, only diploid cells enter the meiotic cell cycle, and it is two key sex determination regulators (known in yeasts as mating type regulators) that register the diploid state: a1/α2 represses an ime1 repressor and thereby activates the meiotic program. Manipulation of nutritional cues reveals that the mitosis/meiosis decision must be maintained. Thus, starvation of diploid cells induces entry into the meiotic cell cycle, but a return to rich medium can reverse the decision and return the cell to the mitotic cell cycle; indeed “commitment” to progression through meiotic prophase I can be reversed until the first meiotic division (Simchen 2009).", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg.9MsXBMJQHD29gS45TB7uC4", "comment": "S. pombe The mitosis/meiosis decision in the fission yeast, S. pombe, also relies on nutrition and sex determination, but in this case, the terminal regulators of meiotic entry are not transcription factors. Instead, nutritional cues and mating-pheromone signaling trigger an elaborate cascade that ultimately controls activity of the Mei2 RNA-binding protein. Mei2 works together with the noncoding meiRNA to initiate meiotic S-phase and also to promote subsequent events in early meiotic prophase I (Watanabe and Yamamoto 1994). Whereas meiotic mRNAs are eliminated during the mitotic cell cycle, Mei2 and meiRNA antagonize that elimination and induce meiotic entry (Harigaya et al. 2006). See reviews for additional information about this intriguing mechanism of mitosis/meiosis control (Yamamoto 1996; Harigaya and Yamamoto 2007).", "votes": "0", "replies": "", "reply": true}, {"vid": "iz7rWK5cqjE", "cid": "UgxyXShAfskewX7GnWp4AaABAg.9MsXBMJQHD2A6WV5CQuuOf", "comment": "I can briefly explain it like this: You have 46 chromosomes and the person you will have a child with is like that. If it had not halved, your child would have 92 chromosomes and their child would have 184 chromosomes, so it would increase exponentially and differentiation within the species would even occur. It can often cause reproductive difficulties, genetic defects, or conditions such as polyploidy. Although polyploidy is generally beneficial in plants, it can be harmful to animals and humans.", "votes": "0", "replies": "", "reply": true}]