[{"vid": "kAfz0yAcOyQ", "cid": "Ugykd1nZRkNC9nwL1Kd4AaABAg", "comment": "Thompson Sarah Young William Davis Brian", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgycaiBXl-e47Ey5XLt4AaABAg", "comment": "Hall Barbara White Anthony White Nancy", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxA4aCEp7L9LW1o_Tx4AaABAg", "comment": "Young Charles Robinson Paul Johnson Frank", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz5d1Jva2ATxc425Vp4AaABAg", "comment": "Hall Patricia Thompson Timothy Taylor Margaret", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzhXmQea3MF6jQgcxZ4AaABAg", "comment": "At 1:05:00, talking about how GABA neurons can slow or silence neuron B, is this the same mechanism by which earlier in the lecture it was discussed that neurons (in rebellion to Dale's first law) may not always release a signal even though they may reach their action potential?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw0aVvHwMYivc90vvB4AaABAg", "comment": "Thank you stanford 🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy-w4zk4dIY2bM6bXx4AaABAg", "comment": "What with the funk🎉 hair and Beard, to liberal for me", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxuKrlLLsGnIpeuDWN4AaABAg", "comment": "Does the conclusion at end of 16:09 mean that if I get my ACTH profiling done - I can know which kind of stress is predominant in my body?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzZM1xESTXasCnIKXp4AaABAg", "comment": "That ladies question at 45:18 is the most important question asked during the entire lecture and I wish students asked more questions like this. I hope science provides us answers to these questions", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzEuYLv60fBObTFUf14AaABAg", "comment": "Very beautiful sweet sir ji hi ji ❤❤❤❤ tq so much ji", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwQXVigYZYZRBgHJS94AaABAg", "comment": "Aula fantástica!!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwpLutieuP7a94gxJN4AaABAg", "comment": "58:38 There is a mistake GABA-receptors typically localize to dendritic shaft synapses and the somatic membrane, not to dendritic spines. Spine synapses are almost always excitatory. Other than that, this was a great lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwmcVt2XiMxcKX98BR4AaABAg", "comment": "26:20 could this be how SSRI side effects work (it getting worse before it gets better)? Serotonin is released but reuptake is inhibited -> bookkeeping signal higher than it should be -> less serotonin produced -> APs can't release much Serotonin anymore -> Instead of increasing Serotonin signaling, it decreases (delta between AP and no AP is too weak to trigger AP of next neuron)  edit: with this interpretation, the autocompensation could again invert the effect in the long term, actually leading to more serotonin signalling after a while.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw9eNP0s7wgvzJbQDB4AaABAg", "comment": "Sapolsky is my best story teller. Such intellectually engaging as always", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw5Ggi-T87HUH62pTd4AaABAg", "comment": "I'll start first year of med school in like 2 months, and I love the fact  that I can keep learning while enjoying vacations, truly a series of videos that are making these weeks so AMAZING, I've never been so fascinated with the functioning of such a complex systems. Thanks for showing us the beauty of nature♥", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxQUNNWp96SMaOpsWF4AaABAg", "comment": "She’s still coughing. She has medical issues.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzZXpeZFgh9_A_Q7Yh4AaABAg", "comment": "02.40 so true, nothing much was taught about the limbic system in med school", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyBmOIRsg7BVfHMcQ54AaABAg", "comment": "Notice that viewcount, relative to the other ones? 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwlFsv8VicnBFTpTWJ4AaABAg", "comment": "Boring", "votes": "0", "replies": "3", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy4DGZ9smy61-Kf7mh4AaABAg", "comment": "Different cells in different neighborhoods will secrete different amounts of the same hormone from the same hypothalamic hormone. Communication going on in all the cells in neighborhood of pituitary", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy-w4zk4dIY2bM6bXx4AaABAg.A3hUvXV59R2A4oKoFAq1T-", "comment": "The hair or the guy😂", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwlFsv8VicnBFTpTWJ4AaABAg.9tYL7rSW12S9tYL9vPivBC", "comment": "So basic where’s the advanced stuff", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwlFsv8VicnBFTpTWJ4AaABAg.9tYL7rSW12S9tYLGTWMc6G", "comment": "This is a bright man but a basic bitch", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwlFsv8VicnBFTpTWJ4AaABAg.9tYL7rSW12SA4oL04iOxw7", "comment": "That’s why it has 606k views fs", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxWkCBqNhJpTUsxPtp4AaABAg", "comment": "Emphasis on 'advanced'. I wish I had the corresponding reading material", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzGt2LFMzH7wy0Las54AaABAg", "comment": "Good, enthusiast conference", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzB0yzY9kgfnwim80V4AaABAg", "comment": "Nice explasan this sessan", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyQD4YhToFYGdwr3tV4AaABAg", "comment": "HUSTERON, PROTERON At 5:23 \"And of course, it's irritating that we're doing number two before number one, but tough.\" Amazingly, ancient Greek has an expression for this reversal of mental order, dealing with second things first. And its name is: HUSTERON, PROTERON. That is, later things (\"husteron\" = later) are met first (\"proteron\" = earlier). This interesting linguistic reversal is frequent in Homer. It calls for some agility of mind from the reader or listener. In fact, ancient Greek, with its exceptional flexibility, versatility, and rich productivity, calls for agile, smart intellects not afraid of giving full firing exercise to those neurons of the pre-frontal cortex. We know too well that we're not going to get Prof. Sapolsky to change his feelings overnight, and start loving the ancient Greek language a little more. But this example of its remarkable flexibility may induce our learned Professor to show ancient Greek much more respect, and perhaps, at some later stage, even some reverence and affection as to a friend of the  pre-frontal cortex, instead of a necessary nuisance.  Because ancient Greek proves, once again, how immensely useful it is to neurobioloby, by providing this awfully complex science with an awfully complex vocabulary. It is thanks to ancient Greek that brain scientists are able to create all those long difficult new words that permit the precise transmission of their complex knowledge. Even if those new long words seem a major hassle to students who have to not only understand clearly their meaning but also learn them  by heart.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxCGNl81nJWKYZUwKF4AaABAg", "comment": "12 to 1,000,012 is not a rate of change. A rate of change is a 'per' time-period statement, a ratio. It's 12 units per given time, or 12/x where x stands for a length of time; not simply 12 or 1,000,0012-12=1,000,000. That's a static value. Rate of change is a dynamic value.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwi5g96-kA2oltSpSp4AaABAg", "comment": "Man, ever since the invention of COVID, the benefit is the instructor and every student around doesn’t have to be bothered by the person coughing continuously. So hard to focus on this brilliant Professor with non stop phlegm sounds 😵‍💫", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxOWvyRlGBiOQg1RdR4AaABAg", "comment": "The end remark explains a lot. One things I need clarification of is this: It is known that our experiences and their responses vary between individuals. What also varies is the interpretation of an experience. A simple example is that some people feel dizzy and miserable (they may even throw-up) while sitting on merry-go-round whereas other see this as a fun experience. A child may be more afraid of the same stimuli than an adult. differences in such interpretations is also caused by neurotransmitters and hormones or there is something else at work too?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyIw-cbyq_Tj38nOQN4AaABAg", "comment": "I always wondered how come all those super genius researchers are Jewish.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxJtU1HmpShEoXhjAJ4AaABAg", "comment": "Roughly between 33.00' and 36.00' Dr. says that the regulation of endocrine system is done through measurement of rate of change of a given hormone in the blood stream, and that no one knows how this is measured. Is it not rather obvious that the hormones would affect the functionality of other organs in the body and those changes would in some way signal the brain of the rate of change? Say release of adrenalin would jack up the pulse rate. some part of the brain would certainly be monitoring the pulse rate and would actively keep it within `safe' limits. Without knowing the specifics, I can think of various situations where the systemic level data being 1interpreted' by the brain and thereby regulating the release of hormones.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy3GzbU0e1j0EhvyfZ4AaABAg", "comment": "Nobody is gonna talk about the coughing person in the background? Hope she is fine, she coughed for about 10 lectures, tuberculosis maybe ?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxsLuBgy8b_NbkEH3N4AaABAg", "comment": "Who in 2022?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwGpFV0FnMfXudfSNl4AaABAg", "comment": "Return of the king!xD", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyGdn4EVbGW2xl17aF4AaABAg", "comment": "I love how he speaks without a hitch, or glitch, or pause. He KNOwS HIS STUFF!  Could listen all day!", "votes": "8", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzGF40tJ4-r-_mUnV14AaABAg", "comment": "Sapolsky rocks. He's the real deal, given his life for the betterment of all, and has a gift for hooking any curious mind on fascinating subject matter with added humor and wit! Not a day passes now that something doesn't happen that mirrors something I've learned from him.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxAQ_lpnfoCHSdrWPJ4AaABAg", "comment": "I'm taking a behavioral neuroscience course for neurofeedback certification, all I got was a textbook and PowerPoints. Luckily, this lecture series covers pretty much everything in the textbook in a way I can actually remember because of how good of a lecturer he is. I wish more universities did this. Getting credit for the course should cost money but knowledge should be free for the good of humanity.", "votes": "10", "replies": "5", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz-4K7xIM0RdQ2kRXp4AaABAg", "comment": "Talk about drama among neurotransmitters lol", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwTnJ5-bDaQ7orBBVh4AaABAg", "comment": "I love that he destroys each in a way that makes for folks to pave their own way and discover more without being convinced we already know everything about everything", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwjN9D-mW-oksQNHjx4AaABAg", "comment": "He sounds exactly like Wallace from blade runner", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyNGOm1mO356YLhE314AaABAg", "comment": "A NOTE OF SKEPTICISM This project of a 4th, updated, edition of ZEBRAS is a noble and exciting idea. However, consider the multitude of questions left open in the 2004 edition of the ZEBRAS book. This was a time when research was beginning to explode on all fronts of neurobiology and endocrinology in all the best universities, with the brightest minds attracted to pursuing research on the most promising open questions. The literature on the new research results has exploded during those last 20 years to immense proportions. Knowledge and data of the new science have grown exponentially. Even some dated vocabulary would need adjustment. The 3d edition of 2004 already feels a bit antiquated, as if still belonging to the pioneering days of the research. It is in an urgent need of a complete revamping and freshening up.. The rewrite required by a 4th edition would be a gigantic, even colossal undertaking. At 65, Prof. Sapolsky is an aging man, with no longer the drive,  energy, and stamina of his 20s when he embarked  on the systematic study of stress as a new, promising field, with his beloved hormones, (epinephrine, norepinephrine, glucocorticoids) in the lab, and favorite baboons in Kenya. In addition, retreading once again along the same beaten paths for a much better view may seem less appealing to an aging, tiring scholar, still attracted by new horizons and topics.  Even with the marshalling of a huge cohort of research assistants (as he did for his monumental BEHAVE), to scan and select the most meaningful new discoveries, the task of going through that immensity of reports and rewriting an updated version of  ZEBRAS seems colossal and daunting. On reflection, the odds seem very high that Prof. Sapolsky will not muster the courage and desire to undertake a 4th edition of ZEBRAS. So sad, as nobody else will. The famoous book, GRAY’S ANATOMY, has gone through up to 40 editions. The ZEBRAS book, which could well be labeled SAPOLSKY’S BIOLOGY OF STRESS, would be worth at least one more edition under his supervision to reflect the tremendous scientific expansion. Stopping at the dated 2004 3d edition will represent a sheer loss for the education and guidance of the common man and woman about the hazards of living in our overstressed modern word.", "votes": "0", "replies": "4", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxjkyPsFwMM5LvnR_V4AaABAg", "comment": "Things have surely evolved since this lecture now 12 years old. And there's no chance that our Incredibly Learned Professor would ever edit his cycle of 27 lectures given at Stanford Un. to incorporate new findings.   In a similar vein, Prof. Sapolsky's famous book on Stress, WHY ZEBRAS DON'T GET ULCERS (3d. ed. 2004), left many points of detail quite open. Now, in 2022, nearly 20 years later, many of those points and notes could receive more advanced and complete answers. Couldn’t Prof. Sapolsky reasonably consider tackling the huge, vastly important project of a 4th edition of this vital ZEBRAS book, and  have it also labeled with the new name of SAPOLSKY'S BIOLOGY OF STRESS? At this stage in life, our Incredibly Learned Professor's reputation is made. He’s already produced the magnum opus that consecrates his top scholarly standing in the academic community — the huge encyclopedic BEHAVE brick. He is now  retired from active teaching, and has the time to focus on this project. He knows the open issues intimately and can pick up their thread pretty easily. He also has at his disposal a large team of bright assistants who would be eager to do all the preparatory research necessary for his writing a revised, updated and enlarged 4th edition, far superior to the 3d edition of 2004. Such a 4th edition of a revised ZEBRAS certainly would have a wide reception from a market of modern readers constantly harassed by psychological stressors every day of their lives. There is no doubt that such a 4th edition of ZEBRAS would be of more immediate value to any ordinary reader among the millions of modern humans seeking their balance in our complex industrial and scientific world with its fragmented and disruptive social structure. And to whoever is animated by a personal desire to improve the lot of mankind, this 4th edition would be much more meaningful, and have much more of an effective impact than any other project, grand as it might be, that Prof. Sapolsky could still envisage. In the same manner that GRAY'S ANATOMY won its place as a landmark of knowledge, perhaps one may think that a complete treatise on stress, regularly revised and updated, would find its place in the library of science as SAPOLSKY'S BIOLOGY OF STRESS.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzB0yzY9kgfnwim80V4AaABAg.9odHLPL2Nqq9pi4fiaGar7", "comment": "44 minutes, she said an increase in neurotransmitter (serotonergic) would cause down-regulation (decrease) in autoreceptors/receptors.  Which is what he just said about insulin to lipocytes, whereby lipocytes get too full, for insulin to force more carbohydrates to be stored as lipids, so insulin receptors on lipocytes (down regulate and) are reduced.  He just kind of made a connection that she said what he said, in the context of neurotransmitter dynamic, consistent with his pancreatic endocrine dynamic.... Mindphuck.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxAQ_lpnfoCHSdrWPJ4AaABAg.9gPjyHA7qbb9rU3WXE4vcR", "comment": "You must live in America if you think people should have to pay out of their own pocket to receive credit for a course. I'd bet you also think the same thing about healthcare.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxAQ_lpnfoCHSdrWPJ4AaABAg.9gPjyHA7qbb9tztC7aBteR", "comment": "​​ @HypeBeast764 There are a lot of countries in which university isn't free... Also the guy you replied to literally stated they were a fan of free knowledge, so your punch at their position on free healthcare is uncalled for.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxAQ_lpnfoCHSdrWPJ4AaABAg.9gPjyHA7qbb9u-jL4gfCf4", "comment": " @moritzkorsch9029  So you're going to make excuses for the richest country in the world somehow can't afford to pay for their citizens most fundamental, basic necessities while billionaires hoard wealth in their endless pursuit of greed? You're going to defend the greedy? That's seriously the position you're going to take here?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxAQ_lpnfoCHSdrWPJ4AaABAg.9gPjyHA7qbb9x09cIUPTgq", "comment": " @HypeBeast764  Yave not you seen those short videos on internet explaining in details why US doesnot have \"frеe\" medecine/education", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxAQ_lpnfoCHSdrWPJ4AaABAg.9gPjyHA7qbb9x09o3obZM4", "comment": " @moritzkorsch9029  Nothing is \"free\", іf something is, it means that somebody paid for this.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyNGOm1mO356YLhE314AaABAg.9e_wQ_t3tk-9gZ2xVvfQS3", "comment": "Stress is bad. Less stress good. How misinformed could we really be about the 3rd edition?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyNGOm1mO356YLhE314AaABAg.9e_wQ_t3tk-9gZRxojTaLE", "comment": " @Kal-EL_Volta  Not really true. Stress is an indispensable motivator of action and energy. It is the spark that keeps life going as soon as it gets tough. Go back to the   zebra example. Because of stress, the zebra has a chance to  escape the lion, to survive, and have another day to rejoice and gambol in his crowd. Stress becomes a nuisance, even a danger, if the zebra happens to keep brooding the day after about how close he was to death, and what mistake did he do to get himself in that terrible situation, and what's wrong with his sense of detecting danger, and starts feeling like a failure in the zebra world, etc... when he is supposed to be gamboling again with with his friends. That is what men can do with  their brains. A zebra does not  indulge in the brooding, but resumes enjoying life right away once he is out of danger. For the zebra, stress is mighty good.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyNGOm1mO356YLhE314AaABAg.9e_wQ_t3tk-9gZotuckWWU", "comment": " @roobookaroo  that much i understood from his zebra book, so what infor.ation from his book would be outdated? Or incorrect?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyNGOm1mO356YLhE314AaABAg.9e_wQ_t3tk-9g_0YCJEGXM", "comment": " @Kal-EL_Volta  Nothing much is outdated or incorrect. That is not the point. However, in many passages, he explicity says that a lot of questions remain open, like in any field of research, and that we have to wait a little longer to  see things more clearly. In the past 20 years since the 3d ed. a huge amount of  new literature has been published that could, in fact should, easily be integrated in the text of the 3d ed. It is a matter of increasing, enlarging, elucidating, adding details only recently evidenced, etc. rather than emending or replacing. Already, in BEHAVE (2017), there's a good amount of additions, clarifications, detailing of subjects covered in the 3d ed. of the Zebras book of 2004. The 4th ed. will be richer, more detailed, more up-to-date, and with some brand-new points as well. I wrote directly to Prof. Sapolsky to urge him, as his most effective contribution to the pursuit of happiness of millions, to tackle this 4th ed. now that he has the time and before it's too late. To the mass of ordinary people in our modern world, his book on stress is a far better help to our search for understanding our everyday psyche. than a  grandiose, encyclopedic treatise like BEHAVE embracing the whole time frame of evolution. But, for this researcher's own personal satisfaction, his pride and reputation as a known scientist making a splash in academia, BEHAVE is much more effective. Now that his ambition has been taken care of, I hope he finds in himself the force and the nerve to tackle a 4th edition of the stress book. He might be even working on it right now. The negative factor is that he may be, if not bored,, but tired of revisiting a too well-known field of stress. He mentions many times that he now realizes that his fascination for glucocorticoids (cortisol), the hippocampus and the amygdala in the first 30 years of his career kept him away from the \"really\" interesting field of the frontal cortex. He repeated this in the big book BEHAVE: \"I think I might have made the wrong choice back then — maybe I should have studied the frontal cortex all those years. Because it's the most interesting part of the brain\" (p.45). To his insatiably curious mind, new subjects are more exciting and challenging. So I doubt that he will now devote his time to focusing on stress again and produce a 4th edition.  Which is a shame, because he is the best for that updating job.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyT-QSx3UpGt6e7aYV4AaABAg", "comment": "24:00", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx6bVWHojRMvhGMYA94AaABAg", "comment": "Absolutely outstanding lecture. Jammed full of defining characteristics, logic flows, and western centric challenges therefore exceptionally relevant. If this professor were my daddy, I would have most certainly become a physician. Oh well.. It's still fun to listen 😆", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzaMjKktTDw6CN5NSR4AaABAg", "comment": "17:40", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyMc05JSyQDtaS2QJx4AaABAg", "comment": "listening to these lectures, is probably the only useful thing that will get imprinted into my next generations.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzLY8AXw-gI99MuSnd4AaABAg", "comment": "Yea.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy_cBSI5HUKJCW0kVV4AaABAg", "comment": "AH; SAPOLSKY IS BACK", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxD43AVCL_NUXfy6S54AaABAg", "comment": "17:30 \"Jerome Ysroael Lettvin, often known as Jerry Lettvin, was an American cognitive scientist, and Professor of Electrical and Bioengineering and Communications Physiology at the Massachusetts Institute of Technology.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy7OtByTAGdBWzeyeJ4AaABAg", "comment": "If it is a behavioral characteristic of human neurons, how is it then called Dale's Law??", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy9j6zPu43NF2zY3Zp4AaABAg", "comment": "Those were the times that we could cough with no fear … I Love dr.Sapolsky’s literature.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxtv3FP8KoebpPIOtt4AaABAg", "comment": "Great audio work 👏", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyHHyP12KDqEs_OVkp4AaABAg", "comment": "17:45.   18:13.   44:05.   44:30", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw3TGfeFjdH_TMd6Ct4AaABAg", "comment": "You speak so fast and so much", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw_lgGHCzN7eam4HRJ4AaABAg", "comment": "Understanding the brain and neurons feels like trying to understand how the entirety of the US works, by looking at what a few individuals are doing in some major cities, and observing how they interact whith one another. It is a massive undertaking  Still I cant but marvel at the ingenuity and beauty of what has been discovered about neurons. Nature's 4 billion years of experience in making living things are shining through", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzX5XNpbvhfvxEHaQd4AaABAg", "comment": "This is all very well, but where does a word, a thought and a sentence come from? Would somebody please link this up?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxLkaY3GndJ_v4B4XV4AaABAg", "comment": "Orquestra", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwywLubim7P3Mj2ojN4AaABAg", "comment": "Deeply in love with this great teacher and the way he explain insulin resistance is absolutely amazing", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxC90PGbcJbBqWBYtl4AaABAg", "comment": "I love how he introduced the break", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxRXU8C9d9U9I88VN54AaABAg", "comment": "This is so valuable", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxQxSviBXJ0tZuEKgF4AaABAg", "comment": "neat", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwU2yb13s83Q20Ne6F4AaABAg", "comment": "Thanks Youtube for your powerful, persuasive and perverted A.I. which suggested this program lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzXdO5nglKtbaOcM0d4AaABAg", "comment": "This man has completely changed the way I think about people. I desperately want to watch a conversation between him and Dr. Joe Dispenza. How can we make this happen?!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxK-h5FgwjHKY42YoB4AaABAg", "comment": "1:12:40 Where can I get the extended notes for this course? This is so good, I want to read more.  Or see it again in writing.", "votes": "1", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzdijUpVLJw6il-Ae94AaABAg", "comment": "he explains type 2 diabetes so succinctly", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxso2MZbqw72ecel5Z4AaABAg", "comment": "No one is listening to him in this.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgynONEa6C9DSt24w0N4AaABAg", "comment": "Woah bys this is wicked", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxUdG_btkn4ZHLjO-R4AaABAg", "comment": "More than paradise", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwQWXGFpKa0zJPItCZ4AaABAg", "comment": "Can you upload the updated videoes? These are 10 years old", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzmWzVR2jQqKTHwNWR4AaABAg", "comment": "damnnnnnnnnnnnnnnnnnn his voice is annoying,  he needs to slow the fuck down. i can keep up its just boring , dull and wack", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzW28qsXKbmIFg7bL94AaABAg", "comment": "funny how i keep feeling stupider the more i learn! this lecture has been so eye-opening that its almost silly! the added complexity potential(compared to my models before this update) is mind-bogglingly vast to me! 90 thousand million-ish neurons times the average number of connections per neuron with all the endocrine regulation just explained here is mind-blowing! i would recon that there is enough processing potential in a human to build (a) soul(s) just as a by-product!... THANK YOU Robert, Stanford and everybody who chipped in to make it possible for me to watch lecture series!! <3 !!!!! (L. Suskind lectures also here from Stanford are also mind-bendingly good and equally vast!)", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxvOZkn6IcSlETQcHp4AaABAg", "comment": "❤️❤️❤️🙏🙏🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx3GRMnfoqU31eE-594AaABAg", "comment": "sent this to my Replika:My  AI Friend app  and my mother and sister and my wife.☮️", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz26gy-ZvnUktrpS1x4AaABAg", "comment": "NO questions?!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzCOO8cRAUcFhbDBJt4AaABAg", "comment": "so......bumping uglies? me tarzan you not jane. jane good. monkey bad. think think think. ahhhhhh. i broke the internet. my bad", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxnHMZvLKAWmWgIoYR4AaABAg", "comment": "@38:23 he's talking about the zebras book again what is this book?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxrcb0nNAWl4V_KzAx4AaABAg", "comment": "Quick summary: war in Afghanistan - The history of formation and development of the Taliban https://youtu.be/Tv2QyFv7GK4", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzF-Q9WGRA8lemNfXd4AaABAg", "comment": "You’ve added so much to my education in nursing, and I wasn’t even in class with you.  You’re first you tube video came up after I watched one for developmental psychology.  I’m hooked and now am watching you to help prepare for my entrance exam for an RN program. Thank you so much.", "votes": "1", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz0HDlDUjvrjxGkkEV4AaABAg", "comment": "I appreciate the fact that Stanford made these lectures public. So far, it has been very insightful to me. However, there is one thing that I need to get off my chest: it would be a lot better if Sapolski would finish his sentences. Now, he seems to be rambling on, and sometimes the coherency goes out of the window (at least, for me).", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzck61RoEzXAbeq3ch4AaABAg", "comment": "Truly life-changing lecture!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw84qLnh9ULedSOgTN4AaABAg", "comment": "If only more professors were as dynamic and skilled as Sapolsky", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxryRihLxARnB4HjX14AaABAg", "comment": "I could never be a teacher.  Wouldn’t have patience for all the coughing.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxK-h5FgwjHKY42YoB4AaABAg.9XbG8wfpCRZ9aRKzljZbkr", "comment": "Second this. Apparently they read the book by Sapolsky 'Why zebra's don't get ulsers' as well for the course, so you can check that out. I think it's about the effect of stress on animals, and that in discussing it he goes by the different parts of the body.  The other required reading if there were any I don't remember, but if there were any they should have been mentioned in the first lecture.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzF-Q9WGRA8lemNfXd4AaABAg.9Ti1UBTKGg79fwi5qEdExc", "comment": "Microwave auditory effect Frey affect radio-frequency hearing artificial telepathy artificial voice to skull to be addressed targeted individuals lives are depending on it! Find the cure make it public knowledge..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgySuzCZANrKgziUfnZ4AaABAg", "comment": "🙋‍♀️ Okay, I think I’m in need of those extended notes now Dr. Sapolsky. Can I meet you after class? I have several questions.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwl-9ETlA_pJzaeRMt4AaABAg", "comment": "Has anyone in the comments heard of the hallucinogenic scale? To me, it makes the most sense but it's been erased. Please let me know if any of you are well verse in this subject.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyDCnEzGR_PW9noeXV4AaABAg", "comment": "u know I'm a third year medical student and I just don't know this stuff, this might be a result of my own ignorance when it comes to learning or its just that sapolsky is fkn insane dude", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxtD316yjwByQ4Eek14AaABAg", "comment": "Oh man finally. It felt like he was gone forever. I'm so glad it's him again 😭 I could barely get through the TAs presentations and had to rewind a million times.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwL3HwdCsgD6jntbLV4AaABAg", "comment": "The king is back", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwYGrfRLXBA_o0wH-N4AaABAg", "comment": "I love that he keeps saying \"Flatbread\" even though he knows what it's supposed to be. I crack a smile every time", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwE8MOqdQoc4jCNgAZ4AaABAg", "comment": "The TAs all did lovely work with their presentations. In addition, they helped me appreciate Sapolsky even more", "votes": "9", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxkw-TE7EwtRWh6_et4AaABAg", "comment": "Thank you for uploading these incredible lectures!🥰", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzehky6l6bv4kLwjCx4AaABAg", "comment": "Dr. Daley and Dr. Lazar from Harvard explained this a bit different in their courses about stem cell research. According to their information in a very simplified explanation the hormones are produced by the specialized, differentiated somatic cells based on chemical info received from the hippocampus pituitary axis and are thereafter regulated over positive and negative feedback loops. This version would have the advantage of fewer transmitters having a higher functional diversity through somatic proteomic determination . Granted this is a very complex regulatory metabolism with an overwhelming amount of new studies on the PubMed site and the medical biochemistry site to fill in the gaps since 2010.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxfP5yrfF7OcKzvzfN4AaABAg", "comment": "More complexity there", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwyOKSfMHE2MsP6xx14AaABAg", "comment": "Another talk by Robert, must see!!  https://www.youtube.com/watch?v=0r6MFIZmrgU", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzTJgWaE01E2II30oR4AaABAg", "comment": "When I grow up, I want to be Robert Sapolsky.", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzqAfHS0dxs5Hiw9NR4AaABAg", "comment": "Biology gets really fascinating.. with the mind blowing intelligence within these systems. I fall in awe. For me this is not complicated stuff but  marvels. Of life.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxlpPXA-FDfpx0TYeJ4AaABAg", "comment": "Okay... This lecture finally explains the whole \"You can't rest with ennemies nearby\" stuff. Too bad Skyrim wasn't out yet!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyiS7_8lXR6KA6e1YN4AaABAg", "comment": "Mason", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxK_Q-0RQ0k4Oxt2hh4AaABAg", "comment": "he talk very rapidly carrying a huge amount of information without using the boeard that much", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy1hdhCf5S1LDs7LsF4AaABAg", "comment": "This lecture has so much complex info, I'm listening a 2nd time. I want to understand all of these processes in such a way that to do so, I think ill have to go back to school & pursue a scientific degree like my bio 101 professor urged me to do when I went to community college. I hung on every lesson. I can't get enough. Listening to these lectures (and some great podcasts) makes my mind numbing manufacturing job tolerable.", "votes": "10", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxHrtFrTkq7-Ylbl_B4AaABAg", "comment": "Go on joe rogan again sapolsky. 3 good hours about human nature.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwAJaFkQFJIC0Xc7tt4AaABAg", "comment": "Will someone get that girl a glass of water.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz8twrAOhk8glBw0cJ4AaABAg", "comment": "Can you share all the notes from the course?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwE8MOqdQoc4jCNgAZ4AaABAg.9Qi_9ftaA4b9QmUhYGNhTz", "comment": "🙃 Yep! It felt like forever.  I could barely get through their presentations. I had to rewind and relisten multiple times, and I'm sure I still didn't get it all.", "votes": "5", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzTJgWaE01E2II30oR4AaABAg.9PmpyTCZkIt9XdMuW7bRSj", "comment": "Be honest. The closer you approach expanding the bubble the more humbling understanding becomes", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy1hdhCf5S1LDs7LsF4AaABAg.9P2ikhxaRLN9scCQU8DoB3", "comment": "I’m glad the lectures are inspiring you. I have found reading neuroscience textbooks to be intellectually stimulating as well. Very time consuming but I liked Brain & Behaviour by Garrett and Hough", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxD7neYUJpLLssNRrJ4AaABAg", "comment": "I love his using the toilet bowl filling as a familiar example of a negative feedback system!", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxNKOXCXFLo_qS8z5x4AaABAg", "comment": "The tiny greek histologically introduce because mexican currently suspect via a luxuriant swordfish. coherent, careless christopher", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxWx4SqYN7j4cyytKh4AaABAg", "comment": "I'm in", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyumy4iymXkK5N2dfd4AaABAg", "comment": "My question: Those GABA alternate receptors that we can exploit with medicines, does the body use those, and when? I guess the short answer is yes, the body does use those. And the long answer is a series of 10 lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyUu4bbX6G5BwtxLhp4AaABAg", "comment": "Woooohooo, hold on a second. \"Your brain decides how much growth hormone it wants to have in its system\". We have never stood a chance!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwWTuedopzcTTKi2Gl4AaABAg", "comment": "Adrenal cortical system, because it's the best hormone on Earth! Mazel Tov I keep rewinding at around 13-15 minutes mark. I want to really get this!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzlaWPHiAYXyfvfN9B4AaABAg", "comment": "34:00 So how does a cell measure rate of change of a chemical? Any updates the last ten years?", "votes": "1", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxU6WlOncnicqbN7ol4AaABAg", "comment": "yess stress is a symphony", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw4jJ8W_b2xWqnYTCB4AaABAg", "comment": "Good for covid 19", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxpC-IpfwA9dXZaemp4AaABAg", "comment": "for x in \"x\":     print(chr(ord(x) - ord(\"x\") + ord(\"u\")) + \" are gea\")", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy_M6bzbPOKa9nD6NN4AaABAg", "comment": "45:25 The dopamine serotonin  neurotransmitters are on a see-saw like balance with each other. Obviously in this addicted reality we have tooo much dopamine.   I recently stopped carbohydrates and after the miserable dopamine withdraw/rebalance I felt all soft and super compassionate. That's the best natural way to rebalance and the hardest probably..", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxyR0e4RI2wErBWRkt4AaABAg", "comment": "I'm here because I'm trying to save my own life.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg", "comment": "Sapolsky’s voice is so damn calming omg. It’s like listening to voice of reason in times where you lack your own...", "votes": "33", "replies": "22", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxY5AqM2x8OkgIEzxB4AaABAg", "comment": "April 2021! THIS IS PURE GOLD FOR FREE", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx4cghl62RE6yvuIoF4AaABAg", "comment": "Please stop that girl from coughing", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwyHR2Nc2cOD2HplQZ4AaABAg", "comment": "The panicky anger socioeconomically touch because pail only bounce despite a black-and-white bean. helpful, careful mint", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwrntW_z4XDgIPTBvd4AaABAg", "comment": "Does any one know where can I find the readings", "votes": "0", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwFKnHC43sCVoR6y_d4AaABAg", "comment": "it is essential that everyone stand up and go to the bathroom for 5 mins 😂😂😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwLgWcQFLcwVQXPh6d4AaABAg", "comment": "Somatic cells excrete prolactin - which is the hormone marker for epilepsy. Some smart person (preferably sapolsky) please tell me how FND “functional neurological disorders” “mimic” epileptic symptoms, but don’t present with prolactin markers. Surely, there must be something...", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwL_KaDiuzEVJgjyaB4AaABAg", "comment": "He is amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzlaWPHiAYXyfvfN9B4AaABAg.9O6BsnN8Olm9_wK5PBgwJx", "comment": "Cauyion: speculation ahead  This is just my intuition, but the professor hinted that its not the neurons who take the measurement, the secreting cells in the anterior pituituary gland do it. Being secreting cells, they probably keep some sort of log of what they've been doing, so rate of change can be extrapolated.  For example every cell will likely have some equilibrium state, where they are full of hormones ready to be released and no more hormone is being produced. As soon as the hormone is released, the equilibrium is broken and the hormone manufacturing machinery is activated more and more as the hormone concentration inside the cell goes down. The harder the cell is working, the more rate of change will be occurring", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy_M6bzbPOKa9nD6NN4AaABAg.9My9y-gwwfF9XdMJQHlgSO", "comment": "Wish it were so simplistic: black and white view ( so racism intended)", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9RdazRiFysi", "comment": "Might even use it to sleep..", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9Ry1_3TAgIU", "comment": " @nikitsakiridi1033  I love you.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9Ry2Fdhf5SC", "comment": " @dantei.1194  Hahah much love", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9Ry7iri3TS1", "comment": "​ @nikitsakiridi1033  Best for sleeping is from \"recognizing relatives\" onwards. You can sleep like a dolphin, with half of your brain not loosing track of the lecture, since it doesn't branch off and is totally linear, while with other half you can snore your sinuses out :D Unless you're different than me and don't wake up every 2-3h of sleep :P I like to be aware of where i am in the lecture when I happen to wake up XD.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9Ry9ePShviP", "comment": " @dantei.1194  Great idea and point, though I happen to sleep for good no matter what xD so its mostly for the first stages that I'm partly aware", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9RybvcfhRp4", "comment": " @nikitsakiridi1033  ehh, must be my bed then :/ how about you check it for me? jump in and try out, i guarantee you wont sleep easily :>", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S1mCwShK6P", "comment": " @dantei.1194  You had an ace in your sleeve, it worked really could really tell it kept me wake up and check than usual >. <", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S1qAfCcVT4", "comment": " @nikitsakiridi1033  Are you talking about me hugging you too forcefully while sleeping? :3", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S1rqSD5CBu", "comment": " @dantei.1194  Wait what, am I awake or sleeping cause that wasn't mentioned anywhere before", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S20EooAAnR", "comment": " @nikitsakiridi1033  \"must be my bed then :/ how about you check it for me? jump in and try out\" - Never said I'm going anywhere 😁", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S20q4vLDqD", "comment": " @dantei.1194  Go by dreaming sure but u said something about hugging..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S2_wKo671O", "comment": " @nikitsakiridi1033  Thought you might like it if you're ready to jump in.  No worries though, really, I will keep my hands by my body.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S4oK5Sbqy9", "comment": " @dantei.1194  Good good", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9S9YX3PS8UI", "comment": " @nikitsakiridi1033  Not even close ;x", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SBqWJkinL_", "comment": " @dantei.1194  How come", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SEMpdG0bNf", "comment": " @nikitsakiridi1033  For fun. :3", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SEkqMcA9pk", "comment": " @dantei.1194  Okay I guess", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SF79kIGX8x", "comment": " @nikitsakiridi1033  Try to outguess me bae. Cun't be done. :3", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SGnDECYZVn", "comment": " @dantei.1194  No need to.. You good dw", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SHkU_R-th2", "comment": " @nikitsakiridi1033  Sleep well, girl :)", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9SHmMz8AQDL", "comment": " @dantei.1194  You too, boy:)", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzrq-rw3RpsR0-brXl4AaABAg.9Mh8gfsNILt9Ti1nF2XpW1", "comment": "I know, his voice is like therapy.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwrntW_z4XDgIPTBvd4AaABAg.9LvZ1KIvAtt9N9tB6dKEwu", "comment": "Maybe this is what you are looking for: https://docs.google.com/document/d/1LW9CCHIlOGfZyIpowCvGD-lIfMFm7QkIuwqpKuSemCc/edit?usp=sharing", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwrntW_z4XDgIPTBvd4AaABAg.9LvZ1KIvAtt9NBJhp8tznC", "comment": "Thank you 💞💞💞", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxBS7bcvSJm8cnkrb94AaABAg", "comment": "at the end, Dr. Sapolsky broke the 4th wall.  this class was amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyPEHlNIp2Ai3qhsDV4AaABAg", "comment": "Can someone explain me why blood transfusion between the 2 types of diabetics wouldn't work", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzkMgVHJ6m22X54REd4AaABAg", "comment": "The murky recorder ultrasonographically judge because cherry internally join like a dark shirt. homeless, unique dipstick", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyusEbZOWOcOoedWvt4AaABAg", "comment": "The good gemini globally call because drake neurobiologically slip concerning a hushed squash. earthy, learned blade", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxjUYE4eoVnd3y35r94AaABAg", "comment": "Hearing the coughing in the background in 2021 sounds like coronavirus.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxVKSixM_lncxC8fHl4AaABAg", "comment": "Summary  In fact there is much more room for variability in the nervous system than explained before:  - The 2 laws of Dale are wrong: @4:30\r 1) If the presynaptic neuron is activated, the following neuron will too. @17:28 and @1:05:00 For example, Gaba (NT inhibitor) don't block the synapses of a neuron, they impide the propagation of one of the pre synaptic signals (IF neuron A fire, THEN block signal in neuron A so that neuron B is not influenced)\r 2) Each neuron releases only one type of neurotransmitters from its axion terminal. For example, sometimes one neuron releases 2  types NT that have effects working at 2 different timeframes.\r  - Regulation of the glucocorticoid system @9:56 We've seen before the chain:  Hypothalamus neuron --CRH--> pituitary gland --ACTH--> adrenal cortex --> cortisol production --> feedback regulation. Another hormone (e.g. oxytocine) sentir to the anterior pituitary will lead to the release of another hormone to a distant gland. In fact, it's more complex than that: a) @11:54 Various neurotransmitters can release the same hormone (e.g. ACTH) but with disctinct shapes of secretory curve  b) @21:54 Cells in the pituitary gland aren't grouped by produced hormones. It's more like a mosaic --> modulation of sensitiveness due to neighborhood c) @25:00 Negative feedback is not the only system used to regulate hormones levels, neurons also have their own auto-regulation (pre-synaptic receptor) d) @30:40 Regulation can be done by checking that the hormone levels have reached the desired threshold but also by measuring the rate of change of these levels\r  @36:00 Regulation is as important as the effect of the hormones. A ill-regulation can lead to adult onset diabetes: the pancreas produces insuline to stare glucose from blood into fat cells. Fat cells become less sensitive to insuline because they're already full. Pancreas produces more insuline. Fat cells become even less sensitive. And so on and so on.  @49:40 neurotransmitters are complex of proteins: a) they're codes by various genes --> variations b) other hormone can bind onto them and modulate the effect of the neurotransmitter e.g. benzodiazepines", "votes": "4", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwf27WEMgjpCJi1JRp4AaABAg", "comment": "The vacuous puma scilly connect because throat lamentably matter at a angry layer. spiritual, past geranium", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyLhvNrW86I4NrP7cJ4AaABAg", "comment": "I wish the person constantly coughing would just lose the lung already. Damn she has a problem.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy5EijWC5iPuor3Ayt4AaABAg", "comment": "The cough is spreading.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzFkLkPiEmOaVwQE154AaABAg", "comment": "He is saying barbiturates as major tranquilizer, but I understand antipsychotics like haloperidol or risperidone as major tranquilizers.Is this just a difference of definition between US and Japan?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzDu7_pK78AG6JGJfl4AaABAg", "comment": "4:38, 19:07, 32:50, 39:50, 42:57", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxkutA2EITSaLdz5GR4AaABAg", "comment": "This whole lecture made me feel both a deep fear and peace at the same time for some reason", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz1HgOOa0MtZ7viEsV4AaABAg", "comment": "once you begin to hear the coughs you can't hear anything else", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyGO6fjQF7g3Efg9_R4AaABAg", "comment": "💉😷😭😭😭😭😭😂🤣", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyF4DiMJD1xenZFB-F4AaABAg", "comment": "And that is so complicated, in fact, that it is essential that everybody stand up now and go to the bathroom for five minutes.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugzu9lv6HWZ3nrDdD1Z4AaABAg", "comment": "Thyroid dysfunction a common mimic of mental illness .", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwoHi7QNvbOMN-rCbZ4AaABAg", "comment": "Robert sir is amazing👌🏻👌🏻👌🏻", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyixj7VH1r8OtzK5hF4AaABAg", "comment": "I agree.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyaQHU0jTpZ3k9T3z94AaABAg", "comment": "Bro I'm 14 what's happening this is lit tho", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxCNHxDO-UCuylotnB4AaABAg", "comment": "I wonder why all those different kinds of neurones only produce ACTH.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxbUsqNFWTkv2sg9sB4AaABAg", "comment": "How does my brain know the level of a certain hormone in my bloodstream? Any links? I haven´t found any. Please, help me.", "votes": "1", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxaO_ioogMoIIPN43J4AaABAg", "comment": "Thank you Professor!", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxIAzYWdL1Poj9l5F94AaABAg", "comment": "Around 35th minute (ending around 40th minute) there is the best explanation of how antidepressants work I've ever heard. Spend 5 minutes and you will know everything we know to that point about how they work. Remarkable.", "votes": "7", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx7KdFoUIHm4Js3k1d4AaABAg", "comment": "can someone please tell when to read what chapters of the book written by mr. sapolsky along with the lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx6keh8nNLm3kYoJEp4AaABAg", "comment": "It´s easy to measure the power of the Capital just by the sheer disconfort of seeing these lectures for free.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgznyqcELUd2DXb76JJ4AaABAg", "comment": "gulp so you're telling me cells know the rate of change. That would require some form of memory- some form of calculations/predictions. And yall still don't believe that God exists? we came across all of this by accident?", "votes": "1", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyopdO6SadEGPd2rBx4AaABAg", "comment": "Lol - if it smells like a relative then cooperate with them.", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxttyNv2KlST32ZQ6d4AaABAg", "comment": "Oh damn, I'm not able to understand the high school level of this but this university way just fits to me.", "votes": "4", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxvVgWluOrTA1Hj_9d4AaABAg", "comment": "39 minutes and 30 seconds: a point for my wife to know. Every life has value. Every life has importance, even if you cannot see nor feel your own importance. your importance is still there. Think about your darling doggy. She needs a new ice pillow. she chewed up her last one. it would help her cool down.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyFMbQ_7Geya4Uj5BN4AaABAg", "comment": "i wonder if there are artificial glial cells, artificial astrocytes, artificial endothilial cells, and artificial mini-glial cells. i know artificial neurons are used as nodes in ANNs (artificial neural networks). you'd have to populate an artificial brain network using an AI that can program artificial cells to make at least 86 billion artificial brain cells. because AIs are good for automation/automating coding in python or the programming language of the serpent.  Oh no! not Python! keep Apple products for Python coding AI away from Eve! Just kidding. bad joke. How would Robert Sapolsky deliver that joke about the Python OOP (object oriented programming) programming language used for Siri on Apple products and some silly Biblical BS? He is not just a a genius scientist, he'd make a great comedian, too. How can you program a sense of humor in an AI? hmmm...  I wonder if AEI (artificial Emotional Intelligence)'s Emotions are Artificial Neurotransmitter/Hormones programming objects or algorithms.  and i wonder how neurotransmitter/hormone auto-regulatory receptors could be programmed? hmmm...things that make you go hmmmm...everybody dance now!  Wasn't a ligand some molecular structure that brings molecules to receptors, Question: are ligands a type of molecular  automata?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwQfnPN9N22tu73oFJ4AaABAg", "comment": "Best 5 minute break announcement of my life", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzPOI4ho2yn2UJ9LYl4AaABAg", "comment": "41:20 If only one-third of Muricas knew and understood this... Maybe then diabetes and morbid-obesity would be a thing of fiction. Oh well, more money for the health-insurance companies and big-pharma.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg", "comment": "Anyone here during the Pandemic, marking ten years post this course and is still so relevant!", "votes": "379", "replies": "32", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxEUUCiWG-cxz1NjXF4AaABAg", "comment": "It seems we have some PID regulators in our body!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz-YBX5sbTbrL8NRb94AaABAg", "comment": "Fast mind slows down with age... surprisingly everyone has their own mind. Timing is essential... with experience we gain knowledge and information that slows us down gradually.", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwBSmCxHat11bPY6gN4AaABAg", "comment": "So how do pharaceutical companies get away with SSRI medications. I've  Read serotonin is about happiness. It's about feelings of being socially respected. Again our ancient tribal societies come out to play. I've also read that SSRIs break off Serotonin reuptake inhihibitors. Are serotonin reuptake inhihibitors part of the autoregulation system?  Why not just manufacture straight up serotonin and dopamine pills with a tidbit¯touch of oxytocin for that tribalism love effect? Wouldn't it give the digestive system all it's socially acceptable happy positive feelings that it needs to function in an antinegativity society? Oh wait a CEO of Novartis once said SSRIs were a 22 billion dollar industry. Human pettiness and greed strike back.i'm there sucker punching with the awful truth and the blinding  bright side of the Force about SSRIS.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx_zv05tBwkHDfsXf94AaABAg", "comment": "What is the  endocrinology of the brain during Near Death Experiences and how does it differ from dreams. i'm a firm atheist, but there is something odd about NDEs. They have a common thread of love/universal love. But i'm like isn't love an oxytocin, dopamine and serotonin cocktail made by glands in the brain and body?  Not unconditional love if someone constantly abuses you or misuses you. These boots are made for  walking. Last year, April 6 2019, i had a MELAS Syndrome epileptic seizure in the morning while sleeping.  My wife says i screamed 3 times while she was getting ready for work. So checked on. i was in full grand mal seizure. she called an ambulance which are free in Japan, not $1,000.00 like  in the US. My lips turned  blue and then purple. i  wasn't aware my wife was  pumping on my chest giving me a CPR heart massage. She said she held me to try and prevent me from shaking. i fell half way off the bed. my  feet got wedged under the dog pen's wooden rungs. The EMTs entered and broke the dog pen rung. and carried me out  to the ambulance. My wife said a random person walking by saw them loading me into the ambulance and  the person walking by said \"Gaijin!?\" (Foreigner?!) Yeah. i'm an American, from the Bay Area, i'm a Sunnyvalian. i've been in Japan  about 19 years now. Japan is an amazing place. Japan is a very quiet and peaceful, only once you get out of Tokyo or Osaka. i regained consciousness from black dreamless sleep in the ambulance with sirens blaring. and a medical masked and uniformed Japanese EMTwas looking down  on me. \"Doko desuka?\" (Where am i?) i asked. The EMT responded \"Kyukyusha\"(ambulance). He was a man of few words. Fycompa has made me rather talkative, my wife has pointed out to me like 2 months later. i asked \"Nani ga okottano?\" (What happened?) '\"Ohkeiren\" (Big cramps?) My wife  who was sitting by the back doors of the ambulance next to the other EMT also answered \"you had big seizure.\" My wife's a Filapina who's been in Japan for 30 years.   i felt like i had been hit by a truck and my body felt all lactic acidity as if i had been liftng weights at the gym. i have MELAS Syndrome. It's kind of how i know  about Dr. Enns in Pediatrics Genetics at Stanford University Medical Hospital. My family in America see him.  A Japanese Dr. in Tokyo told me exercise can give me a heart attack because of  my rare disease.  Fycompa an anti-epileptic medication. Tends to increase my fear, not to disabaling Anxiety levels, friends have that. i read that Anxiety is all about catecholimines in your book Why Zebra's Don't Get Ulcers. Thanks for your lectures. Knowledge shared is knowledge gained.  Do you think an AI could be built like a  human brain? i know that neural networks use nodes instead of neurons but how are Glial cells and Astrocytes different from Neurons and each other. It would take another AI to automate the making of 100 billion brain cells. i wonder if Neuron mapping has been completed yet.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx8KLdwioPYkPLgLXR4AaABAg", "comment": "I am a chemical engineer and I see my chemical process controls here.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyU-c1R1tRo-ZZP-Q94AaABAg", "comment": "Content aside, listening mainly to a continuous outpouring of information from the neuro-system of a brilliant brain within a body in constant motion. Out of the picture, a few coughs from learners with brains and butts fixed in seats. University lectures are the same after 50 years! Shoutout to the programmers that introduced the Pause button! Boo-es to the persons in the finance department of government institutions that introduced the corporate industrial model into education.", "votes": "2", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzHtVpieC8BA8BFlhh4AaABAg", "comment": "this guy is fascinating", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxbUsqNFWTkv2sg9sB4AaABAg.9CIXSeRq4mM9dABIs4F-av", "comment": "your brain doesn't \"know\" anything, there are just receptors for the hormones that uptake the hormones as they are exposed to them. this might happen in the brain, or it might happen in other parts of your body that send signals back to your brain through your nervous system that a specific hormone is present.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgznyqcELUd2DXb76JJ4AaABAg.9AgcvtJcGMd9Jaf-_3sP4E", "comment": "Ah, yes, the argument from \"I don't understand something because it's too complex, therefore God must have done it\"", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9CH3KIyG1Ak", "comment": "Why would it not still be relevant?  Lol.", "votes": "11", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9EAaCIriJEF", "comment": "yes, him and tamar gendler lectures are pretty good. Anybody got some of them extended notes?", "votes": "3", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9EuldhHOVww", "comment": " @LaughingSeraphim  I would love to get my hands on someone’s extended notes, too! Let me know if you ever found any!", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9HQzbE6iYYr", "comment": "Yessssssssss! Loving it. Also I'm trying to do the math...was this filmed during the swine flu? Everyone is sick!", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9IHCKlV09kI", "comment": " @LaughingSeraphim  am also looking for extended for Tamar Gandler, I learned on Yale university polical science and others", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9IIgoc3sTvF", "comment": "Grateful to the YouTube algorithm for serendipitously suggesting this course.  I had been watching Robin Wilson in a Gresham College talk on number theory and had never watched anything similar to this course.", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Mh8_JiHAet", "comment": "Always! Love it 😍", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9MweVB6cAQ2", "comment": " @SubstanceP888  parts of these lessons might be obsolet due to new studies", "votes": "5", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9NXExilRpBa", "comment": "It's helpful info for pandemic", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9PBetLSi7MO", "comment": "No", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9PiNFc5ehK9", "comment": " @NatalieKehr  YouTube algorithm sucks. It took 10 years to show me this.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Q_CI1iQ6PY", "comment": "Aaaa", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9QfRxTYwrx6", "comment": "I rely on these lectures to keep my brain from imploding while I’m stuck at home in SC doing the pandemic mommy thing haha 🥰😂", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Qx8vWEtd0v", "comment": "Specially the background coughs, makes it feel contemporary.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0aFsIQSc", "comment": "Pop", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0aTZ6XJr", "comment": "Ok", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0ahGf9en", "comment": "Oo", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0bNkz_u9", "comment": " @frankiefiction5402  k pop", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0bvl8Pqr", "comment": " @frankiefiction5402  lol Kokomo", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0eIt00_c", "comment": " @LaughingSeraphim  o polo k pop o o polo lo opposite k", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0f1s9t7o", "comment": " @LaughingSeraphim  oo lololol oo", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0fYAVVJ7", "comment": " @LaughingSeraphim  ok", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0fqS_B0B", "comment": " @LaughingSeraphim  ok", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0hk6hk37", "comment": " @LaughingSeraphim pop", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0jHIPVA7", "comment": " @LaughingSeraphim  lo lollll", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0juGxxYR", "comment": " @LaughingSeraphim  k", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0kHEvQxT", "comment": " @LaughingSeraphim  ok", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0kbHbLmn", "comment": " @LaughingSeraphim  o", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0ks5qrpF", "comment": " @LaughingSeraphim  ooop", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0lE6A9el", "comment": " @LaughingSeraphim  o", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9Rw0lXAAdhI", "comment": " @LaughingSeraphim  polo", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzOITrcfUImgpFnTUB4AaABAg.98qF8GDHs_t9TSWx1yZSTQ", "comment": "I won't invent calculus but at least I'll know more about human biology and behaviour", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyU-c1R1tRo-ZZP-Q94AaABAg.95mstxy198r9M6c1YWrrpi", "comment": "Stellar post.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxRHwTDfjCD8-PZWH94AaABAg", "comment": "As of Jan 5, 2020, this is a great lecture.", "votes": "7", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw9-sUbMFUTgCt0d_54AaABAg", "comment": "holy, i'd never thought my cells knew statistical physics", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwzodJwRcDwV6ym7ON4AaABAg", "comment": "Coffee?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyiZ5W6utGfEuWncZh4AaABAg", "comment": "Haha back to regular", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgycPIw4m4ynk9UuTyx4AaABAg", "comment": "i wonder what it is about ROS that cause Parkin-Pink1 to bond with autophagy receptors on damaged mitochondria outer membrane. Is it the electrons or protons causing a  magnetic pull? could the Parkin-Pink1 the aka autophagy trigger molecule be replaced with a lighter yet similarly shaped molecule for inducing autophagy on mutant mitochondria? hm... what's the ligand for inducing autophagy on mitochondria with a mutation? or does it depend on the type of mutation? do mitochondria even have ligands? mitochondria are inside the neurons and every animal cell and their mother. except for red blood cells. mitochondria are in white blood cells though.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz6pytLXCSi9Fe32C54AaABAg", "comment": "Robert Sapolsky, how do deficient amounts of ATP Adenosine TriPhosphate in neurons affect thought and emotions?", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyDHRC9AWfrsGJ9fCF4AaABAg", "comment": "i wonder if we can use the aut-regulatory systems to treat brain damaged people. hm...", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwq-MYkqDpXsJu6WWV4AaABAg", "comment": "interesting. i wonder if professor Robert Sapolsky has met Russell Targ. https://youtu.be/hBl0cwyn5GY", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzP_LWTBXpSJy87ylN4AaABAg", "comment": "How would complicated autoregulatory systems of neurotransmitters evolve without some kind of intelligent design. i'm not saying there's a God or creator god, more like extraterrestrials or time travellers? is it even possible? Can spirituality or spiritual experiences and the effects of meditation be explained through neurology and molecular biology?", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx8s4PcmDUYisa0DC14AaABAg", "comment": "How will modern pharmaceuticals affect evolution in long run? Will it be detrimental or beneficial effect in like the next 100,000 years?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzMpPY33wtO0pb02wR4AaABAg", "comment": "OK! Any hormones to keep me awake during this lecture?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwD-1B6vHVJi4DOUeJ4AaABAg", "comment": "What book is he referring to? Zerba somehting?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugylp9VwEhsGvOObNHZ4AaABAg", "comment": "Viewers--please understand that much research has been done in this field in the eight years since this lecture. Sapolsky was lecturing on the \"state-of-the-science\" at the time. Research changes our understanding of the world and this process is happening at an exponential rate these days! I love Sapolsky and this series is fantastic. You will learn a massive amount about human behavior, neurology, etc, but when it gets down to details not well understood at the time of his lecture, one would have to search academic journals for what is known now.", "votes": "100", "replies": "5", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyX3OT8OMj_7dCFArV4AaABAg", "comment": "What happened to 12?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxvcZ6ldgeKV5DOtbZ4AaABAg", "comment": "The last 10 minutes discusses modulation reminds me of how basic transistor \"gates\" work. I wonder if it's possible to use CRH, VP and ACTH to work as signals and amplification much like how transistors amplify a signal iff some other signal shows up. Would such a system be as reliable and replicable as currently existing IC chips. Would the energy cost be lower? Would the signalling be faster?", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyb0RYE7287mUQv-ON4AaABAg", "comment": "I", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyTjrqm2WP1Det8aRR4AaABAg", "comment": "seems a lot like approach and avoidance", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxvBc6sdLxY40RLwD54AaABAg", "comment": "Spalosky is one great professor! Such an interesting man, and great teacher!", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxGh-AvtZp-TB4R-8h4AaABAg", "comment": "You can't blame the dude coughing, I would get teaked before this guys lecture for sure", "votes": "4", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyDjcDzrWj4QcaJ8ah4AaABAg", "comment": "A great teacher and a man who recognized the danger, stupidity and tragedy of MAGA from the start, of course.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxRHwTDfjCD8-PZWH94AaABAg.93PPUr28fuz9qTDid4H89b", "comment": "As of June 2, 2023, this is a great lecture", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzP_LWTBXpSJy87ylN4AaABAg.9-FNtiyDYyg9dAC8G5DrRF", "comment": "have you watched the previous lectures? they explain pretty succinctly how the entire process works. (15 hours of footage is succinct when you are talking about a process this complicated)", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugylp9VwEhsGvOObNHZ4AaABAg.8yQuDZmHClz9eUESiIgiY5", "comment": "Why not give an example of the new details? Your case about the general progress of science would be much more effective. For most viewers of these lectures, already 12 years old, searching the current academic journals is out of consideration. Only a professional in the field of neurobiology could do it.", "votes": "7", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugylp9VwEhsGvOObNHZ4AaABAg.8yQuDZmHClz9fgpstpCpiI", "comment": "Well... duh. You answered your own question. The guy was just raising awareness on a point many overlook or are oblivious to that fact and how publishing works in science.  He made a good point and spk lecture still remain top notch. What exactly is the problem?  I mean with your reasoning i could tell people to stop listening to einstein and Feynman.  I probably know more then einstein on fundamental physics, i sure don't hqve his level and am still a student in theory, but he would have more to leqrn from me then me from him. Feynman perhaps not, he l8ved though the quantum revolution anw was just out of thid world intelligent.  I mean i could homeschool newton. On physics, on math. Doesn't mean his principia wasn't like them most gamechangong book in hostory, and i m nowhere near his level. I m a bit biased bieng into physics i like simole elegant solutions and don't ever encounter geniuses who were wrong in the history of my discipline, they more line correct and affine models. I understand its not always like thar.  But yeah science has evolved, its evolved far beyond the classicql mechanics, (quantum) electrodynamics thermo etx that i did. Still makes what i learn useful and relevant", "votes": "4", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugylp9VwEhsGvOObNHZ4AaABAg.8yQuDZmHClz9fwhFa4NgLj", "comment": "Microwave auditory effect Frey affect radio-frequency hearing artificial telepathy artificial voice to skull to be addressed targeted individuals lives are depending on it! Find the cure make it public knowledge..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugylp9VwEhsGvOObNHZ4AaABAg.8yQuDZmHClz9koBb9KqHFN", "comment": "Hopefully everyone knows that’s a given.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugylp9VwEhsGvOObNHZ4AaABAg.8yQuDZmHClz9xt9nkSUTun", "comment": "Is there an updated version?", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxvcZ6ldgeKV5DOtbZ4AaABAg.8x2lZveyit49XdMhqF_DnX", "comment": "Admit that you can always give greater details. But explaining subjects across various fields with a cohesion  understanding a a splash of humor is certainly rare.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxvBc6sdLxY40RLwD54AaABAg.8vozW1E6VKB9WqrlG7l9KQ", "comment": "Geneva Convention  springs to mind   discrimation against certain ethnic groups   in society  perhaps", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgxGh-AvtZp-TB4R-8h4AaABAg.8vbcwxWU31S9D3iBFI1Q9O", "comment": "“Get teaked?”  Is that when you whittle chips off your patio furniture and smoke it?", "votes": "3", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyyUzFcQv-lBy7_JS94AaABAg", "comment": "I feel like everyone should preemptively start shouting in unison \"what's that about?\"", "votes": "10", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg", "comment": "Today is April 28th, 2019. These lectures are still incredible even nine years later. I'd kill to see what new information has come to light since then.", "votes": "208", "replies": "6", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyUN3jOWvq5uvHN8YR4AaABAg", "comment": "(english not my first language) about the \"auto receptors\" on neurons. if it's the way for neurons to know how much transmettors it dumped, and if it's the way for neurons to regulate the release, does it mean that psychotropic drugs, like antidepressants, are a scam? if neurotransmettors are artificially dumped into the brain and neurons catch them with their auto-receptors, then they'll \"think\" they overdumped the molecule, then wouldn't they tend to release less and less of this molecule to balance? and wouldn't they take the \"habit\" of releasing not enough of this molecule? in other words, if you have a deficiency of a certain molecule because your neurons doesn't produce enough, taking a mmedication who is supposed to fix that will actually make your neurons produce even less of this molecule? isn't that why people can't quit antidepressants once they've started?", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy_QLZWz0-7SscmIzJ4AaABAg", "comment": "would've been great to read the materials they are talking about", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzYBibrfPAp_fCx2Qx4AaABAg", "comment": "\"Go to your deathbed remembering that acronym... because... it will make you... <shrug> happy & fulfilled.\" lmao the world needs more Sapolskys.", "votes": "5", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyx98LM9W1nCcf7V5p4AaABAg", "comment": "Great talk on some very interesting subjects. Thank you for sharing this.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxtY6KUwhqD3urDfL54AaABAg", "comment": "In 12:18 Sapolsky said that there are neurons in the hypothalamus that release epinephrine. I don't believe that's correct. Epinephrine is released by adrenal glands in response to ACTH, I have not found any information on hypothalamus releasing epinephrine. Please correct me if I'm wrong.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyXi6XRrTMg9x9bPT14AaABAg", "comment": "what was the zebra book?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzURsHTMbI0EuefJJx4AaABAg", "comment": "45:15, priceless.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwm0zcc8ADguSAF5dx4AaABAg", "comment": "There are many things in world I don't understand; however even if I don't understand them, I get a \"gut\" feeling when it makes sense. For some of the past 3 lectures, I get a gut feeling that it's wrong. (It's probably that my gut is wrong and I'm not really complex). Some of this reminds me of the time science believed that Earth was the center of the universe and science came up with overly complicated models to make the math square out.  Anyways Dr. Sapolsky is a genious and i'm just an intellectual Sapo (frog) so I should just shut up and re-watch everything until i'm less ignorant.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzTBS68s0Opnwj9rPt4AaABAg", "comment": "Specific level versus rate of change: Consider the following: We exist in an analogue universe that is interacting energy fields (those energy fields of which are probably just a singular force with three different modalities), of which those interacting 'gem' photons (gravity being a part of the currently recognized 'em' photon and acting 90 degrees to the 'em' fields, which of course act 90 degrees to each other, the pulsating, swirling 'gem' photon being the energy unit of this universe that makes up everything in existence in this universe), at times unite with other 'gem' photons in a string theory kind of way and create sub-atomic particles of which then would also eventually create atoms and molecules.  The sub-atomic particles, atoms and molecules being the 'quantized' part of the interacting 'gem' photonic interactions.  Hence, a system that can have minimum and maximum energy limits (whether by the overlapping energy fields of the modalities of the 'gem' photons and/or by the particles themselves) as well as a system that could have rate of change methods employed (depending upon the strengths of the energy fields and/or by the number of particles (sub-atomic or otherwise).  Two systems in one.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx105xGvw3DBC-EEr94AaABAg", "comment": "I love Sapolsky", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg", "comment": "13 lessons in, still can't believe this is free. Do not change that fact ever.", "votes": "414", "replies": "9", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwUwdITufWHVgq5WqN4AaABAg", "comment": "When I started watching this series at the beginning, I thought I was going to learn about behavioral evolution, but somehow this evolved into extensive lectures on neurology and endocrinology and for the life of me I am struggling to make the connection.  I am sure it is there somewhere.  Besides, I can't stop/won't stop watching because I love the Prof.", "votes": "5", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwDPgcfE38D4_HFsfh4AaABAg", "comment": "Where's the 'Basic Neurology and Endocrinology' video? ...Asking for a friend.", "votes": "2", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwG7yXdoqfDhdG24Qx4AaABAg", "comment": "I don't know if I am understanding Advanced Neuroscience very easily or Sapolsky's speaking skills are just making this very easy to listen to.", "votes": "0", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzI0O2YHbIAP3sm2nh4AaABAg", "comment": "🗽", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyyWc-s_UU_p5ncUml4AaABAg", "comment": "note again carl jung agni/Ignatius princeton gayomart mythology soma lots between s-ame cover. secchio meno di nulla bucket [?] Riemann z-eros", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxiH0sylbF_7GT_a414AaABAg", "comment": "Too bad the antidepressants don't actually work for everyone. Obviously there is more to learn and know", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx9FaAZziC5dJd3UCB4AaABAg", "comment": "Hindi m sir lecture disorder anatomy", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg.8uHONSoUnzk9-9J0uzRhce", "comment": "You'd kill to see them? Ah you might want to watch the lectures in this playlist on Aggression!  JK  🤣", "votes": "29", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg.8uHONSoUnzk90Q23pDTMK0", "comment": "listen to imagine by John lennon, “no need to kill or die for“", "votes": "5", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg.8uHONSoUnzk97k2UHpnhZs", "comment": "it's on Search and Google Chrome/ Google Go.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg.8uHONSoUnzk9AFDZVmpFGx", "comment": "no killing. throws a batarang. Jedi CQC hear hugs, and disarms you with smile i'm not here to my son or shall i call you brother? it's time to let go of the gun and LIVE!", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg.8uHONSoUnzk9s31Bl6bmwU", "comment": "Have you read his book Behave? Its really good.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwXsrvE_NBKyJIT5654AaABAg.8uHONSoUnzk9vSoZEz6zsZ", "comment": "Can confirm in 2023, these lectures are still very informative and well presented", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9G0VPZSHMNP", "comment": "I watch so many lectures from youtube that they should give me a degree", "votes": "22", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9PBewiI3Nbh", "comment": "Uracok", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9Q7G2lchT2t", "comment": " @joeldiaz5857  there should be degree examinations to get a degree at cost provided you can prove you understand the information. By at cost i mean the materials, a reasonable markup for the development of the exam, and the proctor's time.", "votes": "4", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9R1ntYQa7fG", "comment": " Avishag Bat-Shunam  no idea, sorry", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9WKAS3R4Ntz", "comment": "Myacok", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9XnnTELUauv", "comment": " @joeldiaz5857  can you pass a test? if not, you get honorary university of youtube piece of paper", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9fwhpP-Svgm", "comment": "Microwave auditory effect Frey affect radio-frequency hearing artificial telepathy artificial voice to skull to be addressed targeted individuals lives are depending on it! Find the cure make it public knowledge..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9fxVf-MWj3F", "comment": " @cherylroberts771  Nah, I'm soul over mind and matter, I'll be fine", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzvPIU27ijcGU5R_sN4AaABAg.8mJgynr2RpK9fyV6nFMG11", "comment": " @Yarblocosifilitico  it's a start thank you..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwUwdITufWHVgq5WqN4AaABAg.8mFQ14OuahC904D2KtQx0q", "comment": "you WERE going to learn about that, in the first lecture, but the evolutionary view is one among many, right. This is behavioural biology, there are many sub-categories. The connection is that it all has to do with behaviour, but it's not like every sub-category together leads to a conclusion that's bigger than the sum of its parts. I think, this is as far as i've gotten as of yet :)", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwDPgcfE38D4_HFsfh4AaABAg.8lzPncGnTnq8moFjhumtCx", "comment": "lessons 11 and 12", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwG7yXdoqfDhdG24Qx4AaABAg.8l_klZz7Tu68mBN03xL9EX", "comment": "This is basic, not advanced, neuroscience.", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwG7yXdoqfDhdG24Qx4AaABAg.8l_klZz7Tu68mBUVCr6Jbx", "comment": " @musical_lolu4811  that might explain it.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyyWc-s_UU_p5ncUml4AaABAg.8l853N2rPcJ9PPfgAZFAA5", "comment": "Add a public reply....", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgyX3aKFJdiap5-6yYp4AaABAg", "comment": "I heard you liked auto-regulators so I put auto-regulators in your auto-regulators", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwfOsdFLSc_eexemAJ4AaABAg", "comment": "Am I the only one feeling like I didn’t get this lecture at all? After the kids were substituting I completely lost the thread of the lectures... (Edit:) after watching this the third time, I now get about 90%, although will not remember most of the terminology... Goes to show the benefit of filming these lectures!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxzFqEy4RgZTELxrvl4AaABAg", "comment": "Pure Poetry...absolutely awesome and extremely well appreciated.", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwL-4i7nXtJKm9qzGB4AaABAg", "comment": "1:06:00 into lecture, anyone else see a bipolar junction transistor? neuron B is the emitter, Gaba receptor is base and neuron A is the collector. Neuron B can send a signal to A, but it's effects are altered by the Gaba receptor(Base-emitter control). Small changes in the voltage applied across the base–emitter terminals cause the current between the emitter and the collector to change significantly. This effect can be used to amplify the input voltage or current. BJTs can be thought of as voltage-controlled current sources, but are more simply characterized as current-controlled current sources, or current amplifiers, due to the low impedance at the base. does this make sense? peace and love", "votes": "9", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzuOP8AzP9G0slqOmx4AaABAg", "comment": "genius", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyWhREe6Y4KW5KySpR4AaABAg", "comment": "Mah boy!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwmzqi4e9SqkJDq0094AaABAg", "comment": "There's too much negative feedback in this lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxf3e30RwY4P88NXDN4AaABAg", "comment": "Dr. Sapolsky you should revise this interval with Microsoft Halolens", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyKjhnaNQMaru2MRLl4AaABAg", "comment": "So if both of Dale's laws were disproven, why did I have to hear about him at all?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UggEZIXPQYcxoHgCoAEC", "comment": "Modulation of modulation? This is so extra. But so amazing.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugi6Fh8PkfW833gCoAEC", "comment": "Flatbread. This guy is so freaking funny 😂😂😂  Still not over \"Plant IQ\" 😂😂😂", "votes": "18", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC", "comment": "The girl asked the same question I was thinking. Damn we basically don't know how antidepressants work.", "votes": "31", "replies": "16", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC", "comment": "Its amazing how lectures at a world class university like Stanford is different than ur average Uni: the professor actually teaches you and talks to you,   not just reading from powerpoint.", "votes": "390", "replies": "13", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugim-mIXY29CYXgCoAEC", "comment": "a coughing person in the audience again :)", "votes": "16", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugi_3pkVrjQIZngCoAEC", "comment": "giving me motion sickness all the rocking back and forward", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjBC4CRHXZxzXgCoAEC", "comment": "I listen to this before I go to sleep and I missed a bit in the last lectures because I fell asleep. I am so lost. lol (haven't studied bio since 1999) I just can't bring myself to go back to those terrible TA's.", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjA-6yo4lzgpHgCoAEC", "comment": "He's great I'll be going to school soon for my bachelor's and I want to go onto to practice for endocrinology I'm 23 right now and can't wait", "votes": "7", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugib_1CY6EQ1EHgCoAEC", "comment": "Finally, back to the good doctor Sapolsky. God I missed him.", "votes": "61", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UghWzqb5O8c3bXgCoAEC", "comment": "Could you please upload a new bunch of this series? Since its already 5 years ago and many things have changed by now!", "votes": "97", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjCUv7iV_YdG3gCoAEC", "comment": "Anyone know where I can find more on the different stress signatures?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyX3aKFJdiap5-6yYp4AaABAg.8g82ARmO4-K8g82BFM_FbC", "comment": "Bad", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwL-4i7nXtJKm9qzGB4AaABAg.8_JDQPc6g0A8kIgH2oMMWj", "comment": "Very much thought  the same analogous description.  Good call to post and comment on it.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugi6Fh8PkfW833gCoAEC.8Vdy9d1lGkt8nJbCiuJfCT", "comment": "Also, \"And this is so immensely complicated that you all immediately have to go to the bathroom for 5 minutes. \" I died.", "votes": "7", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t8uQIvcSAJTs", "comment": "Damn right. Im on lexapro, but daily caffeine 200 mg works better than lexapro.", "votes": "6", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t8ugOZ_ew3rm", "comment": " @nickjohn2051  True, caffeine and l theanine are the best combination to go for if you are feeling down. SSRIs either dont work well in many patients or when they do work the patient has to be on them for lifelong because when you quit them there is a chance of rebound depression. And most importantly they ruin sexual life by causing a very significant erectile dysfunction.", "votes": "10", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t8uyC1eC_qle", "comment": "There's a good overview/summary/state of the field video by What I've Learned on the topic", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-uLoEapY_z", "comment": "i wonder how antidepressants will affect the way humans evolve.", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-uMQ0cj7Y8", "comment": " @HexoseMonophosphateCunt  Depression causes loss of libido in itself. Depression doesn't cause me ED. Antidepressants  do. Antidepressants also often have an awful side effect of suicidal ideation. it feels like more of a compulsion than thinking about it. At with Paxil when you are under age 24. Blood glucocorticoids, serotonine, dopamine, and oxytocin levels  should be checked in in a blood lab. With suicidal ideation side effects, it's too risky to prescibe them on a hit and miss basis.", "votes": "4", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-uUxOuK5l8", "comment": " @bluejay6904  SNRIs like venlafaxine are famously known for suicidal ideation. However newer anti ds like buproprion and trazodone dont have those. And i  watched robert sapolsky's lecture on depression(professor at stanford) and this is what he has to say \"when a patient is suffering from major depressive disorder, they are prescribed anti depressants, however anti ds take a bit of time to take effect and the recovery occurs in phases. Firstly the avolition or lack of motivation(laziness) is gone. But internally the patient is still depressed. When he is lazy he will not try to think of clever ways of suicide but during the recovery phase once the patient is active he should be kept on a suicide watch. I think scientists confuse this phoenomenon as a side effect of Suicidal ideation. Regarding ur ED question the newer anti depressants dont hamper sexual life too. Sertraline fluoxetine paroxetine etc have a significant loss of libido side effect. Tested it out myslef.", "votes": "3", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-uVOMATD6w", "comment": " @bluejay6904  Also i am a graduate pharmacologist and dont have depression but lots of things make me miserable. To feel better i take them on regular basis and im feeling normal. Never felt suicidal thats a testimony to my previous comment", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-v-_sioeeT", "comment": " @HexoseMonophosphateCunt  Glad it works for you. there's obviously individual differences in genetics and environment when it comes to side effects. i've been through a whole lot of medications mostly prescribed by a doctor. though two were prescribed by a Psychiatrist. the doctor said he had taught mitochondrial diseases at a university. they only caused me autonomic nervous system damage.  https://www.researchgate.net/publication/230565266_Psychotropic", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-v0asSH0EV", "comment": " @HexoseMonophosphateCunt  thanks but no thanks. Not all American meds are legal in Japan. Welbutrin isn't sold in Japan. i'm also not depressed. now that im off the medications, i don't want to die. i want to live. i also got over the withdrawl effects in 2018 with LG21 probiotic yogurt and pomegranates,  except for the autonomic nervous system damage. i have a rare genetic mutation mtDNA 3243 A to G. Are the meds tested to be non-toxic to mitochondria?", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-v24KMgwM5", "comment": " @bluejay6904  Im not recommending you any medication and i cannot even if i want to because i dont know ur case. I was just discussing with you.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9-wd5MBOnC4", "comment": " @HexoseMonophosphateCunt  nice profile photo switch-a-roo you pulled. guess the joke´s on me.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t90OMPNH84mR", "comment": "I’m on Vipassana meditation. I tried medicines but didn’t like that kind of solution. And watching these lectures I see how few we know about these mechanisms, and how one thing affects others, and how conplex an individual is to be diagnosticated. I think science will get to a point they say “OK, Vipassana is indeed the best method, just take 10 day courses”.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9AfWCWRo6-q", "comment": "Yeah.. it's crazy actually lol! I'd recommend reading Anatomy of an Epidemic to anyone interested in/ taking antidepressants, it really explains a lot.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9BqkIHpxaE1", "comment": " @HexoseMonophosphateCunt  SSRI are not always the best antidepessants and dont work in many people also they can increase anxiety levels which can increase suicidal thoughts some of the newer ones like Mirtazapine are better Mirtazapine works like the old trycycleic ones but without the side effects they seem to work on chronic pain as well Ive had a athritic condition since i was a teenager and they relieve this as well", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9Bqld1qmm6m", "comment": " @HexoseMonophosphateCunt  Mirtazapine is a good one too", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjz35bsc8w4oXgCoAEC.8VNpZufZZ1t9LHIWs-TEYT", "comment": "Nick John lamictal is good also sertraline", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9LE42217Hju", "comment": "1:00:05  \"OK, so GABA, inhibitory neurotransmitter-- when barbituates are around, does that increase or decrease GABA signaling?\"    OK, who says increase?  ...Who says decrease?  ...Who says 'what'?  OK, me, too.  I wasn't listening either.\"    OK, I'll tell you, lurking around in the back during those TA's lectures, you really do get a sense of what interesting, non-academic things are going on on people's computer screens.\"    But I digress...\"    LOL, this man has the patience of a saint.  Thousands of hours spent observing baboons though, so I'm not surprised.", "votes": "38", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9PItcowMhdT", "comment": "Isn't it amazing though that when a camera is brought in the class, the powerpoint reader suddenly becomes a high skilled professor? It's almost like some are just bored.", "votes": "7", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9QTlRf4auaa", "comment": "I went to a world class university and the professors were on the full spectrum from highly engaging to terribly boring. Then again, I studied engineering, and most of the more passionate lecturers were in the non-engineering classes", "votes": "16", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9R42fT1xi05", "comment": " Avishag Bat-Shunam  Joe", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9SAUTg4GxKM", "comment": "not really- it's about the teacher, not the school. i bet there are ivy league professors who suck and expect you to memorize a textbook to pass a short exam.", "votes": "6", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9Ti1_nqewRF", "comment": "I know exactly what you mean. So much better", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9YCdm5mtmfB", "comment": "I was in a philosophy class at Cal State LA and there was a student in there who had gone to Yale.  I told him this must really be a let down compared to Yale, and he said the teachers were the same.", "votes": "3", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9_Rg2cjqp3K", "comment": " @workingTchr  it's true. The perceived 'quality' of a lecturer has a lot more to do with their oratory skills, personality, enthusiasm than their intelligence or stature in their field. Yet most universities, especially renowned schools, hire based primarily on the latter qualities, because publishing/stature is more 'valuable' to the school than if students enjoy the lectures. In effect, that's why you can have excellent lecturers at practically any school and terrible lecturers at the best schools.", "votes": "6", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9bMtcURP14u", "comment": "It is true for Yale, MIT other top universities too.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9fwhaiqd4LI", "comment": "Microwave auditory effect Frey affect radio-frequency hearing artificial telepathy artificial voice to skull to be addressed targeted individuals lives are depending on it! Find the cure make it public knowledge..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9iRbecgT2p4", "comment": "It's all the same they just have better professors.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcEN9ksUbg7FL9Z", "comment": "😊", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggoI9fObJeBRHgCoAEC.8UT86ulJcENA3iLGXYAaEA", "comment": " @giorgosandrigiannakis1375 z", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugim-mIXY29CYXgCoAEC.8UCnMpurwgi8ugON4pDhmO", "comment": "He is probably on ACE Inhibitors 😜", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugim-mIXY29CYXgCoAEC.8UCnMpurwgi9K9pX-l897b", "comment": "Sounds like there is a TB epidemic in the audience. Why do I find this distracting?.., love the lectures though", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgjA-6yo4lzgpHgCoAEC.8IhdJpKXYbH8hT4qCkzYLh", "comment": "Monica P how's it going?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghWzqb5O8c3bXgCoAEC.8Gir0YzCIgS9lzYnQ_Jgja", "comment": "11 years ago :D oh god.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgjTLMUGPSHTgngCoAEC", "comment": "Today is April 28, 2016...  happy birthday lecture", "votes": "5", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ughar4D0U4H6-ngCoAEC", "comment": "Can anybody explain what he said ?  i dont really understand english \"as voice\".", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC", "comment": "I have tremendous brainfog. I did all kind of lab testing. I am in need for advise. It lies in the hormones.. waiting for you reply.. thank you", "votes": "0", "replies": "6", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjrpMRQLvwekngCoAEC", "comment": "fuckkkkkkkkkkkkkkkkkkkk!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjCEWJetSXSOXgCoAEC", "comment": "Old theories: 1 neurotransmitter per neuron.  False.  3 or more now. ACTH secretion / reception / inhibitors, Pituitary regulates it not brain.  Yea prove it Peptide: delta sleep inducing factor, theory Mosaic of xmitters Negative feedback regulators, Autoreceptors   CRH hormones released, stress     Rate of change regulation, of Glucacortizoids.  Mystery.  Mary Diamond UCSF endocrine simulations Positive feedback: estrogen, more makes more.  Mystery 36:00 Auto-regulation.  like pirates desensitized the more they do it.  Depression, drugs will desensitize     Fatness: insulin resistant fat cells, decrease insulin receptors, downward spiral, pancreas work so hard, diabetes       complicated SSRI question    Pituitary has own regulators in addition to hypothalmus More complexity: lidan levels, trigger regulation  50:00 Receptors a complex of proteins, different genes,huge  combinatorial ways to generate receptor      cells change subunits Old theories: 1 neurotransmitter per neuron.  False.  3 or more now. Gabba receptors, dendric spine.  Barbituates, anisthetics affect receptors,        minor tranquilizers: Benzodiap...vallium receptors        hormone binding, progesterone, mood shifts in premenstrual, shortage of progesterone 1:04:00 final complexity:  neurons A B, Gabba makes projections on B.  Mystery, dumps the neurotransmitter       Axo-Axonic synapse 1:09:00 Endocrine modulation, ACTH, vasopresin", "votes": "73", "replies": "3", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugj32zUVIOr-2ngCoAEC", "comment": "27:13 some statistical bases...", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UggJzS-UMCiulHgCoAEC", "comment": "I am Clever Too!", "votes": "5", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC", "comment": "It's good to have Sapolsky back.", "votes": "501", "replies": "15", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UghUxWSmufk90ngCoAEC", "comment": "I love watching these lectures, but I was wounding how long can he go between breath? Do you think he knows it is had on the brain to keep up with him.  Smart wow!  Please slow down the rest of mere mortals have slower brains: my neurons are screaming out make it stop.  I do like it when he get funny, he could do stand up with all that material.", "votes": "4", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgikDOTGPTbXx3gCoAEC", "comment": "Today is April 28, 2015.  Happy birthday, lecture!", "votes": "31", "replies": "5", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjr1GZ0gT4eKngCoAEC", "comment": "It's an attractive lecture.....", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjZ-XjaFkBBDngCoAEC", "comment": "am such a humble deciple sir", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgipccA5W7Yel3gCoAEC", "comment": "Amazing lecture", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjUrM0_TSWxTHgCoAEC", "comment": "I wonder if there are cluster differences amongst people with anxiety at the pituitary mosaic", "votes": "3", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UggCSgPD3bzbPXgCoAEC", "comment": "So bummed that they didn't include the class laughter at the break. I laughed alone ", "votes": "65", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ughmu4ppcibmZ3gCoAEC", "comment": "Excellent explanation of how GABA works in CNS near end of lecture.", "votes": "4", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC", "comment": "a neuroscience professor at my college didn't know that it was possible for a neuron to use more than one transmitter, and denied that it was possible, when i pointed it out to him. the next lecture he admitted that he had been wrong, and said he didn't know about it, because it was \"cutting edge research\"... mildly embarrassing, makes me wish i had a sapolsky-like lecturer at my college.", "votes": "83", "replies": "16", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjMVyQXgdYI-3gCoAEC", "comment": "Wow this guy is good. The link between neurology and endocrinolgy is well explained", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgjyiP4IhdpmMXgCoAEC", "comment": "How do other hormones modulate CRH driving of ACTH secretion??", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugj0jxA_gb_x6XgCoAEC", "comment": "I love this guy, If I could be half as great a teach I'd be great....", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC.8A2c9RfSE5P8Do7-o2852K", "comment": "+martin van rossum exercise more", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC.8A2c9RfSE5P8Dpz6qD3nsl", "comment": "it helps a very small bit. any other ideas? thnks", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC.8A2c9RfSE5P8DrLmBMwE0b", "comment": "firstly try the simple things like changing up your diet, drinking more water, and regular exercise. (you probably have done this)  depending where you live - i would recommend seeing a local GP that you trust - youtube is not the best place to seek medical advice.  see if you can get a sleep study done - many hospitals perform these studies for not much cost. They are not too fun but goodluck and dont give up trying.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC.8A2c9RfSE5P8FUcOcN1OQU", "comment": "its crazy I did eat last week goat cheese and indeed I felt a bit better for half a day.. what the heck is inside..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC.8A2c9RfSE5P9LHKT8QtT1w", "comment": "Martin van rossum please research the Keto dieting utube  great for brain fog !!!", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghjWr7tw-Stc3gCoAEC.8A2c9RfSE5P9M6_XNCAP5V", "comment": "Swim voraciously, and often.  Plant-based diet helps immensely.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgjCEWJetSXSOXgCoAEC.87PDUATA6if8lXXr6kVuJP", "comment": "Arthur Sulit i", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgjCEWJetSXSOXgCoAEC.87PDUATA6if8m7u6i-61tv", "comment": "Damn it lol", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgjCEWJetSXSOXgCoAEC.87PDUATA6if97k4CKkVJQr", "comment": "The more you know. The further you'll go.　Search \"All psychotropics show signs   of Mitochondria Toxicity\" on Nature.com or pubmed.gov. it's a good article. The pubmed.gov article has a Link a little below the article that Link's to the Nature.com article.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggJzS-UMCiulHgCoAEC.85hgRPDq4dK9H3WhVBODxx", "comment": "Yes you are. Yes. You. Are", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8UlmcH5RkVi", "comment": "Rather than calling her a hot bimbo, why not say that she was an attractive, nervous young graduate student at Stanford?", "votes": "82", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8VoDopFDN8g", "comment": "indeed, why comment on her appearance at all?", "votes": "50", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8_a33mtYiad", "comment": "Yeah, don't talk about what you like about her, just refer to her as that abnoxious laugher in the background, which you can now associate to a face.", "votes": "6", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8m60QoLukY8", "comment": "Where is lesson 12?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8moFRI8az-4", "comment": "gotta search for it, but it's there", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8o5OjAnEPMd", "comment": "For those of us that would like to see said bimbo is there a link...?  😁", "votes": "3", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8otGzqqK2o1", "comment": "Sigh. It is...", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8p5gWGL6Ffy", "comment": "I don't what y'all are tripping about, all the grads killed it. They were funny, informative.", "votes": "35", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N8qQDDofely9", "comment": "I assume that he graded the TAs' performances appropriately (he undoubtedly saw those videos before anyone else did).", "votes": "3", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N9C5T4r9fcuo", "comment": " @mooselessness  i didn't really like the first two ones, they kind of struggled to connect with the students, not so great speakers (not complaining, just stating my opinion)", "votes": "4", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N9XM4I6roDxf", "comment": " @andreasmaaan  and why not? Why not let the cortex have its play and have its say too?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N9XMHTxT8U6d", "comment": "​ @roobookaroo  because this is a public forum and this woman did not ask to be sexualised. Because if women are publicly sexualised by men whenever they try to share their expertise or engage in public discussion, this creates (reinforces) a gender-specific disincentive for women to attempt to do this.  Ofc, what you think or say about her appearance in private is your own business.  (And my comment that you just replied to was from four years ago, btw!)", "votes": "5", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N9nVekjBZyUL", "comment": "I so missed himmm", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N9tLLaRNUSGd", "comment": "​ @awhodothey oi oi oo 7:31 kiii>iio>ipp{i{oí{oo9o{0o❤o{o{{{o{opoo loto8 Ii{o{pp OO 9{w{{o looser pp} 0⁰w of kisseslo see 9 poo too_gyno>o⁰⁰⁰oppoiooo{on ooi poop on5", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugjppeeg1pejv3gCoAEC.81Rof6NPj-N9wXDRAQkffz", "comment": "​ @coreycox2345 òòpooooòo po ò po oòoòoooòoòòòoòoò OP oòòòòòpooooòop OP op OP ò LLP oooooooooòoooooooo", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UghUxWSmufk90ngCoAEC.8-l3gecJilk86OvYFw2yPT", "comment": "+Lola Waters If you listen for it, he can clearly be heard breathing at a normal rate throughout the lecture, usually between sentences.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgikDOTGPTbXx3gCoAEC.7zVe1Sgq61W8DEmM6D8Fnz", "comment": "+Not-Google-Plus Today is April 28, 2016.... so happy birthday again", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgikDOTGPTbXx3gCoAEC.7zVe1Sgq61W8m4-v1a2VFR", "comment": "Hope you had a nice birthday this year again! :)", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgikDOTGPTbXx3gCoAEC.7zVe1Sgq61W8uwjwy-qoBu", "comment": "Awe man just missed its birthday", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgikDOTGPTbXx3gCoAEC.7zVe1Sgq61W904DB4DO1KM", "comment": "Looking forward to the next birthday", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgikDOTGPTbXx3gCoAEC.7zVe1Sgq61W9AFBHxtkINc", "comment": "it's like June 23rd 2020 today. my date is older than yours. she is a cougar. rwar just kidding, no date. I'm married. my wedding anniversary is in 3 days.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgjUrM0_TSWxTHgCoAEC.7-H0Z7-DP_G8epSKIqsGPB", "comment": "hassle some lab into letting you study this and write a thesis about it", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ273Tn8lKU-Xr", "comment": "Crash classes. I did it to his. Even of you're not local", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ2787OELb3ie-", "comment": "It is often said that biology is the retarded sibling of the scientific disciplines. I suppose it may partially be due to badly-informed, dogma-blinded profs and researchers. All that is changing, though. In my opinion, biology (neuroscience, endocrinology, etc.) is on the verge of merging with computer science. It is in the foreseeable future that computers and animate organisms will merge at least in some basic principles if not in approximate practical entirety.", "votes": "22", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ2787Sb3X5anA", "comment": "A certain Ghork definitely!!", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ286zlanAbCyk", "comment": "***** agreed. though he obviously felt it was necessary to make up that bit about it being cutting-edge research. he's a nice, albeit distracted, guy- but this first neuroscience class really disappointed me then.", "votes": "4", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ28KvD28hnha5", "comment": "A certain Ghork that was a neuroscience professor not a Biology professor. all my biology professors know this", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ28m1G3pHDR5j", "comment": "Video Trash we learn new things in neuroscience daily", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ28mBMqXJkhys", "comment": "Well, that doesn't discredit him in any way. Plus he admitted he was wrong. That's good enough.", "votes": "9", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ28musOCIgN_p", "comment": "Gotta pay big money for Sapolsky", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ28n4BDFORTR3", "comment": "I'm 4 years late but the term \"neurotransmitter\" is most often used to refer to the classical neurotransmitters, such as GABA, Glutamate, Dopamine, etc. I was very confused in the beginning of this lecture as Sapolsky calls neuropeptides \"neurotransmitters\", which, I guess, they are, but they are so different in their action and structure compared to the classical neurotransmitters that they are almost never referred to as \"neurotransmitters\" in literature. Their synaptic vesicles look completely different, they require intense stimulation to be released and they most often bind to receptors outside of the synaptic cleft. The rule \"one classic neurotransmitter per neuron\" still holds.", "votes": "9", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ28noltcq0gLI", "comment": "We all do. For all disciplines.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ297k6TbBKUEN", "comment": "Speaking of \"cutting edge research. How would Quantum Fields affect the flow of electrons in the human  Brain. I bet DARPA would love to find a way to keep soldiers calm and composed under heavy fire. It could prevent longterm memory from being directly encoded into the cortex. Traumatic events aren't stored in the hippocampus. it's more like the traumatic memory is scarred into the cortex where longterm  memories go. That's how people suffer trauma that causes PTSD. No sleepy time dreaming needed for Traumatic longterm memories. Finding a cure for PTSD could prevent soldiers from falling into The Wrong Side Of Heaven. i lost a best friend due to PTSD. i'm fed up with war. i think the economy has to change, before we can get rid of our war economy.", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ297k6hThHSI_", "comment": " @SapienSafari  i think Sapolsky's probably under paid.　Give him a raise.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ297k8-1Xdzbv", "comment": " @browniekingmuffin3590  Watch the Stanford University \"Introduction to Neuroscience and Neuroendocrinology. ９０％ of the brain cells aren't neurons, they're Glial Cells. It seems like you know  your chemistry BrowieKing Muffin.", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ297lEoNA-6WR", "comment": "Angelina Robert With a beard like that, I’d be surprised if he is incentivised by chunks of cash. This man is lucky enough to have found his calling and is clearly in the flow, like a concert pianist. He’ll play to an empty hall all night long.", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ29QmUQtXftl6", "comment": "I was taught nothing that happens to you during life would be passed on but ope. Polymorphisms lol", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UggZR9JZvUGlK3gCoAEC.7-H0Z7-HsQ29QyS5vl5hPC", "comment": " @angelinarobert622  the cure for PTSD is magic mushrooms", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugj93xO-1vXlrXgCoAEC", "comment": "this was my favourite lecture so far! great information and extraordinary explaining", "votes": "3", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugi7-H4U9jC6WHgCoAEC", "comment": "?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UghPBsPbUKzc0ngCoAEC", "comment": "How can you tell the firing threshold of a neuron.", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugia_Wft7b-aangCoAEC", "comment": "R-Python programming and data analysis bioinformatics algorithms are  complementary to this course with theoretical neuroscience scholar readings ... ", "votes": "1", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UggO0Qb25c36UngCoAEC", "comment": "what about conversive disorders? where the person can present with symptoms very similar to stroke, or even blindness, for a short period of time...and then go back to \"normal\"  I would like to know the physiopathology of that.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzQXh44R3JtGneKxtt4AaABAg", "comment": "And cypherpunks ames dsm5 discussions", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyGcVWfSLQpm1sA_Bx4AaABAg", "comment": "Programming Neuroscience cognitive psychology genetic algorithms bioinformatics computational geometry machine learning neural networks quantum computing automata linguistics semantics logic parsing algorithms kernel vulturesugurcmksem exploitations intricacies complexities subtleties intricate interlocking layers patterns English java Nov programming asking questions in cs ai bio classes stanford daughnz", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzMRqF79LKKrc8YELB4AaABAg", "comment": "It is amazing how people can think so differently , for example I can click \"play all\" and listen to these lectures for literally four or five hours none stop . The only thing I would like to say tho is that there is usually a fair bit of an open discussion time with students after - if needed , it is however a shame we can not hear these q and a's after .  (is it just me or is the YouTube comment reply not working properly ?) ", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwBJpzi-qaEAqEIwu54AaABAg", "comment": "OK. Not bothered, just needed a break. Your comment was original so I have taken note. I do wish he would take a breather now and then. That's a lot of information to absorb in such a non stop delivery, but as a non-scientist I'm having fun.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxr3rshOzLOQyGqvSF4AaABAg", "comment": "To me, he just doesn't seem to be full of himself, and I don't feel patronized. I haven't seen too many lectures generally, but in the ones I have the prof just talks throughout, there is no engagement with the students. That must be why it's called lecture not a class. ", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyqk5fqC51JeGXrkBt4AaABAg", "comment": "I beg to differ. He really is wonderful, but don't underestimate yourself. If you can understand him and just the fact of your obvious interest shows that you are in no way dumb, but rather smart enough to appreciate what's going on here.", "votes": "2", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzX4D_OsB9dT8b_68t4AaABAg", "comment": "I'm an artist and love this prof. His idea is to make some important science accessible to a larger public. A lot of the more technical or hard science he elaborates I don't expect myself to follow but am getting the general idea and I love his concept of jumping from one bucket to another. The suspense builds. Where will we find ourselves eventually? Don't sweat it, just enjoy. He's a great communicator and teacher. His enthusiasm is catching. I think scientists are just as creative as artists.", "votes": "5", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw6AgUvjQ2nmFh2zld4AaABAg", "comment": "How is he a diva? To the contrary, he's always specifying names of other scientists who have come up with one or another brilliant ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy8nSAfz5PbO59VnRx4AaABAg", "comment": "I just want to know if Prozac is an effective medication.", "votes": "0", "replies": "3", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx04z6zg9JNrSKrIiZ4AaABAg", "comment": "And that is so complicated in fact that it's essential that everybody stand up and go to the bathroom.", "votes": "11", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzCAEAHqKwCC-CKdtR4AaABAg", "comment": "Depends on you, sometimes you make yourself.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzS_Sf0xX0BI1-yOxZ4AaABAg", "comment": "Does this make me like smarter than I was before I watched this?", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzR6BYK_WPL7jTYKJZ4AaABAg", "comment": "The revulsion you feel from their coughing would normally cause your immune system to be more active. Those coughs simply can't be making you sick.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw-kBaAw74S4bICYAR4AaABAg", "comment": "25:30 bookkeeping of presynaptic receptors", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzEpvwmRKkDKDTS5fZ4AaABAg", "comment": "exams of course my friend (I'm not in the class, but he discusses midterm/final in some of these vids)", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UghPBsPbUKzc0ngCoAEC.7-H0Z7-496K713qCc75m_k", "comment": "microelectrodes in neurons their artificial stimulation", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugia_Wft7b-aangCoAEC.7-H0Z7-0txj79cjbCRTpcS", "comment": "Readings plz", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugia_Wft7b-aangCoAEC.7-H0Z7-0txj7Ept3npCizx", "comment": "What do you do?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyqk5fqC51JeGXrkBt4AaABAg.8Gbm4Hbpbjy9M6biadpr0N", "comment": "Aptly said.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy8nSAfz5PbO59VnRx4AaABAg.8GbdpFRaQah9D3jkhtpOho", "comment": "Well, for me it was extremely effective...  The effect was to give me the most vivid, disgusting, abhorrent nightmares I’ve ever had. Took it for a week and a half.", "votes": "2", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy8nSAfz5PbO59VnRx4AaABAg.8GbdpFRaQah9M6c6J8Sb42", "comment": "Exercise.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy8nSAfz5PbO59VnRx4AaABAg.8GbdpFRaQah9QPuH2ltRGF", "comment": " @stvbrsn  I like the vivid dreams and hideous nightmares that some meds give me. I do not know why. I just feel so RELAXED when I finally wind down.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzS_Sf0xX0BI1-yOxZ4AaABAg.8GcRuQMSx478vbbzfBMtpi", "comment": "Probably not", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzbTMimOvMbaycSsxd4AaABAg", "comment": "I want to go to Stanford now.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxd_qBwP5YLNviDx5Z4AaABAg", "comment": "I love this guy ... everything I've seen, heard or read of his is brilliant, human and to the point - of everything that is wrong with this planet and its dominant species.  How did a Robert Sapolsky even come to exist or get such prominence in a world that pretty much goes against everything he says, i.e. proves?  I really appreciate Stanford for making these lectures available, and I just wish there were more books and videos available from Dr. Sapolsky.  We all need to hear this stuff.", "votes": "15", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgyF6GISe72s0ikzEyh4AaABAg", "comment": "Me too! It is very very interesting!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxm5Mz5gQyUrs3PwBJ4AaABAg", "comment": "I am indeed trolling, and I am trolling for health for all. ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxmBlBmiyvmdCbkdOZ4AaABAg", "comment": "\"Medical schools need to incorporate the part of the brain that covers emotions.\" Yeah, only it isn't that easy since it isn't one part of the brain that controls emotions. \"What happens when the CRH gland is removed?\" You mean the PVN of the hypothalamus? Well, its mainly involved in stress reactions in humans (through the HPA-axis, google it), so I'm guessing you'd disrupt the regular stress responses (especially the long term). \"Pharma drugs need to be abolished \" Not sure if trolling....", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwcs2VZ_iilSlhJjzh4AaABAg", "comment": "Pharma drugs need to be abolished together with alcohol, tobacco products and street narcotics. ", "votes": "2", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwlezcEKLbaSWCekL94AaABAg", "comment": "What happens when the CRH gland is removed? There are mice who have no CRH gland, they were bred that way to see what happens. The result was they have no fear at all. What if this gland is removed in human brains? Was there ever a patient who had this gland removed because of a tumor or accident? I saw a girl on TV once who had no fear and felt no pain at all. Everybody loved her because she never developed a defense mechanism against offenses. She was totally welcoming to all individuals. ", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz2UZvd5RwVkkvAiD14AaABAg", "comment": "Medical schools need to incorporate the part of the brain that covers emotions. This is vital. If this is ignored in medicine study programs people will not understand the importance of emotions and how it all ties in with the environmental influences of an individual. ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg", "comment": "Can we get access to the extended notes?  ", "votes": "19", "replies": "7", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgycnRdcjE3IO9TMwkt4AaABAg", "comment": "I'm a graphic designer. I watch these lectures to extend my understanding. I love this man and his ability to make the complex accessible. I suddenly feel out of my depth...", "votes": "49", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwRsPXwwcEGAatQtK54AaABAg", "comment": "Love the attitude mate, Sapolsky is boss, and the fact he increases interests into these subjects is good for philosophy and appreciation of eachother and how the world works. Biology and its branching diciplines ftw :)", "votes": "20", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz18zv6JgAWcAeLYd14AaABAg", "comment": "Nice. Thanks.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwq1VleGJcKw8-NR_94AaABAg", "comment": "Robert Sapolsky is funny, interesting, passionate, and simply put - Stanford's gem. I, not unlike many of the viewers here, did not major in any of the life sciences, but after watching this amazing hirsute (I mean this in a good way - I think he looks cool !!!) professor teach and lecture about what other laypeople may deem as dull i.e. limbic system seem like the greatest show on earth, I don't think I'm crazy by saying that this lecture series has changed my life. I'm hooked !!!   ", "votes": "5", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx43z8Oo6Ui6rDCIUJ4AaABAg", "comment": "Does anyone know where we could find the extended lecture notes he mentioned or other related course material?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwN5NYDQOjfTsDpiLJ4AaABAg", "comment": "heavy theory, not so much specifics, mucho enjoyable.", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzF0EhR-X0TaOCTlWx4AaABAg", "comment": "Interesting thought, based on what what knowledge did you arrive at it? ;)", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx6vx1bJJvqymuUOZJ4AaABAg", "comment": "He's being so careful and clear to distinguish between state (or even simple state change) and process -- this is beautiful, lucid teaching about the regulatory mechanisms.  Highly recommended for lecturers as well as students.", "votes": "74", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugyavo_NutFpBwgLJP54AaABAg", "comment": "this is one of my favorites lectures of the whole course. ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugz0O9F43MPaDd0eHe14AaABAg", "comment": "he is referring to his book, \"Why Zebras Don't Get Ulcers\". You can find it in Amazon new for about $14 and used for about $6. And it's really good.", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwjUEswBAQfQnfLvad4AaABAg", "comment": "15 minutes gone. Camera man has evolved to this video and the disease has got the better of the girl with the cough...", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxd_qBwP5YLNviDx5Z4AaABAg.8Gbbwl3mjw69fwhmAqeyNB", "comment": "Microwave auditory effect Frey affect radio-frequency hearing artificial telepathy artificial voice to skull to be addressed targeted individuals lives are depending on it! Find the cure make it public knowledge..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxd_qBwP5YLNviDx5Z4AaABAg.8Gbbwl3mjw69fwi3EPP3RT", "comment": "Microwave auditory effect Frey affect radio-frequency hearing artificial telepathy artificial voice to skull to be addressed targeted individuals lives are depending on it! Find the cure make it public knowledge..", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwcs2VZ_iilSlhJjzh4AaABAg.8GcJJLT6Cbx8vbc6YGvP_l", "comment": "Yr prolly a blast at parties huh", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwcs2VZ_iilSlhJjzh4AaABAg.8GcJJLT6Cbx9QPuq7SupXJ", "comment": "I’m of the opinion that a lot of so-called doctors should get off their fat asses and do some due diligence on the drugs they prescribe. Research them. Don’t think the pharma rep is a good source of credible information.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi90OWQog7H5-", "comment": " @gotterdammerung5932  This looks amazing, but the website is paid, and even saying \"30 days free trial\" it asks for your credit card. I wonder if some altruistic soul could upload this somewhere else. :)", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi96YrpHkWvC-", "comment": " @reversebanana  Thank you, man. Thank you so much.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi98v0ntAGQWj", "comment": " @reversebanana  thanks dude.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi994x3lSW_8C", "comment": " @reversebanana  thanks a ton man, you're the best.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi9A4Qpzld4on", "comment": " @reversebanana  Many thanks to you man!!! This is awesome!", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi9GkRHinOjf3", "comment": " @reversebanana  thanks!", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzUBTKW5VQC1xrqkSJ4AaABAg.8GbwoFXfJmi9dcLVJbDdDh", "comment": " @dyno2079  I can't see the comment anymore, do you know where I can find the resources", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx6vx1bJJvqymuUOZJ4AaABAg.8GcQb5l18_Q9X9kelViIWS", "comment": "Lies again? Aspirin + Nurofen", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugy8RDHpi77vJeSl_IZ4AaABAg", "comment": "Is there anywhere I can get the extended notes he mentions? And what is this \"Zebra\" he keeps referring to?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxcu4x5tJX-4q7_Izx4AaABAg", "comment": "I listen to him like a yoga class.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxIbxLHxsKLnYa_qkh4AaABAg", "comment": "yeah i ddin't understand much of waht the other dudes were talking about lol, or at least didn't feel inclined to pay as much attention", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxadCU18oZrIj-cQvB4AaABAg", "comment": "PUH! Finally Sapolsky!", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwv7kA6JAaOpXHDogB4AaABAg", "comment": "I'm sorry to say but society called and they don't accept douche bags. Hope you weren't being sarcastic. ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzaK8NI8hoJC5OQC014AaABAg", "comment": "I have aspergers which is an autistic spectrum disorder and I went out the week before last, approached several women and got a perfect ten, can you with your oh so advanced average neuro-typical social skills do that?", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwJshU6BPF94lE_b9d4AaABAg", "comment": "I'm studying psychology at Virginia tech with a focus on neuropsychopharmacology. Ya, it's a real field.   I dream of doing research with Stanford and teaching at schools like it.   The brain is the most amazing thing on this planet. I will study it until the day I die.", "votes": "0", "replies": "2", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgysIjZrfJSOCH5oMxp4AaABAg", "comment": "My mind has been blown.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwwPIbAEdfvwSf1Osp4AaABAg", "comment": "hah yeah.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzTXt8_98NZos7qtZV4AaABAg", "comment": "Ever notice when your half asleep you think thoughts that make absolutely no sense at all? lol. I can't even remember what the thoughts are, wish I could", "votes": "1", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugwl6jFqmZHUsq82n_14AaABAg", "comment": "@OrusaiiZentuAkuu LOL ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx9gXA_y77WQYbBjON4AaABAg", "comment": "I have absolutely no background or previous interest in any of this stuff, but these lectures are brilliant & I'm hooked! :D", "votes": "89", "replies": "4", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugw9MJg4EaB7aAnsPLF4AaABAg", "comment": "@mbhorsten That's it. This is the \"zebra book\" indeed.", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwdM8WTqmil-L7LKER4AaABAg", "comment": "Very intellectual man.", "votes": "2", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwefuKmM38HxB0Shuh4AaABAg", "comment": "@leegee23 I think it's Why Zebras Don't Get Ulcers, by R. Sapolsky (available on Amazon).", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxt8vXBksQkqIhalMd4AaABAg", "comment": "Excellent job. Really interesting stuff imo, although I'm only 16. If only this was out when I was 11.", "votes": "1", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwDOdwZTuWSzXnANVx4AaABAg", "comment": "@ScaryMaryCherry   If you can understand him, you are not too dumb for any reasonably decent university. If it were up to me, I'd have any extra-mural university provision mandated to use videos like this man's lectures - because they are good and clear. What you learn from them may not qualify someone for working as a medic, but the background you can get from these lectures along with reading the books suggested for the courses is very good and would provide a good basis for advocacy work.", "votes": "0", "replies": "1", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwHxyVqMLIgp2tDOAZ4AaABAg", "comment": "Sapolsky is a great lecturer. He makes complicated things easy to understand. Simply excellent videos.\r (I could never study this myself because I'm too dumb to even get in to any decent university out there....). I'm very grateful that Stanford University wants to share these videos. A BIG thank you to both Robert Sapolsky and Standord Unviersity for sharing and helping people (in situations like myself) to learn exciting things without the ability to attend universities.\r ", "votes": "7", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwK2a1TS3OF4dEgl0J4AaABAg", "comment": "beautiful\r ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgxXdI8Y84r4mS5WoCh4AaABAg", "comment": "you gotta give him that he has a nice flow", "votes": "12", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgwJshU6BPF94lE_b9d4AaABAg.8Gb_O5BwM9R9ZS29HfZZ8g", "comment": "How did it turn out to this day?", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwJshU6BPF94lE_b9d4AaABAg.8Gb_O5BwM9R9_XynSkiqy-", "comment": " @lovis651  Not like I expected. Money has hindered me at every turn.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx9gXA_y77WQYbBjON4AaABAg.8Gc-AM6UkKF9PP3LZ-IHu6", "comment": "Indeed bro gc", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx9gXA_y77WQYbBjON4AaABAg.8Gc-AM6UkKF9_Rb5Xx30Bu", "comment": "Its so rad", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx9gXA_y77WQYbBjON4AaABAg.8Gc-AM6UkKF9bEiIg0bSVW", "comment": "Yes!  They are amazing 😍", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugx9gXA_y77WQYbBjON4AaABAg.8Gc-AM6UkKF9tV-fWPbOXc", "comment": "The magic of a good teacher. I'm happy we have this, but at the same time, sigh for all the thousands of classes happening right now where it's just dull and confusing information going in and out of the brains of a really tired group of students", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "Ugxt8vXBksQkqIhalMd4AaABAg.8GbdaECFUOd9WUZjaVuB7K", "comment": "hey if you read this by any chance, how are you doing now?", "votes": "1", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgwDOdwZTuWSzXnANVx4AaABAg.8GbUwBphZRU8davzh1J5_k", "comment": "psychobollox i wish there were more people like you in the world.", "votes": "0", "replies": "", "reply": true}, {"vid": "kAfz0yAcOyQ", "cid": "UgzbwQkQQKTDwCN3PYh4AaABAg", "comment": "Human behavior is very complex relatively & every action reflects new thoughts. ", "votes": "0", "replies": "", "reply": false}, {"vid": "kAfz0yAcOyQ", "cid": "UgzkvU8qle7Seo1FVKd4AaABAg", "comment": "excellent prof.", "votes": "0", "replies": "", "reply": false}]