[{"vid": "KHkNrbSKFic", "cid": "Ugxw0tQRXBzGT_PTqxh4AaABAg", "comment": "40:47  why are we talking about the ΔH of overall reaction,  when the concerned ΔH in Van't Hoff equation is the one associated to K_1 ?  In the product formation rate law we talked about K1 (i.e. equilibrium constant of the first elementary reaction) !", "votes": "0", "replies": "", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "UgyZm-yOiVjTOBC9Hvt4AaABAg", "comment": "Who chaptered this  video?  Arrhenius is being spelled Irainous which is heinous and 100% erroneous and the lecturer makes the point A is for Arrhenius, e for ln and Ea for Activation Energy!  Even more seriously as an ardent student of Pedagogy or Andragogy does she not worry that only half her students do not understand that A and Ea do not vary with Temperature in K? The clicker result should not be any excuse for steaming ahead with half the class asking \"what did I misunderstand?\"  Come on MIT!  AND at 38 minutes   K1 and k1 appear to be used but K2 in a chemical equation?    The student who say \"we crossed off the ... \" is not developing her chemical explanation rather using a lazy mathematical way of speaking about the effect of something being near zero.  \"Who likes that explanation?\" might be a good question for the lecturer to ask the class at that time...that way everyone benefits and the student answering gets immediate feedback.  But I do like \"A is the rate of reaction at infinite temperature\"", "votes": "0", "replies": "2", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "Ugx3t2zb0I3W9_fLsNZ4AaABAg", "comment": "You could have chosen a better example than 2 methyl groups reacting. May be H2+ I2 will be a good example.", "votes": "0", "replies": "", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "UgzyBe74GsJIuCDhFRt4AaABAg", "comment": "Is it 12 class or not?", "votes": "0", "replies": "2", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "UgwhxGDKJ6fD6UGCiFJ4AaABAg", "comment": "What a lecture  Boon for those who can't afford and who are in Lockdown", "votes": "2", "replies": "1", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "Ugyyoyw0B-FZDl8v7QN4AaABAg", "comment": "you can tell by her delivery that not only does she lover her work but also conveying it to the students", "votes": "0", "replies": "", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "UgxzeAeGk5WQ419HcgJ4AaABAg", "comment": "somehow this turned into a motivational video. nice", "votes": "2", "replies": "", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "Ugx1gHMDHJOlZjTpxAx4AaABAg", "comment": "Just to let you know that your work is being appreciated ! Thank you for the courses!  By the way, the teacher is AMAZING", "votes": "9", "replies": "", "reply": false}, {"vid": "KHkNrbSKFic", "cid": "UgyZm-yOiVjTOBC9Hvt4AaABAg.9hS-OZ75EOc9hSA0emPa61", "comment": "Those chapters are auto-generated by YouTube. Please take up your spelling issues with the YouTube Gods 🙏🏻😉. If you can generate a better chaptered video list, we will gladly update the description with it. 👍", "votes": "0", "replies": "", "reply": true}, {"vid": "KHkNrbSKFic", "cid": "UgyZm-yOiVjTOBC9Hvt4AaABAg.9hS-OZ75EOc9hiY_ugk9y2", "comment": " @mitocw  thanks for your reply, nice to know you're listening.", "votes": "0", "replies": "", "reply": true}, {"vid": "KHkNrbSKFic", "cid": "UgzyBe74GsJIuCDhFRt4AaABAg.9UaPHP4x6399Xypz-DVtRQ", "comment": "for jee advanced it is", "votes": "2", "replies": "", "reply": true}, {"vid": "KHkNrbSKFic", "cid": "UgzyBe74GsJIuCDhFRt4AaABAg.9UaPHP4x6399Xyqoy7a988", "comment": "@Ravinesh Singh  Thanks a lot, bro.", "votes": "0", "replies": "", "reply": true}, {"vid": "KHkNrbSKFic", "cid": "UgwhxGDKJ6fD6UGCiFJ4AaABAg.9Nc27ACLRaOA61GsBDmpMJ", "comment": "Man, MIT adapts its tuition fees, depending on the income of the student parents", "votes": "0", "replies": "", "reply": true}]