[{"vid": "kVu37T6sB_E", "cid": "Ugxa7CgIapqNTESx9HJ4AaABAg", "comment": "47:02 it worked :) sickle cell disease is cured", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugx2SXr4Lkgp1VLPU8Z4AaABAg", "comment": "Thank you so much <3", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugz4UTaQR7z02Li_uBp4AaABAg", "comment": "Lol 2018 lectures talking about crispr being successful wowie", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgyLcBVmAcgGfJMWYj94AaABAg", "comment": "okay?", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgwtQUHTbojJhmbiqNJ4AaABAg", "comment": "(On Friday of February 3, 2023).  Recombinant DNA, Cloning, and Editing on the Overall Subject Matter of Molecular Biology (MIT Introductory Docency of Biology): 1) Cloning is the Process of DNA (Genetic Purification) Segregation (Identification and Propagation) and Homogenization of Genetic Matter; a) Chromosome (Nucleoid Nucleus of Prokaryotes) Plasmid Cassettes of Bacteria (Antibiotic Resistance Mechanism) in DNA Form (encoding Thereof); 2) Cloning Steps (Process); a) Cut DNA by Restriction Endonuclease (DNA Specific; EcoR1 for 5'3;GAATTC;3'5'CTTAAG Sequences; 5' Overhang with Sticky Ends) or Kpn1(Sticky Ends and 3' Overhang) or EcoRV (Blunt Ends); b) Vector (Plasmid with Origin of Replication and Elongation of) and Insert (Foreign DNA as In Eukaryotic to Prokaryotic; DNA of Interest); c) DNA of Interest Investigations; b) Mixed Pieces will have Base Pair Complementarity Affinity and Unity Thereby (5' Free Adenine Phosphate and Absence of Covalent Bond within the Nucleotide [Endonuclease Reaction]; also there is 3' Hydroxyl within the Adjacent Nucleotide) of the Top Strand [Idem for Down Stand in Palindromic/Complementarity]); c) Ligation via DNA Ligase will Catalyze Bonding Reactions of Covalent Bonds Type thereafter, Namely Phospho-diester Bonds; 1) This can also be portrayed as Recreation of the EcoR1 Site; d) Selection of DNA of Interest or making of a DNA Library (Multiple Possible Phenotypic Manifestations for Which Selection is also Possible);  1) Screening is the Selection of a Phenotype/DNA Recombination of Interest (Genotype Modification) that Meets the Criteria Of the Study (Perhaps the identification of a Protein Of Interest); b) Selection would involve the Phenotype/DNA Recombination Clone Selectivity via Environmental Selection (Medium Alternation to Where only the Cloned Desired is promoted and all other Excluded);  c) Antibiotic Resistance Mechanism is a Possible Selection Mechanism; 1) Transfection of Antibiotic Resistance and Selection Thereby; 2) Functional Complementation where an Auxotroph (Mutant Organism who Fail to Produce A Nutrient [Induced Deficiency]) or Prototroph (Self-Sufficient Organism); b) Leucine Auxotroph Transformation (Transfection of Leucine Prototroph Gene Attributable to Metabolism); c) Selection for a Defect-Rescued Organism (Via Culture Selection); c) Yeast Cell Cycle Mutants (Temperature Sensitive Mutants) is Conditional for Temperature.  1) Paul Nurse (2001 Noble Prize Laureate) Cyclin Dependence Kinase in Humans (Genetic Assessment and Identification) 2) Rescuing Phenotype Of Transfected (Laboratory Modality) Mutant Yeast to the Point of Rehabilitation of Previously Mutant Yeast; Polymerase Chain Reaction (PCR) is an In Vitro Approach of DNA Amplification (Denaturing [Enzyme and Heat De-combination], Recombination [Forward/Reverse Primers], Annealing (DNA Polymerase Addition; Function of Repetition); 1) DNA Specific; 2) Amplification thereof for Positive Identification; Genome Editing (Genomics and Gene Engineering; also known as DNA Recombinant Technology; 1) CRISPR CAS-9 Gene Editing Modality (DNA Excision); a) Double Strand Breaking (DSB); b) Cleavage Specificity Modality and Mechanism; c) GAATTC is not Human Specific (1/4096 Plausible Sites); d) RNA-Guided Endonuclease (Cas9) implies the Sequence of the Gene or Area of Gene is known (mostly a theoretical Approach but Improved Genomic will assist); d) Human Genetic Disease Correction or Reversal via Gene Editing in clinical Trials and Ultimately the Vanguard of Medical Therapeutics; e) Bacterial Antiviral Mechanism (Monera Immunology Specifically Anti-virus) by Specifically Bacteriophage viruses de-combination by Clusters of Repeated Interspaced Short Palindromic Repeats (CRISPR is Pathological DNA Sequences Identification system); b) Heritable Immune System of Bacteria Transfection to Human Cells for Therapeutics possible of DNA Excision and Introduction;   PhD Adam Martin, es sehr gut zu lehren Wiederstellung Der Maennern weil Mensch soll nicht Krankheit und Armtum Sein.  Heil!", "votes": "2", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugz8EbnYIZkF4WmtOpx4AaABAg", "comment": "so good! learned a lot from this lecture :)", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgwQrRSiAGkSDcOjdbR4AaABAg", "comment": "absolutely loved it !", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgyU7bmNYqLvmtL5ohh4AaABAg", "comment": "Thanks 👏", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgwL3sv68QwlPEnHJoV4AaABAg", "comment": "Does anyone want to talk about Steven? I’ve had so many Stevens in my life. They keep us sharp and humble.😹 Thank you for the lecture . Flu shot is not for Me but other than that, thank you so much for such a detailed look that answered many of my questions!", "votes": "2", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugwq1PqIAtImnLworwF4AaABAg", "comment": "This lecture is very nice but not totally explained..", "votes": "2", "replies": "1", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugw7P-GhG6aYLUDQTal4AaABAg", "comment": "MIT lectures are always very easy and informative , please keep adding more.", "votes": "15", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugw27lWnlfHj1fLSmXV4AaABAg", "comment": "Plasmids...in bacteria....gives antibiotics resistance Eukaryote dna? Nuclease. Cut dna Ndonuclease..middle chop Ligated Nucleotide sequence... Nucleic acid Phospho diester bond.. Cleave with ecor R1 enzyme.", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgxygUjbppeZNBg85614AaABAg", "comment": "Thank you, but stop promoting vaccine to healthy, young people.  They do not need it.", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgxtTSoQId8gNAZKhG94AaABAg", "comment": "Clear, concise and build up of knowledge is perfect for students. I watched this and found it enjoyable so far.", "votes": "7", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgxnqcVweBjiZGyW-E54AaABAg", "comment": "Is there full course of genetic engineering lecture series?if yes than please post it.", "votes": "4", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgwafoTH_93Xuf1S3Od4AaABAg", "comment": "Lookup Donald Marshall and read his proboards. Help stop human cloning worldwide.", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgziCVWCGkvyuzrDb1Z4AaABAg", "comment": "thanks for  this , very helpful", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgwZpmUDmbLB-fbzp_V4AaABAg", "comment": "Ahh... I remember it's been decades since the concept of in person lectures... Sniffle sob it's like I'm in the lecture hall with him.", "votes": "17", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgzmF1mfopc7EGKQhhN4AaABAg", "comment": "they guy is a legend in explanation! Really good, really thanks cause I need everything for my research!", "votes": "15", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugw9EIZbsBojizRW0a14AaABAg", "comment": "Interesting CRSP to the moon lol.", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugwq1PqIAtImnLworwF4AaABAg.9_MlMkEhytK9tfwpnHnmG8", "comment": "Read !, teachers don’t explain it all in 50 min", "votes": "1", "replies": "", "reply": true}, {"vid": "kVu37T6sB_E", "cid": "UgwoT7cuF83MuHNSx194AaABAg", "comment": "Great job, professor. Thanks........A lot.💯💯", "votes": "7", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgyVBHVwvhRvPqCm60h4AaABAg", "comment": "Can bacteria produce big human proteins like p53 using this technique?", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugy08-Y1mjRAdaurgx14AaABAg", "comment": "Expert!", "votes": "0", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgzmbFqunbUqzNPniGZ4AaABAg", "comment": "Thank you very much 🙏", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "Ugx4YXo_bDEj59CNf1V4AaABAg", "comment": "This was a great lecture about the baseline of most things that is going on in genetic engineering at the moment. It was well phrased and well taught. Keep up the good work.", "votes": "3", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgxbpL_s7HnbtMl0Aot4AaABAg", "comment": "User with username: kdrl nakle (at the time of me making this comment) has commented negatively in similar respects for videos: 13, 14, 15 and 16 and probably more but I encourage you to take their comments with a grain of salt as it appears as though they have a bias against this particular professor.", "votes": "1", "replies": "1", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgyGle5h6zu9NwzqYmp4AaABAg", "comment": "Thanks sir", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgxkEhU28ffzLEY9sCd4AaABAg", "comment": "Very interesting lecture!", "votes": "1", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgyT1JzHj9zIl_kPgOZ4AaABAg", "comment": "appreciable lecture ❤️💕 Loved it sir & thanks for clearing my concept about rDNA technology ( love from pakistan ).", "votes": "6", "replies": "", "reply": false}, {"vid": "kVu37T6sB_E", "cid": "UgxbpL_s7HnbtMl0Aot4AaABAg.9F0XFWe6SqU9PV8QW9RAsM", "comment": "😁😁😁😁", "votes": "1", "replies": "", "reply": true}]