[{"vid": "l-BNoAPe6qo", "cid": "Ugx3zACpPkxs1sUP67x4AaABAg", "comment": "🙌", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgyYDG_5d3ug6wpDBYF4AaABAg", "comment": "the electron source was metal plates or ionisation of gas taken in the tube?", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxJHWniagFdqt0mSYZ4AaABAg", "comment": "14:36", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugxj-PvBMdUJWxHMGTh4AaABAg", "comment": "It's amazing that as someone who is not able to go to a college  can still learn all of this", "votes": "6", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxB0CJtqdYG6mKDOWl4AaABAg", "comment": "Is there any Indian?", "votes": "1", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzNt4VYnzUMxPgDIBx4AaABAg", "comment": "Can anyone tell me where did that 119 came from", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgwF6l0TCLyimb2UlKp4AaABAg", "comment": "Shouldnt the count rate decrease after placing the gold foil in front of the path of alpha particles due to the 20 a particles scattered ???", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugw5GMU86UOrHjillSZ4AaABAg", "comment": "Good lecture and funny experiments !", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugxq6UJSz206eGqkMS94AaABAg", "comment": "At 6:26 , I guess that was a team of crooks , faraday and plucker instead of jj thomson .", "votes": "2", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugy3jKqOEEOzx18aOtJ4AaABAg", "comment": "the professor with the baby that is so sweet to see a women in a position and still able to fulfill other aspirations", "votes": "5", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugzzv81JWFk3j7Wlq3p4AaABAg", "comment": "How did jj Thomson associate the negative particles of cathode rays as the negative charge present in an atom.", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzBcyf1pAZC5IAZXO54AaABAg", "comment": "After all this i have a question.....what did Rutherford die from?", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzA4aFVcsOSF-u_ZMx4AaABAg", "comment": "Nice lecture, but, how did we have equality in 13:08, since  we know only analogous relations for Δx+ and Δx- and in the right hand side of the equality there are the same terms that were introduced in the analogous rlations ?Is there some kind of constant that turns both analogous relations for Δx+ and Δx- into equalities, such that it cancels out whem we try to find their ratio?", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgyC9IuU4LaYw-WjPsN4AaABAg", "comment": "Rutherford was born in New Zealand.", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugx51JBIUoAvr0HP9it4AaABAg", "comment": "Lets introduce ourself ?", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgwcFj-8YgWUlOpEf_h4AaABAg", "comment": "Here is a good alternative to this lecture: https://www.youtube.com/watch?v=qvacRFEjUWk&t=962s", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgyrDQ7I5P-BGOKC3Il4AaABAg", "comment": "great. Thomson called the particles \"corpuscles\", but scientists later referred as electron. thanks", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxBpw4Z3rJTocEt-kt4AaABAg", "comment": "Why dont we have such universities in Developing countries like Pakistan?", "votes": "1", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgweYalK1_sP84hLvJp4AaABAg", "comment": "can't believe we have free access to this, thank you so much!", "votes": "17", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgiKx_8N5fRk9HgCoAEC", "comment": "In the Rutherford experiment conducted in the class we could count the number of balls in the matrix 119 but how Rutherford did in his time? and how did he know how thick was the golden sheet.", "votes": "4", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxB0CJtqdYG6mKDOWl4AaABAg.9f4ThnXhdjh9mPE8cpoZvo", "comment": "🙋‍♂", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgxBpw4Z3rJTocEt-kt4AaABAg.8bwAa7mWnvZ8m9A5YylW9C", "comment": "israr karim also in India", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgikGqbeQpfplngCoAEC", "comment": "Amazing and unorthodox teaching", "votes": "2", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UghixJkh6QvqangCoAEC", "comment": "Could someone tell me why there were the same quantity of alpha particles between with and without the gold sheet if there were backscattering with the gold sheet?", "votes": "6", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UggC-2P0-xuxh3gCoAEC", "comment": "Is there a reason for using triple less than or greater than signs? <<< and >>>? Is this common in chemistry? I have a pretty high mathematical background and it just irks me to see it used like that unless it's an actual well-known notation (haven't seen it in my basic chemistry books or online so far). Just curious... especially because in computer science this is normally the bitwise shifting operator, so I'm struggling to find the exact description of the operator... don't want to use it unless I can back it up; otherwise I need to know so I can define it if necessary to use it.", "votes": "0", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC", "comment": "Rutherford was born in New Zealand, he wasn't knighted, he was made a lord. The story about the operation is utter hogwash", "votes": "5", "replies": "6", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugiv6OuE_RoakXgCoAEC", "comment": "nice mama!", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgisE4Wb8ES_-HgCoAEC", "comment": "what did she mean by: this isnt significant but it depends on what....", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgjKvqBk20aaF3gCoAEC", "comment": "I think I am a little bit confusing over how the discovery of Rutherfold's postdocs led to those conclusions. I don't think the lectuter's being really clear?", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UggaoTPRtyykHHgCoAEC", "comment": "thank u so much .........", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugj2pTvTISa4dXgCoAEC", "comment": "Hi there, can anyone tell me what's the purpose of the anode in the cathode ray tube ?", "votes": "0", "replies": "4", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UggF4pa4jBlh1XgCoAEC", "comment": "Wow. This instructor is disappointing. The number of errors she makes is unacceptable. Even minor mistakes can lead to people having the completely wrong notion of things. For instance, she implies that Rutherford is English because he was knighted. WRONG!!! He is from New Zealand. Early on she suggests that because a student ate plum pudding that they were better traveled. Having ate plum pudding does not require that one travels the world to do so. It is not so important what one things, but HOW one thinks. Her actions suggest that the HOW is highly questionable and someone better suited should be teaching.", "votes": "1", "replies": "2", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UghsGG4-UCUZ5XgCoAEC", "comment": "Totally helped me, thanks MIT, thanks Catherine & Elisabeth.", "votes": "7", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugg8L-Ng5oW5s3gCoAEC", "comment": "Nobody loves William Crookes!", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugj2HVhyKx1orHgCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again.", "votes": "9", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugj126xtEZ9v03gCoAEC", "comment": "Eu amo muito a Laryssa, minha linda namorada.. <3", "votes": "1", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugi_j5qqw3azxHgCoAEC", "comment": "i came here to actually learn the logic behind all that is known in chemistry but i find the lectures to have more of a result giving explanation rather than starting from the root.. alpha paraticle? ok, i just learnt that it is made of 2 protons and 2 neutrons, ok, but why do we say that there are negative and positive particles? how is it that RdBr can give out 132.000+20 alpha particles per minute? since each alpha particle has 2 protons, 132.020×2= 264.040 protons per minute.. i dont think RdBr has that many protons in it... – Now, listen carefully, i have just realised what i was missing with that last statemeny of mine, the RdBr used was not a single molecule, rather, loads of molecules, so thats how there comes out so many alpha particles.. This could be told about in the lecture.. i think that things must be based more on logical explanations rather than \"well this is like this, so memorize\" ", "votes": "3", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgiilMxJNNg6KHgCoAEC", "comment": "Surely, referring to the \"beams of positive particles\" (Goldstein),  \"These rays are beams of particles moving in a direction opposite to the \"cathode rays,\"", "votes": "7", "replies": "2", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugh8nhKu7xlPEXgCoAEC", "comment": "Wow I wish I could go to school there.", "votes": "2", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgidLmtAraXihngCoAEC", "comment": "I have to repeat my post, as no-one has posted.  How can the ray of positive particles move in the same direction as the electrons?  Surely they should move in opposite direction, thus not being able to be detected on the fluorescent screen as in the schematic diagram used in this lecture. Any replies opinions appreciated, mark, and a BIG thanks to mit chemistry dept for posting.", "votes": "8", "replies": "2", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugwfwc2jgP4nR2q4xKl4AaABAg", "comment": "Tim Tebow would have missed the whole frame with his ping-pong ball.", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgwoP9m1duDuIUWudZ54AaABAg", "comment": "Question: How did Rutherford find out the total area of atoms while searching for back scatter probability? The Prof in this video rightfully knows its 266 in her experiment, but how did Rutherford know?", "votes": "6", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UghixJkh6QvqangCoAEC.8RHYB6JEhRp9TneYd7EoRg", "comment": "I think it's that the value mentioned is just an estimate. Radioactivity is a random process, and it's hard to determine the exact instantaneous rate. So if there were fluctuations between the value of 132000, and some 40 or 50 of the particles deflected away, they would not be able to detect it because it is such a low fraction.", "votes": "1", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UggC-2P0-xuxh3gCoAEC.8QAutOshUQQ9d9zEa3wg7W", "comment": "It’s just to emphasize how much smaller the electron is. It’s art dude", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC.8NJ0zBaJ1Fk8QAzLzupe5k", "comment": "Everywhere I read he was knighted (yes, as well as a lord)... so... I guess you could cite the 1 article out of 200+ that say's otherwise? He was indeed born in New Zealand from what I saw, and he also died of a strangulated hernia complication. As to the whole \"no doctor for a knighted person unless they're also knighted\" who knows, probably one of those urban legends or passed down in various books and such. All in all is this really the most important topic on a discussion of chemistry?", "votes": "2", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC.8NJ0zBaJ1Fk8QBF7mdGDhU", "comment": "*says  Citations?   All science is either physics or stamp collecting. ; J. B. Birks Rutherford at Manchester (1962), Oxford University Press  Ernest Rutherford, Kevin Boon, 1991, Nelson Price Milburn Press  Ernest Rutherford, Susan Ratcliffe, Oxford Press, 1962  Ernest Rutherford Resonance, 2011, Vol.16(11), pp.1007-1018, Nagendrappa, Gopalpur   Ernest Rutherford, Elizabeth Knowles, 2014, Oxford University Press  Ernest Rutherford, Physics Today, 2016 [Peer Reviewed Journal]  Ernest Rutherford, John Pearson, Great Neck Publishing, 2006  Ernest Rutherford : and the explosion of atoms, J.L. Heilbronn, New York : Oxford University Press 2003  Ernest Rutherford and the Birth of the Atomic Age, John Peters, School Library Journal, June, 2013, Vol.59(6), p.148(1)  Ernest Rutherford Science and Its Times: Understanding the Social Significance of Scientific Discovery ISBN: 978-0-7876-7724-4   https://www.chemheritage.org/historical-profile/ernest-rutherford  https://my.christchurchcitylibraries.com/ernest-rutherford/  https://www.britannica.com/biography/Ernest-Rutherford  http://www.biography.com/people/ernest-rutherford-39099  http://www.teara.govt.nz/en/biographies/3r37/rutherford-ernest  http://www.nzedge.com/legends/ernest-rutherford/  http://www.rutherford.org.nz/biography.htm  Now, please show me the \"200+\" articles you mention.", "votes": "1", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC.8NJ0zBaJ1Fk8QBFG5mE9lc", "comment": "Your very first article... \"he was made a knight and then a peer with a seat in the House of Lords. For the ultimate honor he was buried in Westminster Abbey.\"  Made a knight....  knighted....  Your second article: \"In 1914 Ernest Rutherford was knighted\"  Third article: Yes, no mention of knighted is made in this one, that does not mean he wasn't however (lack of evidence is not proof of the lack of something, argument of ignorance). In your case you're trying to assume that \"he was not knighted\" is true, based on the lack of evidence stating he was knighted. Logical fallacy. Yes, we cannot assume either that he WAS knighted from the lack of evidence against it (i.e. since it doesn't directly say he wasn't knighted). But I'm not assuming he was knighted from this article alone, I'm assuming it from the various mentions in other articles... some of which are the articles you've listed.  Fourth article: \" In 1914 he was knighted. In 1931, he was elevated to the peerage, and granted the title Baron Rutherford of Nelson.\"  Fifth article: \"Rutherford was knighted in the 1914 New Year's honours list,\"  Sixth article: No mention, once again see third article description above.  Seventh article: \"Rutherford was knighted in the 1914 New Years Honours list and visited Australia and New Zealand for a scientific meeting and for a family reunion.\"  DId you even read these articles? I never said he wasn't a Lord. He was both, a Lord AND knighted. You are the one who refuses to accept he was knighted for some reason, despite giving 5 articles that literally say \"[Rutherford] was knighted\". I would find it hard to insist he wasn't knighted after all the articles I've seen (including the ones you've listed).  Also, clear he died due to a hernia type complication (once again stated in quite a few of even your example articles), or some reason related to the hernia (at least very likely). I already said the whole \"Doctors with titles could only operate on patients with titles\" was likely a myth, so I do agree with you on that part.", "votes": "1", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC.8NJ0zBaJ1Fk8QBK1DF3r8E", "comment": "You are such a liar...my first few articles cited are physical books in The Victoria University of Wellington library. What an arse.", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC.8NJ0zBaJ1Fk8QBKqaDgEx5", "comment": "So you've resorted to name calling. I ignored the cited books and said \"articles\" for a reason. They were your easily view able website articles.... hence why I did not say: \"book\", I clearly said \"first article\". Although I suppose this clears up any confusion since it is now clear the 7 articles I was referring to were the website links at the end of your citation list.  There's plenty of evidence saying he was knighted, you've yet to show me any implying he wasn't. Again, lack of the phrase \"knighted\" does not mean he wasn't knighted, just like the lack of the phrase \"wasn't knighted\" does not imply he was. To do so would be silly. For example:  In your articles that don't directly state he was knighted I could argue: \"You article doesn't say he WASN'T KNIGHTED, therefore he must have been knighted, otherwise they would have said he wasn't.\" That is a logical fallacy. The equal is: \"Your article doesn't say he was knighted, therefore he wasn't knighted.\" That is a logical fallacy as well.  The proof I have is that plenty of articles state he was knighted. Unless you find me a nice link stating \"he wasn't knighted\" I can't really agree with you. Also, I think our debate is over since you seem not interested in actual proof or debate (from your angry tone due to name-calling, as if that aids an argument).", "votes": "1", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi7je3euOmERXgCoAEC.8NJ0zBaJ1Fk8V1RQ0q3r7l", "comment": "You comment nonsense everywhere. He was knighted. https://www.thegazette.co.uk/Edinburgh/issue/12647/page/269", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugj2pTvTISa4dXgCoAEC.8IYT_YY-aIM8IpNwmrbY5o", "comment": "In order to accelerate the electrons.", "votes": "1", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugj2pTvTISa4dXgCoAEC.8IYT_YY-aIM8Is2j8c7Co4", "comment": "Thank you so much!!! Im sorry for this again, but so the cathode's the one who shoot and the anode accelerate the electrons? and Why the need to accelerate?", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugj2pTvTISa4dXgCoAEC.8IYT_YY-aIM8ItM4uyuKc-", "comment": "Mobimobipopo  When a current, flows through the cathode, the heat energy is absorbed by the electrons - they become excited. When they absorb enough of the energy that surpasses the amount of energy to leave the metal (the work function) they escape.This is called thermionic emission. The electrons are then attracted to the anode where they accelerate. This is important dependent on what you are using the electrons for. If you are using in an mass spectrometer for example, it is used to fire at atoms or molecules to ionise them (knock off an electron), this allows it to be eventually be detected by a computer and the mass of an atom or molecule can be found.  If the electrons weren't accelerated they would not have enough kinetic energy to knock off an electron off of another molecule. If they were accelerated too much (i.e the anode voltage is too high), the electron may knock off too many electrons and the detector may identify a much lighter element than it really is (As is detects using an mass/charge ratio).  At least this is how I understand it.", "votes": "6", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugj2pTvTISa4dXgCoAEC.8IYT_YY-aIM8IuMAPu60FI", "comment": "Thank you again!!!!! This is wonderful and so helpful!!!! Have a blessed day to you!!! 🙏🙏🙏🙏", "votes": "5", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UggF4pa4jBlh1XgCoAEC.8GnlTCmKGji8HgEOBpxu0Z", "comment": "Really? You think not clarifying the nationality of Rutherford and the global availability of plum pudding ruined this lecture?", "votes": "12", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UggF4pa4jBlh1XgCoAEC.8GnlTCmKGji8JF4D4Lbl37", "comment": "i personally dont care  even if she mention that  rutherford was chinese(who gives a damm ?as that doesnt relate to the result nor to the equation of the  experiment), as far as i know comparing all the  lectures/ explanation on youtube this the only lecture that have a good explanation about JJ thomson experiment which makes this lecture unique as there are no lecture/explanation on youtube that goes beyond the textbook. the textbook doesnt really  explain how JJ thomson concluded the charge to mass ratio. textbook is like blind faith no real explanation that is also true to all the vid about JJ thomson experiment  found on youtube. but this video is an exception due to it's in depth explanation that makes me feel like even i can  reconstruct the same experiment getting the same result thats how good this video is .", "votes": "4", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugj126xtEZ9v03gCoAEC.82qPj27c6L-9K1kuwOOEGL", "comment": "wtf kkkkkkkkkkkkkkkkkkkkkk o comment mais perdido", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugi_j5qqw3azxHgCoAEC.7-H0Z7-O6Ya8jbgJyDgyw2", "comment": "Ameerhun1996  that is why you go to school and learn fundamental rules", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgiilMxJNNg6KHgCoAEC.7-H0Z7-FZ6g8Wl_wpPg85c", "comment": "Emily M LOL but since there's a high voltage applied on other side both the sub particles gonna go in that direction   (-ve particle) to (+terminal) and (+ve  particle) to (-terminal) n deviation difference is based on discovery of radioactivity!!! I mean e-(beta particle) protons (alpha particle) neutron (which is not here in this video cz its Hydrogen gas) I.e, gamma", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgiilMxJNNg6KHgCoAEC.7-H0Z7-FZ6g9rY1j7nD9GK", "comment": "the electron source was metal plates or ionisation of gas taken in the tube?", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgidLmtAraXihngCoAEC.7-H0Z7-HuiC8RRB4dlSN2F", "comment": "he was using hydrogen atoms, which are made of just one electron and a nucleus of only a proton (the positive particles).  the cathode propelled the hydrogen atoms through the gap and when they passes through the charged feild between the plates, it pulled the electron and proton slightly off course and apart from each other, but they are still travelling in the same general direction due to momentum but at slightly different angles now.  I hope that answers how the positive and negative charge can move together. don't forget that positive charges are attracted to negative charges and vice versa, so there is no reason they can't travel together.  does all that make sense now?", "votes": "2", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgidLmtAraXihngCoAEC.7-H0Z7-HuiC8Wla0hkfYEJ", "comment": "mark conley LOL but since there's a high voltage applied on other side both the sub particles gonna go in that direction   (-ve particle) to (+terminal) and (+ve  particle) to (-terminal) n deviation difference is based on discovery of radioactivity!!! I mean e-(beta particle) protons (alpha particle) neutron (which is not here in this video cz its Hydrogen gas) I.e, gamma  -😏😎😂😂😂-", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgwoP9m1duDuIUWudZ54AaABAg.8HkOnEBHdiF93HpPl0y_wm", "comment": "For RaBr he knew the atomic no.", "votes": "0", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "UgyLk3B6el5ow5NiKJ54AaABAg", "comment": "10:21 Really Ramped the Voltage Up", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgyAIa7kGMLTXca_EOx4AaABAg", "comment": "24:08 UnderGraduate NO Pressure", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugz9RYOrIbE2xj3G9Ht4AaABAg", "comment": "8:05 Genius", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgySGf-eAe8lzad6qIV4AaABAg", "comment": "Good for you. I never learned anything like this in that age especially as a student in a public school of a third world country. I'm just happy that OCWs such as this offered by MIT (completely free of charge) is available to the World. It (referring to high quality educational resources) provides greater opportunities for individuals to realize their full potentials at any circumstances. I am truly grateful for MIT's generosity.", "votes": "21", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgwMj9bjLpKmVyglduV4AaABAg", "comment": "Well I've never been to India, and the news surrounding your country is going chaotic. Rape victims everywhere at a public place in daylight time. Worse, the rising number of patients acquiring AIDS and other infectious diseases. ", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxMd-BMy-4hz7fKILR4AaABAg", "comment": "The diagram is not correct.   The ray of positive particles was detected on a flurorescent 'screen' on the cathode side, with these 'rays' travelling through a hole placed in the cathode, the exact opposite direction in which the negative 'rays' travelled. i find i often talk to myself .......", "votes": "3", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzV9deNkr2TRoCG6jZ4AaABAg", "comment": "Still confused.  The proton should have moved towards the cathode, in opposite direction to the electrons, yes? therefore how were protons detected on the end of the tube", "votes": "4", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugz5SBzIPRaSimwFS094AaABAg", "comment": "Here it is: ocw.mit.edu/courses/chemistry/5-111-principles-of-chemical-science-fall-2008/readings-and-lecture-notes/", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzDBme8K_g_rFJ9koN4AaABAg", "comment": "31:12   Rutherford was born in New Zealand.", "votes": "2", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgyIREV82Ge-anwb62B4AaABAg", "comment": "I can comprehend how the electrons move (from left to right direction) through the anode but not why / how the Hydrogen nucleus? shouldn't it be moving (form right to left direction) through the cathode? Thanks, mark", "votes": "4", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxtIzRsSNxiLCX7KsB4AaABAg", "comment": "This is so simple. We were taught this stuff at a really young age like 14.", "votes": "3", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugwti7dW7R9ggFWtP6V4AaABAg", "comment": "Well websites like wikipedia have their facts wrong most of the time and, apparently because no indian edits the wikipedia pages, they are based on somebody's mono-directional views and internet searches. Probably every basis of science  was developed in india but just because the civilization is really old and isolated, it was never documented or exposed into foreign knowledge, hence nobody really gives any credit to indian mathematicians or scientists.  ", "votes": "3", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugx6x_dGd3txnTelgQN4AaABAg", "comment": "I would FAIL that class!", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzkAoz881I1VTdM6SF4AaABAg", "comment": "MIT 3.091 lecture 3 @19:20", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzSoPOoUyWi-Dqs5qV4AaABAg", "comment": "@Qackool: Try MIT 3.091 Introduction to Solid States, start at 19:20, Rutherford. Warning, this is intense stuff, I had to pause and repeat to understand him, but this should explain what you want to know.\r ", "votes": "4", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugz_iMfdWiqNXjACdnh4AaABAg", "comment": "Can somebody explain to me how Rutherford knew how many nuclei were in the gold sheet of foil? In the experiment, they could count the number of foam-nuclei, but I don't see how they could in the real experiment. From what I've seen, it only looks like they could only calculate the total area taken up by the nuclei, not what each individual diameter is. ", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugx6pPF2vaOI2dwoWl54AaABAg", "comment": "I'm sure she's a nice person but boy is her voice high pitched. Can't stand it! ", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgzQXD_3HXfv3r8c--d4AaABAg", "comment": "she also should have mentioned that in order to get alpha rays the voltage polarity should be switch. you can't get positive rays and negative rays shooting at the same time. can't believe they allowed her to teach at MIT.", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgwPjobcqM9jau-Kqm14AaABAg", "comment": "whats knighted? i dont get it...?", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgyJ7lzSVKKxYLU6GOR4AaABAg", "comment": "@meichenl The other thing that is not mentioned in the Rutherford's experiment is that what kind of charge they were using to accerlate the particles, since they have very short range. Just a technicality", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxMd-BMy-4hz7fKILR4AaABAg.8Gc0VRFb1ev8Wlb-7EddiU", "comment": "mark conley Nah that diagram is crct  it was detected on the other side cz in Goldstein's experiment  there was no additional electric field but in this diagram there's a additional potential (of course higher)!!", "votes": "2", "replies": "", "reply": true}, {"vid": "l-BNoAPe6qo", "cid": "Ugw5Xcrt8K52ueTB1zJ4AaABAg", "comment": "@meichenl The other thing that is not mentioned in the Rutherford's experiment is that what kind of charge they were using to accerlate the particles, since they have very short range. Just a technicality", "votes": "0", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxXFDhlw-t9Cn6ujjZ4AaABAg", "comment": "The ping pong ball experiment would have been more interesting if they did 2 more follow up experiments where they tell each person to THINK and KNOW the ball will go through without hitting anything or bouncing back and measure the Probability.  Then tell each one to throw it again THINKING and BELIEVING it will bounce back when thrown.  The first experiment's results would have been the control since it was without instruction.  Guess this would be quantum mechanics I guess. Thanks MIT!", "votes": "1", "replies": "1", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "Ugzb56pBdvAv46YbkKt4AaABAg", "comment": "yay they actually show the ppts this time!", "votes": "2", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgwleUfJuh-9jT3fpHF4AaABAg", "comment": "Well done videos, better than previous one from chemistry dept. and engineering -solid state chemistry lectures.", "votes": "1", "replies": "", "reply": false}, {"vid": "l-BNoAPe6qo", "cid": "UgxXFDhlw-t9Cn6ujjZ4AaABAg.8GcbE-QaZAk9fKQdLZbAis", "comment": "That's funny, unless you are serious! Just as this is a funny way to do science by analogy I can recall the moment my physics teacher at school brought out the radioactive materials box opened the lid, put the alpha source in a lead lined box and aimed it at the thin sheet of gold leaf...it was enough to know we were dealing with something serious, not fun and games...", "votes": "0", "replies": "", "reply": true}]