[{"vid": "L4tEwAsVW0I", "cid": "Ugwyq3oEQ9n7gzsmfQN4AaABAg", "comment": "great prof", "votes": "0", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgyJ7Pg4wqwmuxJkB1R4AaABAg", "comment": "I lov cancer ♋", "votes": "0", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugxm0-p8h_4tl2-IiCJ4AaABAg", "comment": "What pathogen is causing the mutation…", "votes": "0", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgwkUv4JmyXBcY5l_wx4AaABAg", "comment": "Chalk? What about PP slides?", "votes": "0", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugy3G_dLPxR26EDkapt4AaABAg", "comment": "😅Detailed lecture assimilated  thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugy01yVDcZBXBmQn_7V4AaABAg", "comment": "So interesting love it!", "votes": "1", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgxWPS_-UudWCPTrK814AaABAg", "comment": "(On Wednesday of February 8, 2023).  Cancer (Neoplasia or Proliferation Disease State) is a Pathologic Growth of Tissue (Neural, Muscle, Epithelial, or Connective Tissue): 1) Dysregulation and Degeneration of Normal Tissue Growth (Normoplasia or Euplasia); 2) Genetic Molecular Mechanism of Gene variation or Pathologic Changes within the Genome; a) Oncogene (Proto-Oncogene Transformation) is a Pathologic Growth Signaling Gene expression, usually a Transcription Factor of Growth; b) Proto-Oncogene is Beneficial and when Normal promotes Cell Survival (Growth and Proliferation); c) Loss of Regulated Proto-oncogenic Function (CDKs, E2F, Wnt, MYC Gene Variation et al) is a Possible Mechanism of Neoplasia, also known as a Gain of Function (GOF) mutation (Accelerated growth or Loss of breaks analogy); d) Tumor Suppressor Genes (TSGs) are marked by a Loss of Function Variation of a Gene (Mutation otherwise), usually a TF (p53, BRCA1,2 etcetera); e)  TSGs are known also for Regulatory Function of Cell Repair (DNA Repairing) and integrity of a Cell.  Caretaker or Custodians of the Genome are other epithets, f) Growth Signals (Growth Factors [GFs]) regulate Gene expression of Cyclins (G1 Cyclin Specifically to G1-S Cyclin [Commitment to Cell Cycle Signal]) and Other Cytokines (Il-6, TNFs) can be Signal of START; g)  E2F (TF) where RB Protein Bind to such represses (mRNA biosynthesis of E2F) where the Phosphorylation of RB (Retinoblastoma Gene; First Cloned Gene) deactivates Such and E2F is capable to Bind the Promoter Region of DNA Molecule (Biosynthesis of mRNA or Transcription will ensue);  h) RB Gene Variation (Mutation) can have Neoplastic Growth Processes leading to Neoplasm therein: 1) In Sporadic Variation, there is no History or Diathesis of Neoplasia specifically within the Retina and usually manifests unilaterally (affecting only one Eye); b) 2) Familial RB (Diathesis) is an Inherited and pathologic Variation of RB Gene (Bilaterally manifestation) and implies predisposition to this Proliferation Disease.  The Inheritance pattern is Autosomal Dominant (AD) involving equally Female and Males and involves all generations therein (no Generational Latency as in Recessive Inheritance) phenotypically.  However, the actual Process is Autosomal Recessive (AR) with a Predisposition (Somatic Transformation of Homozygous Significance i.e. Phenotype Post-Gametogenesis Manifestation [Retinoblastoma Neoplasm]); a) Point Mutations, b) Chromosome Loss, c) Deletion, d) Gene Repression. In Colon Cancer and Famlial Adenomatous Polyposis (FAP): 1) Dysregulate in the Wnt Signaling in the Stem Cell Niche Process; 2) Neoplasia Pathogenesis: a) Mutation of Euplastic Tissue; b) Dysplasia; c) In Situe Neoplasia (Anaplasia); And d) Francoanaplasia (Metastatic and Invasive Neoplasia);  2) Adenopolyposis Colon (APC) Gene Aberrance; a) Wnt Signaling Constituively activation; b) Further Genetic variation Inducement;......Translocation of Philadelphia Chromosome (9,22 Transformation) in CML in the Abelson Protein And Gene. (Proto-Oncogene)   PhD Adam Martin, Es geht gut und nicht vergessen niemal Gesundheit werden haben warum Gesundheit geben.  Heil!", "votes": "4", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgzQiOV6zFvsaKaM16h4AaABAg", "comment": "this is my asmr lol i fell asleep at s", "votes": "1", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugxr4rGbUK77JkSV6MR4AaABAg", "comment": "mere kajan ko cancers ki problam ho agi se usne bhut se doctor seelaj krwya koi frk nhi pda fer osne planet ayuveda se apna treatment krwya or oski cancers problam thik ho gai .", "votes": "1", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgyrTD3VakPVBfPOOsB4AaABAg", "comment": "Hey all, Does anyone have any lecture notes on this lecture by any chance? Thanks :)", "votes": "2", "replies": "2", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgwbNY4IvR1fx3lP3Bt4AaABAg", "comment": "I’m not sure making science the Oscars is a good idea. I mean have you seen how scary that event has become? 😹 Thanks for another lecture about the beautiful function of our bodies.", "votes": "2", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgyZLYPsIqVX6F17OFJ4AaABAg", "comment": "tbh ngl, im enjoying watching these,even tho I'm still grade 11", "votes": "21", "replies": "4", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgyLxM6J0jqfpx8dL_h4AaABAg", "comment": "Aneuploid.... chromosome extr??only one..?..genetic integrity caretaker genes.....", "votes": "0", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgzxJ7RRb0ABgyGlze54AaABAg", "comment": "Very good", "votes": "2", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugyunq7AsxNStCg6jXt4AaABAg", "comment": "He is a great explainer... Thanks MIT for sharing this... Worth watching..", "votes": "11", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgwwneoSw3iDVMsKkOl4AaABAg", "comment": "Are there family inheritance trees out there where heterozygous individuals are marked as well (if known)?", "votes": "0", "replies": "1", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugx74ajDA7rXzQ_AO3l4AaABAg", "comment": "What’s with the close up’s on the lecturer?", "votes": "1", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg", "comment": "If it has defective brakes and it keeps on dividing uncontrollably it would grow to an enormous size. A fertilized egg becomes a 8ob baby in just nine months. So unregulated / uncontrolled cell growth would be at least his in a year. That is not what we see.", "votes": "2", "replies": "26", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgwUdb6fO3oX4cvRnJx4AaABAg", "comment": "Great stuff!!  Keep up on sharing knowledge to the world guys!!  May god repay your kindness ❤️", "votes": "17", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgwEax20YRgSTYPJYVh4AaABAg", "comment": "Excellent explanation!", "votes": "7", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "UgyrTD3VakPVBfPOOsB4AaABAg.9cXGQf3qWoQ9cY4vsSeiEb", "comment": "Unfortunately, the lecture notes are not available on OCW, but the recitation notes are on the site  https://ocw.mit.edu/7-016F18.", "votes": "2", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgyrTD3VakPVBfPOOsB4AaABAg.9cXGQf3qWoQ9caSrCh7dxO", "comment": " @mitocw  Oh okay, no worries. Thanks for taking the time out to reply. And thanks to Professor for the great lecture!", "votes": "1", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgyZLYPsIqVX6F17OFJ4AaABAg.9_3ZA6uF1mx9_6weps50Kg", "comment": "Me too 😊😊", "votes": "4", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgyZLYPsIqVX6F17OFJ4AaABAg.9_3ZA6uF1mx9ccyhgDBA0V", "comment": "Keep watching :)", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgyZLYPsIqVX6F17OFJ4AaABAg.9_3ZA6uF1mx9gqxOd6V67o", "comment": "Dang....same goes for me😅...I am in 11th grade and I like watching these video lectures....idk, but its just that it gives kind of happiness and satisfaction😁.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgyZLYPsIqVX6F17OFJ4AaABAg.9_3ZA6uF1mxA2G8-J449IJ", "comment": "Same here, Im in grade 7", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgwwneoSw3iDVMsKkOl4AaABAg.9Quyc4yfo3F9YJEa_kG82G", "comment": "Heterozygous individuals are always unmarked but can be identified by seeing if a single sex of their progenies are marked which could indicate to the disease being autosomal recessive or could be sex linked recessive in case of female progenies being affected as the X chromosome carries the recessive allele for the disease.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9NaTDIG7yt3", "comment": "it could be due to the fact that when a fertilized egg is growing, it knows the map.. And also these cells are not abnormal mutated cells..they are not threatened by our immune system either.On the other hand, cancer cells can divide uncontrollably but with each division they try to mutate further to gain additional advantages. they are genetically unstable..and it makes cancer cells vulnerable...there is a fine line... If a cancer cell accumulate lots of mutation it may not always works in it's favor. Only few cells achive this selective advantage by random mutation.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9NbX4Wh1Tnd", "comment": " @rituparnaghanty6819  I agree with your overall point, but disagree that cells \"try to mutate further to gain additional advantages\".  The implied intelligence simply isn't there.  You put it well yourself, at the end: Only a few cells achieve this selective advantage *by random mutation*.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OaqajZdKRy", "comment": "If you’re going to hypothesise, please provide reasonable processes for these occurrences to take place", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9Obs7Qvggm8", "comment": "​ @rituparnaghanty6819  They are saying that a cell's DNA gets damaged by some \"carcinogen\" OR it's just plain bad luck and the DNA was miscopied in some gene. And that the cell then goes on to have more and more mutation, RANDOM changes, which may be advantageous how???? and hence selected for what????  About 97% or 98% of all cancers are solid tumors. They exhibit the characteristics of an organ. They have a basement membrane, a micro environment with a lot of other cells as found in any other organ in the body. These cells are connective tissue cells, which do all the supportive work for the specialized cells, in the case of cancer, this is the cancer cells. Anything between about 5% to as much as 85% of the cells in the tumor are connective tissue cells!  Added to that the tumor forms a blood network / supply, a lymphatic supply and in many cases hey, a nerve supply, a network of nerves. AND they have stem cells, yeah cancer stem cells that have all the markers of embryonic stem cells. Yamanaka eat your heart out!. The cancer stem cells give rise to all the other cancer cells, if not all the other cells in the tumor. Come on, does this sound like evolution? If so then it is fish to man in a cool thousand years. And that is not to say they are basically trying to say DAMAGE = FUNCTION. Hello hello, I at least, smell a rat.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9ObsfOOu0zt", "comment": " @KenSellers  what selective advantage?", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9ObtQQRRo1n", "comment": " @user-nm9fk7cb4b   Far from there being immune surveillance, without full immune system involvement there is no cancer. The body produces the cancer deliberately. Have a look at the reply I gave to Rituparna. All this can't happen out of chance.   IMO from my own observations, cancer is stem cell mediated immunity, erroneously ignited in the body owing to false beliefs about a possible danger or possible harm. The body moves to try and build some barrier. It is a bad move because the danger is only hateful suggestions of someone wanting to do the person harm. These are always related, inhumane people with some agenda.   If you are interested in what I found about how and why the cancer develops then you can watch my video on issues in cancer.  https://www.youtube.com/watch?v=owoFpAzBock", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OcQLjC5g8q", "comment": " @Kyrani99  You are speaking in anthropomorphic terms about cells as tho they have personalities and complex desires. I’m not confident that your opinions are relevant or correct at all", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OcmG1SSUeM", "comment": " @Kyrani99  “IMO from my own observations”, is anecdotal and cannot be objectively tested or replicated by others  Please articulate the processes using the scientific language we are collectively trying to describe and articulate  Pretty please", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OeSwF5GSJ0", "comment": " @user-nm9fk7cb4b  Yes, it is anecdotal evidence BUT on doing a survey of the scientific literature I have found that it supports my findings 100%. The scientists on the other hand have used transgenic mice to get whatever result is desirable.  What anthropomorphic language are you complaining about. I don't see that I said anything that can be called anthropomorphic.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9Oeh3JgXo5m", "comment": " @Kyrani99  you’ve edited your replies and they’re three times the length they were, you’ve also deleted others 🤦🏼‍♂️ You talk about cells behaving and thinking and desiring as tho they have intelligence. Please, you may have a good idea, but it comes across as just more internet babble", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9Ogqwmbd6jh", "comment": " @user-nm9fk7cb4b  You probably got me mixed up with someone else. I never talked of cancer cells as behaving and thinking and desiring.  There is intelligence at play because we are conscious being and our reactions affect our embodiments, i.e., our bodies. So what we think and how we react to those thoughts affect our physiology.  If you look at the medial story you will find that it does not hold up. The solid tumors have the characteristics of organs. They are not just a mass of abnormal cells dividing out of control.  Trying to explain things from the gene level doesn't give any such result. There are cancer stem cells and they give rise to the other cells.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OhcARaPZom", "comment": " @Kyrani99  I believe the concept you are preaching is called, “pseudoscience”", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OjQuLHOOHi", "comment": " @user-nm9fk7cb4b  You sound to me as if you have not read the research carefully. Hooroo! And note I'm Australian.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9Ok8TyIb3NR", "comment": " @Kyrani99  you have yet to explain yourself in scientific terms  I am also Australian. Not sure why you thought this was relevant. Will this effect our, as you have said, “embodiments”?", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OrPe5cFPYN", "comment": " @user-nm9fk7cb4b  No it won't affect our embodiments. I only mentioned it if you were not Australian and didn't know what hooroo meant. So if you had to Google you'd know it was Australian.   I am in the process of writing about cancer and to the best that I can understand the biology in scientific terms. All I can say now is that it is stem cell mediated immunity, but erroneously ignited in the body owning to false beliefs.    In other words it is a nocebo effect, a person's physiological reaction to ideas of possible harm. If you read the science  you will find that very far from DNA and genetic damage or errors, it is cancer stem cells that give rise to all the other cancer cells and maybe all the other cells in the tumor because a lot are normal connective tissue cells.   It was way back in the late 1990s when the first cancer stem cell was found. They don't create cancer in the lab. They create transformed cells but they are not cancer. And they are using transgenic mice to get the effects they are looking for.  When a person understands the reality, there is a big benefit. They can deliberately effect spontaneous remission of cancer AND even better than that they can avoid developing cancer. I am living proof of that.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9OrrLNw3V1N", "comment": " @Kyrani99   let’s get this sorted  I don’t necessarily disagree with the ideas and concepts that you’re talking about, but the way you talk about them, the language is not scientific or specific enough at all   “…but erroneously ignighted in the body owning (owing?) to false beliefs”… Are you saying the body makes a bad decision or are you saying the body is capable of independent intelligent thought?", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P0MGFdtBFO", "comment": " @user-nm9fk7cb4b  Your remark is interesting. You really believe that the body can make a decision or is capable of independent intelligent thought? Neither one. The conscious being makes the decision /has the thought AND that thought / decision causes the conscious being to react in some way. That reaction is physiological. SO if the person has bought into the false belief of possible danger or possible harm, their body will move to try and wall off or somehow deal with the situation. Thus the body creates a novel organ in the area where the possible harm is believed to be. This is none other than a nocebo effect.  Consider the doctors tell patients that the chemotherapy or the radiation they are being given for treatment can cause cancer. This makes the treatments possible harm. And they sure see in some, those who have believed the story, they see new cancers arise.   Cancer has been treated by placebo, though a placebo the doctors had believed at the time. The chemo drugs of the first fifty or sixty years killed rapidly dividing cells. Well hello hello.. there are no rapidly dividing cells in cancer. Sure just under half fell over of the treatment, but more than half went on to \"survive\" in the medical terms, i.e., lived at least 5 to 10 years after treatment with tumor shrinkages and even some tumors disappeared. Indeed some were completely cured of the cancer and lived out their natural life. This is essentially no treatment made them well. If they believed, as did the doctors, that the drugs would address their underlying issues, which were the issues that gave rise to the cancer, then the body cleans up. The cancer is not killed by the immune system. The majority of the cells die by programmed cell death , apoptosis and some even convert back to normal cells. This I saw for myself, though not through scientific observational means. I used Insight Meditation to make the observations in my body.   The reality is that the body makes cancer stem cells and they make the cancer. And when the spontaneous remission happens at least some of the cancer stem cells are stored for future use, should it be seen to be needed. I have cancer stem cells in my body now for the last ten years and they will never come into use again because I know the possible harm or possible danger is a load of baloney being presented by those that \"want me to go away permanently\".  A lot of effort has been made by a lot of inhumane people and for more than 20 years now in a more organized manner. All that they have achieved is to wake me up and make me more knowledgeable. And I am informing others. Their methods are being exposed.  Cancer is stem cell mediated immunity, erroneously ignited in the body, owing to false beliefs that the conscious being wearing the embodiment has reacted to.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P0Mnnvh8rA", "comment": " @Kyrani99  we usually discuss things with mathematics and scientific language and concepts   Welcome to Earth. You seem new here :)", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P0hTNGtMZh", "comment": " @user-nm9fk7cb4b  explaining things in maths and science is all very well BUT the aim is to help people actually get well. All the math and science is not much good if the treatments are nothing more than a bandage, given that the patient doesn't \"fail the standard of care\". Once a person understand what they are up against they can recover their health. That is where it's at.  I'm not so new to Earth. This is my 13th reincarnation here. It's taken that much for me to get acquainted with the problems you people have so I can do the job I came to do. And BTW I do hold a science degree and I have read a bunch of papers on this subject.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P1E18vzlSV", "comment": " @Kyrani99  yeh, I’ve already solved these problems and distribute the solution daily  And I did it with maths and science, and a simple visual language :)   13th reincarnation? I thought you sounded delusional, have a nice day whoever or whatever you want to call yourself, because to me you’re just a liar pretending to sound important, like a kid using their imagination", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P3-XMH_veg", "comment": " @user-nm9fk7cb4b   When all else fails you through mud and call delusional. ROFL", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P3pSzrYSTy", "comment": " @Kyrani99 , so where is your evidence that you have been reincarnated? Prove me wrong", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P5RnsLh7WW", "comment": " @user-nm9fk7cb4b  The evidence I have is not available to you any more than the evidence you have of your subjective experience let's say, is available to me. There is no scientific experiment that can be done to show evidence that any one of us has subjective experiences. Same for the afterlife.", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P5SVdtWioZ", "comment": " @Kyrani99  you are incorrect. On my Facebook profile (of the same name Jarred Harvey), you will find pictures of my tattoos which are symbols of a syntax, an operating system that disproves the notion that all things are subjective and without a fixed point of reference   You should think more, this unintelligence that has overcome you is unbefitting of one who says they know the truth", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P5gfyoAUn4", "comment": " @user-nm9fk7cb4b  Go fly a kite", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "Ugyc7xUc8IuReCfG-xt4AaABAg.9JusljHTYas9P6O5-jj3oq", "comment": " @Kyrani99  no", "votes": "0", "replies": "", "reply": true}, {"vid": "L4tEwAsVW0I", "cid": "UgwGWSCUP9xghg0QY1d4AaABAg", "comment": "Thank you sooooooooo much for those great lessons!!!!!", "votes": "7", "replies": "", "reply": false}, {"vid": "L4tEwAsVW0I", "cid": "Ugx_XWobLSYfEcKy19x4AaABAg", "comment": "It's a great class", "votes": "4", "replies": "", "reply": false}]