[{"vid": "L5aVubSX5wU", "cid": "Ugwm-xKOCv1df7vcIcp4AaABAg", "comment": "Can work be equal to - V delta P", "votes": "1", "replies": "", "reply": false}, {"vid": "L5aVubSX5wU", "cid": "UgxvguzzlDLvfCef2gB4AaABAg", "comment": "so would it just be easier to use R formula to get the J?", "votes": "0", "replies": "", "reply": false}, {"vid": "L5aVubSX5wU", "cid": "UgxzyHnCvhjMGiQ2iKV4AaABAg", "comment": "Hey, great video. I'm still having trouble understanding why, if we're studying the work done by the system, we're using the external pressure (which, I think, does resistive work) and not the internal pressure, i.e. the pressure of the system. It feels like being asked what is the work done by someone pushing a box to the top of a ramp and answering with -mg∆h (the work done by the force of gravity). Could someone please help me?", "votes": "1", "replies": "3", "reply": false}, {"vid": "L5aVubSX5wU", "cid": "UgwP76tYgzwS3Xldyil4AaABAg", "comment": "thank you so much! where can I find your video on signs (determining - and + for W)?", "votes": "1", "replies": "", "reply": false}, {"vid": "L5aVubSX5wU", "cid": "UgxzyHnCvhjMGiQ2iKV4AaABAg.9ZyYmM9qQES9ZyfV4tvS_W", "comment": "Hi Martim!  The way work is defined is a pain in the butt, especially because in chemistry and engineering we often define it in opposite fashion.  From the chemistry perspective we are much more likely (no 100% consensus) to define work as word done ON the system.  That is why when the surroundings do work on the system work is positive (and negative if the system does work).  But in engineering work is much more likely to be defined as the work done BY the system.  This is exactly the opposite and results in work having the opposite sign as it does from the chemistry perspective.  To account for this their equation for the change in internal energy looks like: Delta E = q - w whereas in chemistry we use Delta E = q + w  Once you substitute the formula for work in the equation will look exactly the same.  As an educator, this is a little annoying but I guess we can't all agree all the time.  So I don't know if this helps you or not, but you were focused on 'work' as the work being done BY the system and this may be the issue as in chemistry it is defined as the work being done ON the system (by the surroundings).  Hope this helps!", "votes": "1", "replies": "", "reply": true}, {"vid": "L5aVubSX5wU", "cid": "UgxzyHnCvhjMGiQ2iKV4AaABAg.9ZyYmM9qQES9Zykra0tVV5", "comment": " @ChadsPrep  Thank you so much, that really helped a lot. I tried to calculate work using W = nRT *ln(Vf/Vi) because I was using my Physics book's definition of work to derive the formula😅.", "votes": "0", "replies": "", "reply": true}, {"vid": "L5aVubSX5wU", "cid": "UgxzyHnCvhjMGiQ2iKV4AaABAg.9ZyYmM9qQES9ZylfgtNF6y", "comment": "I cover this topic in a little more depth in a physical chemistry course on my site here: https://www.chadsprep.com/chads-elementary-physical-chemistry-videos/2-4-expansion-work/ I also derive this formula in this lesson though you'll  note that mine has a negative sign in front! w = -nRT*ln (Vf/Vi)  Physics and engineering go the same route in defining work as they are more concerned with the energy they can get out of a system.  Hope this helps!", "votes": "1", "replies": "", "reply": true}]