[{"vid": "l88D4r74gtM", "cid": "Ugwyx5mKofaA_WY6Mn54AaABAg", "comment": "Professor Strang is a legend", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwKZsPBKktsl8FKIr54AaABAg", "comment": "You’re gonna hate me and I’m gonna hate myself for writing this super dumb arrogant comment but I kinda thought it was easy clap.   Don’t copy me kids, this stuff is important, and if you take more than 0.1 sec to answer the questions, you should take it seriously  But if I may in a not so serious note, this was for babiezzz  When the quiz is in the crib ma drop it like it’s hot… drop it like it’s hot… 😅  Ok I’m gonna stop", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzyxdzMpQIsW6cLxEx4AaABAg", "comment": "Literally in the different world while i was watching these lectures!😮", "votes": "1", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxQiBk-Om8vbj2zoil4AaABAg", "comment": "I was confused by the last question because of how it was sentenced.  I thought he asked why the vector (1,2,3) cannot be in the null space, and why it cant be in the row space. So i tried thinking a solution for the first one even though it was answearing a misunderstood question So i think that (1,2,3) cant be in the null space because then the null space consists of vectors that are linear combinations of all vectors which would mean that there are literally no independant columns so the whole space gets squished into the 0 vector. So to the misunderstood question that is my answear, please can someone tell me if im correct", "votes": "1", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyoHro3GZFPoYdyhC54AaABAg", "comment": "When I get an answer before the students I feel underservedly proud, until Im humbled by the next 5 questions.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugx65j_a-Ge2HRJfa3l4AaABAg", "comment": "I love and love you. All the best for you sir.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugw_LJv-8Tg-tupzTHV4AaABAg", "comment": "29:53 How can you tell the matrix on the left is invertible without using determinants?", "votes": "1", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxAYyxanm_3bYrhDyx4AaABAg", "comment": "For the last question in 45:48, I think the other explanation should be, if the null space is [1,2,3], the first column will be the free variable,which is quite impossible, Am I right?", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyjjmDUgi4pbPY7kuF4AaABAg", "comment": "At 43:54, if we exchange rows of A, what spaces will stay the same? I understand that row spaces won’t change since it’s row combinations but why would null space not be changed as well? Wouldn’t left bill space stay the same?", "votes": "3", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxSq6o0ye7jMuxpmzt4AaABAg", "comment": "I finally get things better after this lecture.  All the examples really helped.", "votes": "2", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugz7GVb47v1wadyGVW54AaABAg", "comment": "Dedicated review lectures such as this one are so helpful. They are certainly useful for tying everything together and identifying remaining questions that students may have. However, at least in my experience this kind of lecture also has some psychological benefits, at least for some students, because they end up realizing they actually know most of the material. This is very important since what often holds students back is lack of confidence and overcomplicating things. And of course a review lecture by Prof. Strang himself is extra special!", "votes": "31", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugx4T8oSu__3ySdT5IZ4AaABAg", "comment": "if they have the same the subspace they exist in the same dimension? is that it", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxda9CnYIjoFoILCLB4AaABAg", "comment": "Does anyone tell me the material URL used in this lecture?", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxwVd1CR8lgEBnlVht4AaABAg", "comment": "What u just left at the end of the class was totally shocking me!!", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgytMvJURBOVQLlPStN4AaABAg", "comment": "15:40 Why were the second and third columns of A equal to -1 -2 -1, 0 0 0 respectively?", "votes": "1", "replies": "3", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzkVlDhSUNE_UC6QHh4AaABAg", "comment": "Great intro to orthogonal complements towards the end of the lecture! 44:20", "votes": "2", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzGO61OkEOySdHT0zR4AaABAg", "comment": "DR. Strang your first Quiz is very challenging. Professor Strang it  seems to me that you force the students to think about linear algebra in an abstract  sense, however solving problems from the text book should help each student to perform well on quizzes and exams.", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzAAHpbp3uefLNKFkl4AaABAg", "comment": "students are dumb in his class.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzECf9VQZth7yuLiZ54AaABAg", "comment": "students are dumb in his class.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugw5fsR7uqMdhpKf_Wl4AaABAg", "comment": "thinking about subspaces of matrices is difficult i couldn't even visualize", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwKZsPBKktsl8FKIr54AaABAg.9z8rkERsuSJ9z8skQe5cl3", "comment": "On a serious note I think Strang’s approach of giving the answer and making students figure out the question is such an effective and insightful way to test understanding. The questions are brilliant.  Teach the students forwards and then see if they know their stuff inside out and backwards, that’s the highest quality of instruction right there. That the students can do it shows how great he is at teaching the lesson too.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxQiBk-Om8vbj2zoil4AaABAg.9uIMeTZLHLU9uJtr-j3153", "comment": "My answear to the misunderstood question was actually wrong after i tried it for my self.  This is the correct answear just for the fun of it: Question : can (1,2,3) be a vector in the null space A: yes it can, I will give u an other version of that vector but similar : v = (3,2,1) A matrix that would produce this vector v to be in the null space would be A = [(1,1,2),(3,4,1),(-9,-11,-8)] try it for your self dear patient reader and you will say ''aha!''", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxQiBk-Om8vbj2zoil4AaABAg.9uIMeTZLHLU9z8uI-4I4Ew", "comment": "You can do this for any vector in general. For a given vector v you can always construct a matrix A whose null space contains v and it can be constructed systematically.   You can also systematically construct any matrix whose null space contains any finite set of vectors as long as the vectors don’t form a full rank matrix", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugw_LJv-8Tg-tupzTHV4AaABAg.9bxrCBPxwhC9cAOt8-eIku", "comment": "Reduce it to row reduced echelon form…you will get three pivot columns……meaning these pivot columns are independent …therefore invertible.", "votes": "4", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgyjjmDUgi4pbPY7kuF4AaABAg.9b5kWMoHDZp9ceFWnAGtvE", "comment": "No. It is a bit counterintuitive.   In general, the column space does change. And when we multiply A and x to give 0 (Ax = 0), the 0 vector on the right hand side results from a combination of the columns of A. So you might think that since the column space is different, you'll need a different combination of the columns to give 0.   But later you'll learn that when Ax=0, x is perpendicular to all the rows of A (the dot product of any row of A and x gives 0). So if you change the order of the rows in A, this property still holds i.e. x will still be perpendicular to all the rows of A. And so the null space does not change.   But the left null space does change in general.", "votes": "3", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugz7GVb47v1wadyGVW54AaABAg.9aJ9WhmLhWW9ps5x8wYIFs", "comment": "I'm still undecided about the time effectiveness of review lectures.  In my classes, lecture time is a limited and valuable resource. Students who have kept pace with the reading, lectures, and homeworks already know 90% of the material on the review.  Students who have procrastinated learning (memorizing) the material will be lost during much of the review and won't get much out of it.  You might as well just give students a list of topics or problems that could be on the exam, and let them manage their own time.  Good students will come to office hours or message (email) you if they have questions.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugxda9CnYIjoFoILCLB4AaABAg.9V2fPSAoZ3S9V3CiSE9DZH", "comment": "View the complete course: http://ocw.mit.edu/18-06S05. Best wishes on your studies!", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgytMvJURBOVQLlPStN4AaABAg.9SmXWIiRvx29TKCWMtXSgd", "comment": "what was echelon form", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgytMvJURBOVQLlPStN4AaABAg.9SmXWIiRvx29ZMIYxUaz1o", "comment": "In case you're still interested in an answer 5months after your question: We know that the vector (0,0,1) was in the nullspace. The vector basically  says take 0 of column1, add 0 of column 2 and add 1 of column3. The last column, column3, then has to be (0,0,0) otherwise it wouldnt give you the zero vector and therefor would not be part of the nullspace. Same thing with the 2nd column: We know that (1,1,0) is in the nullspace and it again basically just says take 1 of column1, add 1 of column2 and add 0 of column3. Since Column1 is (1,2,1) then column2 has to be (-1,-2,-1) to give the zero vector. Otherwise (1,1,0) wouldn't be in the nullspace, which we know it is.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgytMvJURBOVQLlPStN4AaABAg.9SmXWIiRvx29ksKC54bFmx", "comment": " @lamp6017  Thanks (10 months after your answer, this was very helpful)", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzGO61OkEOySdHT0zR4AaABAg.9QeFkRZhRhD9t_3HjXr4OE", "comment": "This pearl of wisdom will certainly help Prof Strang be a better teacher and better human being too", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugw5fsR7uqMdhpKf_Wl4AaABAg.9MRHCd3K55C9P0OTAzgsHC", "comment": "https://youtube.com/playlist?list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzN_LHayJuAtlDnAXJ4AaABAg", "comment": "Fortunate are those who get to study the book directly from the author...", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwoyNcJUuU62waABxV4AaABAg", "comment": "Professor looks like james Stewart", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyPer-Rs7KvWcLkkAx4AaABAg", "comment": "hahahahaha xD , hilareous lecture , <3", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugwjab5irmTy7hvXc7p4AaABAg", "comment": "An Indian edition of this book is available only in India http://www.wellesleypublishers.com/buy.html", "votes": "1", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwiataiM1R-Dx7kGHB4AaABAg", "comment": "could someone tell me at 33:33 how do we get [1000] for particular solution? im so confused. Thank you so much!", "votes": "3", "replies": "3", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugx-W9AQGi3LWcqWIX54AaABAg", "comment": "In case you , like me, are wondering what this video is exactly - He's doing a recap of the first 12 lectures. This is NOT him going through the solutions of a quiz that the students sat. Rather, it's him reviewing the material so far before the students have the quiz.", "votes": "32", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugw1mJlTiVtUYmWnOZV4AaABAg", "comment": "Strang is just the best teacher in the entire world, hands down. Imagine if all teachers had this level and passion for teachin... We would be living in a utopia.", "votes": "10", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugy8khIPrf-elQAj2nZ4AaABAg", "comment": "If A and B have same 4 subspaces.   Then their ranks must be same.  Their dimensions must be same.  Hence their RREFs must be same.", "votes": "6", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwphDOcrav9au-OwnJ4AaABAg", "comment": "36:54 'I don't know why the author put these in here' . Funny part is he's the author of the book.", "votes": "81", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg", "comment": "I don't see what's so good about Gilbert Strang. I'm only able to learn and understand part of the content with him and so much of it I can't keep track of it.  I forget what is an invertible matrix, he always seems to just say this is invertible by just looking at it, and I can't see it by just looking at it, so that makes that hard to follow.   I can't keep track of what has n, n - r, m - r, all that gets jumbled up in my mind.   He wants me to go through steps with him, and sometimes I don't even know where's going with it, so I can't, I have to wait to see what he does, probably because he hasn't shown the steps first along with why they work, so that it never synched in my brain to begin with.  Occasionally I am able to answer a question right when he asks, but half the time, I'm only half following, if even that.  I don't see why other people think his teaching style is so amazing, it's so scattered, and doesn't clearly show how & why things work before expecting me to follow along with examples.  Though I think I'm pretty good at doing elimination.  I definitely can't multiply matrixes so fast as he does, I need to pause the video, and actually write down my work on paper, he just skips steps and writes them down.  Like I don't get it, his style is just way off for me, do I just learn differently then most people?, like I don't get it.", "votes": "9", "replies": "6", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxg2gXRfLeDck6XJDJ4AaABAg", "comment": "back when \"who wants to be a millionaire\" was not popular", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxs5vUDhwIw_haesqJ4AaABAg", "comment": "The Camera guy fell asleep...", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzDWv03AubflzkKc294AaABAg", "comment": "One problem a bit confusing. Normally a square of a matrix is the transpose with the matrix, the example here is like BB.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugx5Igu2LqARuItmQrF4AaABAg", "comment": "42:45 If A and B have the same four subspaces, then they have the same reduced row echelon form.", "votes": "9", "replies": "4", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyFWu8Jx73GfP1xWBZ4AaABAg", "comment": "The exam can be found here https://ocw.mit.edu/courses/mathematics/18-06sc-linear-algebra-fall-2011/ax-b-and-the-four-subspaces/exam-1/MIT18_06SCF11_ex1.pdf I always feel the homework and exam problems are a lot harder than what he covers in lectures. I don't have a problem with that - just making an observation. This post was meant for those that think MIT is a cakewalk based on the lectures and this review only.", "votes": "7", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugwbi7v-a8Bluap6yc54AaABAg", "comment": "Eulers law is just beautiful ....", "votes": "1", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwvDkS1u9RaNFlGe_x4AaABAg", "comment": "When he uses those glasses he looks so kawai :3", "votes": "2", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxzGe9otv4Cu9vCD3B4AaABAg", "comment": "The pedagogy is so good that I feel like I come up with the ideas myself.", "votes": "57", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugz0C4jQmerQaLkruuN4AaABAg", "comment": "My neurons have started firing again after taking this course...Love from India.", "votes": "11", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxzkboj_2mtIoH7EIR4AaABAg", "comment": "Isn't the dimension of N(C transpose) 14? Because dimension of C^T is 20 and rank is 6.", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwiataiM1R-Dx7kGHB4AaABAg.9BK5dDXecyi9BLTapGzLLq", "comment": "The equation you are attempting to solve is Bx=[101]. If you actually multiply the given matrices to find B, you will see that it’s first column is [101]. So, you need x to equal something that when multiplied times B will give you the first column of B, because that first column of B is the same as the right hand side of the equation Bx=[101]. This x would be [1000] because that would be the same as a combination of 1 of the first column of B, and 0 of the rest of the columns.", "votes": "8", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgwiataiM1R-Dx7kGHB4AaABAg.9BK5dDXecyi9BLqx4xeKC8", "comment": "​ @matthewbrown4782  Yeahhhh! that Totally makes sense!! I tried the multiplication and it works! I probably got error somewhere previously when I tried the calculation. Thank you soo much Matthew!!! This really helps me a lot!!!!!", "votes": "4", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgwiataiM1R-Dx7kGHB4AaABAg.9BK5dDXecyi9uyCUYfHAUm", "comment": "The first column of right matrix (1,0,0) just takes first column of left matrix and put it into the multiple.(just like a permutation matrix on left side would do to rows, this matrix  on right does to columns) So its a easy way to get the first column without actually doing complete multiplication. Hope this helps, even after 3 years 😅.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugx-W9AQGi3LWcqWIX54AaABAg.9B68vJHW8979gMHmbd6Rjc", "comment": "Thanks!", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugy8khIPrf-elQAj2nZ4AaABAg.991qwUCsFy59dViOXu1gFA", "comment": "Both their RREFs would be the identity matrix", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugy8khIPrf-elQAj2nZ4AaABAg.991qwUCsFy59uCw3UB3YEB", "comment": "​​ @jeffreywolberg3735 and why you say so? RREF is identity Matrix only in the case of Invertible matrices.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg.98XUrERDZF29GEDd03sNZr", "comment": "Island Cave I have the same feeling, but I kept hearing that the teaching style is amazing, but it is just not for me. I can enjoy it after I went through other courses (and the 3brown1blue), i start to understand where he is heading. But again, it is not for beginner, it will be easy if you already know most of the materials, he can help you recap and fill some gaps.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg.98XUrERDZF29NCVPnZRsNY", "comment": "Maybe you do.  \r But if you want to follow better through his lectures, I suggest that you give the first 3 lectures huge importance because a lot of the shortcuts he is doing is based off those lectures. It is the build up of the basic foundational concepts that make some other things easy. \r For example, in determining if a matrix is invertible:\r In the earlier lectures, Prof Strang said that matrices can be seen as a set of operations that are acted to another matrix. An example is the elimination matrix E, we use it to change the rows of another matrix. Given that, what if we want to reverse those operations? This is where inverse matrices come in, the inverse of E is the matrix that will reverse/inverse the operations of E itself, that is where the term \"Inverse\" comes from. So another way of seeing it is (inverse of E) * E * A = A or (inverse of E) * E = I since I * A = A.  Then, how do we know if a matrix is invertible (that is, its operations can be reversed)? It is invertible if there doesn't exist a linear combination of the columns of A that is the zero vector except the zero combination. Why is that so? One of the easiest way to reason with it is explained in the earlier lectures: if Ax = 0 and A is invertible, then we can multiply both sides by the inverse of A and we will get x = inverse of A * 0 or x = 0. Therefore the value of x should only be zero for the right hand side to be zero.  There a lot of other ways (and better ways, for intuition) to think of this, and the other lectures give insight to that. \r But now, you can easily see if a matrix is invertible or not by just looking at its columns, if it's small enough.  =================================================================================================================================================  In order to understand how he multiplies matrices so easily, you need to understand the point of the first 3 lectures. The third lecture is where he explains 4 ways to think of matrix multiplication, if you understand this lecture then it will be easier to follow through how he multiplies them easily.", "votes": "5", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg.98XUrERDZF29PV2sfrwSGM", "comment": "What you need is practice. You can't expect it to fully understand everything just by watching lectures. I'd recommend that you solve problems available on MIT OCW on Linear Algebra, and focus heavily on the first few lectures which are crucial to understanding this 'tricks' that prof. Strang does.", "votes": "8", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg.98XUrERDZF29RVuuye07FW", "comment": "Yes I can totally understand that this course is actually not optimal for beginners. But after I heard my first introductory course on linear algebra where I practised formalism, simple transformations and proofs over the length of one semester, I dont have any problem to follow him. The traditional university courses are also important in order to learn vocabulary, abstract formalism and of course practice. But the traditional mathematically rigourous way of teaching lacks the ability to put everything together and give an intuition which is what this lecture is trying to do. But yes, the speed of this lecture assumes that you are already cozy and dont have to think much when hearing certain concepts like invertability.  I mean invertability sounds like an easy concept, yeah the effect of a matrix can be undone, but thinking of all the implications it brings when hearing \"invertible\" takes time. Also spaces and subspaces for example: of course it is introduced in this course but in order to actually know how spaces really behave one should spend some weeks in university doing group theory otherwise you get kind of overwhelmed.", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg.98XUrERDZF29TqiRWyu2e1", "comment": "(I was having the same trouble) I think in the initial lectures there were some facts which you should prove it yourself( just take a general small example and see it) to understand everything better- (1) No. of pivots r of any matrix = No. of independent column vectors (2) No. of pivots r does not change if you transpose the matrix. I think more than half of linear algebra goes around the concept of pivots and what they mean. You can tell so many things about a matrix just by observing no. Of pivots.( Dim, null space, left nul space, row space) and once you get the idea of determining the no. Pivots( simple elimination) , you can hear what any (small) matrix want to say without calculations. Also the examples taken by Prof Strang are easy ones, they contain so many one's and zero's  so it's easy to do many things without calculations.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxTu5UwcMuBC2pksBh4AaABAg.98XUrERDZF29hFnTUJju15", "comment": "after some time you’ll get good at this. It’ll be just like a reflex if you practice enough.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugx5Igu2LqARuItmQrF4AaABAg.975T1urBqaO991qW-XJLat", "comment": "May be true.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugx5Igu2LqARuItmQrF4AaABAg.975T1urBqaO99eZOO-N3-M", "comment": " @ramkrishna3256  maybe true as in sometimes true or you think it's true", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugx5Igu2LqARuItmQrF4AaABAg.975T1urBqaO9XQn4kmcf5K", "comment": "I though of this but is it true? Same reduced row echelon form means same row space (hence same null space). But what about the column space? Every row operation may change the column space.  EDIT: I was thinking of this question backwards. What I'm trying to say is that the implication is one-way. If A and B have the same fundamental spaces, then they have the same RREF. Moreover, their transposes also have the same RREF.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugx5Igu2LqARuItmQrF4AaABAg.975T1urBqaO9dViZ9shZBI", "comment": "Both their RREFs would be the identity matrix, I believe.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgyFWu8Jx73GfP1xWBZ4AaABAg.93J-fwnTzna9OFWMq4MDMt", "comment": "Yeah, I totally agree. Although I was sort of surprised that at 24:30, half of the class thought that Ax=b is not always solvalbe with nxn independent columns. So I don't think these classes are all easy peasy to them.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugz0C4jQmerQaLkruuN4AaABAg.91UFi_oDLfe99LkoL8kLgh", "comment": "@E no", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugz0C4jQmerQaLkruuN4AaABAg.91UFi_oDLfeA0nhNjANodd", "comment": "Same here, lol", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugxzkboj_2mtIoH7EIR4AaABAg.9-xj-BUs3dY9F0RFxc8pyb", "comment": "i also think the same......if somebody can verify", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzHLaRF4zP2CJKj85V4AaABAg", "comment": "Ok I figured this out. Let B=CD.  if C is invertible then CDx=0 is equal to Dx=C^(-1)0 therefore Dx=0 is equal to CDx=0. that is why N(B)=N(D).", "votes": "4", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxBuid81pF9INIt0-F4AaABAg", "comment": "Where's the pdf for the exam that he is going through in this video?", "votes": "1", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxes-D0Qw-a7n76zjJ4AaABAg", "comment": "Anybody here who could answer the question (at 42:42) \"If matrices A and B have same 4 subspaces, then _____fill_in_the_blank____.\"", "votes": "5", "replies": "4", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzA9YNmWQVIpIv87gB4AaABAg", "comment": "19:16, why are all 5x5 matrices in a 25 dimension vector space?", "votes": "2", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugw41yTb4nIucHUt1ml4AaABAg", "comment": "7:51. Really good question.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxLBhpdSKxW0k9hCFZ4AaABAg", "comment": "Isn’t this video supposed to be watched after trying the exam1 ?", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxZgx2_9aDJfduNszZ4AaABAg", "comment": "Professor Strang just pulls out numbers out of thin air without explaining where they come from. How does he come up with the solutions at 31:27?", "votes": "0", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxYKa-u_y4A07mRsWp4AaABAg", "comment": "15:36 where does he pull these numbers out from ?", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyO7BIOp83qA6pDrqV4AaABAg", "comment": "13:30 why is dimension 2? He wrote see 3 vectors", "votes": "0", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxyWXRW8zCWLAr1i3Z4AaABAg", "comment": "Around 33:30, how do we know that x=xp+xn gives a complete solution of Bx=b? The way I think of it is that B*xp+B*xn=b+0, so we only get one particular solution that we chose arbitrarily. Can I make linear combinations with the null space basis vectors to obtain all the other solutions or what am I missing? Thanks", "votes": "1", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxeeKZGPC8hzP-9ch94AaABAg", "comment": "Why is the intersection of null space and row space, only the zero vector? Why can it not be a vector such that V times Vtranspose is 0?", "votes": "1", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzdcsXA1uQigYgFnLl4AaABAg", "comment": "I have a doubt/conclusion that needs rectification as I am no sure about  it. So here it goes. If 2 matrices A and B (both nxn) have the same 4 subspaces then if they are spanning all of n dimensional space(in form of Column and Row Spaces i.e. all cols and rows are independent or rank = n), only then can A and B not be multiples of each other.  If they span a subspace of the column space Example 2D plane in R³, then in that case A and B have to be multiples of each other i.e. A=cB. Am I correct? Pls justify or oppose my conclusion. Thanks for reading :)", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugx_5jsf4t0zvsUnofV4AaABAg", "comment": "I have just try the quiz on the mit ocw. Before doing the quiz I supposed it was an easy course. Now I think I was wrong: although the calculation is simple, and the problem are not difficult, one needs to be very clear about the basic concepts taught in the lectures.  The quiz: https://ocw.mit.edu/courses/mathematics/18-06sc-linear-algebra-fall-2011/ax-b-and-the-four-subspaces/exam-1/MIT18_06SCF11_ex1.pdf", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugyn7YNF-HXUzpNzmL54AaABAg", "comment": "Why does C need to be invertible here @30:45 ? For (CD)x=0, if Dx=0 (ie null space of D) automatically CDx=0 as well.", "votes": "1", "replies": "3", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg", "comment": "Damn, what a good teacher.", "votes": "48", "replies": "7", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzjeM-qPSc7tc86eLV4AaABAg", "comment": "anyone can fix the subtitles?", "votes": "0", "replies": "3", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwLtGOoutC30NfpCYl4AaABAg", "comment": "Hard to tell if this is before or after the exam was sat?", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxgoZjqJm5p92AIqi14AaABAg", "comment": "43:26 Min why does the nullspace stay the same?", "votes": "1", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugw-th1AOKnZzlscowJ4AaABAg", "comment": "At 13:20 how he decided the dimension of null space as  2 from x?", "votes": "1", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyAm8XcboW0X8k16r54AaABAg", "comment": "If 1/2 the class does not know that independent columns in an n by n matrix is always solvable then 😅", "votes": "3", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxes-D0Qw-a7n76zjJ4AaABAg.8xmOiT942dR9-sj0ZSyoqE", "comment": "I Think B=A", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugxes-D0Qw-a7n76zjJ4AaABAg.8xmOiT942dR91TzA9bjjYF", "comment": "​ @AntifachoOi not true, because the example the prof gave was two invertible matrices (same size 6x6) can have the same 4 subspaces and be completely different (because it is the fact that they are invertible that gives them the same for subspaces) (please correct if wrong)", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugxes-D0Qw-a7n76zjJ4AaABAg.8xmOiT942dR91Zh79bZdrS", "comment": "Since A and B have same row space then A and B can be made to have same row reduced echelon form and similarly for matrices A^T and B^T. Let r be the rank for both matrices A and B, then there are r independent rows spanning the entire row space for A and B. Then each row vector in row reduced echelon form of B (rref(B)) can be expressed as linear combination of r independent rows of rref(A). If V1,V2,...,Vr be these independent rows of rref(A), then each row vector of rref(B) can be expressed  in some form similar to a1*V1+a2*V2+...+ar*Vr and doing some algebraic manipulations each rows of rref(B) can be made to yield the same matrix as rref(A). SImilar results apply for rref(A^T)=rref(B^T). I don't know if this is leading us to somewhere.", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugxes-D0Qw-a7n76zjJ4AaABAg.8xmOiT942dR99MravAinj5", "comment": "Same RREF. Proof: 1. Given that A and B have the same 4 subspaces, A and B have the same Rank. 2. Since Rank(A) = Rank(B), in RREF the first r columns of RREF(A) = RREF(B) 3. Row operations do not change the row space (since we are just taking linear combinations of the row vectors), hence the overall rows in RREF(A) = RREF(B)     We know this because the first r components are equal, and they must have the same row space, so the remaining m-r components must also be equal. 4. Since rows are same in RREF, the RREFs are equal.", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzA9YNmWQVIpIv87gB4AaABAg.8xdBtDMr4T38xfmF8zB1DV", "comment": "Because any 5x5 matrix can be generated by 25 separate matrices each having a single 1 in a different place.", "votes": "9", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxZgx2_9aDJfduNszZ4AaABAg.8tTIr74Fsi28tYIAMbvqVU", "comment": "The Matrix above is 3x4 with 2 Pivots (the 1s in the first and second column). The last two columns without pivots are \"connected\" with the free 3rd and 4th components x3 and x4. To construct a basis vector for the null space, you make one vector per free column and set the corresponding component to 1 and the other free components to 0 (resulting in (? ? 1 0) and (? ? 0 1)). Then you fill out the missing components with the negative values from the column 3 and 4.   This is explained in the corresponding lecture, where the null space is being introduced (Think its lecture 6-7, Chapter 3.2 in the book)", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxZgx2_9aDJfduNszZ4AaABAg.8tTIr74Fsi29BJyV6QjNsY", "comment": "https://www.youtube.com/watch?v=VqP2tREMvt0&list=PL221E2BBF13BECF6C&index=17", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgyO7BIOp83qA6pDrqV4AaABAg.8tTFw5snxrn8tVigLqyoVo", "comment": "one vector is fixed (particular solution), 2 are free => the null space spans a plane", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgyO7BIOp83qA6pDrqV4AaABAg.8tTFw5snxrn9-vmhGPF4Gx", "comment": " @yadusolparterre  What does it mean to have one fixed and 2 free in regards to knowing that means Ax= 0?", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxyWXRW8zCWLAr1i3Z4AaABAg.8q2ruK7H_Bd9NCI1kTHBSq", "comment": "Yes you are right, the choice of the particular solution as professor says is arbitrary. You could've picked any other valid solution and assign it as the particular solution. We can take any scalar c in xp + c*xn and we can produce infinite solutions (since as you said: B*xp+B*c*xn = b + 0 for any c).", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxeeKZGPC8hzP-9ch94AaABAg.8pZcLJ1J8J98pZdKxFCu0q", "comment": "Ohh got it. When we multiply V with Vtranspose we get the sum of squares of the components of V. And the sum can be zero only if all the components are zero. Right?", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxeeKZGPC8hzP-9ch94AaABAg.8pZcLJ1J8J99MOA7YW-6b1", "comment": " @khurshedfitter5695  Yes", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzdcsXA1uQigYgFnLl4AaABAg.8pZax8xmlWh8q-dH1t9hGS", "comment": "i think you're wrong, take two 3x3 identity matrices with a 0 in the last position and differing only in the fact that the first element of the first matrix is 2 and not 1. they are not multiples of each other and span a 2d plane in R³", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugyn7YNF-HXUzpNzmL54AaABAg.8pHu7hTxpke8pIG54No994", "comment": "Your argument shows that a \"nullvector\" of D is automatically a \"nullvector\" of CD; that is, N(D) is a subset of N(CD).   However, a \"nullvector\" of CD is not necessarily a \"nullvector\" of D if C is singular. It is because a singular matrix may kill a nonzero vector. In other words, it is possible that C(Dx) = 0 could come with Dx ≠ 0.", "votes": "6", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugyn7YNF-HXUzpNzmL54AaABAg.8pHu7hTxpke8pIHj-vwTf1", "comment": " @MrFive_5sir  Was thinking on similar lines but wasn't sure. Thanks!", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugyn7YNF-HXUzpNzmL54AaABAg.8pHu7hTxpke8qh8ik23I3K", "comment": "if c is invertible then (c^-1*c)Dx=c^-1*0 Dx=0", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E98aZAUKNk0T", "comment": "How? He's so scattered in the way he presents things, and after watching 13 lectures, I feel like I have learned what he taught in a swiss cheese sort of way.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E98bYDKVmmBy", "comment": " @islandcave8738  I know Prof Strang has an informal, offhand way of talking about things, but it's his way connecting with everyone's first blush insight into the problems and situations. He focuses in on the fundamental ideas that are the foundation of linear algebra, and explains why and how they arise. For me, the first few times I tried to learn linear algebra it seemed like swiss cheese to me too, but as I gained and understanding and went over stuff again, I came to realize how the substance and holes really formed a neat pattern of connections between the different ideas that are at the heart of the subject. I've never seen anyone teach it better. He motivates everything with reasons that are as easy to convey as it gets. Try watching someone else teach it; you'll see what I mean. Also, try going back over the lectures again, from the beginning...", "votes": "6", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E9B9ZVWIH1hW", "comment": " @islandcave8738  to add to what @jonahansen has said, I would also suggest you make your own notes with the videos if you are not doing that. Try solving some problems from his Strang's book after each lecture and see if that aids your understanding.", "votes": "3", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E9BL4qj0qCY_", "comment": "Island Cave I you don’t understand the idea or intuition behind linear algebra, then go to a channel called ‘3blue1brown’ and look at the playlists, you’ll see one on linear algebra, that’s the one you should watch.", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E9Ox1L0pdrL7", "comment": " @islandcave8738  I think a better way to approach this course is to watch playlist 18.06SC here on youtube instead of just 18.06 because in the first one you have pretty much all of these problems already solved by TA's and the method is presented (few of the recitations are a bit mixed up, but if you went through all of the lectures, then it is clear). Here professor is just doing a quick recap and if you didn't follow the TA's and their explanations, it is confusing.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E9Qn8b-gmfUs", "comment": " @d.r.656  No problem, I hope more people will become aware of this.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgygUUO0URxSFD5DasZ4AaABAg.8no8usRRV3E9ed-A_7Fyay", "comment": " @islandcave8738  you have to first watch the lecture and then open the book and read about the chapter again mate. I run into the same problem. So I think the best way to learn from him is to first watch the lecture and then read the book carefully. After that do some exercise to test your self and connect the ideas", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjeM-qPSc7tc86eLV4AaABAg.8jG2s66SBBZ8jKlej55HbY", "comment": "Make sure you are using the English CC subtitles and not the English (auto-generated) subtitles.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjeM-qPSc7tc86eLV4AaABAg.8jG2s66SBBZ8jLBoUHr_rQ", "comment": "MIT OpenCourseWare I'm doing that but the subtitles in some part of the lecture have problems in the timing .. Sorry for my english", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjeM-qPSc7tc86eLV4AaABAg.8jG2s66SBBZ8tDIq-Eaj2K", "comment": " @mitocw  the timing problem is still there", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgwLtGOoutC30NfpCYl4AaABAg.8iqllxk475n8xWh9-S3plv", "comment": "def before", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxgoZjqJm5p92AIqi14AaABAg.8hz-20l5Wjx8inPfiZC3RV", "comment": "I wonder. Indeed the lecturer did not mention the matrix was invertible, in that case the nullspace would have stayed the same. Thank you!", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgxgoZjqJm5p92AIqi14AaABAg.8hz-20l5Wjx8pZcYiIPGQl", "comment": "Because if we exchange 2 rows of A we are just interchanging two left hand sides of the system of equations and that won't change the system as all right hand sides are identical and equal to 0.", "votes": "8", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugw-th1AOKnZzlscowJ4AaABAg.8h9kP7mPn0V8hn6LtOcY6X", "comment": "Since you can put any amount of vectors 110 and 011 and they have no effect on result thus they nedd to be in null space of A , when A is multiplied by x .", "votes": "4", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugw-th1AOKnZzlscowJ4AaABAg.8h9kP7mPn0V8mb-vwBDMRj", "comment": "Look at the solution for x - it's made up of one particular solution and two special solutions from two free variables.  That tells you the null space has dimension two (it's a plane that passes through the origin so it's a subspace).  The particular solution will shift this plane away from the origin.  If this is not clear, review the lecture on Ax=0 and finding the null space.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugzrdf8ZhPVHQUAIp7R4AaABAg", "comment": "At 3:08 the subtitles are about someone who watched \"How to be a Millionaire\".", "votes": "5", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzsSqRCgD4ZvYRGfxp4AaABAg", "comment": "I am not able to understand how the matrix A is being formed from X and result. Please help", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgjG2zVL4uRtYngCoAEC", "comment": "If the rows of a matrix are dependent, does it mean that the columns must be dependent too?", "votes": "0", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugiy8AlhGH0YhngCoAEC", "comment": "how could Bx = [1 0 1]' ??????????", "votes": "1", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugh1CwbBGkIHqngCoAEC", "comment": "how could he define the last 2 A's columns? 15:10", "votes": "5", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugi77CtvYVpfY3gCoAEC", "comment": "wtf is going on with the cc at 3:08?", "votes": "3", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgiIV2K3cnScG3gCoAEC", "comment": "5:54, why is the reduced matrix   u 0   instead of  Identity 0", "votes": "3", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgiYCYby_tslZngCoAEC", "comment": "Views are less than 100k already.", "votes": "11", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UghPxureQtWLGngCoAEC", "comment": "42:12 , the answer is rank(A) = rank(B) right ?", "votes": "1", "replies": "3", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgjI-GrUeJsSeHgCoAEC", "comment": "The host of 'who wants to be a millionaire' was Regis.  Hi caption reading comrades!", "votes": "7", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UggPv9ROk3EZDngCoAEC", "comment": "I love reviews.", "votes": "6", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ughos64ChnbcS3gCoAEC", "comment": "There's the great tie again", "votes": "40", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UggwYjFbGxyl6ngCoAEC", "comment": "On 4:11, the nullspace vector isn't composed by 5 zeros?", "votes": "0", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugwn7DQIFhKoytY5om94AaABAg", "comment": "I know, right", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgybOD862HGWxkZbUfd4AaABAg", "comment": "yes, both stays the same!", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg", "comment": "After seeing some of these lectures and checking a couple of exams, I think MIT is actually not that difficult. The thing is they do have access to these awesome lectures and they're taught how to think. I'm positively sure that Calculus II and 18.06 are much more difficult in two universities I'm acquainted with than in MIT. However, they're taught how to think at MIT and most good universities just try to explore the limits of difficulty, rather than giving insights into thinking.", "votes": "89", "replies": "7", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwD9vWN6GUgtjmZzXN4AaABAg", "comment": "Being accepted to MIT does not grant superior knowledge. This is a freshman course.", "votes": "8", "replies": "3", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgwNNLQaSJO8hg6T5754AaABAg", "comment": "Great courses! Thanks from France! ", "votes": "2", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugyu_XPKQA6PH67eKmF4AaABAg", "comment": "Thanks again Prof Strang.", "votes": "2", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugzk76RATCXqaAkTUxh4AaABAg", "comment": "quiz tomorrow woo ", "votes": "4", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugzrdf8ZhPVHQUAIp7R4AaABAg.8bzFaoKKnL58c05YAzOaUp", "comment": "Thanks for the feedback - we will look into this caption glitch.", "votes": "3", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzsSqRCgD4ZvYRGfxp4AaABAg.8YcRv_mwbpA8cgo7CsTbO1", "comment": "He just used the complete solution. First, he used the actual solution to the problem i.e 2 0 0 that means when matrix multiplies 2 0 0 the solution should be 2 4 2. so from that we know the first column should be 1 2 1. and similarly he used remaining two special solutions.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgjG2zVL4uRtYngCoAEC.8VH2JufDG7X8b4LsZ2FicW", "comment": "Mahnoor Fatima may or may not be. If number of independent rows is equal to number of columns then columns are not dependent at all but if number of independent rows are less than number of number of columns then columns are also dependent.", "votes": "4", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgjG2zVL4uRtYngCoAEC.8VH2JufDG7X8kBD_UGDqCZ", "comment": "Yes", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugiy8AlhGH0YhngCoAEC.8Qvz7WZHNu08S2F-qthcbx", "comment": "Because the first column of B is [1 0 1] if you do the multiplication, then x particular is [1 0 0 0] (keep the first column of B)", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugiy8AlhGH0YhngCoAEC.8Qvz7WZHNu08TU08yLzQNv", "comment": "That's just a matrix equation ... put the vector on the right in an augmented matrix, row-reduce.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugh1CwbBGkIHqngCoAEC.8QqtyrX3vZa8S2FqZ1Qol_", "comment": "Because A.[0 0 1] = [0 0 0], that means A's 1st column x 0 + A's 2nd column x 0 + A's last column x 1, then the last column of A must be [0 0 0] A.[1 1 0] = 0, then the second column of A must be -1 of A's first column => A's second column is [-1 -2 -1]", "votes": "9", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgiIV2K3cnScG3gCoAEC.8ISbOnvCbls8IbKB_0UGlF", "comment": "Understood. Thank you for taking your time to write a good answer.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgiIV2K3cnScG3gCoAEC.8ISbOnvCbls8wri1D_hY3Z", "comment": " @danielalmeida7140  what is the answer?", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgiYCYby_tslZngCoAEC.8FdPAl5y1GL8nW6yWsGPp_", "comment": "Not anymore!!", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgiYCYby_tslZngCoAEC.8FdPAl5y1GL8sFH3yp-tbE", "comment": "The way to work this one out is to compare the views for this lecture and lectures 1 or 2 on the SAME DATE. This isn't even linear algebra, except maybe in a trivial sense. Everybody knows this video recording moves deeper into history with every passing day. You can't go home again!", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UghPxureQtWLGngCoAEC.89gf0EvBkKA89mY9DZRoV3", "comment": "+Crazy Kid the answer to the question is false. Your statement is correct because A and B are both invertible 6x6 matrices which means both have  rank r=m=n=6", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UghPxureQtWLGngCoAEC.89gf0EvBkKA8AzTduM3ht1", "comment": "+Crazy Kid I think you can say more than that. What about reef(A)=rref(B). Can anyone come up with an A and B that refutes that claim?", "votes": "4", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UghPxureQtWLGngCoAEC.89gf0EvBkKA8g6i97ftNXy", "comment": "Crazy Kid and", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgjI-GrUeJsSeHgCoAEC.8-6R3HlCgXj8bbYxTeBoxG", "comment": "Wtf was this? Could it be the DNN picking on background talk?", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgjI-GrUeJsSeHgCoAEC.8-6R3HlCgXj8c-aaG5J5b_", "comment": "The question about Regis actually comes later in the lecture", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UggwYjFbGxyl6ngCoAEC.7-H0Z7-TPDo8S2FMPtmCFG", "comment": "U is 5x3 matrix, then x must be 3x1 vector", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZt8dTeXixNvs1", "comment": "LordMgls  I’m not sure if this is specifically MIT, but if you mess up one part on the tests, you’re screwed.", "votes": "3", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZt90OAKFdlEZb", "comment": " @lucasm4299 It's true, but usually you're penalized only once, at the point you first made a mistake. If the error carries forward consistently, usually you don't get penalized again. At least that's how it is at my university.", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZt943D7_uHWUG", "comment": "1. 18.06 and 18.02 are mandatory for all MIT students. They're not wringers. There are many courses that are very difficult.  2. If you checked out the exams without solving their questions, you're probably not in a good position to assess their difficulty.   3. You're studying this on your own time, at your own pacing. An MIT student takes 3-5 courses a term. It adds up if you don't have excellent time-management or raw talent.", "votes": "20", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZt96QpCs8sq3w", "comment": "​ @CobaltSthenia  I don't know about many universities, but in my university we have exactly the same workload, and the material that he's teaching is nearly identical, that's why these videos are useful for me to prepare for my exam. I don't watch this stuff because it's from MIT, I watch it because Mr. Strang happens to be an excellent instructor that teaches linear algebra well. And I don't think anybody in the world that studies mathematics, physics, computer sciences, or anything else related, has it easier. I am thankful though that MIT put these videos for free on youtube. That's very forward-thinking, considering this was uploaded in 2009.", "votes": "21", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZtA0ngYZnofb6", "comment": "​ @CobaltSthenia  3-5 courses a term is pretty standard, at least in the universities I know, both in my own country and abroad.  And I have seen some of the MIT papers. From what I saw,  the difficulty level, very honestly, is pretty standard too, they basically test you on the basics, they normally don't set you something super advanced or esotoric at this level and all of it is based on the material taught in class. What really seems to make the difference, as OP pointed out, seems to be the quality of teaching. And of course, it helps that they usually select the crème de la crème, among the applicants. But many other universities in other countries do that too, often by significantly raising the difficulty level of the entrance tests - such as in India and China - and at the end of three years or four years, the students usually still come out knowing far less than their MIT counterparts. There are several reasons US universities have a Reputation™ :P  and the quality of teaching is one of them. Granted, Mr Strang is obviously among the more brilliant teachers ones even among the Ivy League professors, but if the other professors are even half as good as this guy, I can see why unis like MIT have such a good reputation.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZtA0nghZCWX-e", "comment": "​​ @Labroidas I agree. I'm grateful to have access to these lectures, even if it is on YouTube. :P Better late than never. I love the way he connects different topics together to make one cohesive whole, later in this series, he does the same thing involving abstract algebra and calculus and it's a beautiful thing to see.  I've never had a prof this sincere. He seems  so humble too, always polite and treats both staff and students with respect, at least on camera. 😅", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzjbUchKsaVRDdzedV4AaABAg.8GbpwqcWMZtA7VJlzbriTW", "comment": "​ @music_lyrics-ni7ks In engineering it's more like 5-7", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgwD9vWN6GUgtjmZzXN4AaABAg.8GcM5Wkc0bj8ZW9wAmnP6S", "comment": "this is best course i have ever seen.", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgwD9vWN6GUgtjmZzXN4AaABAg.8GcM5Wkc0bj9hFnvex0x_9", "comment": "They have access to superior resources. Having the author of the textbook as your teacher is just", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgwD9vWN6GUgtjmZzXN4AaABAg.8GcM5Wkc0bjA0nhwN1cyER", "comment": "I still learned more from this freshman course than I did doing my Master's at our uni. :P I don't want to mention any names, but holy crap, quality of teaching really does make a difference, doesn't it?", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugws5492tgVY9oV7jpd4AaABAg", "comment": "What is the difference between space and subspace?  The dimension of both row and column space of B =[0 1; 0 0] are same, right? So they are both in the R1 subspace. So the subspace of both row and column space is equal, am I right?  ", "votes": "2", "replies": "2", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugxsg7CZSmjlbQLXVwB4AaABAg", "comment": "@hypnoticpoisons Because those are his reading glasses.", "votes": "3", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyZyvp22mXZTJXwVT14AaABAg", "comment": "love his humour!", "votes": "15", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgyH_wkh-Q3h9iIkb-F4AaABAg", "comment": "oh i'm still in highschool and i can understand and apply everything he's taught! I was wondering why he was taking his glasses off all the time", "votes": "2", "replies": "1", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgxYfuB2tPu8OH8CFol4AaABAg", "comment": "@goryans123 This professor is teaching out of a textbook he wrote too.", "votes": "0", "replies": "", "reply": false}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg", "comment": "I love you, professor. it's so important that you're doing this.  it's an absolutely right thing to do. I remember completely different professors and completely corrupted faculty in Russia.", "votes": "48", "replies": "6", "reply": false}, {"vid": "l88D4r74gtM", "cid": "Ugws5492tgVY9oV7jpd4AaABAg.8GcMWBjQ1yW8hyyhY3s627", "comment": "no. As he said, the row-space is span of (0 1)^T, whereas the column-space is span of (1 0)^T.", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "Ugws5492tgVY9oV7jpd4AaABAg.8GcMWBjQ1yW8zdsDyuMj2g", "comment": "The dimension of the two spaces is the same. That comes out of the fact that rank (A) = rank (A^T) and here, A is n x n.   But the spaces themselves are in no way the same. In fact, they’re orthogonal. One is spanned by [0 1], the other by [1 0]. So if you think about what that would look like in the 2-dimensional coordinate plane, it’s like the x and y axes. Those are not the same line at all. They’re the furthest thing you can get from being the same line actually, because they’re perpendicular and thus share no directionality whatsoever.  Also, you said the two spaces are “in the R1 subspace” - that’s incorrect. They’re not. They’re subspaces of R2. They’re one-dimensional subspaces, yes, but every element in each respective space has two real number components, so there’s no relation to R1.", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgyH_wkh-Q3h9iIkb-F4AaABAg.8Hj_cI0_wKc8npJ2U4FuSK", "comment": "he's long sighted, not near sighted. so he needs his glasses to check his notes", "votes": "1", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg.8GcUHvw01pg9AC_36rB13-", "comment": "What are you talking about?", "votes": "2", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg.8GcUHvw01pg9Ab-t7k6ieN", "comment": "​ @ccg8803  you waited 9 years to ask this. this question was probably asked in 2010. we did not even have proper 3g then", "votes": "3", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg.8GcUHvw01pg9Ab1Lui-kJG", "comment": " @saubaral  better later than never xd", "votes": "4", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg.8GcUHvw01pg9Ab8mN4bMK_", "comment": "Just imagine. 10 years later someone will see these comments :p", "votes": "0", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg.8GcUHvw01pg9E61ErRtuZI", "comment": " @ccg8803  I have heard something about the corruptness of Russian universities on a numberphile podcast episode. It talked about how they discriminated against Jews such that they would certainly not be allowed to get accepted into the university and would have to find another place (there were almost none that would accept Jews). The recruiters would ask a lot more difficult questions for the oral questioning of the subject of the Jews than for others, in hopes of them not getting them correct. They were also judged stricter, so any mistake would send them home. If they got everything correct then the recruiters would think of something even more difficult and then nitpick on very very small details to send them home, there was no possibility of getting into such universities as a Jew in Russia.", "votes": "10", "replies": "", "reply": true}, {"vid": "l88D4r74gtM", "cid": "UgzEujGe0YxpG0uIvqV4AaABAg.8GcUHvw01pg9tGlj2cFevm", "comment": "Just a random guy watching comments after a few years.", "votes": "0", "replies": "", "reply": true}]