[{"vid": "llaa-iEYDLI", "cid": "Ugzbp36ICyW8VfmtbXF4AaABAg", "comment": "While writing the electronic configuration of molecules using Molecular orbital theory we consider both anti-bonding and bonding orbital But how is it possible for both types of orbital to form at the same time for ex if p and pz orbital overlap, assuming z-axis to be internuclear axis there can only be one possibility at a time : a. If the lobes are of same phase it will form bonding molecular orbital or else b. If the lobes are of different phase it will form anti bonding molecular orbital. How can both be formed please explain??", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugx79xTqK0aKTL_R5LN4AaABAg", "comment": "43:57", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxA8xYqjRod-Nx4fl14AaABAg", "comment": "In SeH2 we were asked to find the geometry not the shape as lone pairs are not considered in shape where as in geometry we have to consider the lone pairs also ..please correct me if wrong", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgyVQ_WNwZ8IYTHK7Jt4AaABAg", "comment": "Continues to be salvation for this 53 year old former failed physics major.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxRV2Q3ALbdc0EQJJh4AaABAg", "comment": "0:21 the answer will be 5. According to  Drago's rule there will be no hybridization. As such the angel would be nearly 90°", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgzoUObA5xQo7LnuI-h4AaABAg", "comment": "how both bonding and antibonding orbitals forms at the same time if there can only be either constructive or destructive interference? not both at same time?", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxdEtFJ238SUdlg2Fh4AaABAg", "comment": "Fantastic Professor.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwmOsFBvZbHO6xYFUh4AaABAg", "comment": "hey why didnt you wrote sigma properly", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwxfcJJSX3Ahd2vxON4AaABAg", "comment": "I never expected this from mit students it's sp3 so easy", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgzPXfzqyS88YlW66Pl4AaABAg", "comment": "👍👍👍👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgyZSy49JNiatXV6AmV4AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxOxTq0o3ErLHlG2St4AaABAg", "comment": "Someone please explain to me why the SeH2 structure can't look like https://nonsibihighschool.org/intbasch11_files/image035.png but with Se instead of O. I'm confused 😅", "votes": "0", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwPkaMaFb6VYpCmGQd4AaABAg", "comment": "Best teachers", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxFmaHhkMZt9vU9GGZ4AaABAg", "comment": "Thank you MIT very cool", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgzgSh8CrnTdPBVe6_54AaABAg", "comment": "Is sp mixing is possible in N2+ and N2-", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwMuxaoD4w3NWCUFq94AaABAg", "comment": "good explanation", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgzLT804Uv8_GpZtDsB4AaABAg", "comment": "man it's very good explanation. but what is taught in Mit I am doing in my undergraduate now. BTW very nice", "votes": "0", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugx0gRsuqPmQzpRI3HF4AaABAg", "comment": "One-electron bond in He2+.  And He2 + and H2 + are equally stable, because they are connected by a one-electron bond: compare the bond energies and the bond length (see page 262 L. Pauling, Nature of the chemical bond/translation from English by M. E. Dyatkina, edited by Prof. Ya. K. Syrkin. M. L .: GNTI Chemical Literature, 1947):  E (He2 +) = 58 kcal/mole  E (H2 +) = 61 kcal/mole  L (He2 +) = 1.09 Å  L (H2 +) = 1.06 Å  The helium atom has 2 electrons and one energy level (1S). Therefore in He2 + there are 3 electrons. The assumption that the bond in He2 + is three-electron is incorrect. The multiplicity of the bond is still determined by the fundamental rule of the octet. Therefore, it is easy to show that the bond in He2 + is one-electron (hence its multiplicity is 0.5). For this it is sufficient to apply the octet rule to He2 +, look at the image.  From the picture it is obvious that in order for the octet rule to be fulfilled in He2 +, the bond must be one-electron (only one electron can belong to both atoms simultaneously). Moreover, it can be concluded that the octet rule in a \"condensed\" form reflects the balance of the Coulomb repulsive-attraction forces between the electrons and the nuclei. Since, with the example of He2 +, it is obvious that, for a three-electron bond, the nuclei would remain without electrons, which led to a strong increase in the repulsion between the helium nuclei.  The fact that using the MO method in He2 + yields a three-electron bond (with a multiplicity of 0.5) should not be misleading, since the MO method contradicts quantum mechanics. See: http://vixra.org/pdf/1704.0068v1.pdf  “Quantum-Mechanical Analysis of the MO Method and VB Method from the Position of PQS”.  The MO method are analyzed using the principle of quantum superposition (PQS). It is shown that the main assumption of the molecular orbitals method (namely, that the molecular orbital can be represented like a linear combination of overlapping atomic orbitals) enters into an insurmountable contradiction with the principle of quantum superposition.  See the answer to the quorum: https://www.quora.com/Which-is-more-stable-He2%2B-or-H2%2B-and-why/answer/Volodymyr-Bezverkhniy?share=d6838bd2  Benzene on the basis of the three-electron bond:  Review. Benzene on the Basis of the Three-Electron Bond. (The Pauli exclusion principle, Heisenberg's uncertainty principle and chemical bond). http://vixra.org/pdf/1710.0326v3.pdf   The present work shows: 1. The present work shows the inapplicability of the Pauli principle to the chemical bond (pp. 103-105).  2. In addition, a new theoretical model of the chemical bond is proposed on the Heisenberg uncertainty principle (pp. 92-103).  3. That is, in fact, in this paper it is shown that modern concepts of the chemical bond can not be strictly considered theoretically true, but rather qualitative with empirical quantitative calculations.  See all works:  1. Structure of the benzene molecule on the basis of the three-electron bond.  http://vixra.org/pdf/1606.0152v1.pdf   2. Experimental confirmation of the existence of the three-electron bond and theoretical basis ot its existence.  http://vixra.org/pdf/1606.0151v2.pdf   3. A short analysis of chemical bonds. http://vixra.org/pdf/1606.0149v2.pdf   4. Supplement to the theoretical justification of existence of the three-electron bond. http://vixra.org/pdf/1606.0150v2.pdf   5. Theory of three-electrone bond in the four works with brief comments. http://vixra.org/pdf/1607.0022v2.pdf   6. REVIEW. Benzene on the basis of the three-electron bond (93 p.). http://vixra.org/pdf/1612.0018v5.pdf   7. Quantum-mechanical aspects of the L. Pauling's resonance theory. http://vixra.org/pdf/1702.0333v2.pdf   8. Quantum-mechanical analysis of the MO method and VB method from the position of PQS.  http://vixra.org/pdf/1704.0068v1.pdf   9. Review (135 pages, full version). Benzene on the Basis of the Three-Electron Bond. (The Pauli exclusion principle, Heisenberg's uncertainty principle and chemical bond). http://vixra.org/pdf/1710.0326v3.pdf  http://vixra.org/author/bezverkhniy_volodymyr_dmytrovych", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugz27UzJE93L0NO5Fwx4AaABAg", "comment": "Not students are weak af ,avg indian student like me can solve these questions in seconds and the fuck they don't know how to draw Lewis structure....may be mit is just a name .", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugzt6yiCQ_Va16P3P8B4AaABAg", "comment": "Indians have no idea whats going on !! The students in Video aren't from MIT, instead some other students !!", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxOxTq0o3ErLHlG2St4AaABAg.9F2JL0SD8sS9J9fD44FJ18", "comment": "It can, but both H2O and SeH2 have electron pair geometry that is tetrahedral ( the Se or O is surrounded by 4 things: 2 lone pairs and the 2 hydrogens), but since the lone pairs are not atoms the molecular geometry is bent/ angular. So if you were just asked for a Lewis structure, then that structure should be sufficient. However most of the time we try to visualize the 3D structure of molecules. If this doesn't make sense, you might be at a younger chemistry grade and it will be discussed at the next grade depending on where you live or attend school.", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgzLT804Uv8_GpZtDsB4AaABAg.8hvsiC-ovfK8hyG_SvX1Mm", "comment": "Hi Debak, this also is an undergraduate course at MIT. Visit the complete course site on OCW for information and additional materials: http://ocw.mit.edu/5-111F08.", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgxEOBXhv7ndxpKI6JZ4AaABAg", "comment": "A nyc  lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwWGdLUNkpHgchmMhJ4AaABAg", "comment": "We don't get or see the He2 but we can get He+ & He- like cationic & anaionic figure......Similarly we can not watch or get the God but we can get or see the prophet/avatar/deity...and by them we can experience the God.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwL_pbpfyNFMq0BX2p4AaABAg", "comment": "plz suggested me organic chemistry book not very hard.  but it contain all basic information like that molecule is found in a that things etc.", "votes": "1", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgyLW61gKN7ulEivw9p4AaABAg", "comment": "There should be no such thing as \"copyright restrictions\" in the way of knowledge.", "votes": "18", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugw-xX6812ur6-yRj_l4AaABAg", "comment": "All this talk about pi makes me hungry ... ';-)", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgydxnoHMGywZjCd5EJ4AaABAg", "comment": "We are getting into this in the class that I'm taking.  This will be a great reinforcement to my class.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugy3jAaCCQaOecCo3P14AaABAg", "comment": "The present work shows the inapplicability of the Pauli principle to chemical bond, and a new theoretical model of the chemical bond is proposed based on the Heisenberg uncertainty principle.  Review. Benzene on the Basis of the Three-Electron Bond.  See pp. 88 - 104.  http://vixra.org/pdf/1710.0326v1.pdf    The Pauli exclusion principle and the chemical bond.  The Pauli exclusion principle — this is the fundamental principle of quantum mechanics, which asserts that two or more identical fermions (particles with half-integral spin) can not simultaneously be in the same quantum state.   Wolfgang Pauli, a Swiss theoretical physicist, formulated this principle in 1925 [1]. In chemistry exactly Pauli exclusion principle often considered as a ban on the existence of three-electron bonds with a multiplicity of 1.5, but it can be shown that Pauli exclusion principle does not prohibit the existence of three-electron bonds. To do this, analyze the Pauli exclusion principle in more detail.  According to Pauli exclusion principle in a system consisting of identical fermions, two (or more) particles can not be in the same states [2]. The corresponding formulas of the wave functions and the determinant are given in the reference (this is a standard consideration of the fermion system), but we will concentrate our attention on the derivation: \"... Of course, in this formulation, Pauli exclusion principle can only be applied to systems of weakly interacting particles, when one can speak (at least approximately on the states of individual particles) \"[2]. That is, Pauli exclusion principle can only be applied to weakly interacting particles, when one can talk about the states of individual particles.  But if we recall that any classical chemical bond is formed between two nuclei (this is a fundamental difference from atomic orbitals), which somehow \"pull\" the electrons one upon another, it is logical to assume that in the formation of a chemical bond, the electrons can no longer be regarded as weakly interacting particles . This assumption is confirmed by the earlier introduced notion of a chemical bond as a separate semi-virtual particle (natural component of the particle \"parts\" can not be weakly interacting).  Representations of the chemical bond given in the chapter \"The Principle of Heisenberg's Uncertainty and the Chemical Bond\" categorically reject the statements about the chemical bond as a system of weakly interacting electrons. On the contrary, it follows from the above description that in the chemical bond, the electrons \"lose\" their individuality and \"occupy\" the entire chemical bond, that is, the electrons in the chemical bond \"interact as much as possible\", which directly indicates the inapplicability of the Pauli exclusion principle to the chemical bond. Moreover, the quantum-mechanical uncertainty in momentum and coordinate, in fact, strictly indicates that in the chemical bond, electrons are a system of \"maximally\" strongly interacting particles, and the whole chemical bond is a separate particle in which there is no place for the notion of an \"individual\" electron, its velocity, coordinate, energy, etc., description. This is fundamentally not true. The chemical bond is a separate particle, called us \"semi-virtual particle\", it is a composite particle that consists of individual electrons (strongly interacting), and spatially located between the nuclei.  Thus, the introduction of a three-electron bond with a multiplicity of 1.5 is justified from the chemical point of view (simply explains the structure of the benzene molecule, aromaticity, the structure of organic and inorganic substances, etc.) is confirmed by the Pauli exclusion principle and the logical assumption of a chemical bond as system of strongly interacting particles (actually a separate semi-virtual particle), and as a consequence the inapplicability of the Pauli exclusion principle to a chemical bond.  Heisenberg's uncertainty principle and chemical bond. For further analysis of chemical bond, let us consider the Compton wavelength of an electron:  λc.е. = h/(m*c)= 2.4263 * 10^(-12) m  The Compton wavelength of an electron is equivalent to the wavelength of a photon whose energy is equal to the rest energy of the electron itself (the standard conclusion is given below):  λ = h/(m*v), E = h*γ, E = me*c^2, c = γ*λ, γ = c/λ  E = h*γ, E = h*(c/λ) = me*c^2, λc.е. = h/(m*c)  where λ is the Louis de Broglie wavelength, me is the mass of the electron, c, γ is the speed and frequency of light, and h is the Planck constant. It is more interesting to consider what happens to an electron in a region with linear dimensions smaller than the Compton wavelength of an electron. According to Heisenberg uncertainty in this area, we have a quantum mechanical uncertainty in the momentum of at least m*c and a quantum mechanical uncertainty in the energy of at least me*c^2 :  Δp ≥ mе*c and ΔE ≥ me*c^2  which is sufficient for the production of virtual electron-positron pairs. Therefore, in such a region the electron can no longer be regarded as a \"point object\", since it (an electron) spends part of its time in the state \"electron + pair (positron + electron)\". As a result of the above, an electron at distances smaller than the Compton length is a system with an infinite number of degrees of freedom and its interaction should be described within the framework of quantum field theory. Most importantly, the transition to the intermediate state \"electron + pair (positron + electron)\" carried per time ~ λc.е./c  Δt = λc.е./c = 2.4263*10^(-12)/(3*10^8) = 8.1*10^(-20) s  Now we will try to use all the above-mentioned to describe the chemical bond using Einstein's theory of relativity and Heisenberg's uncertainty principle. To do this, let's make one assumption: suppose that the wavelength of an electron on a Bohr orbit (the hydrogen atom) is the same Compton wavelength of an electron, but in another frame of reference, and as a result there is a 137-times greater Compton wavelength (due to the effects of relativity theory):  λc.е. = h/(m*c) = 2.4263*10^(-12) m              λb. = h/(m*v)= 2*π*R = 3.31*10^(-10) m   λb./λc.е.= 137  where R= 0.527 Å, the Bohr radius.  Since the De Broglie wavelength in a hydrogen atom (according to Bohr) is 137 times larger than the Compton wavelength of an electron, it is quite logical to assume that the energy interactions will be 137 times weaker (the longer the photon wavelength, the lower the frequency, and hence the energy ). We note that 1 / 137.036 is a fine structure constant, the fundamental physical constant characterizing the force of electromagnetic interaction was introduced into science in 1916 year by the German physicist Arnold Sommerfeld as a measure of relativistic corrections in describing atomic spectra within the framework of the model of the N. Bohr atom.  To describe the chemical bond, we use the Heisenberg uncertainty principle:  Δx*Δp ≥ ћ/2  Given the weakening of the energy interaction 137 times, the Heisenberg uncertainty principle can be written in the form:  Δx*Δp ≥ (ћ*137)/2  According to the last equation, the quantum mechanical uncertainty in the momentum of an electron in a chemical bond must be at least me * c, and the quantum mechanical uncertainty in the energy is not less than me * c ^ 2, which should also be sufficient for the production of virtual electron-positron pairs.   Therefore, in the field of chemical bonding, in this case, an electron can not be regarded as a \"point object\", since it (an electron) will spend part of its time in the state \"electron + pair (positron + electron)\", and therefore its interaction should be described in the framework of quantum field theory. This approach makes it possible to explain how, in the case of many-electron chemical bonds (two-electron, three-electron, etc.), repulsion between electrons is overcome: since the chemical bond is actually a \"boiling mass\" of electrons and positrons, virtual positrons \"help\" overcome the repulsion between electrons. This approach assumes that the chemical bond is in fact a closed spatial bag (a potential well in the energy sense), in which \"boiling\" of real electrons and also virtual positrons and electrons occurs, and the \"volume\" of this potential bag is actually a \"volume\" of chemical bond and also the spatial measure of the quantum-mechanical uncertainty in the position of the electron.  Strictly speaking, with such a consideration, the electron no longer has a certain energy, momentum, coordinates, and is no longer a \"point particle\", but actually takes up the \"whole volume\" of chemical bonding. It can be argued that in the chemical bond a single electron is depersonalized and loses its individuality, in fact it does not exist, but there is a \"boiling mass\" of real electrons and virtual positrons and electrons that by fluctuate change each other. That is, the chemical bond is actually a separate particle, as already mentioned, a semi-virtual particle. Moreover, this approach can be extended to the structure of elementary particles such as an electron or a positron: an elementary particle in this consideration is a fluctuating vacuum closed in a certain spatial bag, which is a potential well for these fluctuations.  It is especially worth noting that in this consideration, electrons are strongly interacting particles, and therefore the Pauli principle is not applicable to chemical bond (for more details, see the section \"The Pauli Principle and the Chemical Bond\") and does not prohibit the existence of the same three-electron bonds with a multiplicity of 1.5.  See pp. 88 - 104 Review. Benzene on the Basis of the Three-Electron Bond. (The Pauli exclusion principle, Heisenberg's uncertainty principle and chemical bond). http://vixra.org/pdf/1710.0326v1.pdf  Bezverkhniy (viXra): http://vixra.org/author/bezverkhniy_volodymyr_dmytrovych", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwKhZt6AqrLAXvzqAV4AaABAg", "comment": "I dont know why all this mdfkn indians come to this video if they already know this \"easy shit\".. Come on! In every video of science ive seen they post they know since kindergarten.. is this why you learn all this? To show off in youtube comments?", "votes": "0", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgynTeBAEKBho9BaQvx4AaABAg", "comment": "Why is she yelling", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwtLC0VOrE5nCgn67J4AaABAg", "comment": "no images", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgyzVKfwwy8rZ0Lcz1p4AaABAg", "comment": "We learn this in 11th grade here in India , hehe easy!", "votes": "6", "replies": "3", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiYW4ZaGLYisHgCoAEC", "comment": "I love how everyones like \"wow i could've gotten into mit how did they get that inclass clicker question wrong, I got it right gg, im a genius\", well you didn't so stfu lmao", "votes": "11", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiEDaj1oe-3eXgCoAEC", "comment": "When 30% of your class is grossly wrong, it would be worth of a little more time than a \"in pasant\" answer....", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiHR-58BC2bfHgCoAEC", "comment": "ok so now i wonder if phosphorylation in atp has something to do with this, like maybe theres a bonding orbital and an anti bonding orbital at play here? I'd be curious if anybody knows the answer.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiJq6i45kt2iHgCoAEC", "comment": "loved it  !!! lecture was super hit", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiBfO2DI5nnLXgCoAEC", "comment": "Hey! can some one explain to me why 12 electrons needed to have a full valence shell? thank you!", "votes": "0", "replies": "3", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgieNPfmilfykngCoAEC", "comment": "I really like her teaching.Thank you", "votes": "3", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggRBE4ChzrYhngCoAEC", "comment": "poorest lecture i have ever seen..", "votes": "3", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjE_fMOjTiiPXgCoAEC", "comment": "who all came here by watching thumnail. If someone has come then hit a like.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjNzrfHKJlPm3gCoAEC", "comment": "Why hasnt the reason behind why sigma2pz orbital occupies lower energy level for molecule of an element with Z>=8 been mentioned?", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwKhZt6AqrLAXvzqAV4AaABAg.8Z9fom_g3P38ZSnNnlNFvJ", "comment": "pablo fts lol", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgyzVKfwwy8rZ0Lcz1p4AaABAg.8VqgJS6Q7zi8adE4PA-GUS", "comment": "Once you enter an university even in India, you will learn all of them again.", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgyzVKfwwy8rZ0Lcz1p4AaABAg.8VqgJS6Q7zi8fkZRvsyyud", "comment": "But we won't be fooling around and taking hours to figure out Lewis structure", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgyzVKfwwy8rZ0Lcz1p4AaABAg.8VqgJS6Q7zi8fzsjoPBp9U", "comment": "I guarantee you all these students are 100 times more impressive than you.", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgiYW4ZaGLYisHgCoAEC.8VDlp7TgslT8wwnmypnLci", "comment": "Yeah - I was sort of encouraged by it - (I'm a junior college drop-out). : )", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgiBfO2DI5nnLXgCoAEC.8QG60i6WJoq8QQNu-vHwat", "comment": "hydrogen can have only 2 electrons in its valence shell and there are 2 atoms of hydrogen which means it can accommodate 4 in total and selenium can have a maximum of 8 electrons in its valence shell (octet rule) but has only 6. so when you add up 8+4 you get 12 and we have only 8(6+2) in total . I hope that helps .", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgiBfO2DI5nnLXgCoAEC.8QG60i6WJoq8QRE97F0xhP", "comment": "Thank you so much!", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgiBfO2DI5nnLXgCoAEC.8QG60i6WJoq8QRI85uSurb", "comment": "sayna sayydai No worries! Anytime!", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugie4FLdFviKFXgCoAEC", "comment": "These examples are only homonuclear diatomic molecules. Is there any video that exemplifies the heteronuclear molecules?", "votes": "3", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjRnk0SEJdTD3gCoAEC", "comment": "Love it! Annoying that you write a 2 as an a though", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghNxJBKZeiUNHgCoAEC", "comment": "these smart chicks are so sexy. Great choice MIT, I have expected an old, bearded, 60+ year old professor", "votes": "10", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgigB2Sp_N59W3gCoAEC", "comment": "Difficult content with clear explanations. Very good!", "votes": "2", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjOt9sFRNAgl3gCoAEC", "comment": "I was so confused about this in class today. This video cleared up so many things :)", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugiy-VSRNvL2lXgCoAEC", "comment": "Why π bonds are weaker while p-orbitals have higher energy than s orbitals? That will be amazing if someone reply.", "votes": "0", "replies": "5", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC", "comment": "It is pretty easy for Indian students preparing for IIT-JEE... Learnt this in class11..", "votes": "34", "replies": "8", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugj1rtpE2Sy-nngCoAEC", "comment": "thank you  very much. Brilliant teacher!!!! If I would have such a teacher in chemistry I' would be a chemist and not a physicist as I'm. :)", "votes": "2", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgimXaIQKYvPmHgCoAEC", "comment": "brlliant", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugi9-AXw2fSuDngCoAEC", "comment": "@MIT OpenCourse Ware Is this an undergraduate course?", "votes": "1", "replies": "5", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghZjv__NdC60HgCoAEC", "comment": "OCW 5.111 lectures are very good and everything is explained in details . Thanks a lot. Could you guys please upload the problem sets for 5.111 on the OCW webpage ? It would be very helpful and I don't want to go through a no. of books for problems. Thanks again", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggCQ1y6yyn0yngCoAEC", "comment": "skip to @9:02 for the beginning of the lecture", "votes": "66", "replies": "5", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjKMGPhNdD83HgCoAEC", "comment": "What does nodal plane mean ? According to the web it says a nodal plane is a plane in which the probablity of finding an electron is zero, however i could not connect the meaning of nodal plane in this video. Can someone explain the connection/use in this video ???", "votes": "0", "replies": "2", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggpkPvetsj3T3gCoAEC", "comment": "why bother if you are removing the images??", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghHk2oDmKl7BXgCoAEC", "comment": "Can anyone help me out. What does this line mean\"Things look different in different directions for molecules than their constituent atoms(mostly losing symmetry due to another atom interacting with electron). Think only of the simplest example, H-h, to appreciate why. Here space is indelibly marked by line joining(bond) the two nuclei, which defines, once and for all, what was previously an arbitrary Z-axis. There is one special direction plain to see. and (owing to this pointer in space) the molecule is denied of the s-p-d-f orbitals of hydrogen atom. Those familiar wave functions derive slolely from 1/r coulomb potential and spherical symmetry of the atom.\" ( My question, why did those orbitals were denied in hydrogen gas. This paragraph is talking about shape and how orbitals look different from their constituent atom's orbital. I really don't understand. Can you make it clear)", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghBwvuWefonongCoAEC", "comment": "Why is it at 22:00-22:30 that when there is more electron density between the 2 nuclei(in constructive interference) the interaction energy goes down? Also, what is a good explanation of interaction energy itself?", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugh1hDIfXKrk7HgCoAEC", "comment": "I want her to be my teacher !!!!", "votes": "2", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggQVjvrOWJ-fHgCoAEC", "comment": "Awesome, by far", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjcbtqdWYd9lngCoAEC", "comment": "31% ?!?! My sophmore ap chem class could get a higher percentage than that....", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC", "comment": "32% of students in an MIT class thought hydrogen selenide was linear? WTF?!", "votes": "46", "replies": "8", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghNxJBKZeiUNHgCoAEC.8HRcbK2Yoir8Wtn4yf3ed0", "comment": "zelimirvulic Bruh She is not sexy.", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgigB2Sp_N59W3gCoAEC.8G_7243OnF_8r9s-SsAq6a", "comment": "seriously difficult content we learn these stuff in INDIA in class11 search up jee advance question paper u will see what type of exams we need to sit for to make a living!!", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugiy-VSRNvL2lXgCoAEC.8BKLlTjkJls8BNQAmiyP_z", "comment": "+A.Berru Arslan A more simple explanation of why pi bonds are weaker is because of the geometry of the bond. Basically, pi bonds happen in parallel so there is much less overlap between the p orbitals than the s orbitals in a sigma bond. Also, the energy associated with the orbitals is mostly restricted to the amount of energy required to remove or dislocate an electron from that area of space (ionization or when an electron absorbs and emits radiation, thus making it \"jump\" from an orbital to the other).", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugiy-VSRNvL2lXgCoAEC.8BKLlTjkJls8BNQaaFXzUe", "comment": "+LeoM but p-orbitals have higher energy, right? The thing is I can't understand p-orbitals somehow weaker such as the geometry of the bond but contain higher energy contrastingly.", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugiy-VSRNvL2lXgCoAEC.8BKLlTjkJls8BNVmpKMLZ_", "comment": "A.Berru Arslan It is confusing, but like I said, when we talk about the energy associated with s, p, d and f orbitals, we are talking about the amount of energy required to remove an electron from that region of space. When we talk about molecular bonds, on the other hand, we actually aim to have less energy in the molecule because the bonding of orbitals from two individual atoms results in a molecule with lower energy, so it's more stable. In Pi bonds, the bonding is weaker because the p orbitals don't overlap as much and although there is a lowering of the molecule's energy, it's not as much as when you have a sigma bond from 2 s orbitals. Be careful not to confuse the energy on the orbitals with the stability of the bonds. Higher energy doesn't always mean something will be stronger, especially when we talk about wave functions.  ", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugiy-VSRNvL2lXgCoAEC.8BKLlTjkJls8BNWcUjqKup", "comment": "+LeoM thank you very much for the explaination 😇 last one more thing: since we do not consider the energy and the strength of a bond as relevant, but why do we need more energy to break the sigma bonds (don't they absorb the energy given?)?", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugiy-VSRNvL2lXgCoAEC.8BKLlTjkJls8BNbBkvNo4M", "comment": "A.Berru Arslan Well, the reason you add energy to any bonds to break them is because in adding energy you are essentially increasing the overall instability of that bond. When an orbital adsorbs energy what we mean to say is that the electron captures that energy and uses it to move away from the nucleus. In doing so, the bond was just destabilized and may be broken if that energy is not emitted. By the way, I'm not asserting these things as absolutely correct or true because I only recently started studying MOT in my inorganic chem class. I still have a lot to study so I suggest you not simply take my word for it and try to find a good textbook to do your own studying just to be safe :) ", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8J52Y09WrPU", "comment": "Ikr", "votes": "3", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8WAFtu9QmU3", "comment": "Tarun Sangwan same here in Pakistan", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8XFgHtTi_Zh", "comment": "Tarun Sangwan true", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8ZSnFip0NCY", "comment": "lol yes", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8fkZKkQdxY2", "comment": "Yup ..specially adv student .", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8fzsmWx5lbY", "comment": "Poor kid got rejected from MIT.", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8fzt_83VJk8", "comment": "Yes, and most high school students in the USA learn this, too, but they learn it again, because it's a requirement, and some students don't learn this until their freshman year. Instead, many MIT students are actually talented and varied in their skill set outside of STEM.", "votes": "3", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugg2cZ-tqJn52XgCoAEC.89b-6i1P2Qo8n5y9tcTbvj", "comment": "@Aman Kirola To hell with the \"level\" LOL.", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi9-AXw2fSuDngCoAEC.840wNnn-zrr7-KqKZcwanu", "comment": "+etienne palos Yes, this is an undergraduate course. See http://ocw.mit.edu/5-111F08 for more information and course materials.", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi9-AXw2fSuDngCoAEC.840wNnn-zrr7-LBFH7b-_c", "comment": "+MIT OpenCourseWare thank you so much! If all goes well, I will see you in four or five years! lol", "votes": "8", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi9-AXw2fSuDngCoAEC.840wNnn-zrr9LgS91CTA7Y", "comment": " @etiennepalos4319  Did you end up making it there ?", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi9-AXw2fSuDngCoAEC.840wNnn-zrr9Lguf3-dxr9", "comment": " @Frappyification  Woah! Way back! Interestingly, I would say \"yes and no\" Yes because I am currently studying a PhD in Theoretical and Computational Chemistry but no because my interests became more focused on specific groups and so I'm at UC San Diego, I didn't apply to MIT  but extremely happy here! Update on MO theory... I now have taught MO theory in an upper-division Quantum Chemistry course! So I think I made it \"up here\" in terms of chemistry (:", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi9-AXw2fSuDngCoAEC.840wNnn-zrr9Rfig66Guk9", "comment": "Bro Congrats  You aimed it and achieved it 👏 👏 👏  I won't come to MIT I go to IIT will see in 2 years", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggCQ1y6yyn0yngCoAEC.815EamgcXrp725C0gNKxLU", "comment": "Thanks :-)", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggCQ1y6yyn0yngCoAEC.815EamgcXrp8Fuq7Ki4sCj", "comment": "thanks...", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggCQ1y6yyn0yngCoAEC.815EamgcXrp8J52CEeVr7n", "comment": "Thnx", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggCQ1y6yyn0yngCoAEC.815EamgcXrp8Zdr3xC-JuK", "comment": "I wish I had read this before watching the video. ... LOL", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggCQ1y6yyn0yngCoAEC.815EamgcXrp8f0R29oWxEj", "comment": "Thnx", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjKMGPhNdD83HgCoAEC.7yyYHztE9DW7358Xa3kfSU", "comment": "nejat izar electrons can either act as a wave or as a particle. The MO theory clearly states electrons are delocalised over the molecule, which means that they are ubiquitous. Nonetheless, electrons act as a wave , and when they are being destructive ( like ripple effect when you see in a pond),  they cancel out each other. This cancellation leads to probability density (places most likely of electrons reside) being zero; thus forming a plane that no electrons dare to enter (like No man's land). So image this, two molecules have one valence electron each. When they interact, they either work together or fight each other. If working together, they are likely to achieve a common goal, being stable, which is low in energy. If they choose to not cooperate, pushing each other away seems to be a reasonable choice. The latter consequently create a area between them where no electrons can cross.", "votes": "3", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjKMGPhNdD83HgCoAEC.7yyYHztE9DW8IfUeQLf686", "comment": "Great explanation. If they chose not to cooperate, does this mean they will anti-bond(*) and will this require a high energy?", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi8Tosh-zav_3", "comment": "Adnan Bashir you are wrong too. the angle is 91°. selenide doesn't undergo hybridisation.", "votes": "3", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi8fkZHsWDqI_", "comment": "Yeah they are weak af", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi8fzsxag56K-", "comment": "You failed to get into MIT, and you think because you got a clicker question right in a general requirement freshman class you're smart! Wrong!", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi8lYuNC_C2du", "comment": "Getting into schools like MIT takes a lot more than intelligence.  There is a certain amount of privilege that's needed.", "votes": "6", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi96W0N14m0DQ", "comment": "Drago's Rule Broo..", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi96W0PNrgn-4", "comment": " @rahulhuda123321  Drago's rule", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi9IaY9_K0K9g", "comment": "It's sp3 very very easy question", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghvgJvEwlapfHgCoAEC.7-H0Z7-L1Vi9OSnDgmpe-b", "comment": " @zainulabideenalikhan5849  answering a comment wrote 7 years ago is like shaking a coke before drink it", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjLxERaQhZZ7ngCoAEC", "comment": "mit students cant put together that seh2 has 4 e- groups in less than a minute  good job america", "votes": "11", "replies": "2", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjwDzLm9gUBg3gCoAEC", "comment": "Is not a \"constructive interference\" an oxymoron?", "votes": "0", "replies": "1", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghXF-n0aUCjR3gCoAEC", "comment": "44:05 diissisoseeation E mental note", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugjzah_EblzDTXgCoAEC", "comment": "29:43 mental note binding E of He2", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiYEEbdAt60uXgCoAEC", "comment": "7:10  Great Image!!!  Poor Jellyfish. ", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiqgvhwLaZ9sXgCoAEC", "comment": "Removing an image due to copyright is so pathethic.   Its almost as pathetic as those 31% that said linear.  Maybe a direct correlation?  No offense intended.", "votes": "4", "replies": "2", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggmmsMyM8RlPXgCoAEC", "comment": "How can I find the Fridays lesson(next one)??", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugig2sgaIe95kngCoAEC", "comment": "WOW! Cool teacher nice explanation MIT's cool.", "votes": "2", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggVWLlrutiowXgCoAEC", "comment": "Thats what i studied during my highschool in India easy as 1+2+3=6", "votes": "21", "replies": "4", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugj8uzfd1_8aF3gCoAEC", "comment": "Amazing! In the textbooks, its written so straightforward. I loved everything about this lecture- presentation, content, quality, everything. Thumbs up!", "votes": "4", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugg6mAAUPVCkc3gCoAEC", "comment": "very usefull video....i like it very much", "votes": "1", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjB1WmCBHHcH3gCoAEC", "comment": "Why does she say at the end that the sigma 2p orbital in N2 is higher in energy than the pi 2p orbitals? Can someone explain why that is?", "votes": "1", "replies": "2", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugjir-iwJPNQWngCoAEC", "comment": "Thanx so much love ur teaching", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggDwoUxNy06tHgCoAEC", "comment": "The topic of this lecture starts actually at 9:30, for time saving. This shows a good lecture of molecular orbital diagrams but only in the case of simple diatomic compounds, not the things like DMSO, trimethyl phosphinoxide,... (which are highschool questions in Europe)", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugj73SgxZ63xGngCoAEC", "comment": "thanx,,,,,,,now i am capeble to find bond ordar", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggvzpEvLEvPn3gCoAEC", "comment": "one of the best lecturers...great speaker", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UghCML-nUweiAngCoAEC", "comment": "49:25 saved my life, but start at 46:43 and go to 49:25.  I've been looking around the internet for this answer for 2 hours.  I missed class today I bet they covered it today.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugi5_iN_VhXX4ngCoAEC", "comment": "I noticed that the O2 MO diagram shows the sigma2pz is lower in energy and sigma2pz* is higher in energy than their pi2px and pi2py counterparts, but in the N2 model, the pi2px and pi2py energies are lower than the sigma2pz but the pi2p* and sigma2p* levels are not a mirror image, like the O2 diagram is. Is this change intentional? In other words, (at timestamp ~50:35), is the sigma2pz* meant to be the highest energy level?", "votes": "2", "replies": "2", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UggdZkh4_XawXXgCoAEC", "comment": "What MIT is doing is admirable. Every educational institution should do the same  ", "votes": "75", "replies": "2", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiSB5B40zPdIXgCoAEC", "comment": "it's a steal to have these online, thank you so much for having these", "votes": "7", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgjLxERaQhZZ7ngCoAEC.7-H0Z7-N1r775fLUhIbPcV", "comment": "maybe I should have applied to MIT I wonder what kind of filters they go through.. It is honestly just intimidating to apply there", "votes": "4", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjLxERaQhZZ7ngCoAEC.7-H0Z7-N1r78wwrFJNdwoH", "comment": "If MIT applicants are supposed to already know this shit, then why do they have a class for it? I suspect that most talented kids don't have competent high school science teachers. In my day high schools were too busy misinforming us about US history.", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjwDzLm9gUBg3gCoAEC.7-H0Z7-Fo9k87R-h3lXXCG", "comment": "no", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgiqgvhwLaZ9sXgCoAEC.7-H0Z7-Ue8B7-HUBnWMgHq", "comment": "Prior to 2009, MIT OpenCourseWare published only content that it could publish under the Creative Commons license (Attribution-NonCommercial-ShareAlike). After 2009 MIT OpenCourseWare allowed content that could be published under the Fair Use defense.", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgiqgvhwLaZ9sXgCoAEC.7-H0Z7-Ue8B705NKM-1j6J", "comment": "CarlosE Recinos A better analogy would be that we are giving the car to the beggar. Before 2009, we owned everything in the car and would give it to you free as long as you mention that you got it from us, didn't try to sell it for money, and if you made any changes to the car; you would give it away like we did with our car. After 2009, we might give you a car that we didn't fully own and the police could fine you for the parts we didn't own if you weren't using it for educational purposes, or you used too much of it, or effect the value of the car part, etc.", "votes": "40", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggVWLlrutiowXgCoAEC.7-H0Z7-QqDv8RPSjakVAjP", "comment": "indians are so... extra", "votes": "4", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggVWLlrutiowXgCoAEC.7-H0Z7-QqDv8T4Hm-Q5e9o", "comment": "pavit bhagat we learnt this at high school too but you can't think everyone to know all this they are starters", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggVWLlrutiowXgCoAEC.7-H0Z7-QqDv8VAuiFTJhXv", "comment": "yet you're still here watching this video so you can troll. your mother would be proud. keep your pride to yourself. no one else gives a shit how smart you are.", "votes": "5", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggVWLlrutiowXgCoAEC.7-H0Z7-QqDv8YyQxoUMPXP", "comment": "john rogers  I m in high school n m from India...m learning this now but who learns this at university", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjB1WmCBHHcH3gCoAEC.7-H0Z7-7wNL74FzphL8mi_", "comment": "it happens when s-p orbitals mix. but that is all I can figure out sorry i dont know why they mix only in groups 3a-5a or why there E level is lower", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UgjB1WmCBHHcH3gCoAEC.7-H0Z7-7wNL7BwXZgtfMVX", "comment": "Adam Wojtczak I have the same question. I thought it should be in the order of: 1sigma g, 1sigma u*, 1pi u, 2sigma g, 1pi g*, 2sigma u* with exeptions for O2 and F2 where 2sigma g and 1pi u are turned. +MIT OpenCourseWare why does she tell us different?", "votes": "2", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi5_iN_VhXX4ngCoAEC.7-H0Z7-C9SV71-Ks_yMGCk", "comment": "I was wondering that too.  I'm guessing that it's an error: that the energy decrease from bonding is still the same as the energy increase from anti-bonding.  But that's just a guess.", "votes": "1", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "Ugi5_iN_VhXX4ngCoAEC.7-H0Z7-C9SV77tXle22GIk", "comment": "Dan Wylie-Sears it is not an error the anti bonding E levels never change but the bonding levels change depending on the group <6a and pi is lower E than sigma", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggdZkh4_XawXXgCoAEC.7-H0Z7-ABDR75_qlI-EAwE", "comment": "Ashish Shukla why???", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UggdZkh4_XawXXgCoAEC.7-H0Z7-ABDR75a9238p5tY", "comment": "no need my work's done. ", "votes": "0", "replies": "", "reply": true}, {"vid": "llaa-iEYDLI", "cid": "UghrWEQYvnw7sHgCoAEC", "comment": "Thank u very much sir it was very useful", "votes": "1", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgiNQ7AhVM5OlHgCoAEC", "comment": "When the electrons fill in the MOs, how do you know that they fill the MOs in that order (i.e. sigma first, then sigma stars)? Why do they even fill in the antibonding MOs if they actually want to bond?", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugi4AA7iZCLD73gCoAEC", "comment": "Is there either another MIT course or some other resource where I could find a much more in depth treatment of MO theory (upper undergraduate to graduate level)? Any help is appreciated!", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwA8-6Lt8szivhey494AaABAg", "comment": "hikguru, all 2p orbitals (x, y and z) have the same energy. You can pick whichever combination of them and you're gonna get the same results.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgyAB6Omxwafp6tjXtZ4AaABAg", "comment": "Why do electrons preferentially occupy 2px and 2py states as opposed to 2pz?  For C, why do the 2 2p electrons occupy 2px and 2py but not occupy 2pz?  If that happens then in the MO picture the sigma 2pz would and pi 2px would get occupied (instead of both pi 2px and 2py).  In other words there would be 2 sigma bonds, not 1 sigma and 1 pi.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgwbdjURprot1gGYHXZ4AaABAg", "comment": "I want this video on my\tOptimus Chic E720 unit.", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgzbqAcXs1vrzuwNuC54AaABAg", "comment": "@zixerqwert  Why wouldn't I reply? It's not like I was watching the video 100% of the time. I had 51 minutes to find your stupid comment and fight the urge to reply. :-)", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugw7bxRQts5uAXPY1c94AaABAg", "comment": "@zixerqwert  @zixerqwert Reallllllly? This was a clicker question at the beginning of class, not a quiz or exam question. Clicker questions are used for attendance. Sometimes people don't pay attention to it and they just click something so they're marked as being there. Why waste your time being irritating when this lecture is posted here for your benefit?", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxLJ3h7jwx7G9dvDkN4AaABAg", "comment": "@zixerqwert  I'm a student at U.W.I in Jamaica, I share the same surprise. ", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "Ugw9xBpdTCUJsSVLaAZ4AaABAg", "comment": "@LordAlda yeah \r \r ", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgxlKmLTON27s5ae12F4AaABAg", "comment": "roger tsein, not robert tsein", "votes": "0", "replies": "", "reply": false}, {"vid": "llaa-iEYDLI", "cid": "UgyBwoxzTlLtyU1i0Ih4AaABAg", "comment": "In the case of Be2, How do we know that sigma2* has a lower energy than pi2. That is, how do we know that the 2pi orbital does not fill up before the 2 sigma* orbital thus making the molecule stable?", "votes": "0", "replies": "", "reply": false}]