[{"vid": "lLY1u2aghIQ", "cid": "UgyeXVvFy72hpOqJoyp4AaABAg", "comment": "I feel like I'm missing something. What prerequisite would you recommend.", "votes": "0", "replies": "2", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgwbpuIHtvIib712hHZ4AaABAg", "comment": "I love this professor ❤ he is the best", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgzN_HgcO6inEhPPnBd4AaABAg", "comment": "The lecturer has sharp didactical skills, he masters the subject matter and he is an excellent scientist. That is why those gifted students in the classroom are seemingly having fun by taking the class. I would recomend anyone, who is intrinsically motivated to learn by attending to a teaching conversation with the lecturer, to watching these sequence of 24 lessons.", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgzTwBSsXt1MKeD6PjN4AaABAg", "comment": "A total confused lecturer! No clarity what he is saying and expecting. A big fun!", "votes": "1", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgyJc5hxFGePy-3eI854AaABAg", "comment": "# of saturday afternoons that I have had fun drawing curves: 0", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgwJJRg0Qtx8fykDyz54AaABAg", "comment": "Cần 1 phụ đề tiếng Việt", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "Ugy-dW1N9-1JlFYQG4p4AaABAg", "comment": "The professors examples for developing an intuition of the Michaelis-Menten equations were poor. I find it more intuitive to consider the rates of change of E, S, ES, and P with respect to the diagram. I also thought his attempt to describe the problems with the schematic diagram was more confusing than elucidating. I think working through the derivation (when properly understood) provides the intuition necessary for the equations to become clear. Once caveat to this is I have a strong math background, but even for those without (assuming differential calculus is a prerequisite) it should be more clear.", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgyAIyM5TWd1dYPaP3V4AaABAg", "comment": "He mentions that the [ES] inhibitor would produce a curve where Km is not affected while the Vmax is affected, which isn't the case. The enzyme inhibitor binding to the complex only is called the uncompetitive inhibitor, which lowers both.  Overall, I do think the series is good. Just have a basic understanding of all material (provided in their opencourseware website), then you can learn the things you need without getting confused.", "votes": "1", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgxooRAIHapxxmpWTN14AaABAg", "comment": "akward professor", "votes": "2", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "Ugw8-JOq8TqALiD4yLF4AaABAg", "comment": "at around 47 min I think he uses the word \"enzyme\" for \"catalyst\", which is very confusing", "votes": "2", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgjVank59Sj2R3gCoAEC", "comment": "Wow, this makes way more sense when you review what a limit is. I was all kinds of confused about the answers to the 0 and infinity hypothetical questions until I reviewed the concept of limits taken over a period of time.", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "Ugi28rL0_fHjb3gCoAEC", "comment": "he keeps saying S for Enzyme !!!   ?Am i getting it right or i should just quite  ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UghHX5EK5fWvN3gCoAEC", "comment": "DATA PROCESSING (INDUSTRY)1.2.", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "Ughl7VELBneft3gCoAEC", "comment": "Heads Normal speed links to lecture16 & Lecture1 and CompuTer Mathematics Thumbs up @ 4 Thumbs Down @ 0 ({[coin spins>:.. Heads]})  thumbs up @ 5 Thunbs Down @ 0 gonna do the same on next coin spin with the corresponding answer ...3,2,1 <questions> hey what do you thinks its gonna be ee bee fter this post is posted? Whois? hey t is to + like addition is to multiplication.                              =|+", "votes": "0", "replies": "", "reply": false}, {"vid": "lLY1u2aghIQ", "cid": "UgyeXVvFy72hpOqJoyp4AaABAg.A4UC_rNkU_-A4Ya-GEgX5h", "comment": "From the course syllabus, \"Prerequisites Given the wide range of backgrounds among students in this class we will try to avoid unnecessary jargon and mathematics. However, it will be very helpful if you are comfortable with the material in Introductory Biology 7.012, Differential Equations 18.03, and Probability 18.05. In addition, each weekly problem set will have a computational problem, so prior experience with a computational package such as MATLAB®, Mathematica®, or Python is expected. The “officially supported” package will be Python (sample code, etc), but problems can be done in any language.\" Visit the course on MIT OpenCOurseWare for more info at: http://ocw.mit.edu/8-591JF14. Best wishes on your studies!", "votes": "2", "replies": "", "reply": true}, {"vid": "lLY1u2aghIQ", "cid": "UgyeXVvFy72hpOqJoyp4AaABAg.A4UC_rNkU_-A4YuhYiemKR", "comment": " @mitocw  okay. Thank you.", "votes": "0", "replies": "", "reply": true}, {"vid": "lLY1u2aghIQ", "cid": "Ugi28rL0_fHjb3gCoAEC.85ijyVJxyPU8EVPetGjDgM", "comment": "E-enzyme S-substrate", "votes": "0", "replies": "", "reply": true}]