[{"vid": "Mqml5LS31j8", "cid": "UgygocUIK0fU7aWA4894AaABAg", "comment": "Very good and funny videos bring a great sense of entertainment!", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgwKH96reqfWp_WSri54AaABAg", "comment": "So it concludes here that we are actually taking the resulting Heat of Solution (whether it is positive or negative) as the basis to tell whether the Heat of Solution could either be Endothermic or Exothermic. How about taking into account of the Change in Temperature? Does it makes sense if we take Change in Temperature as the basis to tell whether exothermic or endothermic???", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgxPqzMSBl_oZOeq40l4AaABAg", "comment": "Dear Sir,  I am a student from Australia. Your video lectures are excellent. I have a question on ionic compound solubility (NaCl in water) which my textbook and other videos on youtube channel could not give me a satisfactory answer. The answer I got from was that: When considering why the compound is dissolved, we must consider 3 intermolecular forces: Solute - solute, solvent - solvent and solute- solvent IMF. In the case of NaCl, the solvent - solute IMF is ion dipole force which is a strong IMF therefore it will overcome the solute - solute IMF (ionic bond). However, the ion dipole force is clearly weaker than the ionic bond. I could not figure out how the ion dipole force could break the ionic bond. Furthermore, it could not explain why some ionic compounds such as silver chloride is insoluble in water.  Your expert opinion is much appreciated.", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ugjf9n9xOAn1IXgCoAEC", "comment": "Thanku so much sir.", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgjuTfKC3EhepHgCoAEC", "comment": "thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ughk6cwXO9rpwngCoAEC", "comment": "a new fan of AK LECTURES ! <3 Thank you for all the helpful videos, they are always very detailed and super informative, yet you make it very simple to understand :)", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ugham07C31zkwngCoAEC", "comment": "Very helpful video! Keep up the good work :)", "votes": "0", "replies": "1", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgjDMcyKp_eyrHgCoAEC", "comment": "Thank you, your video is easy to understand and focused", "votes": "2", "replies": "1", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgwXofxKWt3Ko2TlA6p4AaABAg", "comment": "You're welcome : ) I hear you on that one.", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ugx9P4L2b3t7jglu2Fd4AaABAg", "comment": "The true definition of spontaneity requires ONLY that ∆S of the universe to be positive under ANY conditions. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgwFHMKSM70KJYyPguZ4AaABAg", "comment": "You are probably referring to the equation ∆G=∆H-T∆S.  Notice that all variables in this equation refer to the system and not the surroundings. According to this equation, equilibrium is achieved when the change in Gibbs Free Energy is zero. BUT this only works for constant temperature, pressure, PV work only and a reversible reaction. When this conditions arent held constant, the equation breaks down. Therefore, this is not the true definition of spontaneity.", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ugy05Vp-kxImxZLHsRZ4AaABAg", "comment": "Absolutely not. That is a very common misconception. At a very basic level (usually high school or introductory college courses), you use that equation to consider spontaneity and it works for certain situations. Maybe I will explain this point in a future video.", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ugzcme1zb3p5uNCmoDV4AaABAg", "comment": "Glad to hear it! Good luck on that test, let me know how it goes.", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgxlaAFA2CTWQSPLuzB4AaABAg", "comment": "I have a test on this stuff in a few days and I was staring at my notes for and hour, but I got it in under 5 minutes with this video Thank you so much! ", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "UgyDi3yEtx11WLsfyH94AaABAg", "comment": "I think I make it clear enough. I assume pressure,temperature and the mass is constant. So if you are looking at an ideal fluid, change in volume is zero. And that will approximate change in enthalpy to equal the internal energy of the system. ", "votes": "0", "replies": "", "reply": false}, {"vid": "Mqml5LS31j8", "cid": "Ugham07C31zkwngCoAEC.7-H0Z7-QXru7-IWsIGUmm8", "comment": "Thanks! Will do :)", "votes": "0", "replies": "", "reply": true}, {"vid": "Mqml5LS31j8", "cid": "UgjDMcyKp_eyrHgCoAEC.7-H0Z7--W547-IJgvToOfk", "comment": "Thank you! Thats great to hear! :)", "votes": "0", "replies": "", "reply": true}]