[{"vid": "nmehlS-8b3Y", "cid": "UgyRY5RFTZ62WK_niB14AaABAg", "comment": "1:12:16 Fuelmodel", "votes": "1", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UgywxGmuFiEh_4AY0Q54AaABAg", "comment": "That’s tough", "votes": "0", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UgzZ_3iQkmB178mfHp54AaABAg", "comment": "Ah, so at 21:30 he pretty much simulates a covered call, utilizing the spread in between option premium and storage price to profit. While having the ability to purchase the commodity and sell it for the spread.", "votes": "0", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UgzJY9lyS2yIjfanxWt4AaABAg", "comment": "very cool. Mean reversion from temperature and spikes from the bid stack.", "votes": "1", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UgxWGVHXAjDmmTXLqNd4AaABAg", "comment": "1:11:29 I wonder what would the dynamics of the power prices become in 10 years if we could somehow find a practical and reliable way to store electricity (and thus power)? Maybe at that time those nasty spikes in the time series would be mostly gone.", "votes": "1", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "Ugz7LzhCMsuKcgKN-2J4AaABAg", "comment": "19:19 Just realised how amazing this is. You are effectively using the storage to hedge your short position of the spread option, in other words you are replicating the option by the physical ability to store commodities. And on top of that, you are using dynamic hedging to replicate the option. The first quant who discovered this \"double hedging\" strategy was wicked smart.", "votes": "9", "replies": "1", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "Ugxa5RihBnyUJIXCLRN4AaABAg", "comment": "13:40 isn't that a calendar spread?", "votes": "1", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UgzGVtw2ESUy7WgpE0J4AaABAg", "comment": "The observant north nearly boil because pink literally spoil following a annoying laundry. enthusiastic, fearful fearless activity", "votes": "0", "replies": "2", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "Ugxzd84qjDK4Qp190D14AaABAg", "comment": "when you will time lot of person cheating   .....  y we have said   26 LAX LOSE", "votes": "0", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UghjB6529pGnk3gCoAEC", "comment": "Very interesting. Showed me how a tie to a physical commodity constrains a financial instrument - and makes it much more effectively amenable to traditional modeling.", "votes": "10", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "UgjILLcpe-ffO3gCoAEC", "comment": "9:35 Actually, you don't need to wait a year for the profit. You get your profit immediately since futures payments are made upfront, regardless of when the delivery is. So, when you deliver the oil to your customer a year later,  you already had the payment for it for a year.  11:51 Actually, you don't borrow money in August, either, because, again, futures payments are made upfront. So unless you first sell the promise to sell in Dec and then use the proceeds from that to very quickly buy the promise to deliver you the oil in Aug, you have to borrow right now.", "votes": "3", "replies": "2", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "Ugh0YbHoOcJ-2HgCoAEC", "comment": "Nice lecture.", "votes": "2", "replies": "", "reply": false}, {"vid": "nmehlS-8b3Y", "cid": "Ugz7LzhCMsuKcgKN-2J4AaABAg.9fvqlPr6OLO9zZL5rX0JQk", "comment": "Tbh, I didn't get one thing. On July 31 we have that Aug 23 contract is at 55$ and Dec at 80$, so we owe 25$ due to expiration of the option. How does the hedge with the storage work?  On the same date I go long on Aug and short on Dec, but the profit of 25$ will be made on Dec, right? I mean, on July I'll be \"virtually\" hedged, so I have to borrow the money to pay the debt due to the option sold, but this money will be recovered in December.  Is that correct?", "votes": "0", "replies": "", "reply": true}, {"vid": "nmehlS-8b3Y", "cid": "UgzGVtw2ESUy7WgpE0J4AaABAg.9LF-L6_SX2E9Uj8pQSrKLH", "comment": "What?", "votes": "0", "replies": "", "reply": true}, {"vid": "nmehlS-8b3Y", "cid": "UgzGVtw2ESUy7WgpE0J4AaABAg.9LF-L6_SX2E9fqXojrA7E8", "comment": "Deep stuff!", "votes": "0", "replies": "", "reply": true}, {"vid": "nmehlS-8b3Y", "cid": "UgjILLcpe-ffO3gCoAEC.89nzET1jG_e9Pt6Dm14uTo", "comment": "Pretty sure futures only require a collateral post And you only get 'payment' of the difference as the futures spot gap closes", "votes": "3", "replies": "", "reply": true}, {"vid": "nmehlS-8b3Y", "cid": "UgjILLcpe-ffO3gCoAEC.89nzET1jG_e9gExELzWvev", "comment": " @KingXKok  yea exactly... but then I'm not sure how that hedging strategy of longing Aug future and shorting Dec future can offset the short position from the option. You won't get payment of +$25 on 31Jul so you still need to find ways to borrow that money no?", "votes": "1", "replies": "", "reply": true}]