[{"vid": "nvxvcbaoayM", "cid": "UgxQYdsB_3aLaRz4xaF4AaABAg", "comment": "Good lecture, although it doesn’t seem to me that the teacher properly addressed the student question at 40:00, which I understand is about somehow confirming the specificity of the antibody. This can be shown by, say, a western blot in which you ran the purified antigen, and possibly, a protein extract containing the protein with the relevant epitope.", "votes": "0", "replies": "", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgzDX4cNh0NmrV4e3D14AaABAg", "comment": "Barbara Imperiali is secretly the thought emporium in disgiused", "votes": "1", "replies": "", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgyzgaqX7WJn-_oZlTJ4AaABAg", "comment": "4:48 cuttlefish? I thought it was a squid... But I can't see it's fine in the darkness. Google lens says firefly squid but if a cuttlefish exists than probably google cannot distinguish it in that darkness 🤔 If my short systematic summary I did a while back is correct squids and cuttlefish belong to different orders. Both are Decabrachia apparently, however 🤔 So if it is a cuttlefish, does anyone know the species?", "votes": "0", "replies": "2", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgxrJQszo4VPW3grzr94AaABAg", "comment": "The title of both of these lecturers is “Professor”. It is somewhat rude to present these videos without the use of this title in their name. Would the editors please keep this in mind for future lectures and lecturers  Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgzJYNOFlj6903J6noZ4AaABAg", "comment": "👍👍👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgxzTtLYi17pBiGW_tZ4AaABAg", "comment": "https://learn.genetics.utah.edu/content/labs/microarray/", "votes": "0", "replies": "", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgzKdJhoQRbf56_Jatt4AaABAg", "comment": "Loved the lecture ❣️", "votes": "8", "replies": "", "reply": false}, {"vid": "nvxvcbaoayM", "cid": "UgyzgaqX7WJn-_oZlTJ4AaABAg.9Qw0QA263p49TNmO4-fNXn", "comment": "Yeah that's,I think,squid.Cuttle fish has a pair of fin like extension laterally from the mid-posterior position.", "votes": "0", "replies": "", "reply": true}, {"vid": "nvxvcbaoayM", "cid": "UgyzgaqX7WJn-_oZlTJ4AaABAg.9Qw0QA263p49TO5TTjZZ8T", "comment": " @arnabdas5883  that plus w-shaped pupils is how I learned to tell those two apart. A small bit is their pose but that does not apply always (/--) like that kinda, tentacles more obliquely compared to the body. And squids with about two fins, octopedes I think have none (although there was this flapjack octopus....) and no two tentacles. Is that correct? I really have to learn more about cephalopods....", "votes": "0", "replies": "", "reply": true}]