[{"vid": "oI9fMUqgfxY", "cid": "UgzJVRZUKosBHHn5p2F4AaABAg", "comment": "I can't see any card.", "votes": "1", "replies": "", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UgxCBawp1FUZRjQYL2N4AaABAg", "comment": "Barney Stinson double", "votes": "1", "replies": "", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UgygJu8avu2ybFyytph4AaABAg", "comment": "God saide, professor Leigh overstepped his boundaries that semester?.", "votes": "0", "replies": "", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UgxLFzQ0MX6Jxo8NVMN4AaABAg", "comment": "This is another fantastic lecture on Expectation as it relates to the world of Computer Science. Professor Tom Leighton continues to challenge each MIT Computer Science student from a theoretical  side to a practical side of Computer Science. Each student in Computer Science should realize how important Probability Theory is to Computer Scientist in this world.", "votes": "2", "replies": "", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UgxxzYiUVdqEaOKNPH54AaABAg", "comment": "We can figure out the professor's number exactly, just by noting  which card he took a peep. No statistics involved.", "votes": "3", "replies": "1", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UgihJnjn9AtAkngCoAEC", "comment": "Coin flipping game   what? real#01   Hey so I forgot to post notes on like too as if   WRINKLES INT THE WIND By SMOOT | that ya watch the BIG BANG THEORY   <EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEeeeeeeeee>Natural Numbers                                                     |                                                         C                                                           /Comps.                                                           \\\"OH\"                                                                       wh@                                                                           W^                                                                              w&                                                                                      (<#SpaceJam:Mon*s>)                                                                                               =", "votes": "0", "replies": "", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC", "comment": "I'm a business informatics student so I am taking introduction to computer science and computer programming,  and so far I hate everything that has to do with this major aside from these 2 courses which I am really enjoying so far, so I am considering changing to a computer science and engineering major,  but I want to make sure this is what I will enjoy before I make this change so I am researching some stuff  relating to computer science online, one of which being discrete mathematics.  Do you think discrete maths gives good insight on how CS is like?  How about 'Theory of computation' and 'Intro to Artificial Intelligence'?  Do you have any other recommendations for courses or subjects that DO give good insight on CS and  do not have any course prerequisites so I can look into them and be able to follow? Thanks in advance to those  who take the time to answer and help :) Apologies if this has spammed you on more than one video. I'm just trying to get as much information as possible.", "votes": "5", "replies": "12", "reply": false}, {"vid": "oI9fMUqgfxY", "cid": "UgxxzYiUVdqEaOKNPH54AaABAg.8d3z4AUhQW59_yy4Ar_KY2", "comment": "yeah, I did wonder why he has to look at some of those cards.", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY8N3mNYTqmRS", "comment": "How's it going?", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY8N49U51h108", "comment": "Quanxiang Loo Hey, since then I have indeed changed majors to Computer Science and Engineering. I'm not sure what you're asking about so if you can clarify so I can properly answer. How is what going?", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY8N5WpEExhDT", "comment": "Kalernor I was curious to know whether you made the decision to switch majors in the end, to which, as you have mentioned you did indeed switch. Given that, I am also curious to know whether the switch gave you what you expected and how your experience is in your new major compared to your previous one.", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY8N7nJRNQYJV", "comment": "I am very happy with my decision. I am enjoying the breadth in topics in computer science and computer engineering. Also since in my country certain courses are obligatory in any engineering major(maths and physics) I am having fun with those as well. If I had to boil both majors down, the beneficial courses for work in IT industry are shared by both majors. While definitely not for me, I do think Business Informatics is a great and unique major. I guess I just have more of an engineering mindset and tend to enjoy those types of courses way more:) Also I developed a passion generally for the discipline of computer science as a whole, which is why I'm enjoying the many diverse courses I am taking even though they may not have any use in work in industry. Sorry my thoughts and writing are a bit unorganized I'm typing this in bed as I'm about to sleep", "votes": "7", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY8O1WUnGxb79", "comment": "Education and training are not the same thing. Sometimes just loving what you learn, even though it may seem \"useless\" at first, will bring you further in the long run! (:", "votes": "6", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY98_4RbKLHh6", "comment": "How is it going", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY98_7zPzsG9P", "comment": "Is Discreet Math big part of CS?", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY98_FNKnLLRV", "comment": " @europebasedvlogs1251  If by CS you mean the degree, then yes, it is important for most courses that involve theoretical work.   Alternatively if by CS you mean the work space, then it depends on what your career aspirations are. If you plan to work in research in a field that involves some theoretical work, then it is very important. If you plan to work in industry, then on average I would say it is not so important, but it will develop your problem-solving and logical thinking skills, which can be useful in any type of programming task. Also, some Discrete Maths courses cover things useful for competitive programming, which is a helpful activity to participate in if you plan on applying for a job at places like Google.", "votes": "1", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY9Qa9zV3tyge", "comment": " @Kalernor  Hello Kalernor. I am just about to begin my Computer Science degree and I have some doubts that you have gone through 6 years ago. I know nothing about computer science and programming in general. I was good at math, pre- calc and some of the calc1. But lots of people told me liking math and being good at it doesnt guarantee a good experience with CS.  I wanted to see how many people came this far in the course and saw your comment. Do you think watching this Discrete Math playlist would be enough to understand if I will like and do well in my major or not? Should I start a Java or Python course as well to really dive in and see if I will be good at it?", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY9Xc3TFxyF7S", "comment": " @berk7944  How's it going?", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY9XcBxW5gjfj", "comment": " @zombiesalad2722  Pretty great so far. Programming is a bit different than studying Math or any other class. Its not just theoretical and calculations, you have to practice like its a physical thing. And definitely studying last week doesnt cut it. You can study less than other classes in a day but it has to be regularly. Consistency is the key. I suggest checking few udemy courses if you plan to start. The things you cover ends in just few weeks but you get more mileage which will give you an advantage over people. Knowing something isnt equal to being able to do it in coding so extra experience is great.", "votes": "0", "replies": "", "reply": true}, {"vid": "oI9fMUqgfxY", "cid": "UggJ0X1PxmM0engCoAEC.8-42h4E4EqY9XcPmeL-soq", "comment": " @berk7944  That's good to know! I agree that programming is different, but I feel that computer science is not just about programming. You get a learn about data structures and algorithms, operating systems, theory of computation, compilers etc. They really change the way how you look at code and how you approach new problems. I'd recommend you to check out Linux if you're not already using it, it's such a nice os to program on.", "votes": "1", "replies": "", "reply": true}]