[{"vid": "OjhZYx1FbhI", "cid": "UgwDxdqT5N3mlHAR5OF4AaABAg", "comment": "Thanks ❤️🤍", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxgGRekl7NytvbvKGh4AaABAg", "comment": "This is helpful ❤️🤍", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgyL232JUkZMv1X7jKt4AaABAg", "comment": "ABCDE(2.98765) ABCD(3.291465990471957) ABC(4.288665936532518) AB(4.364771916249741) A(4.442463277327811)   A minus tanA =AB; AB minus sinAB= ABC;  ABC minus cosABC=ABCD;  ABCD minus1/xABCD=ABCDE  4.442463277327811 minus tan4.442463277327811 equal 4.364771916249741; minus sin(4.364771916249741) equal  (4.288665936532518); (4.288665936532518)minus cos(4.288665936532518) =(3.291465990471957); minus 1/x(3.291465990471957)= 2.98765", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgyqgAexZ3lAMVoFP4V4AaABAg", "comment": "17:00 Those TA not wearing safety glasses is an OSHA violation.", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugx0x2JbAsVyK53aG_R4AaABAg", "comment": "Mam I think that change in any state function never be a state function, it is just path I dependent. So change in entropy is not a state function. (Peter Atkins and Levine", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugyk0sdakBnTr4wYPPd4AaABAg", "comment": "Cars rust in the north because they salt rhe roads for ice and do not in the south", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxngI-7ihWFey1XwdJ4AaABAg", "comment": "I know college isn’t the place for lon eye opening lectures but they at least should have put in the calculatoins for ΔG when K = 273,15 and one degree under and above to explain that the same reasoning but vice versa is aplicable for the formation of ice but now the enthalpy is reversed (because of the reverse phase transitioning) so you see the effect of temperature", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugzn3P44ZhsBvckZyEh4AaABAg", "comment": "When the hair is cut it’s lose from the dog, so there’s more disorder when the hair is cut.", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzLouuB2fzbRQN6MwV4AaABAg", "comment": "Is there another video which explains how this formula came up? Like something that explains what really is gibbs free energy and the derivation of the formula?", "votes": "0", "replies": "3", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxVXLex7OFRQQCrnCF4AaABAg", "comment": "We in India while preparing for IIT JEE advanced are taught gibbs free energy more than this in class 11th...", "votes": "2", "replies": "1", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugwl-LdumFQ550kvWhF4AaABAg", "comment": "she omits the middle syllable from the word \"temperature.\" she keeps saying \"tempature.\" oy she can't even pronounce the most basic physics phenomenon. 20:41 mispronunciation of the word \"stoichiometry\". where did she graduate from? trump university?! oy fkn vey!", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugxje1ARipejvSt5kcJ4AaABAg", "comment": "I am surprised that MIT is allowing it to be taught that entropy is a change of disorder. The equation present for Gibb's free energy is about heat. Delta H is about heat and so is entropy, as defined by Rudolf Clausius. How then does one balance an equation with a quantity of heat on one side with a quantity of heat and a quantity of disorder on the other side? And, what is a quantity of disorder?  Clausius defined entropy as S = 1/T (integral dq). It is a measure of heat transfer!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxTcM_9wrerKNPFnBx4AaABAg", "comment": "She is amazing!", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgybcAWr_F73W6RReNZ4AaABAg", "comment": "that was excellent, thank you, I now sort of get it.", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugyvb0PxLr20x8uYUI94AaABAg", "comment": "Great video. Loved your presentation and examples.", "votes": "2", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzSiUxCxPmOrZ5fT1p4AaABAg", "comment": "How are you supposed to calculate the Entropy (J K⁻¹ mol⁻¹) for a particular molecule? (for example 70. J K⁻¹ mol⁻¹ for H2O) Or are the values usually listed in exams?", "votes": "0", "replies": "1", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzB4jptDy-SXJale0p4AaABAg", "comment": "The fact that I learn more with these than from my terrible chemistry lecturer :(  Thank you very much!", "votes": "2", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzPqS-KVGC1YtUg4yx4AaABAg", "comment": "早く構築する話早くしろ！💢自動販売機配置する話早く構築しろ！💢", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzXxBfMI15ylwX13FF4AaABAg", "comment": "Name of professor? She is so awesome id love to take a course of hers", "votes": "0", "replies": "1", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwEseHS2bRzMsZasS94AaABAg", "comment": "Very good lessons i love it", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzLouuB2fzbRQN6MwV4AaABAg.9vo-skOHQu19voRJWrmRUw", "comment": "It might have come from the assigned textbook readings: https://ocw.mit.edu/courses/5-111sc-principles-of-chemical-science-fall-2014/pages/unit-iii-thermodynamics-chemical-equilibrium/lecture-16/. Best wishes on your studies!", "votes": "1", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzLouuB2fzbRQN6MwV4AaABAg.9vo-skOHQu19voU3vQODLL", "comment": " @mitocw   Thank you so much!!!!", "votes": "1", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzLouuB2fzbRQN6MwV4AaABAg.9vo-skOHQu1A2mY6WezjdM", "comment": "​​ @BorangeDoorhinge-gz3yx How did you access the textbook?", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgxVXLex7OFRQQCrnCF4AaABAg.9vkB1oTcYpxA8JVQgWe-4m", "comment": "MIT is a shit institute anyways. They've only produced 101 more nobel laureates than all IITs combined. Obviously a JEE aspirant who will definitely not even make to an IIT is smarter than a professor at MIT.", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzSiUxCxPmOrZ5fT1p4AaABAg.9kQthJb4VJp9oOb7lsn1WG", "comment": "To calculate the entropy of a molecule, you'll need to consider its various modes of motion, such as translational, rotational, vibrational, and electronic, which are influenced by the molecular structure. The partition function Z, which is a product of the partition functions for each mode, can help us determine the total entropy by taking the derivative of its natural logarithm with respect to temperature T and multiplying by Boltzmann's constant k. This will account for the specific contributions of each mode based on the molecule's arrangement and its state.", "votes": "3", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzXxBfMI15ylwX13FF4AaABAg.9h2s5x_3PRo9h36qhr5iNv", "comment": "The professor is Catherine Drennan. For more course info and materials, visit the course on MIT OpenCourseWare at: https://ocw.mit.edu/5-111F14. Best wishes on your studies!", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgxukbbPSL-4m-I1LZ14AaABAg", "comment": "Delta S is not a state function, only S is the state function (from Physical Chemistry, Ira Levine).", "votes": "2", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgyyudXXpx7f9t92tNl4AaABAg", "comment": "Love you to teacher", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzkQFSEnYw7cGLXcL54AaABAg", "comment": "13:24 I too had a dog named Shep", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzY81b6HAH0cMD0ReZ4AaABAg", "comment": "To whom it may concern. Over Unity Electric Generator Design: By ☯AMA☯ Segment 1: 1 motor with hollowed bar connected to it standing vertically. Circular disc connected to bar that has magnets embedded in it's top side  all around, surrounded in high permeability material to focus magnets outward pushing force in an upwards direction from top of disc.   Segment 2: Hollowed out cylindrical Bar of material horizontally positioned.  donut shaped platter that's flattened on all sides instead of rounded, all around the flat edge of this platter, from the center is a ravine in the center so structure looks more like 2 donut shaped platters flattened on all sides & sandwiched together against a smaller donut shaped platter that's flattened not rounded & between them both. Square openings are located all around the outside of platters edge on both sides & goes all the way through material. In these openings rectangular magnets surrounded in high permeability casings are slid into place all around platter in a matching pattern on both sides. N facing in then S facing in.  Connect these securely all along the length of the horizontally positioned bar except at far ends and center. At both ends of horizontally positioned bar securely connect a ring of material that can be magnetically repelled (This will allow bar to spin when apart of completed construct)   Build a hollow ring structure that has ring of magnetic repulsion around its inner ring that will be able to fit around main horizontally positioned bar and keep it from touching anything on account of the bar sitting on its magnetic field inside the ring. The ring structure has a rectangular bar protruding from it's outer edge & has small square platform on end of it that will allow it to be screwed in to another structure.  Make 3 of these ring structures & position them (approx) over both ends of horizontally positioned bar & around it's center.   Build hollowed out rectangular encasement that is separated into 2 pieces that can be placed on top of each other and screwed together. This encasement will fit over horizontal bar & everything that is immediately around this bar. Encasement needs areas all along it's top side that has screw openings that all structures inside that need to be fastened down will be able to screw into. (Best if encasement is transparent) Encasement has round opening at both ends so when in place horizontally positioned bar with round magnetically repel-able disc attached to it  are sticking out.   Build hollowed out ring structure (flattened not rounded) that has a hollowed out rectangular bar that protrudes from top and bottom of ring and has square platform at end of each that will be able to screw into inside of encasement on top and bottom. Ring structure should be able to separate into 4 halves (from middle separating top & bottom & from side to side on each) that sit on top of each other & side by side perfectly connected when encasement is closed. Hollowed out aspect of ring structure & it's protruding hollowed out bar that's connected to it is for conductive wiring to be placed so that the copper coil constructs not mentioned yet will be able to plug into this ring structure and the current can be diverted up through the hollowed out area to a point where another device can plug into it. On bottom of hollowed out ring structure there are openings where copper coil constructs can be plugged into.    Build wide but small ring with ravine around its outer edge in center (kinda would look like the round metal piece you would see in a pulley system but not angled in) of structure (flat not rounded & not hollow in center). Copper coil will be coiled around this. Build hollowed out rectangular structure the length of the width of the wide small ring structure. Build a plug system within it so at the center of the rectangular structure it has proper electrical plug poking out that will be able to plug into bottom side of larger ring structure that is designed to divert current. At both ends of small rectangular plug system there should be flat rectangular legs hanging down so that you can fit it perfectly over center of small wide ring structure that has copper coil wound around it & screw openings at bottom of these flat rectangular legs so they can be screwed together. Ends of the copper coil are fed up into the plug securely.  With wiring in place screw top halves of ring structure together still separate from bottom halves. Then with wiring in place screw bottom halves of ring structure together. Now screw the already connected top halves to the inner top encasement structure & same for bottom halves. Two main encasement structures still disconnected at this point. (Fine point... there are as many of these ring structures with copper coil constructs plugged into them as there are the magnetic disc constructs lined up across the length of the horizontal bar) This is because they are all to be lined up. Now with everything ready carefully lift up the Horizontal bar with the magnetic disc setup securely attached to it. At this point the magnetically repelling rings that are at far ends and center of bar should be hanging freely. Carefully position this whole thing in the bottom encasement so the copper coils are positioned perfectly in the ravine of the magnetic disc area connected to bar. Line the free hanging magnetic rings that have rectangle bars and square platforms up with the inner bottom of encasement and screw them in. At this point the horizontal bar is sitting on the magnetic fields in the rings and is securely in place connected to bottom encasement. Now pick up the top of encasement and carefully line it up the same but on top & then screw the top encasement to the bottom encasement. If lined up properly you will see that when the horizontally positioned bar is made to spin, the magnetic fields will interact with the coils that are perpendicular to the magnetic field lines and since the copper coils are positioned to hang withing the ravine, the magnets on both sides will magnify the effect to achieve greater results & since the magnets on both sides are set up N then S all the way around it will end up being AC current. At this point you may be wondering how will this ever equate to over unity? well we are about to get to the part that makes that possible.    Build cylindrical structure (like a donut but flat not rounded on all sides but still hollow in center like a donut). The cylindrical structure is built in 2 parts. Top part & bottom part. Bottom half has a ridge close to bottom center area that circles around further into the center but not all the way in. On top of this ridge is a flat ring of high permeability (magnetic field shielding) material that has small openings that will allow magnetic fields through specific locations. The top flat side of the 1st part has rectangular grooves cut into it that go almost the entire distance from outside of cylindrical structure to hollowed out center. At both the outer edge and inner edge it instead cuts down sharply & narrowly at just over the width of the horizontal bar. This way when the horizontal bar in it's encasement is sitting in this spot the case fits down in and bar slides down in with a little extra space but the encasement can't shift forwards & backwards. The top half of cylindrical structure has same groove but no extended ridge going further towards center. Fill the rest of the rectangular grooves with duplicates of the electric generator construct. Now carefully position top of cylindrical structure in place and screw it to bottom section. Now position the motor segment with the vertical bar that has discs on it in center of cylindrical construct so the disc is lined up perfectly underneath the inner ridge that has the flat ring of high permeability material fastened to it. Now you can duplicate this whole setup and stack it for more electrical output. (The only thing that would need to be duplicated with the motor & vertical bar setup is for you to add another disc with magnets embedded in it, higher up on the vertical bar you are already using). When you turn motor on the discs will spin and the magnetic fields on them will only interact with the discs on the horizontally positioned bars when the magnetic field lines go through the small openings in the high permeability material. Since those openings are lined up with the edge of the discs connected to the horizontally positioned bars, it will force them to spin, effectively generating lots of electrical current. Just make sure to let enough of that current pump energy into the 1 motor you are using to run things, and the rest of the electric current is over unity. If you are still wondering how this could end up being over unity, the answer is simple. The device exploits magnetic field effects connected to the vertically positioned bar connected to the motor to have them do all the extra work so the motor does not have to. And since the magnets are exerting there force upwards while the bar spins around sideways, the motor won't be getting a detrimental amount of push back.      This design invented by ☯AMA☯", "votes": "5", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwTVqNnNXjEYh6XREB4AaABAg", "comment": "It is nice to compare and place beside 2nd Laws of Thermodynamics here. It will help a lot.", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxhuVEwl5oxROPgoH94AaABAg", "comment": "why does a dynamite explode so quickly?  According to chain reaction, a small scattering cause a multiple one. But think about this. How a small particle never lost any kind of kinetic energy? Obviously, atmosphere does some jobs when exploding.  What about Gibbs E = enthalpy - TS then?", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugy20y1VgAAxTEzp_Dt4AaABAg", "comment": "I don't feel well. I live on Mount Olympus.", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxwpP_Ej0TrvUERgsJ4AaABAg", "comment": "Where are your safety goggles?!?", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugwp3OydqOF60hxNN5t4AaABAg", "comment": "Godammed my math...I understand Entropy as a concept fully, but the math I need to learn more.  It's like knowing a culture but not knowing how to communicate with them.", "votes": "0", "replies": "1", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwZfXEQQ-ItywXc85t4AaABAg", "comment": "Thanks MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwWxAmQbgbdHA7_mxB4AaABAg", "comment": "Very interesting and I really like it Expecially his voice 😍", "votes": "3", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzwxtKLpfJizV7JckB4AaABAg", "comment": "To think and to say what we are thinking, we humans often move body parts around randomly...lotsa hands! It’s even more distracting to the listener viewer when a laser pointer becomes involved in the lecturer’s mental processing.", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugz0InOTATdA6Skwsy14AaABAg", "comment": "It's Amazing 🙌, Really Great!!", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzTnn4C2eKvwvk_qDF4AaABAg", "comment": "Thank you !!", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzA3wfOCqr8Hep3XSt4AaABAg", "comment": "Nice lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzGdMJGwmmTOLWBl9R4AaABAg", "comment": "Most important Gibb's Free Energy, Helmholtz Free Energy. https://youtu.be/QKhYwqU3qzU", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzTnW0tSOws8KZtmVN4AaABAg", "comment": "My god thank you so much.  I went to MIT in 1998 it was really hard to be a good student those days, studied from 9am to 9pm and then time to do my homework. Very stressful.  Now I continue studying but I have a family and this open courses make my day 🙏", "votes": "68", "replies": "3", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxT3xkXr5eneLHLNax4AaABAg", "comment": "Great lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugw4gMO6Sv2pD_si7c54AaABAg", "comment": "19:37. Why can't we talk about S itself . Can't we use the third law,  Nernst theorem and debye exptrapolation to estimate entropy at low tempratures and integerate the entropy changes upto the temprature of interest by taking into acount all the phase transistions and heat capacity changes in between.? Is it reference to a reaction or anything else? Reply please if anyone knows.", "votes": "3", "replies": "2", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzgrqKjVRa_jhnFFo54AaABAg", "comment": "8:11. Why is that the answer? Why isn't it -4.5 Kj/mol?", "votes": "4", "replies": "2", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugwp3OydqOF60hxNN5t4AaABAg.9QF6QlsUIX89QN0bSsk-Cw", "comment": "Ive come to find math as its own language in a way.", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzTnW0tSOws8KZtmVN4AaABAg.9CnZ46kd34T9RPsZdmYqGC", "comment": "maybe for grad school or medical school or just for becoming more knowledgeable", "votes": "2", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzTnW0tSOws8KZtmVN4AaABAg.9CnZ46kd34TA0E4Qkp9iel", "comment": "Motivation!", "votes": "1", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzTnW0tSOws8KZtmVN4AaABAg.9CnZ46kd34TA5kweIf58y_", "comment": "what did you study at MIT? and what are you doing now for a living?", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "Ugw4gMO6Sv2pD_si7c54AaABAg.9BHjLNPZEy99HdzEGF7nFp", "comment": "What do u do sir??", "votes": "1", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "Ugw4gMO6Sv2pD_si7c54AaABAg.9BHjLNPZEy99Y1SRPs-CtX", "comment": "It's not that we can't, we're just not concerned with S itself at a specific point in our reaction. Plus it's more unnecessary hustle. Calculating ΔG the traditional way is convenient and produces pretty accurate predictions in regards to our work.", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzgrqKjVRa_jhnFFo54AaABAg.9ATvOcUy9t09E95r_lCeQR", "comment": "When you add or subtract, you assign significant figures in the answer based on the number of decimal places in each original measurement. (You need to take place value into account). When you multiply or divide, you assign significant figures in the answer based on the smallest number of significant figures from your original set of measurements.  28.9 x 37.00178 = 1069.35144   in this example, the answer is 1070, because the first multiplier has 3 sig figs and the second multiplier has 7 sig figs. In multiplication, the solution must reflect the lowest number of sig figs used in the multipliers.  28 - 32.48 = -4.48    in this example, the answer is -4, because 28 is accurate to the ones place and 32.48 is accurate to the hundredths place .  Taking into account sig fig rules for adding/subtracting, the answer should be rounded to the ones place. Thus -4.48 is rounded to -4.", "votes": "6", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzgrqKjVRa_jhnFFo54AaABAg.9ATvOcUy9t09NjCZxgZ6Yt", "comment": " @tims.440  In the first example isn't it the solution 1069?!", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzsSsMnbnOQIf5K9b94AaABAg", "comment": "ice melting at room temperature is a physical change (Phase Change). We are not creating new material. So calling this a chemical reaction is misleading.", "votes": "1", "replies": "1", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugw5NLyYPbchqG1aHLR4AaABAg", "comment": "Does ice melt at room temperature due to negative (delta G)energy or due to heat from the room air? And what if we consider ice at 273K?", "votes": "1", "replies": "2", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxOsanI3v8kxULVv5t4AaABAg", "comment": "Thanks", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxrSVjC8dAos4wWLOt4AaABAg", "comment": "Nice, I'm studying this right now in my engineering gen chem class", "votes": "12", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugxu-7_lvK6dvidE-B54AaABAg", "comment": "Pjj", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzXfGuykil-oU7Y_954AaABAg", "comment": "It's great! Thank you so much! 💖", "votes": "2", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwHoDLgTX1OuEVX1QR4AaABAg", "comment": "i need a lecture on huron-vidal mixing rule please", "votes": "0", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugx6vFAcLvQdTIOPYYJ4AaABAg", "comment": "i love this woman!", "votes": "25", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgyMMgTfryZTn2YFysd4AaABAg", "comment": "Helped me a lot understanding the Concept of Free energy. Thanks Teacher", "votes": "5", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwgEVT4HAF8cqnqQud4AaABAg", "comment": "9:46 it migth be 0.000233", "votes": "4", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzzpaP3i9LjUBqbGbV4AaABAg", "comment": "Wait what? I think my teacher at kota teaches better", "votes": "8", "replies": "2", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgxxND8zo4mge6AjPZZ4AaABAg", "comment": "Nice", "votes": "4", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgyW47dYjNR8ee20aUl4AaABAg", "comment": "Figure at 12:31 is an incorrect representation of entropy. Delta S there would be in how many ways you can build the same structure. Therefore, the structure shown with a high entropy could be a structure with lower entropy.", "votes": "3", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugzg3K5K7GSC2Q9ytMx4AaABAg", "comment": "Thanks a lot", "votes": "1", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugw-tjorYYePNpCGmYF4AaABAg", "comment": "Thank you so much for this", "votes": "2", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzrRhaKP1wT_eFi6hh4AaABAg", "comment": "Illustrate an organic contaminant (e.g. benzene) plume that is entering a previously uncontaminated aquifer from a point source (e.g. a leaking underground storage tank), and show the predominant terminal electron accepting processes that you would expect to be occurring at different regions of that contaminant plume. “Defend” this by determining the thermodynamic favorability of these different terminal electron accepting processes, assuming the potential terminal electron accepting processes would be aerobic respiration (O2reduction), Mn(IV) (pyrolusite) reduction(to Mn2+), Fe(III) (ferrihydrite) reduction(to Fe2+),sulfate reduction(so sulfide), and methanogenesis.Before calculating the energetic favorability of these processes, produce balanced reactions depicting these terminal electron accepting processes based on H2as the electron donor (be sure to normalize all reactions on the basis of one mole of H2). Explain how the thermodynamic favorability of the different terminal electron accepting processes.A table that includes ∆G0frelated to this question is provided at the end of the exam.Why might it be “scientifically defensible” to use H2 for these calculations, and not benzene.   Chemical Species include: Mn(2+) MnO2 H2 H(+) H20 S(0)=elemental sulfur HS(-) SO4(2-) Fe(OH)3 Fe(2+) CO2 CH4 O2  ∆G•f (correlates to the chemical species) -228 kJ/mol -457 kJ/mol 0KJ/Mol -40kJ/mol (@ pH 7) -237 kJ/mol 0 +12KJ/Mol -744Kj/Mol -692Kj/Mol -83KJ/Mol -397KJ/Mol -34KJ/Mol 16.4KJ/Mol   Please, I know it is long, but if anyone can help with this, it would help me out a lot.", "votes": "2", "replies": "1", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "Ugw207o8yaYa05cEXU94AaABAg", "comment": "Really good!!👌", "votes": "7", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwZJOf6r8Q4o32oSLd4AaABAg", "comment": "Thanks a lot! This helped me a lot in truly understanding the gibbs free energy equation!", "votes": "30", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwGQrOAyO6owXuKb_t4AaABAg", "comment": "Can you give lectures in hindi", "votes": "5", "replies": "3", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgwOc-uWPf1Rqd1vWKV4AaABAg", "comment": "Cool", "votes": "5", "replies": "", "reply": false}, {"vid": "OjhZYx1FbhI", "cid": "UgzsSsMnbnOQIf5K9b94AaABAg.99aHy90UanD9Vlw03kaQVr", "comment": "Even dissolution of ammonium nitrate is a physical process which is termed as reaction..", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "Ugw5NLyYPbchqG1aHLR4AaABAg.99Wh-s3rAGN9IQd9-r3yPx", "comment": "Heat is a form of energy whereas temperature is the manifestation or lack of heat in a room relatively speaking", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "Ugw5NLyYPbchqG1aHLR4AaABAg.99Wh-s3rAGN9PlaT35zZ8-", "comment": "∆G=∆H-T∆S (delta g is negative so if entropy is positive which means entropy has increases∆ S=∆q/T where q has increased thus ∆S has increases ) one and same thing", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzzpaP3i9LjUBqbGbV4AaABAg.8uC8IlPYb1u9JVg4GAtuc-", "comment": "Why", "votes": "1", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzzpaP3i9LjUBqbGbV4AaABAg.8uC8IlPYb1u9ODCRgxHvXC", "comment": "Go away ,I have been to kota, they just can teach for iit , other things they are garbage compared to her", "votes": "5", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgzrRhaKP1wT_eFi6hh4AaABAg.8daGAsDKY4dA7Q2mjwVw0c", "comment": "To analyze the thermodynamic favorability of terminal electron-accepting processes (TEAPs) for the degradation of organic contaminants like benzene in an aquifer, we need to consider the standard Gibbs free energy changes ( Δ 𝐺 𝑓 ∘ ΔG f ∘ ​ ) of the reactions. For this purpose, we will focus on hydrogen (H₂) as the electron donor, as it simplifies the comparison across different terminal electron-accepting processes. 1. Balanced Reactions and Thermodynamic Calculations Let’s write down the balanced reactions for each terminal electron-accepting process using H₂ as the electron donor. We will then calculate the Gibbs free energy change ( Δ 𝐺 ∘ ΔG ∘ ) for each reaction to determine their thermodynamic favorability. a. Aerobic Respiration (O₂ Reduction) Reaction: 2 H 2 + O 2 → 2 H 2 O 2H 2 ​ +O 2 ​ →2H 2 ​ O Calculation: Δ 𝐺 ∘ = [ G 𝑓 ∘ ( H 2 O ) ] − [ G 𝑓 ∘ ( H 2 ) + G 𝑓 ∘ ( O 2 ) ] ΔG ∘ =[G f ∘ ​ (H 2 ​ O)]−[G f ∘ ​ (H 2 ​ )+G f ∘ ​ (O 2 ​ )] Using the provided Δ 𝐺 𝑓 ∘ ΔG f ∘ ​ values: Δ 𝐺 ∘ = [ − 237 kJ/mol × 2 ] − [ 0 kJ/mol + 0 kJ/mol ] ΔG ∘ =[−237 kJ/mol×2]−[0 kJ/mol+0 kJ/mol] Δ 𝐺 ∘ = − 474 kJ/mol ΔG ∘ =−474 kJ/mol b. Manganese (IV) Reduction (MnO₂ to Mn²⁺) Reaction: 2 H 2 + MnO 2 + 2 H + → Mn 2 + + 2 H 2 O 2H 2 ​ +MnO 2 ​ +2H + →Mn 2+ +2H 2 ​ O Calculation: Δ 𝐺 ∘ = [ G 𝑓 ∘ ( Mn 2 + ) + G 𝑓 ∘ ( H 2 O ) × 2 ] − [ G 𝑓 ∘ ( H 2 ) × 2 + G 𝑓 ∘ ( MnO 2 ) + G 𝑓 ∘ ( H + ) × 2 ] ΔG ∘ =[G f ∘ ​ (Mn 2+ )+G f ∘ ​ (H 2 ​ O)×2]−[G f ∘ ​ (H 2 ​ )×2+G f ∘ ​ (MnO 2 ​ )+G f ∘ ​ (H + )×2] Δ 𝐺 ∘ = [ − 744 kJ/mol + ( − 237 kJ/mol × 2 ) ] − [ 0 + ( − 457 kJ/mol ) + ( 0 kJ/mol × 2 ) ] ΔG ∘ =[−744 kJ/mol+(−237 kJ/mol×2)]−[0+(−457 kJ/mol)+(0 kJ/mol×2)] Δ 𝐺 ∘ = − 744 − 474 + 457 = − 761 kJ/mol ΔG ∘ =−744−474+457=−761 kJ/mol c. Iron (III) Reduction (Fe(OH)₃ to Fe²⁺) Reaction: 2 H 2 + Fe(OH) 3 + 6 H + → Fe 2 + + 6 H 2 O 2H 2 ​ +Fe(OH) 3 ​ +6H + →Fe 2+ +6H 2 ​ O Calculation: Δ 𝐺 ∘ = [ G 𝑓 ∘ ( Fe 2 + ) + G 𝑓 ∘ ( H 2 O ) × 6 ] − [ G 𝑓 ∘ ( H 2 ) × 2 + G 𝑓 ∘ ( Fe(OH) 3 ) + G 𝑓 ∘ ( H + ) × 6 ] ΔG ∘ =[G f ∘ ​ (Fe 2+ )+G f ∘ ​ (H 2 ​ O)×6]−[G f ∘ ​ (H 2 ​ )×2+G f ∘ ​ (Fe(OH) 3 ​ )+G f ∘ ​ (H + )×6] Δ 𝐺 ∘ = [ − 692 kJ/mol + ( − 237 kJ/mol × 6 ) ] − [ 0 + ( − 83 kJ/mol ) + ( 0 kJ/mol × 6 ) ] ΔG ∘ =[−692 kJ/mol+(−237 kJ/mol×6)]−[0+(−83 kJ/mol)+(0 kJ/mol×6)] Δ 𝐺 ∘ = − 692 − 1422 + 83 = − 2031 kJ/mol ΔG ∘ =−692−1422+83=−2031 kJ/mol d. Sulfate Reduction (SO₄²⁻ to HS⁻) Reaction: 8 H 2 + SO 4 2 − + 8 H + → HS − + 4 H 2 O 8H 2 ​ +SO 4 2− ​ +8H + →HS − +4H 2 ​ O Calculation: Δ 𝐺 ∘ = [ G 𝑓 ∘ ( HS − ) + G 𝑓 ∘ ( H 2 O ) × 4 ] − [ G 𝑓 ∘ ( H 2 ) × 8 + G 𝑓 ∘ ( SO 4 2 − ) + G 𝑓 ∘ ( H + ) × 8 ] ΔG ∘ =[G f ∘ ​ (HS − )+G f ∘ ​ (H 2 ​ O)×4]−[G f ∘ ​ (H 2 ​ )×8+G f ∘ ​ (SO 4 2− ​ )+G f ∘ ​ (H + )×8] Δ 𝐺 ∘ = [ − 34 kJ/mol + ( − 237 kJ/mol × 4 ) ] − [ 0 + ( − 397 kJ/mol ) + ( 0 kJ/mol × 8 ) ] ΔG ∘ =[−34 kJ/mol+(−237 kJ/mol×4)]−[0+(−397 kJ/mol)+(0 kJ/mol×8)] Δ 𝐺 ∘ = − 34 − 948 + 397 = − 585 kJ/mol ΔG ∘ =−34−948+397=−585 kJ/mol e. Methanogenesis (CO₂ to CH₄) Reaction: 4 H 2 + CO 2 → CH 4 + 2 H 2 O 4H 2 ​ +CO 2 ​ →CH 4 ​ +2H 2 ​ O Calculation: Δ 𝐺 ∘ = [ G 𝑓 ∘ ( CH 4 ) + G 𝑓 ∘ ( H 2 O ) × 2 ] − [ G 𝑓 ∘ ( H 2 ) × 4 + G 𝑓 ∘ ( CO 2 ) ] ΔG ∘ =[G f ∘ ​ (CH 4 ​ )+G f ∘ ​ (H 2 ​ O)×2]−[G f ∘ ​ (H 2 ​ )×4+G f ∘ ​ (CO 2 ​ )] Δ 𝐺 ∘ = [ − 83 kJ/mol + ( − 237 kJ/mol × 2 ) ] − [ 0 + ( − 397 kJ/mol ) ] ΔG ∘ =[−83 kJ/mol+(−237 kJ/mol×2)]−[0+(−397 kJ/mol)] Δ 𝐺 ∘ = − 83 − 474 + 397 = − 160 kJ/mol ΔG ∘ =−83−474+397=−160 kJ/mol 2. Thermodynamic Favorability The calculated Gibbs free energies ( Δ 𝐺 ∘ ΔG ∘ ) indicate the favorability of each reaction: Aerobic Respiration: Δ 𝐺 ∘ = − 474 kJ/mol ΔG ∘ =−474 kJ/mol Mn(IV) Reduction: Δ 𝐺 ∘ = − 761 kJ/mol ΔG ∘ =−761 kJ/mol Fe(III) Reduction: Δ 𝐺 ∘ = − 2031 kJ/mol ΔG ∘ =−2031 kJ/mol Sulfate Reduction: Δ 𝐺 ∘ = − 585 kJ/mol ΔG ∘ =−585 kJ/mol Methanogenesis: Δ 𝐺 ∘ = − 160 kJ/mol ΔG ∘ =−160 kJ/mol Predominant Processes: Fe(III) Reduction is the most thermodynamically favorable process with the lowest Δ 𝐺 ∘ ΔG ∘ value, making it the most likely TEAP in environments where Fe(III) is available. Mn(IV) Reduction and Sulfate Reduction are also favorable, but less so than Fe(III) reduction. Aerobic Respiration and Methanogenesis are less favorable compared to Fe(III) reduction, but still relevant depending on the availability of O₂ and other substrates. 3. Scientific Defense for Using H₂ Using H₂ as the electron donor for these calculations is scientifically defensible because: Consistency: H₂ provides a common electron donor for comparison across various TEAPs, simplifying the assessment of relative thermodynamic favorability. Generalizability: Many biogeochemical processes in subsurface environments, including those involving benzene, ultimately rely on hydrogen oxidation. Thus, H₂ serves as a representative donor for broader assessments. Complexity Reduction: Directly using benzene would involve complex and variable reaction pathways and intermediates. By focusing on H₂, we can more clearly compare the favorability of different electron-accepting processes. 4. Plume Illustration and TEAP Distribution In an aquifer with a benzene plume from a leaking underground storage tank: Near the source (high concentration of benzene): Aerobic respiration might dominate if O₂ is present. Intermediate regions: Mn(IV) reduction could occur if MnO₂ is available and O₂ is depleted. Further downgradient: Fe(III) reduction would become predominant as Fe(III) becomes available and is reduced. In sulfate-rich zones: Sulfate reduction might occur if sulfate concentrations are high and Fe(III) is exhausted. In areas far from the contaminant source: Methanogenesis could become significant if organic matter is available and all other electron acceptors are depleted. This distribution reflects the sequential depletion of electron acceptors and changes in the predominant microbial processes in response to the evolving conditions in the plume.", "votes": "0", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgwGQrOAyO6owXuKb_t4AaABAg.8_aKG1Yx5PU8a8SiQhcQSS", "comment": "then the others might not get it brother..", "votes": "10", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgwGQrOAyO6owXuKb_t4AaABAg.8_aKG1Yx5PU8f3YBiduDeq", "comment": "Gp Shrivastava  American English is the language of MIT", "votes": "7", "replies": "", "reply": true}, {"vid": "OjhZYx1FbhI", "cid": "UgwGQrOAyO6owXuKb_t4AaABAg.8_aKG1Yx5PU8fCeJdyJCab", "comment": "It's an American university and I don't think they have a large enough audience for it.", "votes": "6", "replies": "", "reply": true}]