[{"vid": "OMFpHmfC1pY", "cid": "UgxNP6qb1WDeldpD3TF4AaABAg", "comment": "Why don't these kinds of intermolecular forces require quantum mechanical calculations? Is it because distance is too large that QM effects doesn't matter?", "votes": "0", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgwS9nxQGvLVGfHtA0F4AaABAg", "comment": "I am wondering in which real system (state) a sodium cation could meet a HCl molecule. Hope someone can answer my question.", "votes": "0", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "Ugyc9F6Gs3KwP9yleA94AaABAg", "comment": "It appears that no one from MIT is monitoring this site and its comments. So, it's up to other viewers to respond to comments, if they can (have the knowledge, etc.)   I have the questions:  \"Why is the term 'kilo-joule'  used for such a tiny amount of charge? What's wrong with 'joule, or    milli-joule' when referring to atoms and molecules?\"", "votes": "0", "replies": "3", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgxBU0z4ougVjLctjVV4AaABAg", "comment": "Wow!", "votes": "1", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgzqFfU9vUSRYBCvDO54AaABAg", "comment": "wow... i'm really greatful for having acess to internet and being able to watch a lecture like this one!", "votes": "2", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgyjOX14ziLTovtS5Zd4AaABAg", "comment": "Why did not we talk about InterMetallic Bonds , like one in alloys", "votes": "2", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgxbyxJ9x0im4kSdETd4AaABAg", "comment": "thx", "votes": "1", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "Ugx2SnQso7JbwR8ZR8V4AaABAg", "comment": "Thank you very much, MITOCW for sharing these awesome lessons with us. It really helps. Again, it was a wonderful lecture.  By the way, is there anybody that could find the full version of the video on gecko gloves?(the one with fantastic electron dance) It looked great, but can't seem to find it anywhere. Thanks.", "votes": "1", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "Ugya7hp_xJ82z6N5xAh4AaABAg", "comment": "This is the most incredible lecture that I have ever seen...", "votes": "8", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgxllnM6gYL3RZQ2doZ4AaABAg", "comment": "Thanks for the holistic dive. Most teachers just arm wave this fundamental material.  Well done!", "votes": "0", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "Ugygeee9zQM3KrrTGJN4AaABAg", "comment": "the table has a row left blank... what's the diff. bet. hydrogen bond and dipole-dipole in water?", "votes": "1", "replies": "1", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgxoTymUlyA54f83j154AaABAg", "comment": "He made this so much easier to comprehend! Loved the explanation, thank you so much :)", "votes": "3", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "UgzAqqlXwkgF5GtC7nt4AaABAg", "comment": "👍👍👍👍👍", "votes": "2", "replies": "", "reply": false}, {"vid": "OMFpHmfC1pY", "cid": "Ugyc9F6Gs3KwP9yleA94AaABAg.9ieX1It6lWR9ih5MvvS1Vf", "comment": "We do monitor comments but will only answer simple course material questions: What textbook is used? Is this an undergraduate course? Who is the professor? etc. We are not Subject Matter Experts (SMEs). If we knew all the contents of the 2,500 MIT courses we've published, we probably wouldn't be answering questions on YouTube. 😉", "votes": "1", "replies": "", "reply": true}, {"vid": "OMFpHmfC1pY", "cid": "Ugyc9F6Gs3KwP9yleA94AaABAg.9ieX1It6lWR9ihqoZdydVA", "comment": "Well, ok. Thanks to MIT for presenting the courses, anyway. So, as you say, other reviewers, and other sources may provide answers to questions one may have. Some of the instructors are excellent, as Dr. Grossman is.", "votes": "1", "replies": "", "reply": true}, {"vid": "OMFpHmfC1pY", "cid": "Ugyc9F6Gs3KwP9yleA94AaABAg.9ieX1It6lWRA670ZaCBQXu", "comment": "kJ is used only when we are referring to moles, otherwise electron volts becomes more practical to use.", "votes": "0", "replies": "", "reply": true}, {"vid": "OMFpHmfC1pY", "cid": "Ugygeee9zQM3KrrTGJN4AaABAg.9IXSKLxzJ209MZdAKRVgG7", "comment": "Dipole-dipole interactions tend to align water molecules one after another:   O H  H   O H  H Whereas hydrogen bonding tends to align water molecules into a 3D lattice-like structure with tetrahedral coordination. Plus there's a difference in energy, if I'm not mistaken, but I'm not 100% certain about that.", "votes": "0", "replies": "", "reply": true}]