[{"vid": "P34zaLtmsn0", "cid": "Ugzr7WL7P21MWgiXWuh4AaABAg", "comment": "I still remember questioning insanely wickedly smart joyful teachers.   Grew up hearing about the significance of blood pressure (blood boiling) in extreme developing insane environments where intense pressure were unpredictable and comes from every directions. Thus It is essential to account for atmospheric pressure from all directions to ensure the accurate calculation of our blood pressure measurements tools by using sane minded physicists instruments because not every pressure measure equipment has atmosphere pressure with human weigh calculation with the mercury.   We have many unrecogniz error theory to prove even doctors  scientist and instruments would turn into deceitful tool.", "votes": "0", "replies": "", "reply": false}, {"vid": "P34zaLtmsn0", "cid": "UgxlJ-QuNiG53zmgYIF4AaABAg", "comment": "赞！", "votes": "0", "replies": "", "reply": false}, {"vid": "P34zaLtmsn0", "cid": "Ugyk18LzHieSJzaCC_54AaABAg", "comment": "Actually, this is something I've seen this year at my school (I've finished 11th grade) and it's great to know what those things actually mean. Sadly they're teaching us like these things are from the moon or sth, not telling us what to actually do with these infos. Why are they behaving these things like they do for history/literature? This is chemistry, a nature based science and everything we encounter in our daily lives are related to this, since obviously we're living by the laws of nature... But at MIT OCW, you're not only learning  things in-depth (by explaining what happens, how and why) but also learning how to implement these into your own life. (Why This Matters) MENS ET MENUS IS THE ONLY WAY FORWARD! Thank you MIT, and MITOCW, for being such wonderful. The world is a better place with you in it. Hopefully, I'll be able to be a part of MIT in the future :)", "votes": "10", "replies": "2", "reply": false}, {"vid": "P34zaLtmsn0", "cid": "Ugw8HlHdU6zrLAIUouJ4AaABAg", "comment": "Thank You!", "votes": "0", "replies": "", "reply": false}, {"vid": "P34zaLtmsn0", "cid": "UgxGFnWWT4KJiM0gX394AaABAg", "comment": "👍👍👍👍👍👍👍👍👍👍👍", "votes": "3", "replies": "", "reply": false}, {"vid": "P34zaLtmsn0", "cid": "UgyIc6cIS_4zRCeq-Rd4AaABAg", "comment": "u r amazing 🔥🔥", "votes": "1", "replies": "", "reply": false}, {"vid": "P34zaLtmsn0", "cid": "Ugyk18LzHieSJzaCC_54AaABAg.9P5fAr7tih89dkRX_rSa0I", "comment": "Yeah that's something I experienced at my university. Often times your teachers don't really understand the material very well, so they present it to you as confusing or like you said, from the moon. Don't let that discourage you though! These resources from MIT as well as the plethora of great textbooks can teach you 90% of what you need to know. The other 10% will have to come from a good teacher and experience, but if you study long enough you will find both.   I highly recommend William Brown's Introduction to Organic and Biochemistry, William Jolly's Modern Inorganic Chemistry, and Victor Gil's Orbitals in Chemistry. They're oldies but goodies, and can be found online for cheap compared to much bigger, much more poorly written, newer textbooks. You'll want to get your physics and math up to snuff too, in order to understand the Orbitals book (it's quantum chemistry), so be sure to digest MIT's 8.01-8.05 (maybe 8.06) as well as 18.01, 18.02, 18.03, and 18.06 lectures. Chemical thermodynamics and kinetics will be important as well, but don't stress if it's not very interesting right off the bat. After you study all the quantum stuff, you can go after statistical mechanics, and then thermodynamics start to look a little cooler.   Anyway, that's probably more unsolicited info than you cared to read, but good luck if you're still pursuing chemistry or physics!", "votes": "1", "replies": "", "reply": true}, {"vid": "P34zaLtmsn0", "cid": "Ugyk18LzHieSJzaCC_54AaABAg.9P5fAr7tih89ziTncTF4RS", "comment": "Exactly. i refer to chemistry course and realise when it changed to physics. but yes this connects all dots and makes soo much sense as compared to asking us to remember the things as laws.  something worse, my classmates remember derivations and you are supposed to rememver too. simply because you cant miss steps even addition matters sometimes. (we are from Bharat) not that its a disgrace. Im really proud to be indian but education has to change and it is slowly happening", "votes": "0", "replies": "", "reply": true}]