[{"vid": "P388gUPSq_I", "cid": "UgygcRvr_4KrHgcwrx94AaABAg", "comment": "Young Charles Jones Nancy Robinson Mark", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxGq2WwPMZuYqbH8YR4AaABAg", "comment": "Moore Anna Thomas Thomas Hall Margaret", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzeGUaFJzph3MWKxYB4AaABAg", "comment": "Wilson Ronald Davis Patricia Robinson Sarah", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzKxDuwVMh36PZreGp4AaABAg", "comment": "Clark Daniel Jackson Timothy Harris Ronald", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxi81bvK5wqPokwyU94AaABAg", "comment": "@yOuTuBe STOP SHOVING YOUR CHOICES ONTO MY DEVICE. YOU ARE SICK. & FILTHY. FUCK OFF!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyDtT81hSaBCADuOzR4AaABAg", "comment": "Fucksake did they need to take squeaky note notes right next to the camera mic. Why is the camera mic even on?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxwXp8T90fXptmL35J4AaABAg", "comment": "This one had fascinating cinematography", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxTpQKFWoopVh2Bxht4AaABAg", "comment": "35:20", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw3Hr_hQ_eTw8zoBhF4AaABAg", "comment": "Gaping craters coal", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzazHSwvhLdJpF7KTp4AaABAg", "comment": "To things walking in sandals trying to be outgoing: hey 50:45 here 51:00 I mean 51:03 I am Hey LaFlora at your service 51:20 you’Re no cap 51:29", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzxUapKsoK-TQlGLP14AaABAg", "comment": "47:43 hypocampus a present: 48:10", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzwuJ8Xs9j-L2z_sLB4AaABAg", "comment": "So what if Candy fuck around and try to become a stand up comedian is y’all wit it no 41:47", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxOU8JyE2D80tJDUix4AaABAg", "comment": "Hard shell because you can’t step out vomit of 27:49 and exotic meals 27:42", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyJWJKKx-LlrWFVdAl4AaABAg", "comment": "Abraham???? 25:19", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxpmI9OFHW2S7dIzYp4AaABAg", "comment": "Move that womb without the Holy Ghost you twat 24:48", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxeOg_UGifiQe690Ft4AaABAg", "comment": "At 18:29", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9mmIluMToTVluTaZ4AaABAg", "comment": "Easy ! They all have squint eyes like me !", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxIf0ID8P__E2imFbt4AaABAg", "comment": "Perhaps, every arrogant asshole I see is my relative🤭😅", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwMVTw-f71QjT0K2y14AaABAg", "comment": "Is Sapolskys sense of humour hereditary or acquired?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzbtuLBNKzl-OhWv3x4AaABAg", "comment": "Regarding first born with siblings higher IQ than only children meaning parental attention is ruled out, I think there's a confounding Factor in that parental attention at an early age may be impactful but then later on the more complex \"environmental simulation\" of having siblings may add on to that early parental attention. An additive factor, not to mention the parentification of first borns which likely factors in.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw3Hr_hQ_eTw8zoBhF4AaABAg.A3wfcS92n0HA3wfpbUBE_-", "comment": "Regulated 👑", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxOU8JyE2D80tJDUix4AaABAg.A3_Q9cs9twBA3_QDlt2D_V", "comment": "Bob Marley would you be???? Loved????? 28:23", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugxq3CvLEcFD-yeOwGV4AaABAg", "comment": "Every time I post a comment on YouTube, I feel like I am sending an email.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9Bs2t-Shqk4ZsV6R4AaABAg", "comment": "Since chutes and ladders is a game of chance why would a smart person believe such a study anyway.  I know this was supposed to guide them to the answer but ...", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgypP8Q7saQoIlmRTx14AaABAg", "comment": "When you raise pups and kittens , when old enough  to mate they will often not mate  with someone  they were raised  with as babies but not related to .", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwBXpZUaq21A8_JWcB4AaABAg", "comment": "That's so much better than Netflix", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwZwzYS94xdZuOj5nR4AaABAg", "comment": "Camera man, I see you and how much fun you must have had before RODO.  Yeah, I know it's US not Europe. Still funny, sorry guys", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgywrFtMLOuQzpOZqqN4AaABAg", "comment": "Professor had extra coffee today🥸", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwCDi7EtGgnl8Y1ibN4AaABAg", "comment": "so nobody talks about the camera guy huh?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwKocs7rCFuBJZivJR4AaABAg", "comment": "I noticed No computers. Pen and paper. Looks odd in 2024.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwkx8a9MDoh90I30394AaABAg", "comment": "We love you Robert, thank you for your videos!!! ☺️", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzohJjkPUvK5DxsVwF4AaABAg", "comment": "I love the little wandering camera", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz_UGHF6b8dzPVWEVh4AaABAg", "comment": "How do I convince my 3rd cousin to mate with me?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx_qJ8-e6iBCN1oMY94AaABAg", "comment": "I wonder if this nerd believed in the vax, and if he did, and he explains science so well, why morally did he not come up with a video to chill people out when we were in a global crisis? selfish", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxGsQREZNke3hgo7sV4AaABAg", "comment": "Nervous system and endocrinology", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz8vILdYNgJ3ErSZs14AaABAg", "comment": "Du d fui lá e muitas felicidades e muitos anos muitos anos atrás e se fala alguma coisa ER hoje né se fala alguma coisa ER hoje né se fala comigo né se Deus", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyV3Y9_zH-NedcOQ5d4AaABAg", "comment": "Cl Cl Cl Cl Cl Cl Caixa econômica federal intensivão Caixa econômica g Du ei e muitas alegrias e muitas alegrias sempre vcs vão sair hoje né se fala comigo né se Deus quiser ir amanhã então é só r viu e muitas alegrias e muitas felicidades sempre e muito muito muito muito forte e muitas felicidades e muitos dias quando chegar lá te", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxqoso39CR94ZGnCYV4AaABAg", "comment": "Xc e muito muito muito muito muito muito forte mas é só r e muitas alegrias e muitas felicidades sempre e muito muito muito forte mas se quiser vir amanhã né e muito muito muito muito feliz aniversário e muita saúde paz e felicidades e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxETbBMUmtsKccKUAd4AaABAg", "comment": "Cê sabe se fala alguma coisa ER hoje e sempre r viu se fala alguma coisa ER hoje né se fala alguma coisa ER hoje né se fala alguma coisa ER e muito muito muito muito muito muito muito muito forte", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzTWY_aYPYifLjRo5x4AaABAg", "comment": "Fu gu e muito muito forte mas se quiser ir amanhã às noite e muitas felicidades sempre vcs merecem ser amanhã mesmo se fala alguma r viu e muito muito muito muito muito muito muito forte mas é só r viu se fala alguma coisa e muito obrigada por", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw3AWPFcvkgwuxlYN14AaABAg", "comment": "C BB BB GG GG e f e muitas alegrias e muitas felicidades e muitos anos atrás e sempre vcs estão lindos e r viu se Deus quiser ir amanhã às noite toda vez é só r e muitas felicidades e r viu é só r e muitas felicidades e ER hoje né tô aqui fora esperando aqui e te tarde e muitas felicidades e muitos anos muitos anos atrás e se fala e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw79d13SSpISoxw2n94AaABAg", "comment": "D fui dormir agora e muito muito i xv x brasil ao vivo agora toda vez por favor se fala alguma coisa ER hoje né se fala alguma r viu e muito muito muito forte e muitas felicidades sempre", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxNoFlI90iDiiGeeO94AaABAg", "comment": "G e muitas felicidades e muitos dias quando chegar lá buscar as coisas por aqui mesmo né ele ir lá buscar as crianças estão fazendo as coisas ai Sim hein se cuida e muito obrigada por ter te respondido antes das ostras RJ agora só r e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxso8hb7GagfpZlsI54AaABAg", "comment": "M xv x brasil ao vivo e muitasalegrias e muito obrigada pela informação sobre as coisas por ai Sim e muito muito muito forte mas se quiser ir lá buscar as coisas por aqui mesmo e muitas felicidades sempre e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgykUfBnaevgOaVmJ6B4AaABAg", "comment": "Ah sim entendi mas é só falar sobre as coisas por aqui mesmo né ele ir lá amanhã e sempre te amo muito muito mesmo né ele ir amanhã às noite e muitas alegrias e felicidades e muito muito muito muito forte e muitas felicidades sempre e muito muito forte e muito obrigada por ter vindo aqui fora esperando aqui fora esperando aqui fora esperando aqui fora esperando aqui fora e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyduI3scQos7_yk6nJ4AaABAg", "comment": "Fala alguma r viu e muito muito forte mas se Deus quiser vir aqui e muito muito muito forte mas se Deus permitir sempre felicidades e muito obrigada por favor te amo tanto e muito muito muito muito muito muito forte e muito muito feliz aniversário r viu se fala alguma coisa ER hoje e sempre vcs estão lindos e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxj8c9pvfBnLAmY4nB4AaABAg", "comment": "DJ Gustavo lima te amo muito muito muito muito muito muito muito forte mas é só r viu e muito obrigada por favor se for w se for w se fala alguma coisa ER e muito muito muito forte mas é só r e muito obrigada por ter vindo", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx8MvJyjNBcYSuYYO54AaABAg", "comment": "Fg é tão rápido e muito obrigada por ter te respondido antes e muitas felicidades e muitos dias muita saúde paz e muitas felicidades e muito muito forte e muitas felicidades sempre e muito muito forte mas se quiser vir aqui tô aqui fora e muitas felicidades sempre e sempre vcs vão sair amanhã e muito obrigada por favor se for", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzPAHYTCIjwgjFiJNF4AaABAg", "comment": "Xv só r e muitas felicidades sempre e e e e e tu f e muito obrigada por ter te respondido tô aqui fora esperando aqui terça feira e muito muito muito muito muito muito muito muito muito muito muito forte mas se quiser vir aqui e muito obrigada por favor te amo tanto e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyPOqOkeQ0hkrQCdb94AaABAg", "comment": "Ch SP né mano mas se quiser vir aqui tô esperando ele responder e muitas vezes é é só r e muitas felicidades sempre e muito obrigada pela informação e muitas alegrias sempre vcs vão sair amanhã às três dias e muito obrigada pela atenção e muitos dias quando chegar aqui fora esperando ele chegar aqui te mando msg e te mando msg ok ok ok ok obrigada por ter te", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzlp2XH5318Uzo9eI54AaABAg", "comment": "Ch c tô falando sério e muito muito muito forte mas é muito difícil mesmo né ele é muito difícil mesmo né mas é muito difícil né e e e e muitas alegrias sempre vcs vão sair hoje r viu se Deus permitir sempre vcs vão sair hoje r e muitas felicidades sempre", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy0DyNUeiVKT4xPPaR4AaABAg", "comment": "DJ Gustavo lima e muito muito muito forte mas se Deus quiser vir aqui tô aqui esperando vcs estão fazendo oq hj e muito obrigada por favor se for w se fala comigo e muitas felicidades e muito muito muito forte e muito obrigada pela informação e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzOL57r9Dhjo2NchG14AaABAg", "comment": "Xv e tarde toda e muito obrigada por favor te amo tanto faz parte dessa vez por causa dos Santos Dumont é só r viu e muito muito forte mas é só falar sobre as crianças estão r e muito muito muito forte mas é só falar sobre as coisas por aqui e muito obrigada por ter vindo as coisas por aqui mesmo né ele é só falar sobre as crianças e muitas", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwdoGORUtRvJigovnV4AaABAg", "comment": "Fala alguma coisa e é só falar sobre os dias por causa disso né amiga é muito muito muito muito muito muito muito muito muito forte e muito muito muito muito feliz por favor se fala comigo e muitas felicidades sempre vcs estão lindos né r viu se Deus permitir sempre", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgztJcm6FV2ONtzgFvF4AaABAg", "comment": "F e muitas felicidades sempre vcs vão sair hoje né se Deus permitir e muito obrigada pela informação e e r e muitas alegrias sempre vcs vão sair hoje né se Deus permitir sempre felicidades sempre vcs estão lindos e r", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzWjG0jDEcKBFDesW54AaABAg", "comment": "F e muitas felicidades e muitos dias muita saúde paz vida longa vida e saúde paz e felicidades sempre vcs estão lindos e muito muito lindo esse vídeo maravilhoso né amiga e muitas felicidades e muitos anos atrás e r", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwJe_Np1ndrdTtMjrB4AaABAg", "comment": "F e muito obrigada por ter vindo aqui fora esperando ele chegar lá buscar ela e muito muito forte e muito muito muito muito forte mas se quiser vir amanhã então só se for por causa disso é só falar", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyagTOo-MuS9SM4A-J4AaABAg", "comment": "Xv é só r e muito obrigada por ter te respondido ontem e muito muito muito muito forte mas é só falar sobre as coisas por aqui e muitas alegrias e felicidades sempre vcs merecem ser feliz e muitas felicidades e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzc6PWxo2bzgOtRlJt4AaABAg", "comment": "Du ND né amiga e muito obrigada pela informação e muito muito obrigada por favor te mandar as crianças e muito obrigada pela informação e muitas alegrias sempre vcs vão sair amanhã às três horas e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyDhB2Q3Dq_IAGGqmF4AaABAg", "comment": "Xv f e muitas felicidades ER e muito muito e muito e te é é só r é é é rrt r r e é ER e r viu se fala alguma r era w r e muito obrigada é é rrt rre ee ET yi e muito muito muito forte e muitas", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwJEsCMPGLgkFqbTxJ4AaABAg", "comment": "Xv é é só r viu e muitas felicidades sempre e sempre vcs estão fazendo ET ei ele ir amanhã às noite e muito muito forte e muito obrigada pela informação sobre os dias por causa das pedras aqui tô esperando ele chegar aqui fora e muitas alegrias e muitas alegrias sempre felicidades", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw0e241WhqfxirV8Gh4AaABAg", "comment": "Du r viu se fala comigo e muito obrigada por favor te amo muito vcs vão sair hoje né se Deus permitir sempre felicidades sempre e sempre vcs vão sair hoje r e muitas felicidades e muito muito muito forte e muitas alegrias e muitas felicidades e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzqwTZHKuEEB7uCmIx4AaABAg", "comment": "Xv d ER r viu e muito obrigada por ter te respondido antes e muito muito forte mas é só é só r viu e muito obrigada pela atenção e muitos dias muita saúde paz e muitas alegrias e felicidades e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwxztkkVfPW7m_I5O54AaABAg", "comment": "F e muito muito muito muito muito forte mas se Deus quiser ir lá buscar ela e muito obrigada por ter feito alguma ri muito e muito muito muito feliz por você e muito muito feliz aniversário r viu se fala comigo e muitas", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyVn9mrgiW0BDwDMsh4AaABAg", "comment": "Fc e muitas felicidades e muitos anos atrás e se for w r viu e muitas felicidades e muito muito forte mas é só falar sobre os momentos e muito muito muito muito muito muito forte e muitas", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxNSFc5bGJvAfyUYGl4AaABAg", "comment": "C BB BB GG GG GG GG GG GG GG GG GG GG GG GG GG GG GG GG te amo muito muito muito forte mas se for w r viu e muito obrigada pela informação sobre as crianças e muitas alegrias e muitas felicidades sempre", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxCP5-bMmwbQrAgaed4AaABAg", "comment": "F e muitas felicidades e muitos dias muita saúde paz e muitas alegrias e muitas alegrias e felicidades e muito obrigada pela atenção e carinho por mim por favor se for w r viu e muitas alegrias e felicidades e muitos", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy482Cd3RCsFwnHGTh4AaABAg", "comment": "F e muito muito forte mas se Deus quiser vir amanhã né se Deus permitir e muito muito forte mas é só falar sobre as coisas ai sim hein mano e muito muito muito forte e muito muito forte mas é", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyhgwnQ0Xg_1izYIa94AaABAg", "comment": "Xi d fui lá pegar as crianças e muito muito forte e muito obrigada pela atenção por favor te amo tanto faz parte desse grupo e muito muito forte e muito obrigada pela informação e muitas alegrias e muitas felicidades e muito muito muito forte e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9uFV-cOwHq7SxdTd4AaABAg", "comment": "Ch DF e muito muito muito forte mas se Deus quiser vir amanhã então só r viu se fala alguma coisa e muito muito forte mas se quiser vir aqui tô aqui esperando aqui fora esperando ele chegar lá e", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwz27cMrxue-zEn9yl4AaABAg", "comment": "G e muito muito muito muito forte mas se quiser vir aqui tô aqui fora esperando ele responder e muito muito muito muito muito obrigada por favor te amo muito muito mesmo né ele é só r viu se fala alguma r viu se fala comigo e muitas felicidades", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwiM5GzBi4Q95AFSCB4AaABAg", "comment": "R viu se fala alguma coisa ER e muito obrigada por favor se fala alguma coisa ER hoje né se fala alguma coisa ER hoje né se Deus quiser ir amanhã então só r viu se fala comigo né se fala alguma r era w r e muito obrigada pela informação e muitas felicidades e muito muito muito muito muito muito muito muito forte mas se quiser vir amanhã né se Deus permitir e muito obrigada pela informação e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzROwNj2PAg9yOM5s54AaABAg", "comment": "ER r viu se fala comigo e muito obrigada pela atenção e muito obrigada pela atenção por causa disso né se fala alguma coisa ER e muitas felicidades e muitos anos muitos DJ e muitas alegrias sempre vcs estão fazendo oq hj e muitas felicidades e muito obrigada pela informação e muito obrigada pela atenção por favor te amo tanto", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyBkQMKkvofxm7Xijp4AaABAg", "comment": "DJ Henrique e muitas alegrias e felicidades sempre e sempre vcs vão vir aqui e muitas alegrias sempre vcs vão sair amanhã e sempre te mandar as crianças e muito", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxWtvkwnBUuPtBhb2J4AaABAg", "comment": "Du ND e muitas felicidades e muito muito forte mas é só r e muito muito muito muito muito muito muito forte e muito muito muito muito muito muito muito forte mas se quiser ir lá buscar as coisas por aqui e muito obrigada por favor te amo tanto faz tempo atrás e sempre vcs vão sair amanhã", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx6o5XIQtr6dk91gft4AaABAg", "comment": "DJ Gustavo lima e muito obrigada por favor se fala alguma r era ri demais e muito obrigada pela informação sobre esse valor é muito difícil mesmo se ele for buscar as coisas por ai Sim e muitas alegrias", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxfJzPXi3inlXbQ09V4AaABAg", "comment": "Fo e muito obrigada por ter vindo aqui e muitas felicidades sempre vcs merecem ser amanhã às noite e muitas alegrias sempre vcs vão sair amanhã às noite toda hora ri demais né amiga e muitas felicidades", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzlms6n2WEo7PvUji54AaABAg", "comment": "There is also some advantage to inbreeding where there is synergy between genes, though that is likely much less than the kin selection.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzEnaq3Q0iCSJEML_14AaABAg", "comment": "I think this is beautiful. I think this is awesome first five years of my primary education in Russia, my after school consisted of staying in a group of five other kids, with a very sadistic abuse of 300 pound gorilla who was a national hero from the second world war, she used to pull my hair, not on the top, but next to your ear and of course she was pulling everybody’s ears. Once I jumped out of the window from the second floor during the afterschool program and run across the backyard of the school, and I was changed by to German Shepard’s released from the chain by superintendent as he did every day after kids go home  But we didn’t go home we stayed for after school torture  I jump on the fans, but the fans wires old, rotten, wood and fans, and the failed at that moment to German Shepard’s beat me in my butt and ripped a hole in my pants  I found it off the dogs and kept going back home without my backpack  🎒  Well, all this things I remember from first 12 years in Russia  Sweet memories, sweet memories, abusive dictatorship, created by bolsheviks and communists depriving people of spirituality, created people, brutal, not capable of appreciating a child or loving a charter each other  Artificial intelligence is so stupid, especially here on Facebook", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxF31p2RnvVWg3_ljR4AaABAg", "comment": "#Ethology is the scientific study of animal behavior—including animal communication, predation, defense, aggression, mating, imprinting, fixed action patterns and releasers, and migration—most often in their natural conditions.  #Bogoslowsky 🦁🤴", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyFXGcf-aqumyBLXpt4AaABAg", "comment": "The question I would have asked him about the study is \"why are YOU excited about it?\"   Haha but I'm a psychology major.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugya_XJz3sYwvXVkTTp4AaABAg", "comment": "ha ha =)) camera man go wild on this episode", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxVFnOd4fiejWHec-l4AaABAg", "comment": "Almost over now, We've let it all slip away", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz44BQHTjAK26oJT_N4AaABAg", "comment": "9:27", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy6pDn3yasoIXf5bNR4AaABAg", "comment": "He doesn't mention that first borns have to learn everything themselves.  The second born gets taught the things the first figured out alone.  So the firstborn gets to learn alone and also become a teacher. Also i guess a child born many years after the first couple may have to learn alone again.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxrK-7xeoi43-KZ3Nl4AaABAg", "comment": "Summary :   1. Inherited vs. heritable traits and epigenetics in behavior genetics  Understanding the difference between inherited and heritable traits is crucial in behavior genetics, particularly when examining the role of epigenetics in gene expression. Experimental design and critical evaluation of scientific studies are essential to shed light on the complex relationship between genetics and behavior.  2. Birth order's impact on IQ  A large study conducted in Norway showcased the impact of birth order on IQ, revealing that first-borns tend to have higher IQs than their younger siblings. This may be attributed to parental investment, tutoring roles, and family dynamics. Interestingly, the neoteny theory suggests that birth order advantages may reverse in later life.  3. Animal kin recognition mechanisms  Animals recognize their kin through a variety of methods, including innate recognition, lock and key mechanisms, and olfactory cues. For example, deer mice have a unique form of sperm competition, and rodents differentiate between siblings and non-siblings even when raised separately.  4. Signature proteins and MHC in immune system and olfactory recognition  Signature proteins on cells are essential for the immune system to recognize pathogens, but they also play a part in olfactory recognition in animals. Major histocompatibility complex (MHC) proteins are detected through pheromones, enabling animals to discriminate relatedness. MHC genetic signatures are even reflected in urine smell, affecting organ transplant success.  5. Hormones and neurons in social bonding and smell recognition  The hormones oxytocin and vasopressin, along with neurons, play a significant role in social bonding and smell recognition, especially in identifying close relatives. Genetic mutations related to these hormones have been associated with autism. Social interaction fosters adult neurogenesis, and pregnancy can lead to changes in the olfactory system.  6. Recognizing relatives in the animal kingdom  Animals use sensory cues like smell, voice, and appearance for recognizing their relatives through innate recognition and imprinting. Olfactory receptors and hormones further sharpen their sensitivity to relatedness. While inbreeding can lead to genetic abnormalities, distant-relative mating provides kin selection advantages. Humans rely on cognitive processes for recognizing relatives.  7. The fusiform cortex's role in human relationships  The fusiform cortex, responsible for facial recognition, plays a role in human bonding. Newborns rely on their sense of smell for mother-infant bonding. Sensory-driven factors also contribute to human mate selection, and the concepts of pseudo kinship and pseudo-speciation manipulate human relationships, creating a sense of belonging among non-relatives.  For summarized notes of all the lectures, check here : https://www.wisdominanutshell.academy/tag/human-behavioral-biology-robert-sapolsky/", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzA2Ks6eEFtBedAD114AaABAg", "comment": "Can we, those binge watching these lectures, get the reader, and the list of chapters/sections/etc. in assigned reading material? Oh, when are available office hours? Can we do the exams online given the audience is most likely world-wide? Thanks :)", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxuFWMPp-381PbqXQx4AaABAg", "comment": "54:03 😂🐢", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz2KrjiCkUWhUAz1Id4AaABAg", "comment": "So if a pregnant woman is developing olfactory super sense in order to recognize her newborn and to avoid eating harmful things. Can we conclude that cheating on a pregnant woman is a silly thing to do because she will immediately recognize the foreign essence feromone of another woman that a simply bath will not take the essence away maybe for days?", "votes": "0", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzQ2I4-13TRNKQ9elt4AaABAg", "comment": "Not to diminish his point, but he must be an only child if he thinks 2.3 IQ points is insignificant between siblings 🤣", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwWzpD7jytfENekJqd4AaABAg", "comment": "he referenced chutes and ladders.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwkCTkyku2LRDt1d-54AaABAg", "comment": "Why would the study be reported with that much hype if there wasn't a big effect? Aren't the researchers acting dishonestly by not disclosing up front that their results are irrelevant? By pushing the relevance of their findings they are acting like there is importance already established as a premise of reporting.", "votes": "0", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwmS7rngXqA1ITV-RV4AaABAg", "comment": "What's up with the myths about Oedipus and Electra? Malfunctions in relatives recognition systems?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyBY8nDrj7a0lntsst4AaABAg", "comment": "Does anyone have any sources to the kibuttz children feeling like relatives?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwucE40I2y6Dt-W7gB4AaABAg", "comment": "This has to be the sexiest professor who is not my type in the world.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxzUcGddeuP9y4BM-Z4AaABAg", "comment": "I say that the chutes and ladders \"Are you impressed yet?\" moment, should be a science-stand-up for Netflix or something... so funny 😅😂", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz9DI8xt-u9rVCG09V4AaABAg", "comment": "Well, the best answer about this \"Most important question about the Chutes and Ladders study?\" would have been:  Did they find the Chutes and Ladders gene?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyqaewvU8KGoXZCvqV4AaABAg", "comment": "The part with Napal and Belgium study - played smoothly, Mr. Sapolsky!  He is a great lecturer indeed.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwAk44OAMAx01choFh4AaABAg", "comment": "Love his sense of humour", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwlVzDxzdOqitLZlWB4AaABAg", "comment": "Guess who's third cousins? Queen Elizabeth and Prince Philip✔", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy6wc-p5Oee4A0DTJJ4AaABAg", "comment": "Is he breathing?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzq041GYjN68T8z7WZ4AaABAg", "comment": "Autism isn't a disease.", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz2KrjiCkUWhUAz1Id4AaABAg.9nA-aoQzlzu9qkEyoOFUZd", "comment": "I don't think it would have harmful affects. We are naturally attuned to perceiving cheating than we are with generosity. Perhaps this would stress the mother out because she can't rely or trust her partner and thus prepare if the father leaves. It depends on the environment and how well the mother handles stress. If the mother is too stressed the fetus will have elevated levels of  glucocorticoise in the bloodstream  causing the fetus to have a smaller region of the brain that handles stress.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz2KrjiCkUWhUAz1Id4AaABAg.9nA-aoQzlzu9tJr5-FeV_H", "comment": "Oh ya! No don't do that! A pregnant woman can smell what you are thinking sometimes!  From across the room.   Its just not worth it because also a pregnant woman is way more prone to homicide!  Bare handed homicide.  Also bout 4x as strong as she normally would be!  All fact!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwkCTkyku2LRDt1d-54AaABAg.9lMIUF3wvRf9qjvAU9Xaf4", "comment": "Because we tend to think in categories. In order for the public to be impressed the study has to have some kind of eureka. Every bit of information we get from a study moves a field further but it's not always going to be a eureka. It's like one small step which the public wouldn't be interested in or inspire youth.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwkCTkyku2LRDt1d-54AaABAg.9lMIUF3wvRf9qk-PuWH5zd", "comment": " @prestonthomas9684  then so be it. I'm not for the distortion of reality in order for effect. That's disingenuous and akin to manipulation. It's also pretty arrogant for the user to assume so much about their own abilities in the control of others as it would require a presumptive perfection in all their own premises, perspectives and conclusions. Which is obviously fallacious on its face. What idiots.   And don't get me started on how stupid it is to try and get the whole population into STEM. Why aren't females proportionately represented among engineers? Because they don't want to do it. Statistically speaking, females tend to occupations that involve social relations over occupations that involve STEM. Whereas males trend the opposite. For us to waste all this energy and resources to try and TRICK people into trying things they will inevitably choose not to do is a waste of energy and resources. I'm not saying we have a better way to weed out the small minority who are interested in the career length application of that field of study at this point but that this way is ipso facto insufficient. For us to go a step further and actually distort the significance of the data for this purpose of tricking people is absolutely egregious!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzq041GYjN68T8z7WZ4AaABAg.9cLM9tValjZ9qkW2EewlsW", "comment": "People with autism have a larger brain yet the neurons are farther apart. That is the problem with autism. The genes transcript into bigger brains but doesn't transcript neurons for the extra brain size.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxcE-4WwgyeD6YKNQ14AaABAg", "comment": "I would love his classes more if he stopped refering to autism as a disease.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg", "comment": "1) The IQ test they used (not specified) in Norway lacked the precision to reliably detect a difference that small. It's not the the study design that matters here. It's the precision of the test instrument that limits it. There are different adjustments to apply for age. It's a blunt instrument. 2) We had a mantra in my lab: \"Statistical significance is not clinical significance.\" I varied by 2 points between ages 24 and 42, the only two times I was tested. I had a higher score at 42, but my IQ is NOT rising.", "votes": "0", "replies": "11", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwp9_KlwmcWn5zvcRx4AaABAg", "comment": "Ummmm Autism isn’t a disease", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxPaMqsSH5sojs5ZUR4AaABAg", "comment": "Best story about mate selection: 50:20", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz7mrsZ-EhJDFn7fJl4AaABAg", "comment": "I Q?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxeb0FWjKDTXZUNCjp4AaABAg", "comment": "46:30  Err, autism is not a disease. Sapolsky is brilliant - but that's just plain wrong.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyhTTmKmm1LbQS8oA54AaABAg", "comment": "It's not thay human babies prefer the smell of their mom - they have an innate aversion to the smell of Margaret Thatcher", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgztVmFZnuCZm6F59_14AaABAg", "comment": "Okay, so the last 5-10 minutes of this lecture are extremely foreshadowing, not just for the class but for the US as a whole. IMO worth waiting for...", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxl5JkYXS0rxAzwUEt4AaABAg", "comment": "Shout out to his unscripted, \"take your average, like, off the rack endocrinologist and what these hormones are about is...\" comment 😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwmCiz3jWJ4dSgyni54AaABAg", "comment": "RaJah all that !!! YEA🙏🏼", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyIE3IRLm5VWAFdUJZ4AaABAg", "comment": "I was at Stanford under a  pseudonym in 1977 pursuing killers. It screwed me up. I came back in 2011 and had the privilege of this man's insight.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy2jTB8ZMAm9ow7Lnd4AaABAg", "comment": "Great instructor/professor/great man.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyIS6nDRWivV7m7a1F4AaABAg", "comment": "ECELLENT!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx-Ly_fSDcz0SDEC014AaABAg", "comment": "STOP CLICKING YOUR PEN! That guy in the background is so obnoxious!!", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxKhmUVDIDvwYMEBzJ4AaABAg", "comment": "1:17:20", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwGg2PfrvcsRhVp0Ld4AaABAg", "comment": "Wake self", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxsSsRr7o1ZP15ZNW54AaABAg", "comment": "Wake up", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz9jonlluS9SNd8DpZ4AaABAg", "comment": "The real question is how ladies back in the day had 14 kids maybe that's a lie but also the effects of complex organics and their implication in the expressions. I guarantee no one is out here saying the peak oil is creating fumes we never seen before. But if you thunk a single line explanation could get ya ... better look out, dawg.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwthOr8lq1iZCs8O6F4AaABAg", "comment": "As an answer to the first born question it is pretty obvious the answer would be through epigenetics by the emotional experience and it's genetic modulation", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugyk2fZIlSE1Xu9q-P14AaABAg", "comment": "I need to know exactly how much better the Nepalese are at Shoots and Ladders!", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cTo4qttyo-", "comment": "When you have 250.000 participants, it is not really a problem, is it?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cTtOZu6L3A", "comment": " @freyc1  The number of participants only affects the likelihood that they represent the population. The test has its own precision limits.  An example of this kind of error: Imagine a digital camera that takes pictures of 10 pixels by 10 pixels, only black or white. Take portraits of 250,000 faces. You will never be able to detect how many of them have pimples because the camera is unable to detect anything as small as a pimple. The effect is smaller than what the instrument can reliably measure. IQ tests all have a margin of error. They are a blunt instrument, in addition to it being poorly defined just what they are testing.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cTuIf0IlTz", "comment": " @beenaplumber8379  This is not comparable. You are not looking for small things, but for small differences between things. Yes, there is a considerable margin of error, but all these erros even out, with a large number of participants.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cTvNpBKb3A", "comment": "Imagine I want to check if children are taller at 12 than at 11 and a half. The difference is very small. And maybe my measuring device is very inaccurate. Still, if I measure 100.000 kids at 12 and at 11 and a half, the average result will be greater in the second case, even though it will often not be the case for individual kids.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cZF4ubWUTL", "comment": " @freyc1  If you measured a child 250,000 times with such a device, that error would average out, but you cannot do that with an IQ test. Repeated administration of IQ tests affects the outcome of those tests. More importantly, height is actually defined (not measured) with incredible precision (even if there is a wide margin of measurement error, as in your example), and measurement is relatively objective. Height is the distance from the floor to the top of the child's head. If you measure 250,000 children with your device, you would also average out the error pretty well. But what would you do if you randomly assigned the children into two groups and found that one group was significantly taller than the other? That sort of error happens all the time, and it doesn't mean there is some sort of significance to their being assigned to one group or the other. Prof. Sapolsky talks about the importance of randomness in determining what we observe.  If you assess the IQ of 250,000 children, you don't know the objective, or \"actual\" IQ of any of those children, only your measurement, so you cannot validate the precision of your assessment. You can only assume its precision because it has been published and validated statistically - within certain constraints. The only way to validate its precision would be with repeated measures of the same individuals, which confounds the data. That limits the meaningfulness of small differences in IQ scores. They can never be tested to a great degree of precision.  The people who design IQ tests cannot say what drives the numbers up or down by only a few points. They cannot even define the concept of an actual, true value of a person's IQ beyond the repeatability of the result using a variety of means, each of which suffers from similar deficiencies in precision.  A difference of 2 cm is a meaningful difference in a child's height, by definition, but a difference of 2 IQ points is not defined as a difference in intelligence. It is defined as a difference in performance on a given IQ test. An IQ point is not a unit of measure. IQ truly is a self-referent statistic. It was intended to predict academic achievement, but it doesn't even do that well. It predicts how well you will do on your next IQ test, but it doesn't even do that with the kind of precision implied in that study. Statistical significance does not always indicate a meaningful difference.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cZnU4Y_VHC", "comment": " @beenaplumber8379  It is not about measuring the same kid many times, but about measuring many kids in both groups, to see if there is a different average in each group, because that's what's we are interested in. And the point of having so many of them is that the difference cannot be a fluke. If there is a significant difference, there must be a reason for it.  Sure, the fact that we have measured the difference does not tell us why there is a difference (hence the discussion in the video). But there must be a reason. The fact that it does not predict anything else (which in this cas is debatable) really doesn't matter. A significant statistical difference is meaningful by definition, because there has to be a reason for it, although we may not know that reason. It means we have to find an explanation.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cZopNBIooE", "comment": " @beenaplumber8379  Also, the study never pretended to assess the actual IQ of any child but only the average IQ of groups made of many children. And that can be tested with almost arbitrary precision provided you have enough of them in each group (just give them all the same test). And it is not because we do not know what IQ actually means or because IQ tests would be stupid that the difference shouldn't have causes.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9cZz8xOlDL-", "comment": " @freyc1  Statistical significance is defined by a \"p\" value, which represents the probability that numerous repetitions of the study will yield the same result, usually more than 95 times out of 100 for this type of work, NOT that the result itself is at all meaningful. (Statisticians usually scream those words through clenched teeth.) Having more subjects in each group does not affect the sensitivity of the instrument you use to measure them. Remember, every subject has a unique value, and each of those unique values is assessed only once at baseline and again at the end by an instrument that is both imprecise and inaccurate, within limits. There is no force of nature that requires it to even out with repetition.  Remember also that IQ is presumed to be unchanging, so the fact that a slight drift was detected is just as likely to reflect a limitation in the assessment as anything else, especially a change so small. But we know the raw IQ score DOESN'T remain constant, which is why these tests include a fairly crude correction factor for age when computing the score. Nobody in psych research would ever claim such a minute change as seen in the study described by Prof Sapolsky would be of any importance other than statistical, even if it were real. IQ tests do not measure what you apparently think they measure, and they are not nearly as precise, nor their scores as meaningful, as you seem to think they are.  I mentioned two tests I had over an ~18 year period. The more recent was 2 points higher than the earlier test. But there was also a third test. The two I mentioned were WAIS-R II and WAIS III, but during that time I also had a Stanford-Binet test. The range of scores, if you include that one, was 14 points, nearly a whole standard deviation, yet they were all validated tests for clinical and research use, and all administered by licensed professionals.  The variation in scores is really big, and it can't be averaged out across a population because the variance is different for each person. Unidentified subpopulations can have undue weight on the results. You're measuring the diameter of a blood cell with a yardstick, and that's not something the instrument is capable of doing, no matter how many cells you measure. The error in that range is arbitrary, and it is separately and independently arbitrary in each case.  The proper way to report meaningful data, if there were any, in such a study would be something called a repeated measures ANOVA with between-subjects variables for sex and environment, where average scores were not tested, but the change in individual scores were tested. It's been a while since I saw this lecture now, but I don't think they did that kind of analysis. I can't imagine increase or decrease in IQ score was detected in this study. The noise would be incredible at that resolution. I'd expect nearly all of the variance would be unexplained by the test variables. If they didn't do that kind of analysis, this is really junk science. If they try to assign meaning to changes in a test score that are undefined or below the threshold of detection by the test designers, again, junk science.  I love Prof Sapolsky, but I think he's presenting this study all wrong and giving it undue weight.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9c_3Ta_3saQ", "comment": " @beenaplumber8379  You simply don't understand the problem. We do not care about measuring individual IQs precisely. It doesn't matter in the slightest.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9c_5-N2ZfzF", "comment": " @beenaplumber8379  I agree with almost everything you say (I have none of the opinions you assume I have). I merely think it is irrelevant.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoDsIhLRcU1t6ok0Z4AaABAg.9bfytPHLSGn9ccor1ksigI", "comment": " @freyc1  I'm perfectly ok with disagreement. That's what drives science. If we all agree, there are no questions remaining for science to answer. (I'm a retired neuroscientist.) And I'm sorry if I've misrepresented your position at all. However, we are still talking about different quantities, for whatever reason. Neither of us is talking about individual measurement of absolute IQ. You are talking about the average of IQ scores across an enormous sample size (which is reliable up to a point, but not very meaningful as differences decrease). I think that is the wrong metric.  I am talking about the differences in IQ over time, with sex and environment factored in. When you compare an individual's baseline score with their final score, then each individual serves as their own experimental control. It's much more powerful than comparing averages at the beginning and end of the study.  It's those differences in IQ score (which were apparently not reported), not the baseline and final score averages, that are not made meaningful or reliable by a large sample size. The minuscule difference, averaged across the vast sample size, and most likely within individuals, lies deep within the area of uncertainty of the test instrument, and well below the threshold of any real world meaning. The designers of the various IQ tests have never asserted that a fraction of an IQ point represents any functional difference whatsoever, even if the effect on the calculation of the scores is real. We don't even know what, if anything, IQ tests are measuring because their best validation is performance in other IQ tests.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugx-Ly_fSDcz0SDEC014AaABAg.9aEAQo3NUvp9aNdiQ1E5BJ", "comment": "The one coughing grinds my gear more!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzwjfi46ABBKR0Hb3h4AaABAg", "comment": "I usually recognize my relatives using the so-called \"surname approach\" - a fancy piece of cognitive reasoning", "votes": "5", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxU8jo7tSLaYeKtnel4AaABAg", "comment": "Armpit smell of Margaret Thatcher lol.  Phrases I never thought I'd hear", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzw6--3cHsR2gk8DF54AaABAg", "comment": "This guy’s hilarious", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx8t_FPqdROiv-Gpm54AaABAg", "comment": "The differential theory of mind stuff, inter alia,  is definitely worthy of refreshing.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz1xwkqDjYyHFBQF1x4AaABAg", "comment": "This dude is awesome.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxQBFhz8rZT4gptdxF4AaABAg", "comment": "In about three quarters of an hour  we have just seamlessly arrived to sweet home alabama", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwX1F-nUllpBor_SnV4AaABAg", "comment": "So tell me how ones own fart smells passable and others awfull?  And there's studies that have shown that women are not attracted to a man whose immune system smells like their own even though the man is not a close (or even distant) relative. This has been attributed to the fact that complementary immune systems create more viable offspring. Btw. did you know that people get sniffles and other olfactory iflammation quite a lot when in active courtship. That's because you are exchanging your bacteria which (if all have gone well) you are not yet immune.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxxOcOvCfom7KEOnpJ4AaABAg", "comment": "Hey does someone has the link of the NYT article about Chutes and Ladders? I can't find it anywhere, this is weird 🤔", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzF2VudEqXi8QtUj994AaABAg", "comment": "What a great teacher! Thank you for putting this online!", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgywdH7NdYFSbvwCM-d4AaABAg", "comment": "Regarding his question about recognizing a mother and the differences between vaginal birth and C-sections: my son was a C-section baby and I know that the OB/GYN wiped some vaginal fluid on his face and then placed him near my wife's face and neck immediately. This is one way to remedy the absence of going through the birth canal and being exposed to that type of bonding.", "votes": "19", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxc7Q_rwBdKYFXabgZ4AaABAg", "comment": "needs a break to much weed/psychedelics/shitshow talking", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwMkIpE3rz_x1TRI2N4AaABAg", "comment": "Was this lecture on April Fool’s Day? I can’t find anything related to that “Chutes and Ladders” study in the New York Times.  BTW it’s called “Snakes and Ladders “ in Nepal.", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzNKglwvysQBMkE2YV4AaABAg", "comment": "Between any two countries, one will always do better than another, naturally.  Therefore  . . .?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwlt4r6p_qcZN-Je5p4AaABAg", "comment": "Does the longitudinal difference in the locations of Nepal and Belgium have any bearing on the result?", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxyBX4Llyd9KQwb8Ax4AaABAg", "comment": "Sapolsky is awesome.  I'm serious.", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyG1hqJ3irUA3jx7hB4AaABAg", "comment": "My pregnancy smells /food needs and aversions explained finally.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwFBdvG0YiV2ZFlMv14AaABAg", "comment": "neat", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgztGGkJgaSCXFrqJDh4AaABAg", "comment": "Coughing lady is back, when will she stop coughing. Still, Sapolsky is as great as ever.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzwOB6EB5_TCg6ZR994AaABAg", "comment": "Kudos, Dr. Sapolsky!  You had me at, \"...screwy olfactory system during pregnancy\" in prep for scent bonding with the new-born. (Mind Blown!)  So many revelations!  AND that big reveal about the military being a perfect example of manufactured pseudo-kinship.   Can't wait for the next lecture!!", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxzQBENNaQTWYdgmqN4AaABAg", "comment": "\"Okay I guess I will smile at the kid now and then and maybe attend a few of his piano lessons but Im not investing any more than that \"  cracked me up so harddd", "votes": "6", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwMkIpE3rz_x1TRI2N4AaABAg.9YbMnmr-Cxn9bDW0NvVvf7", "comment": "It wasn't a real study, it was a thought game. The whole purpose behind the game is to think of different kinds of questions when conducting a scientific study. Not just the obvious questions that you would ask in a study but the questions that nobody thinks of.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxyBX4Llyd9KQwb8Ax4AaABAg.9YW5Z7Rp4UU9YW5b3i2jvl", "comment": "Always.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzysrGqhYhCtpwhpqJ4AaABAg", "comment": "oh yea right on read this dude's behave boook synopsis... i thought it highly entertaining... left printouts of it in the bathrooooom to keeeep me entertained while i grunt. having said that nice series of lectures Prof Sapolsky! Dude, You totalllllly looook familiar", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzOSwFttk6vQEsl1l14AaABAg", "comment": "you want tomeet your xwife real time? ok", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgycqdwkimPvS5T3g8p4AaABAg", "comment": "Birt good...mom nice...assoc..", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz9Pj_eQFpkje0Kx9N4AaABAg", "comment": "Generalisation specialisation.....diverse...inbred....env need", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxAFFK2TVg-WV-2ihh4AaABAg", "comment": "Pregnant..need food...oflactory hike..dead kid in 6 months....invest gone", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyriWNSkJIdK7dGuFt4AaABAg", "comment": "Cycle of comfort", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxhvFbnV9gM8i4vZHB4AaABAg", "comment": "Parents r lovey dovey....thn reality hits..", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugyg01AEt0flglvVvVJ4AaABAg", "comment": "First born more care at birthing but 2nd gets practice....love and no knowledge in developing countries...romantic time....", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxJAEgCzwdaC6l9gih4AaABAg", "comment": "Nepalese don't falter bcoz life repeated hits....follow the system or die...no room for faltering... Won't make mistake in dice number movement.....both r equal unless u make a mistake and other playe also has to be aware....", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwn4Ht0YDOScUFU0r94AaABAg", "comment": "If u don't falter when bad dice...u at least go with the numbers....no mistake.... Mistaken snake...sheep", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzbAgaHq74b8hBKozl4AaABAg", "comment": "wow guys  so much knowledge thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz3MYPBaL62WgxcaY14AaABAg", "comment": "I am fourth born to a mother who was hospitalized for being suicidal while pregnant with me at Agnew State Hospital. Three months later she was coerced into surrendering me. I was adopted out and raised as an only child. I am listening to this lecture wanting to know which has more impact on my IQ 🤪", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyGNqlVPCOwHslRoUx4AaABAg", "comment": "내손을 잡아^^하고싶은말이 다 들어있네", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzxxM-ckrdC05RqGup4AaABAg", "comment": "mother doesnt equal stranger doesnt equal armchair im just faceblindXD did they try that with recordings? i recognise people by sound lol", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxmay45G9guyzEXF294AaABAg", "comment": "he called my neurotype a disease? wha-?", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxBiSk7f3b7M5hc9-V4AaABAg", "comment": "💚💚💚", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxmRFRVj0hzRP8mvll4AaABAg", "comment": "Has Stanford ever released the midterm or final to this class?", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwMoJ5m9btVjqrBU8d4AaABAg", "comment": "I don't know but I loved the smell of my babies heads after I had my three sons. I bet I sniffed their heads enough that if I smelled someone else I would have noticed the difference. After all it was my sons I constantly held.", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzoCjb7dNFSc3iYxRV4AaABAg", "comment": "That hormonal renovation thing is interesting as hell. I've had 5 kids, the first 4 have the same dad, I don't have any memory of how the middle 3 kids smelled at birth, but my firstborn I can't remember clear as though it was happening, the next time I began god awfully attuned to my firstborn was when he started to hit puberty around the age of 10-11. Interestingly though, my 5th baby who was only a half sibling to the other 4 was born around the same time, and he smelled exactly like my 1st did at birth. Whether that's due to just how genetically similar they both were to me over their dads or whether it's because they were both the first child I had with different men I'm interested in, if the female pregnant brain gets a new renovation with each pregnancy to different men or each pregnancy in general I'm also interested in, but the really big curiosity I've got about it is my 5th only lived to be 13.5mths old because he was born with orai1 deficiency/crac channelopathy. One dodgy orai1 gene from his dad, one from me meant he had no functional T or B cells. So now I keep wondering if my first is a carrier of the same mutation I have and #5 had 🤔", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw5d0M9tZjU-04qD8V4AaABAg", "comment": "That's one beautiful teacher. After years I still find something new.", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzOSwFttk6vQEsl1l14AaABAg.9XjRcjeW8e99XjRpGJY4SJ", "comment": "she comrr to san fran, im not going to texasever again/", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz3MYPBaL62WgxcaY14AaABAg.9XPzBao5YZF9XQ-2iHicEY", "comment": "Aha! In any case, the effect is not that big.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugxmay45G9guyzEXF294AaABAg.9XG11PFvwDm9YqYsFYKQ1Y", "comment": "this was recorded more than 10 years ago and autism research was in a different place. there are still researchers that refer to autism as a disease rather than a disability (because a disease inherently causes suffering, thats why its dis-ease, not at ease but autism does not inherently cause suffering especially as we learn  more about it) but the neurodiversity idea is becoming more prominent since the 90s and especially in the 2010s and now the 2020s.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwMoJ5m9btVjqrBU8d4AaABAg.9X2K62dZIky9alseq1uBNR", "comment": "Omg yes. And I could tell the change aa they grew from baby to child", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwU67U9sxjtbnAbCTJ4AaABAg", "comment": "Epigenetics is more rare than it seemed 10 years ago.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz35z07dzuGvQeB0Td4AaABAg", "comment": "This guy sucks.  Whatever he or Stanford are doing in SEO is causing me to see 2 of 3 videos in my youtube queue from him.  Unlike other channels, I seem to have no way to block him.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzZyjXGJo5IB_AYQ194AaABAg", "comment": "30:00", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzdmseqi7sFF5TFoLx4AaABAg", "comment": "So gifted a lecturer.  I hope I might one day speak and communicate 1/10th as well. Thank you Professor Sapolsky!", "votes": "9", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzL6gKZ_ZhBlDacx0F4AaABAg", "comment": "My favourite part... He used the word \"morning\"  at students. Didn't you see the chutes and ladders article posted this morning? Lolllol the dead silence... priceless", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxOjai1MdtciZwzuqF4AaABAg", "comment": "the entire time i was wondering what the crowd looked like 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgywLP4V5_rTbR5edPh4AaABAg", "comment": "The man is a waterfall of words - great stuff, i miss the classroom", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzBk4NbF6HnFez8IP94AaABAg", "comment": "I'm an English major watching for fun and haven't fled yet!", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzuQwpJICoJo1nDy6t4AaABAg", "comment": "Interesting…..signature proteins floating around ….", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwZ5QAUWzdmWI7NEu14AaABAg", "comment": "With the taking care of children. Feral house cats will leave the kittens with a \"group\" and a wet nurse or two while the mom goes out and hunts.  So this trait would be on par with the vampire bats/reciprocating behavior?  Super loving this class. The professor makes things clear enough so that you know what's going on without needing an undergrad degree in biology.  ;)", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyWM4vzYCaYuaezRLl4AaABAg", "comment": "Not a science major but a secondary language arts education major here. I absolutely love these lectures and have found myself drawing parallels between the info I have learned in these lectures and my everyday classes. I believe that is a phenomenal indicator of just how effective you are as a teacher. I strive to be as good a lecturer as you at some point in my future career and would like to thank you for making these lectures both free and readily available for the general population instead of hidden behind a paywall like most other universities or educational institutions do.", "votes": "9", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz1sb9HWDvWLuV5Yqx4AaABAg", "comment": "Can't believe the plant IQ joke didn't get a laugh, he tried that one a few times", "votes": "12", "replies": "3", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyiNxC9A5efPZojTFV4AaABAg", "comment": "How does one take notes in his class?", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxD-w44z3HT5eKYyN94AaABAg", "comment": "maybe this olfactory renovation during pregnancy can give some clue to the loss of smell in some covid-19 cases?", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz8xaOcuiJHqvcVVR94AaABAg", "comment": "Kurła, ludzie, siedzę sobie w domu i studiuję na Stanfordzie, CA", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz7R3RWVKrkxyujf1F4AaABAg", "comment": "That was all too annoying.  Can’t stand inclusive interactive lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxz8PSh_xXBTFqc0jN4AaABAg", "comment": "15:27 is when he gets to the point about that dadaistically fictional study.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyVhI4BMVyhomqSZd14AaABAg", "comment": "I tried to count up how many times he uses \"Interesting\" but lost interest and gave up! What a great lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy-9gVs356p2kwKB5p4AaABAg", "comment": "I love that the lesson he is trying to impart is to approach even incredibly impressive modern research with scrutiny and skepticism.", "votes": "17", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw1qLalgBr5exNmfx94AaABAg", "comment": "How does one keep up with all the new articles coming out", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzZyjXGJo5IB_AYQ194AaABAg.9Wd-zkOKipU9ZDzbP2NOyC", "comment": "1:08:00", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz1sb9HWDvWLuV5Yqx4AaABAg.9SOsjACh8lD9b4zY4Rt9zh", "comment": "These days you'd probably have a couple of students try to replicate the findings...", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz1sb9HWDvWLuV5Yqx4AaABAg.9SOsjACh8lD9eLlWgEj4Us", "comment": "Me: watching so I can hear the joke. He is so brilliant and his jokes are the best.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz1sb9HWDvWLuV5Yqx4AaABAg.9SOsjACh8lDA2nFONKTV7P", "comment": "I laughed every time he used it", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugy_nrF9ydPqk6IvVet4AaABAg", "comment": "Wooahhhh!   I sleep with Sapolsky every night.   So only hear the 2st half of lectures & then snuggle while he talks & drift off.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy_esbc4xLC7HcPlJp4AaABAg", "comment": "You are the best  but I'd be afraid of your assessment on my adhd,a globalization template with new industry poped in my head how does that work", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwhNePoSMc3dWIAe5d4AaABAg", "comment": "Finally saw students in this video", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy2ypW1Pi-gdhRmGeF4AaABAg", "comment": "What about technological advantages that younger siblings are privy to due to advancements over time?  There's also the proclivity for younger siblings to lookup to their elder siblings. Not to mention a greater sense of security for younger siblings.   Those factors alone could potentially explain such a small IQ discrepancy if not accounted for or ruled out.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx1fV9YXLf2hSvNc_h4AaABAg", "comment": "I just learned a new fact that learning new facts stimulates neurogenesis in the hippocampus so .... I just got a few neurons out of this.", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyCHQWJEtwgNZaUAeF4AaABAg", "comment": "\"people from Nepal Vs. people from Belgium\" - Did anyone ask about people from each country but no longer lived there? Know it's not to be taken seriously, but it seemed like that small detail got missed out of the questioning. Sure there was plenty else. These are brilliant lectures. Thank you again for sharing them!", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyuKHap0Z4gwG1uSYt4AaABAg", "comment": "Can you do a lecture on coughing?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgztlSfL0TYHMprMLXJ4AaABAg", "comment": "Interesting thing about the tutoring model to explain IQ differences between firstborn and second-born, is that it’s actually consistent with a number of other findings in the field. For example, having mixed-aptitude classes in gradeschool has actually been shown to slightly increase achievement not only for the low aptitude kids, but also for the high-aptitude kids as well, relative to segregating classes by aptitude (eg. having the brightest kids in their own advanced classes and the glue eaters in a separate, lower level class). It’s thought that this is because it forces the higher aptitude kids to be able to competently answer questions and refute wrong answers from the lower aptitude ones, effectively demonstrating the same “tutoring” impact on IQ and academic achievement.", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzBFUhhxCz3L7firah4AaABAg", "comment": "Whoever is recording this needs to pull back from Sapolsky and let us see the board occasionally.", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzD-uoxnA0mFvGFChd4AaABAg", "comment": "Maybe the first time you make a baby it comes out better", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwT3qL0g4aJnUAxUzF4AaABAg", "comment": "Man, comments are almost as good as these videos", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyueVgydSq1xJ8q6tF4AaABAg", "comment": "does anyone else  think he sounds like Jeff Goldblum?  Explaining how dinosaurs always end up eating everyone?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy0PN1zlkCsjZEQXzt4AaABAg", "comment": "Professor, You implied a difference in parent-newborn relationships based on olfactory experience in vaginal births contrasted with Caesarian-section births. All three of my daughters were delivered via C-section, the first emergently after almost delivering vaginally. The eldest daughter has had a closer relationship with me all her life. I was close to my last two, but the communication was not as tight. I'm 66 now (18-22 or so during deliveries), and all three have ostracized me. Is this related somehow to their types of birth and that i did not breast feed them? Why do they love their father now more than they love me? K", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzVJ3ckm7FdEGsPRoR4AaABAg", "comment": "what is the Wellesley effect?", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzrH0SKDfMQmlZn3Jd4AaABAg", "comment": "I feel privelaged to be able to understand these uni level classes as eng being my 2nd language", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwy8Y55WE_ooXrSc7R4AaABAg", "comment": "I am from Nepal. I sure play it better . 🇳🇵", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwbLsC3Kwku1AH--cx4AaABAg", "comment": "Thank you Dr. Sapolsky. Thank you Stanford.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxf-_kGqtwzRyQQ51F4AaABAg", "comment": "Did this study factor in chance?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugyqa5NneBlV4S2x5pB4AaABAg", "comment": "olfatory learning :o", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgybUo9wNdo8epQ6Aml4AaABAg", "comment": "I am Nepalese and yeah everyone of us took part in the snake and ladder experiment", "votes": "22", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgztlSfL0TYHMprMLXJ4AaABAg.9Q7VpdplNQu9d4Wqr72nhF", "comment": "this is a very interesting additional detail, thank you!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzBFUhhxCz3L7firah4AaABAg.9PbNrV2d3wI9TY9VY8NLbp", "comment": "It's automated.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugy0PN1zlkCsjZEQXzt4AaABAg.9P9BLbljlxN9Vp1BkJas8N", "comment": "Lots of this happening these days.  Perhaps there may be some kind of political difference.   If you are very conservative and your kids are not (or vice versa) this may be the issue.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzVJ3ckm7FdEGsPRoR4AaABAg.9P9Ab5OIlNe9_ztTQzO7RB", "comment": "Synchronized menstruation", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgybUo9wNdo8epQ6Aml4AaABAg.9Ofw63eZIHX9PdU1VQr08_", "comment": "Well, chute!", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw0a9jruz8E5x4E3_l4AaABAg", "comment": "I'm in", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzwMI40hkvfPsSsEjd4AaABAg", "comment": "The fact that people are most attracted to the scent of their 3rd cousin leads me to this follow up question: Would a 2nd or a 4th cousin smell more “attractive”?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxEDbeX-fr7osQRxHl4AaABAg", "comment": "46:53 It's kinda funny that learning about new neurons being generated in my brain's hippocampus as an adult (contrary to my previous belief of this process stopping in early childhood) perhaps contributed to the creation of said neurons. This makes me strangely happy. Or maybe it isn't so strange.", "votes": "8", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxXchjbTaw6H8d-RKV4AaABAg", "comment": "Why cannot we humans have sharper senses..we seem very backward..is there a real reason for this..or is it just the way nature wanted us to be?", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxbnEILPayJnyZ0VWh4AaABAg", "comment": "1:00:20  Quagmire shows up- GIGGITY", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy_MiDPBi8wudPLFmh4AaABAg", "comment": "20:46 Bruh", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz79ZQi89d6w92phAh4AaABAg", "comment": "I’m Never going to look at my 3rd cousin the same way now.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwCkJiDomsUWcNk9EJ4AaABAg", "comment": "Now I figured out why these videos are underliked: it's too interesting to listen and even watch that one forgets to look below, I think", "votes": "12", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgytFgpLKA9a34aCFmF4AaABAg", "comment": "This is dope", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzJfYX3w2jN2ZZfxZt4AaABAg", "comment": "the 2nd born (& the rest of the other borns) child having a higher IQ than the  1st born child makes sense. I remember the game where I compete against my siblings and cousins (family relatives on my mother's side) in answering questions from sciences, history, etc.  My cousin (2nd born child in their family) won first place then followed by my sister (who is also a 2nd born child in my family) won second place.  I won third place ( I am 1st born in my family and 2nd born in the entire family relatives of my mom's side).", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzKn0OBgE0PbQogB6h4AaABAg", "comment": "lectures are jam packed with information in breadth, on speed 1.5x is great, dont mind watching this at all, every now and then i catch something memorable", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwTkFhNrFnyGvM0kQ14AaABAg", "comment": "x/(x-1) = 2 where x /= 1 x= 2x-2 -x = -2 x =2", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzk32HzU0sZcXsbbdt4AaABAg", "comment": "I love him, but I also think he kinda looks like a bonobo", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx40hiP-V49b9-zng94AaABAg", "comment": "?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwK-gFIo_Kn1LqDYzt4AaABAg", "comment": "At 46 minutes he says that this ability to smell a relative vs a stranger is dysfunctional in people with high incidences of autism in their family. Interestingly, look up the 'sweaty T-shirt' experiments: where women can determine and rate \"sexual attraction\" by smell. Higher sexual attraction with a more genetically distinct versus a close genetic match.   When a t-shirt has been worn by a man for 24 hours, women smell it, and rate \"sexual attraction.\"   But... women on birth control have it reversed and are more sexually attracted to a close genetic match. In other words more like a brother or a cousin.   Women not on birth control are more attracted to the most differentiated from their genetics.  People are regularly reversing human history bcuz we are choosing mates with women artificially \"pregnant\" on birth control who essentially might be genetically similar vs distinct. The skyrocketing rates of autism might partly be due to that fact", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzoTBwbIR_w1BP_HWV4AaABAg", "comment": "How big is the difference? No difference.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz9iVXWL5_nIQC0vLV4AaABAg", "comment": "We love Dr. Robert Sapolsky's lectures. Does anyone know if the course materials are available anywhere? I could not seem to find anything online at Stanford. This series seems like a valuable resource and should be supported. I also wonder if Dr. Sapolsky continues to offer this class in an updated version and whether we can find the recordings. Another question - why does the Youtube site have to be so hard to navigate? For example, why are the lectures not maintained in some sort of order?", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyLPpnWFXAhNp2_kKF4AaABAg", "comment": "Ok, I'm from Belgium and I have never  heard of that game. So here are my explanations before watching further: Before I google it: because there are fewer players knowing the rules  After I google it: \"Oh, it's not Shoots and Ladders, it's Chutes and Ladders\" After hearing the rules: Errr, that sounds like a pure luck game. So are the Nepaleese luckier than us ? Random thoughts before hearing the answer: How can a group of people can be \"better\" than another group of people at a luck game? - They are lucky - They cheat - They found some caveat - They play with different rules", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx0YTJ2U98srO95Gdp4AaABAg", "comment": "The solid pheasant architecturally interest because wood ontogenetically tickle to a unknown bull. lonely, accessible kenya", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx4yCT2dVnysFfun1R4AaABAg", "comment": "The like lift meteorologically fire because bead conservatively nod modulo a unsightly format. materialistic, truthful bankbook", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxXchjbTaw6H8d-RKV4AaABAg.9OPCnsRJrJk9R132Cfnqd2", "comment": "Blind people have sharper senses.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwCkJiDomsUWcNk9EJ4AaABAg.9O0LVM7FgMUA2nF4aIIODb", "comment": "genuinely", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwK-gFIo_Kn1LqDYzt4AaABAg.9MXjSaGNouP9TYBABXyBpD", "comment": "Could you link the source(s) you're referring to? Seems highly unlikely that birth control increases sexual attraction to relatives & thus has caused increased rates of autism. Don't you think it's much more likely that our biological understanding of autism, awareness of symptom variations across age/sex/culture/etc., & increased access to diagnostic services are what contributes to↑autism diagnosis?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyLPpnWFXAhNp2_kKF4AaABAg.9M3dgu8DQxu9N8biOp2E9w", "comment": "Hah, I also had questions. Hope yours were satisfied once the point of this \"study\" was explained lol", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugx3o_Cfekrpdc2VhYt4AaABAg", "comment": "The ceaseless criminal remarkably dance because albatross phylogentically hug off a separate shrimp. gabby, witty trombone", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyFt8SxDqF5DPEHjYd4AaABAg", "comment": "The resolute sleep suprisingly attract because pet routinely follow a a longing flare. therapeutic, chief lasagna", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwxwK4CCjZ4ASHo6Fh4AaABAg", "comment": "The kindhearted bomb microcephaly wash because disgust clasically trip mid a simple india. thoughtless, slim throat", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxLUVus5Uqp0O2IkNZ4AaABAg", "comment": "¿It was that place in olfactory bulb injured in Phineas Gage? I think so, without reviewing the case. It's so interesting in relation to serial killers ¿is there some failure in the victims ? Same thing for women who don't let his mate after several events with violence.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzEPekELcRBTxXcWgl4AaABAg", "comment": "thank you !", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzc8YYMOfnDxFh-G4d4AaABAg", "comment": "\"A hen, or a blue whale or fly is just an egg's way of making another egg\"", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzgD8B-oYqIBYwk_g54AaABAg", "comment": "1:01:55 I'm sry but this hears super creepy and pedo. 😂😂😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyEMBXEL9d3OuQ5CF94AaABAg", "comment": "The learning that the learning occurs at that point is innate!!!! WTF did he say? Someone Explain. For context: 58:39", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy-UqWP9aYrfGex8Lh4AaABAg", "comment": "Its very interesting to think about how much change was made in all those years after these video made. Do all these information still legit, or i just get chill, listening these old jew?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwQzs6oT_-NluW_aEx4AaABAg", "comment": "Rochambeau!  wild goose chase", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzQsJKK0mQyZJro6ep4AaABAg", "comment": "What is rowshambo?", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwsUg46dk2a3DkpEg94AaABAg", "comment": "Epigenetics ❤️🥰❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxLRk--_QwYbuUZphh4AaABAg", "comment": "This is for me :  Start at 30:00", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzwjjSJHa4vb2OR_vZ4AaABAg", "comment": "This is for me :  Start at 30:00", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwQfkt8RU6WOo2gc5h4AaABAg", "comment": "I love these lectures, because they're not just about behavioral biology and related domains, but also about critical thinking. The first 30 minutes of this lecture are something what everobody should learn! Learning is not just memorizing fact, but also thinking about them.", "votes": "14", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxUz6V5AVXpyC4zlOt4AaABAg", "comment": "The unused riddle normally paint because bankbook histochemically precede over a last crow. probable, guarded respect", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwaEkKYvRRhZhJRrkJ4AaABAg", "comment": "20:50 xD", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzyCIp1E2VJYIrJ0yV4AaABAg", "comment": "Second born children take beatings from the first born and more likely to have brain damage.  Saying this as a second child.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgySIJZvIN1u5MHl03F4AaABAg", "comment": "The possessive bean microscopically decorate because stock bodily groan except a ill brandy. instinctive, worthless turnip", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyEFHf9AIh_1MmGUTB4AaABAg", "comment": "What the hell is this cameraman doing 😂", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzQsJKK0mQyZJro6ep4AaABAg.9KVYAEXeGYB9N3FMq1xQqi", "comment": "Paper, scissors, rock a.k.a hick, hack, hock", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwQfkt8RU6WOo2gc5h4AaABAg.9JsFUbrOFPb9R0xtxvRTWK", "comment": "That would be ideal. Perhaps research was done on this : what percentage of viewers/students watch these lecture as a form of entertainment and learn the facts when they study the notes later on and what percentage learn as they go and immediately use the information to analyse their surroundings?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwQfkt8RU6WOo2gc5h4AaABAg.9JsFUbrOFPb9VBnOzGy0Ud", "comment": "asap", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyEFHf9AIh_1MmGUTB4AaABAg.9Iy2sv9acOw9PdVRoy5lL2", "comment": "Someone must have placed it on the Roomba.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwJTl6vEWgcAEF7EnB4AaABAg", "comment": "wasn't it Roosevelt who married his cousin or second cousin ( but i have a feeling it was his uncles daughter)", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxRxnRaGbRJmP0AEFV4AaABAg", "comment": "Thank you so much for uploading this whole lecture series. So interesting and well taught!", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyN0Brao3DKtsJ5pdd4AaABAg", "comment": "The uttermost crow coherently stretch because power centrally frighten given a nondescript john. joyous, orange discovery", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg", "comment": "Ok I’m   P", "votes": "0", "replies": "8", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz-fhxyHbX1L7aeE354AaABAg", "comment": "This thing about the study though hahahah got me laughing out loud", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwGsOGFlVVlEOOyRfV4AaABAg", "comment": "Love this but 2.3 IQ point difference at the mean will express itself radically at the extremes. So based on this study there will be significantly more first born geniuses.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz2RSdPXUbZnUyTzYd4AaABAg", "comment": "Haha Robert the comedian in this lecture. He actually is really funny", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgykaOQ8ycX5diXSn4p4AaABAg", "comment": "... HAHA I find myself interacting when questions are asked! I even raised my hand when asked if (in the class) anyone is a first born.... I am SO into this! Loving the possibility of being able to follow this class. thank you!", "votes": "0", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwCUrvhkKM5_V3uBBt4AaABAg", "comment": "32:29, I’ve been enjoying your videos,,I’ve noticed you’re tearing the hell out of sperm,, you keep that up and they’re going to have to change the Bible,especially in genesis,, Adam might loose his spot to Eve", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwDg-68jv6yILTdd_14AaABAg", "comment": "19:16.,,first born gets a lot of love and attention,,the more children,the love and attention gets divided out,, you can’t give out too much attention to one without explaining to the other child that they’re important too,,and as the family grows,it becomes more corporal,,,kinda like large classrooms vs small classrooms for learning,,,small is intimate,,,,I come from a family of eleven,, a loaf of bread goes one way down the table,, you understand psychology a little earlier,, ( big nickel,, little nickel),", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyslL21FtZetUqb4vJ4AaABAg", "comment": "We need another update on the \"Zebras\" book, please.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz0Raj-yGmrquPCjCt4AaABAg", "comment": "Dr. Sapolsky is By Far the best professor in the world. It's a pleasure listening to him.", "votes": "5", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyKe4XSgT7Y2v3y_BJ4AaABAg", "comment": "1:17:50", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzy4viYH-b-SlRYvhx4AaABAg", "comment": "lmao the camera operator is having a stroke around 21:00", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwpby3oBrAKonRAk1Z4AaABAg", "comment": "I’m so grateful to be able to watch these university-level classes at 17 years old", "votes": "47", "replies": "4", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzkOBL5AKQroG74QDZ4AaABAg", "comment": "I was first born. Everything perfect.  My brother, last born, had everything he wanted. Did everything younger than us. My parents were older so they were also not just sure that nothing bad would happen but also were tired to deal with him.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyvMIfDOiHsYaGkzed4AaABAg", "comment": "He is great", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxZXpXNZCAb5MkCqn54AaABAg", "comment": "Man I just want to be in the classroom to be able to ask and answer questions.", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyZijzxGQLV-NmtGGF4AaABAg", "comment": "10 years ago this man would have passed the wave check... Straight swimming    🏄‍♂️", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxci8xDU_DTC3umVi54AaABAg", "comment": "This guy is a legend", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqWh0C6c6f", "comment": "Moo P ppp", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqX2jP125N", "comment": "Police p The first president president lin oo  M Mlo", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqXGQqv2h6", "comment": "M", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqXhhlgRRs", "comment": "Oko km o ooo oo ok", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqXi2S2lOb", "comment": "Ooolkooooo", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqXuGuwnHv", "comment": "O", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqYOzoT4Uz", "comment": "Our", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzu8k7jIhURX26wgth4AaABAg.9HqWZyPYtmw9HqYW-2Q4FM", "comment": "I’m", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgykaOQ8ycX5diXSn4p4AaABAg.9Hbm1OSmtpk9Icv74lEMLF", "comment": "I do that too. It gets me more into it.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgykaOQ8ycX5diXSn4p4AaABAg.9Hbm1OSmtpk9K_NMFdSDg-", "comment": "you have szysophrenia... omg..", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugwpby3oBrAKonRAk1Z4AaABAg.9FufxRcZzxE9OS4m2OO4C0", "comment": "Great to hear not all 17 year olds are obsessed w/Instagram, Twitter etc.... Kudos my friend..", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugwpby3oBrAKonRAk1Z4AaABAg.9FufxRcZzxE9P9K23y3qHM", "comment": "Not a lot  of us are, you’d be suprised", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugwpby3oBrAKonRAk1Z4AaABAg.9FufxRcZzxE9PbOHzm19sX", "comment": "I hope you don't get disappointed.  Most profs are not this good.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugwpby3oBrAKonRAk1Z4AaABAg.9FufxRcZzxEA2nF7UcUnlN", "comment": "Me at 14 :D. Im such a nerd :)", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxDbWki1it0D1cEXR94AaABAg", "comment": "Been binge watching and ruminating. This fear of 'them' is logical, no? Simply a defence... warning. Basically non-kin are more likely to attack. But does a trusted friend - of any kin - get this reaction? Scientifically tested? If true could it just be the old friend or foe response?", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzHusujxAuYQah9cpx4AaABAg", "comment": "39:48 left at (nope my youtube doesnt start it exactly where i left, and i dont want to miss a sentence he says)", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgypIjOl3FDrVngwQLd4AaABAg", "comment": "I love how he tricked everyone into playing his fake-chutes-and-ladders-study game. Fantastic educator.", "votes": "123", "replies": "3", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxV-I1gojxZs9BBCk94AaABAg", "comment": "Im sending this to all my third cousins", "votes": "14", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgylqeGTXVSR9ehfkyx4AaABAg", "comment": "Why brothers smell weird and stink.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwWrPg_Vo4CiXoGT1J4AaABAg", "comment": "G", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzqNVB3qKa5yfBx4p14AaABAg", "comment": "Ami Abu", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgySiN68_Wp8NBvHmNp4AaABAg", "comment": "Final considerations about manipulation gave me the chills. O.O", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxHiy9vhBPtE6VhAnF4AaABAg", "comment": "Recognizing Relatives lecture starts at 29:40", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxEV9W49dnHdSH9vwd4AaABAg", "comment": "Going to buy Behave once I finished the 25 lectures, and read the Sh*t out of it. It's really interesting and I don't even remember how I got here Thanks YT", "votes": "9", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwfX0CP0857t0ByocZ4AaABAg", "comment": "Interesting study about \"if the person spend a lot of time with another person before age of 6, then they will never marry\". On average in most countries school begins at age of 7, thus classmates probably have a theoretical chance to marry each other later.", "votes": "3", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxKnFzTB_8gwCuDh8R4AaABAg", "comment": "I think these terms need a proper definition along the explanation and examples. From what I gather here, heritability is the percentage representing the direct influence of dna in the variability of a trait.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyXGRVbJm3L0JnNSXR4AaABAg", "comment": "Oh my gosh! This is marvelously educative and interesting at once.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzBfUbtv7oozrLUd7Z4AaABAg", "comment": "It is so cool that those lectures are understandable with a German school education.. (like high school)", "votes": "3", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgziEbTN5CB4xlfLCFx4AaABAg", "comment": "20:50", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz2aS41U5ST-3bFbhp4AaABAg", "comment": "3rd cousin! Amazingly old Chinese custom demands 3 generation at least.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwVRy8eh2QbCNjYZGZ4AaABAg", "comment": "I like the speed in which he presents the information.", "votes": "4", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyRYcNBdq_RomcHA254AaABAg", "comment": "What's with incest both in humans and animals?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy3oUrhx3S9K56GhV94AaABAg", "comment": "I still don't understand why he is trashing the Norwegian IQ first born study, even if it's only 2.3 point difference it's a difference that you have to explain", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9FraCB3LwnvpToyB4AaABAg", "comment": "So, when mother raccoons kick their four month old children out of the nest, has she gone through another reformation of her olfactory system? It's kind of a brutal rejection so it must be a strong mechanism.", "votes": "0", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgypIjOl3FDrVngwQLd4AaABAg.9DiyhkbBUNL9b4z9uvS0us", "comment": "I like the guy asking \"what constitutes being good at chutes and ladders?\"  I'm on the fence as to whether he was a bit thick, or a couple of steps ahead of the class and making a joke, but its funny either way.", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgypIjOl3FDrVngwQLd4AaABAg.9DiyhkbBUNL9gtdgbjhVJE", "comment": " @SineN0mine3  my first thought when he mentioned it at the start was that this game is pure chance, there's no decision making, just dice rolls, so no group can be better at (winning) it. It's all random chance. I'll watch the rest now.", "votes": "7", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgypIjOl3FDrVngwQLd4AaABAg.9DiyhkbBUNL9nGG3b7BP3g", "comment": "I thought the supposed study was real up until I read your comment and was terribly confused the whole lecture as to why he never disclosed the end result of the study 🤦‍♀️thanks! Xd", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxV-I1gojxZs9BBCk94AaABAg.9DVT11yDKkf9R0xz320CeF", "comment": "Is that some type of marriage proposal?", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwfX0CP0857t0ByocZ4AaABAg.9ALujEbVugv9ANFJ6fk1Pe", "comment": "If people have a significantly lower chance of marrying their elementary school classmates than other people from their years the hypothesis isn't that difficult to mentain", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzBfUbtv7oozrLUd7Z4AaABAg.9A-pptYE8NR9ANH11877Hq", "comment": "Abitur zählt als \"freshman classes\" also auf uni level.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwVRy8eh2QbCNjYZGZ4AaABAg.99kWeFr17OQ9PbONtrOxHf", "comment": "Yeah, I can no longer watch other profs.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugy3oUrhx3S9K56GhV94AaABAg.99gBlX7n8Py9PdVJJTPHmW", "comment": "In real world examples 2 IQ points don't mean squat.  We aren't talking Forrest Gump here.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugy9FraCB3LwnvpToyB4AaABAg.99dwYE2VcbZ99dxgrlp8-t", "comment": "Or do they imprint? They are known to be unreliable as pets (I've never tried).", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugy9FraCB3LwnvpToyB4AaABAg.99dwYE2VcbZ9ANIYSZLbpl", "comment": "Or the children grow out of their initial smell (like birds once they have real feathers).", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwGJUuoqRf-gO3bvDZ4AaABAg", "comment": "A question I immediately had about the Chutes and Ladders study: How is it possible to measure or estimate levels of skill in Chutes and Ladders, since the game requires zero skill?", "votes": "7", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyHdT3-_zMtOhnZ9Bh4AaABAg", "comment": "I'm in", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyoHVpdUFKGdRjk9KN4AaABAg", "comment": "Perfect escape from watching my city burn.", "votes": "3", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy2aEGzwp3EzIfWTxx4AaABAg", "comment": "watching sapolsky lectures at 8am on a Tuesday. I am officially a nerd but I'm proud of it", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxbr3UuHqkiycPDNSN4AaABAg", "comment": "Oh damn that pseudo sibling thing screwed me big time!", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyoVxPDVksfLaWX14B4AaABAg", "comment": "The comments decrease with each lecture 🤣🤣🤣. I would go through all these lectures is a resolve.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwrHA3WXG8fA_q1E4B4AaABAg", "comment": "He definitely has the binge clothes shopping Gene.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzJlHnxMFzcqS6BiRh4AaABAg", "comment": "1-Considering the significance of statistical differences. 2-Recognition of Relatives 30:00. Intrasexual competition in female deer mice, (sperm). Sperm will cluster w/themselves. There is innate recognition of relatives. Cross foster. They can recognize behaviorally it’s relatives. Sibling>half sibling even. Olfactory signatures (eg. urine) and pheromone communication. -Qualitative differences in the urine reflecting genetic makeup. -mechanism for recognizing these differences.  The major histocompatability complex. Shared antigenic determinant. This sticks to all cells. Immune System.Don’t attack said cell.  Autoimmune diseases think these are invasive. Trypanosome. Schistosome.  These are ultimately soluble. Give a unique signature to the pheromones coming off of you. They can tell if this is of a relative. There are gradations of recognition dependent on relatedness. You have a specifically shaped protein receptor. If the protein doesn’t fit exactly, then it’s a relative. Depending on how much and how long the proteins stay in the receptors.  Oxytocin, <-functions into pregnancy, then recognizing HSC signals. So then mother nurses. Vasopressin. Social anosmia. Inability to do it. ^High degree of this in families w/autism.  Adult neurogenesis. Hippocampus. Olfactory neurons are created. Females develop these olfactory neurons (and vaso and oxy have roles).  Why do you need to know who relatives are? You know who to interact with. Nobody paid attention to dominance reversal if they were related.  Avoid inbreeding, genetic defects. (Opposing argument: kin selection.) Mate with something like a third cousin: that is the balance.  McLintock study. Third cousins have the most attractive pheromones.  Olfactory receptors detect relatedness. Vasopressincand oxytocin create receptors. Prolactin is another way.  Noninnate recognition. Imprinting. Innate learning. Learn odor, voice etc. goat, and sheep don’t have intrinsics. Eg. The one who smells like my saliva I licked or my vaginal fluid etc. (based on own recognition of smell.) Sociological facts can lead to clamation.  We do neither. We do it cognitively. We think about it and we figure it out. Baboons can do this w/some degree of statistical thinking. Males around ovulation period. Sunfish. The fish father separated gets upset when seeing them with the other male fish.  Fusiform cortex recognizes faces. Damped in autistic people. Mother=stranger=armchair. Pidgins, goats, humans have it.  There is instinctual recognition of the mother by the baby through the histocompability complex, but it however has no relation to the father.. Can also recognize the voice of mom from the resonance through the ambiotic fluid.  Mating. Joseph Schaffer. Kids raised Socialist communes in Israel. Raised in same age group as somebody anywhere up to 6 years of age, you never wanted to mate with them. They seem like a brother or sister/sibling.   Arthur Wolf. Infancy marriages in Taiwan are disastrous.  If we are malleable in who we feel related to, it may be taken advantage of. (Functions in military propaganda.)", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugyed56L0whk-mADzVl4AaABAg", "comment": "Humans are not always rational.  Point taken.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxE9Ukau6Ksxi9jm094AaABAg", "comment": "Great teacher", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz115HkZN5TA92gkNJ4AaABAg", "comment": "Pandemic or no pandemic the lectures are a treat and everyone needs to make time to listen to them. Not only is an integrated inter-disciplinary approach required to appreciate behavior but the application is relevant to all walks of life too and very much to my profession of marketing.  I just finished reading The Gene and this is such a wonderful follow up. Can't wait to finish the lectures and proceed to reading Behave.   I have one request though, is there a way we can access the handouts, the link shared  to coursehero requires a paid subscription.", "votes": "16", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzvBzrgjYXU0r0zKvd4AaABAg", "comment": "We need space to converse. . . and converge.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzUYdOwQoQ4MvgG6C54AaABAg", "comment": "I had always wondered why Albert Einstein married his cousin... turns out he was also a great behavioural biologist.", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy63RHejCflCb1TPWR4AaABAg", "comment": "35:35", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxrChbZ6gp2KTCwce14AaABAg", "comment": "maybe becuz they played'snakes & ladders'like we did!...'chutes'n'ladders!..baa''", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzcMcybHxcq2RRQcct4AaABAg", "comment": "How is 2.3 IQ difference not significant? It's like 15% of the standard deviation. On an individual level I agree it doesn't matter much, but something worth investigating is happening there. If we can raise half the population IQ by 2 points it's huge.", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxreBU_SDNxseClhOt4AaABAg", "comment": "Killing humour.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyMddNOAL5cX27wYcx4AaABAg", "comment": "That clicking noise makes me want to punch babies.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxDkN_9_qB2cQvLc6Z4AaABAg", "comment": "I was first born, and the second born, had a higher IQ, than I did, Then my brother's second born, had a higher IQ, than the first born, then another brother, had a set of twins, the girl got the intelligence, and the boy, got autism.", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgywgYNghrZMTP9d_Gt4AaABAg", "comment": "Anybody else shouting \"effect size!!!\" at their screens by 15:30?", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwGJUuoqRf-gO3bvDZ4AaABAg.99WPw9v78xG99WQJONmI2I", "comment": "Ah. Telekinesis.", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyoHVpdUFKGdRjk9KN4AaABAg.99O09yiy_us9ANFc0m7mZW", "comment": "Have you finished his books?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzcMcybHxcq2RRQcct4AaABAg.956NpvifRrg95Pyq7aqMNq", "comment": "Feakos First borns find the statistic more significant than other borns.", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxDkN_9_qB2cQvLc6Z4AaABAg.945peyyQiGw9ANGu5R4k4E", "comment": "Autism isn't on a stupid-intelligent spectrum", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg", "comment": "0:28 Recap & feedback from previous lectures – inherited trait vs. heritability     – inherited trait: almost all humans have five fingers per hand     – heritability: having a different number of fingers is usually caused by the environment (e.g. accidents)         – heritability (variability around the number of fingers) is essentially 0%  – gene-environment interaction (GxE)     – there's ALWAYS some interaction  – behavioral evolution vs. molecular genetics vs. behavioral genetics     – different levels of description, not wrong vs. right     – epigenetics (the way that the environment influences biology) as an example         – (simplified) molecular level: the way in which the environments turns genes on/off        – more detailed level: regulation of chromatin remodeling and methylation of genes;            changing access transcription factors to DNA     – Is classical behavioral genetics (i.e. comparing monozygotic and dizygotic twins) \"useless\"? NO!         – more modern behavioral genetics combines those methods with molecular biology  09:29 \"Chutes and Ladders\" experiment (fictitious example) – imagine an experiment found that people from Nepal are better at this game then people from Belgium     – What kind of controls are used to make the experiment sound?         – sample size, environment, training etc. – even if everything is controlled for, one critical question remains critical question: how large is the difference?  17:05 \"IQ of first-born vs. second-born\" experiment (real example) – study found that first-borns have higher IQ than their younger sibling, but only by 2.3 points – study accounted for many environmental factors (first-borns vs. only-childs, mother's age at birth etc.) – key take-away: reliable effect (i.e. statistically valid and methodologically sound) doesn't mean that the effect is big  29:40 How do organisms recognize relatives? Pheromones! – even single-cell organisms (e.g. sperm) can do it     – example: sperm of monogamous deer mice behaves differently towards rival sperm than that of polygamous deer mice – you can show this experimentally with (pre-natal) cross-fostering in rodents: urine of relative vs. urine of stranger   36:27  major histocompatibility complex (MHC) – group of genes that code for proteins that help the immune system recognize foreign substances   – 58:35 learning to recognise relatives: experiential, but that the learning happens is innate", "votes": "317", "replies": "10", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy2237eeP6JNhPTBdB4AaABAg", "comment": "4:10", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwhyMnI94svrLDvwlR4AaABAg", "comment": "The number of fingers is inherited, that's why it's always 5. The variation of this number is always related to environment, which shows heritability is close to zero.", "votes": "10", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzxu2POvmtNe5cvd314AaABAg", "comment": "52:00 when I yell \"help\" followed by my little son asserting his dominance with cheering laughter everyone around knows that I'm kidding too..... same thing when I had a \"fun fight\" with my brother back when .... though I'm not sure my wife - would be mich help if it was a real fight.... but I'm confident my brothers blood pressure could be raised - I'll do an experiment and report!", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyKazx8mbsq5PxaBiR4AaABAg", "comment": "I was hooked on oxytocin when I was young. It's a hard habit to kick", "votes": "10", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwcZZVtHaSHi5Xh-Wl4AaABAg", "comment": "“Wait, these kids don’t smell like my vaginal fluids.” Robert Sapolsky 2011", "votes": "17", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg", "comment": "I am binge watching this from a third world country where our education system is literally the second worst worldwide. I have learned English, design, and coding from the internet. and here I am learning about genetics.  Thank you Stanford. Thank you Youtube. and Thank you Dr. Sapolsky.", "votes": "1.4K", "replies": "36", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyZ7ZEk8NKd0dPalu54AaABAg", "comment": "1:04:30 - This is some highly interesting stuff which also could (partly) explain a phenomenon among humans: Lots of studies have shown that women tend to be the unhappier the more promiscuous they are.  The example with Baboons, who selectively only invest in the offspring of a female if they have a high chance of being the father, now gives us a big hint: Maybe it is the same in human males and those also only invest in females and their offspring if they can be fairly sure that they are the father?  Or in other words: (Highly) promiscuous women may be treated worse by men (who may be their temporary partners) and this is (part of) the reason that makes them unhappy?", "votes": "1", "replies": "5", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9kEdSUbKmcdKPo594AaABAg", "comment": "professor， this is also a english lit grad and I have to say these lectures are amazing!", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw0QA1BJc3eqfBeew54AaABAg", "comment": "These classes are gold", "votes": "8", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwGAEblTzV0l5Lz5kR4AaABAg", "comment": "I dont suppose the TA catchup lectures are somewhere online?? I deffinately would watch them!", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxpmHiv8FSgSiTq02p4AaABAg", "comment": "My favorite", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzA6sXA3m0NykR6DtV4AaABAg", "comment": "This guy is a class act. A great teacher.", "votes": "21", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxTzjZ_p9GsGU6sz3N4AaABAg", "comment": "Chutes and ladders is a game of chance, how can someone possibly be better at it than someone else? How did none of the students think of this!", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwIh7cflYSgNAvNREJ4AaABAg", "comment": "s", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwoD8nOTXZylPUCS7R4AaABAg", "comment": "I really appreciated that he tryed to explain again the difference between something being inherited and heritable in the beginning. unfortunatly, my cousin had eleven fingers when he was born and got one removed surgically. that confuced me big time ...", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxhY0p279US8QXHNAh4AaABAg", "comment": "@ 1.09:32....by cutting off the fish by a watertight seal...could you also be cutting off some form of Fish Communication ?...", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwTE1YpYP9CgLTpBSd4AaABAg", "comment": "think the flip of IQ happened with my older bro and I. another child came along and I became middle child.", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwcJVZtwEd-mlrEIdB4AaABAg", "comment": "love the teachers sarcasm about the nepal belgium 'study'!", "votes": "14", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzE22aG8aFSftqO9bV4AaABAg", "comment": "ruled only chilnd fields.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E298dc_-0xqUu", "comment": "<3", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E2992oPgK4HQd", "comment": "sometimes humans can be so wonderful <3 thanks for this resume <333", "votes": "9", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E299JHynLAZZo", "comment": "Thank mate! I was a bit overwhelmed about inherited and hereditability but this solved my doubts", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29A-1aUsiRZ5", "comment": "❤", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29Gf2G_u3CtV", "comment": "Nice!", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29HVgZvQo8Bl", "comment": "Saddens me to see how ineffective studying methods persistently remain in popular use amongst students.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29LgC75ziJj3", "comment": "Thanks my man", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29M1fgVbX2O1", "comment": " @crimsomnia1415  Can you please elaborate?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29M4dZzDoLLo", "comment": " @arne8780  Thank you, I can't wait to see if you did this for all the lectures!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9sX3klCMKx03d55F4AaABAg.92HNkOdz3E29SONObnh1bY", "comment": "Now we have a class representative", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwhyMnI94svrLDvwlR4AaABAg.9093q8sj1eG9R0xTUGzMfh", "comment": "Some word definitions belong on cheat sheets", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwhyMnI94svrLDvwlR4AaABAg.9093q8sj1eG9gVJvvkO3gj", "comment": "Actually it is inherited.  There are families in Central Nebraska with six fingers passed down from generation to generation.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyKazx8mbsq5PxaBiR4AaABAg.9-qnpn3TnRg9ANEn5tQ1PH", "comment": "My oxygen habit impacts me quite a lot", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyKazx8mbsq5PxaBiR4AaABAg.9-qnpn3TnRg9DR6qVNeUHX", "comment": "I still dabble", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ92mB9J4ag5j", "comment": "That's awesome!  the internet is amazing.", "votes": "46", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ92xI_4MpDHc", "comment": "Yes - internet is a great equalizer. It allows people who did not had opportunity for good education to do self study", "votes": "31", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ97k0NeIazUy", "comment": "California Girl Assuming the ‘environment’ in which you watch it is similar :)", "votes": "17", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ99c5YnxFItl", "comment": "I’m in America and let me tell you —> these lectures are top notch and better than any class I can afford", "votes": "47", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ99mX__KUQnD", "comment": "Could you give me some suggestions on design courses?", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9AMVrx9ZsP7", "comment": "Dude me too! Here in El Salvador not even evolution is contemplated in the educational curriculum", "votes": "23", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9BINNZilMXg", "comment": "Where are you from?", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9GC7ARTBuoi", "comment": "Nice work! Educating yourself helps you and others simultaneously - thank you for being a role model :D", "votes": "8", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9GePbtCOPYy", "comment": "The material is available but you have to have the desire and discipline to learn, so kudos to you!", "votes": "10", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9Gq4YYxlHhv", "comment": "That is so cool. That's why the Internet is super important.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9HZYD9OUXt8", "comment": "We are attached to AI,,,you don’t need neural-link..these cell phones are great,peace", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9I8j3xsJ8jF", "comment": "Good luck with your studies👍", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9IfuHsWxsL8", "comment": "Wonderful x", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9MUsBm9f_tH", "comment": "@William Lawrence I've been living in Dubai, UAE for 4 years now. but I'm Egyptain born and raised and lived in Egypt for 32 years.", "votes": "8", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9MwdWn0TVLU", "comment": " @ashbrady588  3262w65262322222222233223233222212322w222222222242222522224243223222223442224444224222222322222222442222222222222322222222222222²222322222222322222222222222222222222222222222222222222222223222222232222222222222222222222223232222222222222222222222224222222232222222222222222222222222322223222222222222222223322232222323222222222222342242222222222222222222223225223222222232222222222222222223222222222222223222332222222322522222222222222232242223222222242222224222222252422222322222222222223242222223222232222423222323322222222222222236223323222322222424422222232223222224222222244222343323432322322362322222232222232222224423223232233222232242222322222232222243222324322232242232232243424222224222222222322222222432423222226224454w4232444344244224242244,1212222221121221,,,,,you ²21211112111111211221211121221211212112111221121121211112211121111121221²11¹111121121½21111112111121211211211¹112111212111111111111121221122111121121121112111111111¹1221111121112221111121111211111111112221¹1111111111¹1211112211111½1121111111111111111111111111¹11", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9MzXh47mvEW", "comment": "Spectacular..I hope in the past year you've realized even more knowledge!!", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9NBZQGKnYds", "comment": " @mowgoud  watching this from India. We have very cheap internet and thanks to that, even I learned alot", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9O-E1K_1aAJ", "comment": "This is how you use YouTube", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9OBFlMe-0_B", "comment": "Prof S. is fabulous.", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9OS2xt8_yRZ", "comment": "Great stuff...... I stumbled on these Stanford lectures because of the strange YouTube algorithm .... This professor is very special, a wealth of knowledge with a great way of speaking to his students - he just flows faultlessly and I love him ... Thank you Stanford for making these lectures available to us for free 👍🏽", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9QBNA2oCj0q", "comment": "That is great. I'm so happy for you!", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9Skr_yRKFAZ", "comment": "Greetings from India.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9UsC7epgctY", "comment": "God speed", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9V1YvcwVuCH", "comment": "that is so cool, and me to, I've dropped out of high school my self and learning biology, psychology,  philosophy, psychic by internet", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9VdMk90dvpn", "comment": "beware of men with beards who think they got it all figured out. they dont, they keep tryin though. i like that part the best", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9Wq5uw2mR9t", "comment": "Find audiobook \"Why Zebras Don't Get Ulcers\". This guys life is more than you could expect.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9XRB1rE7FHh", "comment": ".. I'm in united state...and poor. Lol. Learning is learning... Love his lectures...", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9aYQrcAkHVT", "comment": "Hallelujah for people like you !!!! Aloha from the Big Island of Hawai’i", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9gvVVvbmckC", "comment": "philippines?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQ9qq-rdMAf72", "comment": "Mexican Desi in the zone.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQA1bo4kZYn1y", "comment": "Where is the absolute worst education system?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQA2jfPOqWBpQ", "comment": "Me too, especially the learning about genetics. Most high graduate academics still insists in the genoma code as \"the holy grail\" it's become unacceptable in the field of medicine also in mind sciences in general", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQA2ngMFvYguh", "comment": "Keep an open mind and don't attaché to anyone else's idea of what your reality is - Michael Levin's work should be studied!", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQA3wsGB7BuwR", "comment": "You're speaking on behalf a lot of us all around the world!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQA5JNnwePwN_", "comment": "Thats pretty effing cool! Hope you are still out there learning.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwzYXi1OJzLO7zvcrB4AaABAg.8z2sTEjD7DQA5JzLFNNZeS", "comment": " @joesickler5888  yup. still kicking. still learning. Always.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyZ7ZEk8NKd0dPalu54AaABAg.8yOKyn2c8Mf9PdXiA6_X9r", "comment": "Someone cheat on you recently???", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyZ7ZEk8NKd0dPalu54AaABAg.8yOKyn2c8Mf9Pdc3hrfnOp", "comment": "​ @pauladuncanadams1750  The last time a girl cheated on me was 30 years ago. BTW we are talking here about science and not about personal anecdotes. And your \"argument\" is known as an argument ad personam which tops the list of false arguments ;)", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyZ7ZEk8NKd0dPalu54AaABAg.8yOKyn2c8Mf9PddMg067PM", "comment": " @Dfd_Free_Speech   or maybe unhappy women are unhappy with their unreliable and cheating mate?  And so they cheat on them, but they cheat to get back at their no-good cheating partner, so it's really that they are unhappy because stuck with some two timing a-hole.  Lighten up!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyZ7ZEk8NKd0dPalu54AaABAg.8yOKyn2c8Mf9Pe4j3WYMkB", "comment": " @pauladuncanadams1750  Do you have any scientific evidence for your speculations? I based my comment on lots of scientific evidence. Where is yours?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyZ7ZEk8NKd0dPalu54AaABAg.8yOKyn2c8Mf9Peh7xKqpE2", "comment": " @Dfd_Free_Speech  No you didn't.  You based your negative comments on conjecture.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwGAEblTzV0l5Lz5kR4AaABAg.8xiALxi593J98quZoFvg7E", "comment": "https://www.youtube.com/playlist?list=PLpXaCv0b7h12LpVunZ361VfCBQSwi_2e8       not sure if this is what you're talking about. Some lovely person put them all in order", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxTzjZ_p9GsGU6sz3N4AaABAg.8wInwCmVoIb9N3E8wc2V2c", "comment": "One of them did ask \"What are the skills required?\" to which Prof replied \".......... telekinesis\"", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoD8nOTXZylPUCS7R4AaABAg.8vquD7qnPT09R0xLNXvSsI", "comment": "That’s the problem with science, similarity of words with a world of different meaning. Every profession has its own language", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwwwkWMDdOP7nx7CC94AaABAg", "comment": "Why cant we watch the introductory lectures :C", "votes": "6", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9xSZfs1S3o4YTeGZ4AaABAg", "comment": "so why do first-borns have higher iq exactly? he just digressed on to something else and never gave the answer", "votes": "2", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxunbQV0ShmFqWe7xh4AaABAg", "comment": "Epic beard!", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw3CwZMCs1eLAisr8J4AaABAg", "comment": "Dr. Sapolsky made reference to sharing 50% of genes with a sibling in this video to theorize a way in which the proteins attached to our cells that indicate who we are to relatives can be similar and thereby giving rats the innate ability to tell relatives apart from strangers and point taken! But if we actually get the majority of our genes from our mother due to the exclusive use of her mitochondria and the other factors inside of her cells that sperm do not have, wouldn't that mean that we have more than 50% of our genes in common with our siblings?", "votes": "3", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz5oqV_qynY-uWaRCF4AaABAg", "comment": "This is actually so interesting and entrataining! So good that they made this available to everyone", "votes": "19", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxy_mnn5eY8ToEzvCt4AaABAg", "comment": "I do like the \"Chutes and Ladders\" discussion.  The questions are good ones.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwicfCj4iEI2dUsy0h4AaABAg", "comment": "lol, the random panning over the class", "votes": "26", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugykl0vkBlyQoxLsswB4AaABAg", "comment": "Couldn't get into Stanford Jokes on them! HA! Or is it?? ;) lol!!  Thank you YouTube/those responsible for the loading of the mind blowing videos.", "votes": "6", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugz9IAPrRurSieK6l2h4AaABAg", "comment": "I love these videos...but the cameraman could be a little more intuitive on what the professor is attempting to convey. I am this far in the series and not once have we seen the number of hands when he asks a question of the audience. Blur the image if you don't want to get permission from each student. It would make for a much more engaging presentation. Similar with images he makes reference too that may be either out of frame or on a handout. The fox vs dog images from a previous video comes to mind. I just saw my first audience pan right after typing this. It wasn't even to show a group participation, just a single student asking a question. What gives?", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzr2CnmKXVZobd2b6l4AaABAg", "comment": "So ashkenazi Jews are more or less third cousins with a huge percentage of each other, due to matrilineal passing down of group membership, Placing them in the ideal range of outbreeding/inbreeding, allowing genetics to more quickly reflect cultural values through selection", "votes": "4", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxPeEkh9IEWxg4rybJ4AaABAg", "comment": "Re-watching 5 years later. Furstrated about noone asking what I wanted to again. Pausing video to relax and vent my frustration. Found my post from 5 years ago. Not sure what to think now. What I wanted to ask: how the age difference between the siblings affected the IQ score difference? How was it when the siblings were 1 year apart, 2 years, 3 years, 5 years, 8 years, 12 years and more than 12 years. I know some people who have siblings (not half-siblings) with big age differences. I wonder how this affected the difference. Also, what about siblings, where one of them was given away for adoption? What if it was the first one, what if it was the second one? The adopted ones: were they raised as a first, as a second, third or more, or as a single child? Question over questions.... Noone asked...", "votes": "4", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxFF9DkvpZP-885Rxh4AaABAg", "comment": "cant find anything relating to the chutes and snakes studies belgium vs nepal on the internet these days. what was the difference?", "votes": "1", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzbbEVLviiAPDevYqh4AaABAg", "comment": "junkand debunk.  expressive characteristic imho.   even though elites finf it a master chess game where you take the queen in a stalemate.  2018/10/18 tuesday child echos wildly science and life with a dogmatic tatoo", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyDuDt5PAYUHtmRZoF4AaABAg", "comment": "Huh, neurogenesis in the olfactory bulb could explain morning sickness a bit.  And from there, I suppose this explains my parents being third cousins and getting along despite my mom being batshit crazy.", "votes": "6", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwW_Ro2afKZZoj6YqF4AaABAg", "comment": "I wonder have they ever found in their studies of non-human animals that \"some animal is acting in such a way that defies all these theories, for example co-operating with everyone on its path and not caring much about who is relative or not\"", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzkWDQaoAuc-YZ7JO14AaABAg", "comment": "Stanford University could do a study of the miriad marriage customs in India. In 1970 I had a class mate who married the daughter of his eldest sister that he grew up with. In his culture, when there is a possibility for such an alliance, the girls parents are obligated to bring a proposal and the boys parents cannot turn it down. Abraham, on the other hand could not knock up his neece, so he knocked up her slave. Then his neece also somehow had a son who became a threat to his son. He was unable to sacrifice his eldest brothers grandson, so he raised his son in hiding. We are referring to. Ismael and Isaac.", "votes": "5", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzMH8L0p89QLMFe_dx4AaABAg", "comment": "Must be why Im getting a headache, these videos are stimulating neurogenesis in my hippocampus :)  But OH GOD SPIT WASHING YOUR KIDS FACE BLEHH BAD MEMORIES lol.", "votes": "18", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwoZibI4iBvbBxs1dd4AaABAg", "comment": "I can't stop laughing about the shoots and ladders, this is comedy gold xD Edit: I'm fifth born, and I'm smarter than all my siblings. I'm odd... Although my oldest sister is pretty damn smart too.", "votes": "8", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxdwPrIztr3qIHZPSd4AaABAg", "comment": "45:00", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx6m5PhXHgn3RvwINJ4AaABAg", "comment": "I dated my second cousin for 2 days without knowing it until our mothers talked two days later and found out that her last name is my mother's maiden name.", "votes": "9", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy9xSZfs1S3o4YTeGZ4AaABAg.8sp2J9NqJJt8vHeicERn8n", "comment": "They get more parental attention and the next kid less, plus he/she gets more responsibility by teaching the other siblings.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugy9xSZfs1S3o4YTeGZ4AaABAg.8sp2J9NqJJt9ANGhkpofX6", "comment": " @juangamazo5781  *as far as anyone knows to point to", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw3CwZMCs1eLAisr8J4AaABAg.8sDj5mW6ST69awU4bnHhug", "comment": "No because of variability of genes.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwicfCj4iEI2dUsy0h4AaABAg.8pFCYhtGZOX908xrRNjgm1", "comment": "Jen B I love it! :D", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwicfCj4iEI2dUsy0h4AaABAg.8pFCYhtGZOX9OS5Z92TbQt", "comment": "The class was huge! And packed..... I can see why; this prof is awesome...", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz9IAPrRurSieK6l2h4AaABAg.8n3_YXFtMkw9TY9AI7tspK", "comment": "Pretty sure there is no \"cameraman\"; it's just  automated to track his head movement!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxPeEkh9IEWxg4rybJ4AaABAg.8mkp8ApS6ZC8vFewFRr5SZ", "comment": "Did I ask no as I didn't want a random reader answering but I did think about them.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxFF9DkvpZP-885Rxh4AaABAg.8meagq87e5D8u_kj44770q", "comment": "seriously? You searched that?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxFF9DkvpZP-885Rxh4AaABAg.8meagq87e5D8vHdzCFqVtJ", "comment": "Ah, my dear Watson I believe the technical term for your condition is rube ... I have a nice piece of Everglades you might want to purchase if you ever want to move to Miami!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwW_Ro2afKZZoj6YqF4AaABAg.8m18VYZJ9DP9Z-klzuzCI0", "comment": "It really seems that bonobos do that.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoZibI4iBvbBxs1dd4AaABAg.8kYocQMAK7c8mz6hwfIk_H", "comment": "The study provides results of the members in Average.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwoZibI4iBvbBxs1dd4AaABAg.8kYocQMAK7c8w_BHueqNPN", "comment": "the difference was 2 IQ points, very very very huge , infact a shattering difference", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugx6m5PhXHgn3RvwINJ4AaABAg.8iuycK0-Afa8nvEwUBEwO-", "comment": "That's coz you're a douche bag 😂😂", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugx6m5PhXHgn3RvwINJ4AaABAg.8iuycK0-Afa9ANIMtOzJSP", "comment": "My boyfriend has the same last name two villages over and we checked 4 generations back (running out of documents on my mother's side)", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugypd_-f5B7mR3jpa5B4AaABAg", "comment": "Love listening to this lecturer.  He makes the subject matter accessible to people who are not actually studying in university.  Like his understated humor.  Thank you for uploading this.  ☘️🌲🙂", "votes": "110", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxrHPoHKamqy8kcED94AaABAg", "comment": "I would think that a 2.3 IQ point difference on average would be a big deal! They've done many other studies since then I believe and found that as you have more and more children the younger ones have exponentially lower IQ. It wasn't controlling for genetics or environment, they were just trying to see the phenomenal effects. I think their conclusion was the parental investment thing being divided between kids. The firstborn had 100% attention (more words per minute, etc) and then the secondborn happened and was divided 50/50, and the third and so on. Interesting stuff, but I honestly thought that 2.3 was not insignificant. Especially if that's at the mean, because in a normal distribution that difference grows much larger as you go to the tail-ends.", "votes": "12", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw67GNyr56PVCPM4kF4AaABAg", "comment": "Ok so about the chutes and ladders study, am I the only one that's blown away by the fact that not a single student thought to ask how skill was measured in a game based 100% on the role of a die, henceforth based entirely on chance...", "votes": "6", "replies": "5", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugzoci-dGgubMEKs4nN4AaABAg", "comment": "I just finished this lecture and understood everything, just like all the lectures before this except the molecular biology ones. Did anyone else struggle with the molecular biology lectures as well, cuz I just skipped those", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgypnFGCKVyr8aoDBL14AaABAg", "comment": "I do like Dr. Sapolsky's humour and all, and give him credit for attempting to present this complex and state-of-the-art content in an undergrad course like this. I also think first 3-4 lectures were real fun to watch. But by the time I reached lecture 8 I felt annoyed by the vagueness in presentation of complex concepts like heritability, lack of clear system, lecturer's style which is too flamboyant and too heavy on jokes for a serious university class.", "votes": "6", "replies": "3", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugyz7gAspL-TjeB-1IR4AaABAg", "comment": "A stats class would clear up the heritability issue. Also large sample sizes can generate statistically significant yet numerically insignificant differences. The larger the sample the smaller difference you can detect. No one asked what the confidence interval was.", "votes": "13", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwliU5mBiuI9FG73bJ4AaABAg", "comment": "People getting distracted by small background noises are so fucking annoying.  If you're listening to the damn words, you won't notice this garbage.", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxclGKLdFo1wi8EPbl4AaABAg", "comment": "Who downvotes this?", "votes": "6", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxMr83Lz8AyOOnicph4AaABAg", "comment": "but if it were inteuterine effects first-borns and only children would have similar IQs", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy2WkPfx3s4kv3jX1x4AaABAg", "comment": "so much fucking coughing", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgynX4Ys_rioPgJ2gV54AaABAg", "comment": "Around 11:00 I’m starting to think prof Sapolsky’s coffee that morning was a double-extra-sugar-mega-espresso.", "votes": "81", "replies": "5", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzLA4UfdoMJm1eZNFV4AaABAg", "comment": "These kids can't all be quick enough to understand this dudes teaching at this pace. Unbelievable......", "votes": "1", "replies": "4", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzaYF-ZgkpLbgg-GVd4AaABAg", "comment": "thanks for the vid :-)", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwtyHmbkkYJrF1G2Ld4AaABAg", "comment": "It's mentioned in relation to deer mice that individual females mate with multiple males and that intra-sexual sperm competition consequently occurs. Deer mice are thus called a polygamous species, but they are actaully polyandrous, since it is the females taking multiple mates and being inseminated by multiple males and not the males keeping female harems or otherwise disproportionately monopolising reproductive access to females. I think this is right, but correct me if I am wrong.", "votes": "4", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyfETKkkCj8d6PyBwN4AaABAg", "comment": "Wait, why is there an enormous amount of evidence that first born children sneeze one less time during IQ testing? Even that would be a totally interesting phenomenon that would need an explanation!", "votes": "4", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugyb8SjhZUJtOTPtG814AaABAg", "comment": "First born, more DHEA? Testosterone?", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC", "comment": "This guy is so freaking smart. Like, I can't handle it. So happy I can see this.", "votes": "105", "replies": "8", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgjqlWL__JvyrngCoAEC", "comment": "36.40", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Uggq6PQUgMBeGngCoAEC", "comment": "i am an English literature student professor sapolsky and I'm loving the course! it is revolutionizing the way i think about culture and history. more people need to talk about the intersections between biology and culture which together shape our reality.", "votes": "119", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Uggfv_4wHorZU3gCoAEC", "comment": "I think Margret Thatcher's own kids probably turned towards the other smell ;)", "votes": "8", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugypd_-f5B7mR3jpa5B4AaABAg.8irre-whvzk8uZuGMGJzpi", "comment": "eliz donovan He's low-key hilarious. My guess is, that he comes up with ludicrous scenarios and improbable conversations while staring at baboons in the wild, and his imagination just runs with it.", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugypd_-f5B7mR3jpa5B4AaABAg.8irre-whvzk9X9l-JFoyKE", "comment": "Lies again? Rude education", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxrHPoHKamqy8kcED94AaABAg.8iO6gvYyg1V8p-Xm0k2dUv", "comment": "That was my thought also, was expecting a smaller difference after that lead-up", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxrHPoHKamqy8kcED94AaABAg.8iO6gvYyg1V9xD5UqKcP4s", "comment": "The real study found the difference between the second and third-borns was about 1 point, and then there is no measurable difference anymore. So no, there is no evidence that \"the younger ones have exponentially lower IQ\".", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw67GNyr56PVCPM4kF4AaABAg.8iA_nm6X2n48jvaioEC40S", "comment": "It's not entirely chance. People have techniques.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw67GNyr56PVCPM4kF4AaABAg.8iA_nm6X2n48k0dOrTC0FB", "comment": "Like blowing on the die? Praying to allah before they roll? Cheating and using a weighted die? (sorry for sarcasm) A standard un-tampered die has an equal 16.6667% chance to roll each number (as an independent statistic, non-reliant of previous rolls), even if you use the \"spinner\" provided by some chutes and ladders its still 1-6 so 16.6667% independent chance for each. Not to mention you actually don't have a choice whether you take a chute or ladder. If the player lands on a square with a chute or a ladder they are forced to take that interaction. I really don't see the room for logical reasoning or ability at all here. I honestly can't think of another game where the player has literally NO interaction with the game whatsoever, and where the ENTIRE game is based on a random amount of 1-6 movement, with absolutely 0 input or decisions to be made from the players part.   I personally think this is the response the professor was looking for, to transition into his next piece about first born's generally having a higher iq based on \"statistics.\" This point enforces the idea that sometimes we are not the authors of our own fate in this world, and that statistically sometimes people have better logical intelligence based nearly entirely on a factor that they had absolutely no control over, such as birth order. And also to show how simply reading the results of a study and not asking critical questions about that study, can be very misleading. Which he goes into depth about throughout this lecture.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw67GNyr56PVCPM4kF4AaABAg.8iA_nm6X2n48k437vmV5VE", "comment": "Yea you are right, I'm not sorry for the sarcasm, but I cant logically apologize for your lack of intelligence, so I felt a little bad. You do realize that not only does craps use TWO die, but the betting system allows for multiple options to win, therefore we start getting into unevenly distributed statistics. For instance, there is roughly a 17% chance of rolling 7, roughly 14% chance of rolling a 6 , roughly 11% chance of rolling 5, etc. etc. Because of how the game is designed there is a way to calculate probabilities.   When you are dealing with a single non-weighted tournament rules 6 sided die, you have an equal 16.66667% chance of rolling each number. Such as chutes and ladders (ya know the actual topic of the conversation, not sorry for the sarcasm) So if 100 people are playing, 16 might roll the correct number to hit a chute down to the victory. Does that make those 16 people better at the game? No... it is entirely based on chance.  As to your last comment, I believe it is sarcasm, though a very poor attempt at it. So I will choose to not even reply to it. I wish you the best of luck whenever you make it to your first statistics class.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw67GNyr56PVCPM4kF4AaABAg.8iA_nm6X2n48obnK5Qmj4Z", "comment": "If you watched the actual video, one of the first questions asked was how they determined one group was \"better\" than the other", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw67GNyr56PVCPM4kF4AaABAg.8iA_nm6X2n48q8iLCwPP30", "comment": "The point was that the \"winners\" only won by a margin too small to consider significant and there was no control.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugzoci-dGgubMEKs4nN4AaABAg.8hGZmLqc8qw8knaggB7NLv", "comment": "I Consume DMT Molecular biology is kind of my forte,  so if you have any specific question, let me know.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgypnFGCKVyr8aoDBL14AaABAg.8h9x3C7lgKd93jP9LVoJPr", "comment": "They do have assigned readings and discussion sections and office hours which I'm sure are well-utilized by students to clear stuff up. Moreover, I think this way, we have to do our own research and put in effort to understand concepts rather than just learning only what the professor tells us.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgypnFGCKVyr8aoDBL14AaABAg.8h9x3C7lgKd9PdY7_v98ZW", "comment": " @taranpreet_kalra  Even better,  teacher's aids giving tutorial classes on each subject matter to catch you up.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgypnFGCKVyr8aoDBL14AaABAg.8h9x3C7lgKd9PdYIhxAGvl", "comment": "If you ever actually attend Stanford and pay tuition you can feel free to bitch.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugyz7gAspL-TjeB-1IR4AaABAg.8glrpfjFE0L97k1rmAUhhx", "comment": "Yes, Taleb would be having an epileptic fit listening to the way some of these hypotheses are dreamt up, tested and then extrapolated at society level.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgynX4Ys_rioPgJ2gV54AaABAg.8e_JC496G-f8lBaAF5RWFa", "comment": "I wish I could go back in time and find out! :)", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgynX4Ys_rioPgJ2gV54AaABAg.8e_JC496G-f9OaDpGGz5WF", "comment": "Because you're dumb..", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgynX4Ys_rioPgJ2gV54AaABAg.8e_JC496G-f9PbNz22bqYo", "comment": "It's the cameraman's crazy close ups.  He's making me dizzy.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgynX4Ys_rioPgJ2gV54AaABAg.8e_JC496G-f9Ph37VjPRra", "comment": " @oasisneko1  only this makes u dizzy?? omg u must have problems..", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgynX4Ys_rioPgJ2gV54AaABAg.8e_JC496G-f9PvrAm7x_Kv", "comment": "labas :)", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzLA4UfdoMJm1eZNFV4AaABAg.8cNmtTB7IJN8m74lutwRES", "comment": "They get handouts with notes.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzLA4UfdoMJm1eZNFV4AaABAg.8cNmtTB7IJN8mmM0p4VtWe", "comment": "One of the best things about him is he makes these topics relatively easy to understand. I doubt even the English major is lost in the woods here. It’s Stanford after all", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzLA4UfdoMJm1eZNFV4AaABAg.8cNmtTB7IJN8obnRspZG1v", "comment": "Maybe you aren't very familiar with how insanely selective Stanford is", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzLA4UfdoMJm1eZNFV4AaABAg.8cNmtTB7IJN9CJl9Z0oRNB", "comment": "Also they have a textbook which they’re supposed to read before class.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwtyHmbkkYJrF1G2Ld4AaABAg.8bCoViJqZ9J8mCptX3DesA", "comment": "Christopha, you're correct.  And Sapolsky has mentioned polyandrous before with definition but it seems he got a little carried away in talking about it to use the correct term.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgwtyHmbkkYJrF1G2Ld4AaABAg.8bCoViJqZ9J8nZexO7mlAG", "comment": "Strictly speaking, I believe the proper term for multiple females would be polygyny, multiple males would be polyandry and multiple partners is polygamy. Thus polygamy is the umbrella term that just happens to mostly stand in for polygyny.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyfETKkkCj8d6PyBwN4AaABAg.8_XCebSv-5v8nG98uqfeAb", "comment": "I hope you’re being sarcastic bc he was making a joke lol", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PY7Be9BN5X", "comment": " kristal knox  Don't be mad just because you can't understand it", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZ-Kekt3C1", "comment": " kristal knox  Sure, Jan.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZ0xnkhQeF", "comment": " kristal knox  you're the dumbass who can't use \"you're\" properly yet thinks herself smarter than a world renowned expert in his field 😂 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZ4ZVByNPv", "comment": " kristal knox  Kristal, put down the crystal meth", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZ7xiEmIMR", "comment": " kristal knox  oh now all of a sudden you're speaking proper English. Look at you Ms. \"May I.\" 😂 😂 😂 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZ8HgU30MQ", "comment": " kristal knox  Not if you're not too stupid to spell \"racial\" 😂 😂 😂 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZCeS8nEG-", "comment": " kristal knox  Kristal, please don't forget to take your Zyprexa. You're making a fool of yourself for everyone to see!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggV_Mb1Q0GqjngCoAEC.8V_cVtXyBzU9PZCxdMb4YK", "comment": "@UC6ATru6Hh6IDWoeWBTjj7qQ *It's", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggq6PQUgMBeGngCoAEC.8MNvkS-7N508twPh0T9bDa", "comment": "Yeah, I originally major in Japanese literature and I am enjoying these lectures so far :D", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggq6PQUgMBeGngCoAEC.8MNvkS-7N509R0wVwE9VF9", "comment": "Just remember that people will reject half of what they know just to keep life simple.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjj_rxVXVnn8XgCoAEC", "comment": "Sorry, but there is a profound  logical error. I assume you assume that IQ means messuring of intelligence. It is messuring whether questions are answerde in a certain way and whether you think in a certain way. Normaly - I assume- one got more time for the first kid- a kind of drill starts.", "votes": "0", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgiNStMkVzItC3gCoAEC", "comment": "The Israeli Kibbutz study has now been refuted: they interviewed many of the kids again and found there was an attraction in many cases, though they didnt marry. However there are lots of other studies that show the Westermarck effect is real and interesting.", "votes": "2", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgiYLXTnQ63BGngCoAEC", "comment": "Is the olfactory system of a newborn's mother, which has been enhanced by oxytocin and vasopressin, sensitive enough for the mother to feel uneasy if her newborn is switched with another newborn?", "votes": "1", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgiMpOCLyjAQoXgCoAEC", "comment": "I am curilus if there is data about iq in birth order of siblings where there is a large gap of yrs. say 10+ yrs between siblings.  anyone know?", "votes": "2", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgjG7y84lwqUA3gCoAEC", "comment": "Thank you, Dr. Sapolsky for this brilliant introductory course. Lecture notes for this course would be very useful. And I am very sorry that the site does not contain explicit references to the research materials mentioned in your lectures.", "votes": "5", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgjtnuWAVn8oyHgCoAEC", "comment": "Do baboons know that sex leads to babies?  That seems to be what he is saying, but I didn't think they realized that.  And I certainly didn't think fish did.  What else could be going on here?", "votes": "2", "replies": "5", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ughq6vSn4pDwJHgCoAEC", "comment": "28:43 ... irrefutable, statistically totally reliable ...", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UggFl5Ao8G9FDngCoAEC", "comment": "Who else thought about showing this to their third cousin? ... No one... ? .... Maybe I should think of something else entirely then...", "votes": "93", "replies": "3", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UghPHxssWA9BYHgCoAEC", "comment": "Another thing about third cousin distance attraction, he made a graph where third cousin was the peak and it descended evenly on either side, does that mean a fifth cousin, or so, distance is about as attractive as a very distantly related person (different continent, etc.)?  I just did the math (hopefully correctly) and got that third cousins are approximately 0.390625 percent related; how does that have an effect on attraction when it is genetically so small and why would that amount give an inclusive fitness? I have to assume that most times in evolutionary history third cousins have more relatives in common that one great grandparent or does the study account for that and mark them as closer than third cousins?", "votes": "1", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugi6mif7ifVJh3gCoAEC", "comment": "He said that people found the smells of others at a third cousin distance most attractive, but how do we know if that attraction is DNA genetic or more like the grandma effect where it is passed down environmentally? Were the people that they were smelling actually third cousins or did they have some percentage genetic similarity in random areas; i think he used the word histocompatibility at some point?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UghX49KmTPQPyngCoAEC", "comment": "@recognizing by smelling (1:12:00) : in trance- therapy i made the repeated experience, that fathers, suffering from an kind of \"cold\" relationship and a lot of conflicts with their children, often had a very vague feeling, that the child have had a \"wrong kind of smelling\" ..", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UggJDeObEIImYXgCoAEC", "comment": "As far as I know, chutes/snakes and ladders, does not involve any skill whatsoever. It's completely random who wins. There is only one choice given to a player and that is that they may roll again after rolling a 6, but unless we know the exact rules of the game as played in the study, how can we tell if the information is valuable?", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC", "comment": "2.3 IQ points is not a small difference. It will make a big difference at the tails of the distribution.", "votes": "11", "replies": "12", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugg9HQgv0nzMRHgCoAEC", "comment": "How about babies crying interrupting concentration, combined with sleep interruption affecting the first born. What happens to the mothers IQ. What if she's blonde?", "votes": "14", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgimP7E8pUV43ngCoAEC", "comment": "the Nepalese were better nurished and had traditional building blocks, folklore, exploration derivatives, and elevated land that hinders early development to day dream", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC", "comment": "God damn cameraman!", "votes": "56", "replies": "9", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC", "comment": "I'm so happy there are so many Sapolsky videos available. I would love to actually take a class and yet, I feel privileged just to have access to it. It's almost like taking the class.", "votes": "449", "replies": "9", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UggoE_4-0OtXmXgCoAEC", "comment": "Question: When Robert talked about bees recounting high value forage in the middle of the lake to the other bees, and then losing credibility because the other bees are capable of distinguishing implausible information... It seemed as this was light hearted anthropomorphism, But,would the ability of a individual bee to have and then lose credibiiity be a demonstration of theory of mind? 'Others knowing that' such a  bee gives implausible information...?", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UghMkpD8G-q5_3gCoAEC", "comment": "9:30 KoRn - Shoots and Ladders", "votes": "6", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugj9OQzKXBZBUngCoAEC", "comment": "yeeaah there are a ton of studies out there that must have been the result of having an idea/ hypothesis that ended up not rendering anything, and selectively stating results. maybe even manipulating the data, if your difference isn't statistically significant and someone tries to reproduce it, well, built in disclaimer. i had to read so many absolutely ridiculous \"scientific\" papers in college that apparently fooled professors by using the ludicrously wordy and word droppy language typical of those things", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugjj_rxVXVnn8XgCoAEC.8LIgB06gptP8mOv8ilgBM8", "comment": "I assume you scored fairly low on the IQ test", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiNStMkVzItC3gCoAEC.8LDp-tn4J9v8QKipP_aRud", "comment": "Thomas Richardson you have to take everything he says with two big grains of salt", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiNStMkVzItC3gCoAEC.8LDp-tn4J9v9cbm_S9NzMU", "comment": "Some people disagree. See for example : http://www.stephenksanderson.com/documents/Mary-Sand-Russ-ReplytoShor-Simchai.pdf", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiYLXTnQ63BGngCoAEC.8KIcu1pYQ6-8RFdR4o93GR", "comment": "Would love to read the ethics board application for the human run of this experiment.", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiYLXTnQ63BGngCoAEC.8KIcu1pYQ6-8u_lf6vFYhM", "comment": "enough babies do get swapped and parents are oblivious...and some just know that something is wrong.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiMpOCLyjAQoXgCoAEC.8FLlzkNZkYJ8u_lMU8YQaF", "comment": "because possibly it goes up again?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiMpOCLyjAQoXgCoAEC.8FLlzkNZkYJ9R11NSqaoAR", "comment": "Chances are they both are rated as first born", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgjG7y84lwqUA3gCoAEC.8D3HfjJNNpZ95PxCDTZMpR", "comment": "Boris Shukhman Yale does not have a comments section available with their free courses that are a kind gesture from special environments that most people have no access to. You have no sense of perspective of what gratitude for what Stanford is offering here except to ask more.  Ungrateful.", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgjtnuWAVn8oyHgCoAEC.87Z1VfU5Hnp8Ew-5ngu05V", "comment": "Well, it certainly seems the fish don't know, since the change in behavior happens due to the presence of the male, not due to the two copulating.  Perhaps it's similar with Baboons? Or perhaps Baboons know more than we think. It wouldn't be the first time animal intelligence was underestimated.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgjtnuWAVn8oyHgCoAEC.87Z1VfU5Hnp8FMC7dFr3Z8", "comment": "Bman Chu Fair enough, though perhaps the instinct they have is an evolved one rather than it being indicative of conscious awareness. After all, the change in behavior doesn't necessarily require the animal to be aware of the reason for the change.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgjtnuWAVn8oyHgCoAEC.87Z1VfU5Hnp8Wy_x4j_y9A", "comment": "Forget baboons. Humans don't seem to know sex leads to babies", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgjtnuWAVn8oyHgCoAEC.87Z1VfU5Hnp8mmMLlIKqzx", "comment": "Julie Calder wow you’re dumb", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgjtnuWAVn8oyHgCoAEC.87Z1VfU5Hnp9PdW5YPBLdj", "comment": "Ask Professor Sapolsky.  Baboons are his specialty.   But I don't think you realized that.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggFl5Ao8G9FDngCoAEC.84x3_OhuQ6e8lvexCVbdmN", "comment": "humor is the Highest form of understanding.", "votes": "12", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggFl5Ao8G9FDngCoAEC.84x3_OhuQ6e8umj6G_ZnKT", "comment": "My partner is actually my mom's third cousin, we've been happily coupled for 5 years and going strong. We're thinking about reproducing so I'll get back to you when we get the results LOL", "votes": "14", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UggFl5Ao8G9FDngCoAEC.84x3_OhuQ6e9R6xISeq5lm", "comment": "update me and my mom's third cousin (or my third cousin as well? 🤔) have become parents to a beautiful baby girl 😊 she'll be 1 next month ✌️✌️", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UghPHxssWA9BYHgCoAEC.8-oumps5ezA8sDkhud-51Y", "comment": "There's no way that a complete sibling is 50% because you share the same mother, which would mean that you'd both have more of her DNA because you'd share the same mitochondrial lineage and in cell factors. That means that there would be a difference between a maternal and paternal third cousin lineage. This adds further questions to yours... for instance, does a second cousin paternal lineage share the same percent of genes as a third cousin maternal lineage? It turns third cousin into an approximate percentage instead of an exact number.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UghPHxssWA9BYHgCoAEC.8-oumps5ezA909204827xC", "comment": "3rd cousins are 0.78% related. Go up to the great-great-grandfather and mother, diving 100 by 2 (4 times). Both of them are 6,25% related to you. Their son get genes from both so he's also 6,25%. Then divide by 2 (3 more times) until the 3rd cousin, 0.78125% related.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX70vBznlwxOD", "comment": "They didn't do the study on the tails.", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8ONnwi4DHgA", "comment": "It just means that for ever individual who has an IQ around 140 a member of the lower scoring group within the exact same percentile (approximately the 99th) will probably have an IQ around 137.7, which is an insignificant difference. This of course does not control for variability, despite a lack of evidence of any substantial differences in variability within both groups.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8WukusbLAOk", "comment": "Yeah right, i mean determining the statistical significance was a part of the study... He's being super critical of some studies, but these exact criticisms would also apply to some of the other studies he mentions too.   He seems to be unnecessarily splitting hairs with some of his points, at times making some distinctions less clear than if he simply recognized the differences of semantics.  I mean, back to the twin adoption studies, they aren't indirectly screening adoptive parents for alcoholism or any of the negative predispositions passed on genetically. So you're basically left admitting that the behaviors learned from a mother before the moment of adoption are more significant than the environments of infancy adolescence, youth and adulthood. The study's claim has more evidence then his counter claim.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8ZTyUZIsaRG", "comment": "I think that IQ tests as other standardized tests that try to measure complex human characteristics, need to be interpreted really carefully, because its hard to tell what they are actually measuring. So It would be really hard to give those 2,3 points some real life meaning, they don't have the power to state \"1st > Latter\", they rather support the idea that brothers are quite similar which wouldn't be too big news.", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8ZUFYHrICr8", "comment": "Igor Abarzua Yeah, that's true, but i always find it odd when people only point this out about IQ tests. At this point, IQ is literally the most meaningful, predictive, and well studied out of any of the psychological traits. Although, it's definitely worth pointing out that it is more like a combination of traits than, itself, a single trait...", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8a_5GP2O9Dp", "comment": "The test would have controlled for normal variability between siblings. It wasn't concluding that sibling IQ is almost identical with only a 2.3 difference. The conclusion was that there was a consistent difference between first borns and later plus or minus the normal variability you get from siblings. The normal variability would have just been normalised the finding was this extra 2.3.  I think Robert Sapolsky was arguing this difference is so insignificant that it could just be attributed to random error, hence the shoots and ladders example because shoots and ladders is a game based purely on luck. Any difference between two different populations on how well they perform on shoots and ladders is simply random.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8a_j2ob5gC0", "comment": "Arnold Flibble Yeah, but at that scale of data collection, such a predictable correlation is totally within statistical significance. Why do younger siblings sneeze more often during IQ tests? No matter how you ask it, the question still requires an answer. And, it's an inane criticism from someone who claims well debunked studies have proven that pheromones cause ovulatory synchronization in humans.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8abGKWqjXir", "comment": "How do you know it is significant and not random effect? The sneezing itself could be attributed to random effect and he was presenting sneezing to show what minor variance you need to produce such a minor difference in results. In clinical trials you have control groups to try and account for random effects so as you don't think what looks like some minor benefit to be an actual benefit when it is really just random.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8abnxxzKdCE", "comment": "Arnold Flibble Ha we know it's not random because it correlates to birth order haha. You guys are confusing the effects of too small a sample size- which might create the appearance of a  correlation until more data is added- with statistical significance or margin of error- which is determined by factoring the sample size and testing method accuracy. Given that IQ tests are an incredibly consistent testing method (at least with respect to the variable of birth order), and given that we are talking about massive samples with repeatable predictability, there is definitely a correlation. That doesn't mean birth order is itself causal though. A popular causal explanation is explained with two known facts: 1) IQ is heritable 2) low IQ people have more children. Knowing those two things, we should actually expect people of lower birth order to bring down IQ averages.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8adti88s0RM", "comment": "What? The fact you have a correlation doesn't mean it is non-random, that correlation could simply be random. Do you think all these are statistically significant? http://www.tylervigen.com/spurious-correlations  IQ tests themselves have a margin of error of about 5 points. I assume they factored that in though if not it could explain the difference.  You do know first born and later born have the same parents right? How would IQ being heritable or low IQ people having more children explain the difference between their first born and second born? Do you think parents genes change after they have a child?", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8ae2jkaFy9u", "comment": "Arnold Flibble I'm not saying no correlation can ever be random, but none of those examples of random correlations are remotely analogous to this. And quite possibly not a single one of those examples is actually an example of a random correlation. Most of those are totally bogus graphs that arbitrary scale or remove data which does not fit at all if you look at the whole picture or they never had a sufficient data set to begin with.   Suicides and aeronautical spending absolutely correlate, as does cheese spending and anything else associated with an increase in economic resources. Wealthier societies have higher suicide rates and more money to spend on space. The more direct correlation is wealth, but they are neither casual nor random. How did nic cage appear in 1.8 films in 2006? That alone tells you everything you need to know about the intellectual honesty of the person who compiled those \"data\" points and produced those graphs... There is no remotely accurate record of the number of people who strangled themselves to death in their bed sheets, and those stats only line up over a small segment when you zoom in on cheese consumption between 29 and 33 lbs per year. You get the point. We are not talking about comparing something with a sample size of four incidents per year to something with a sample size of 400,000 incidents per year, and we aren't overlaying 2% percent of one graph over 86.3% of another to create a roughly similar shape, where we still sometimes feel the need to make up data points and fabricate arbitrary curves that do not in any way correspond to the actual data.   Again, not saying random correlations don't exist, just saying that all evidence suggests this is not a random correlation. If the professor wants to throw this study out and the adoption studies out for frivolous reasons like this, then that makes the irreproducible and highly criticized studies he states as scientific fact absolutely laughable.  You made no attempt to address the logic of the heritability prediction i stated, and instead inserted your own irrelevant criticism of some other argument. If we expect low IQ parents to have more children, that means that children beyond a certain birth order threshold will be more likely to have lower IQ. Therefore when taken as the group of all non-firstborn children, their average IQ will necessarily be below the average firstborn IQ, even if birth order is completely non-causal. If that still confuses you, write it out as a math problem, with numbers, and you'll see exactly what I'm talking about.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl9PYW961ppXgCoAEC.7-H0Z7-T0WX8aeQIlePmED", "comment": "You stated that it isn't random because it correlates. Sample size doesn't matter randomness is always a factor. Clinical trials don't stop doing control groups after a certain sample point. It is always relevant to see whether the effects of a drug are more than simply random else you could think a drug works when it in fact does not.  Yes those things on that website correlate... You are missing the point. The fact you can find a correlation between two data sets doesn't mean you have discovered something significant. Also those graphs on the website are produced by an algorithm that scrapes through lots of data to randomly find correlations.  What was this logic of heritability prediction? Are you saying that single child households would skew the first born stats to have higher IQ because single child household parents typically have higher IQ? That would be a gross oversight by the people that did this study to conclude that first born were more intelligent than later born as single child households clearly tell you nothing about whether first born are more intelligent than their siblings as they don't have any siblings.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugg9HQgv0nzMRHgCoAEC.7-H0Z7-Qf8C9PdVibfCv9j", "comment": "What if they were Swiss?  Does this mean the father murdered them???", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgimP7E8pUV43ngCoAEC.7-H0Z7-JaRV7-H0kXsePV9", "comment": "...a bigger reception with a contraption to conceptualize~", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA78Di6dxu-rq", "comment": "Jurij Fedorov  There you go w/ that gender stereotyping =] Yeah if they could just pull back on the zoom instead of panning back & forth. But that's been the issue w/ all the vidoes in this series.", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA8fVDeJUzGGl", "comment": "The pops and clicks in the audio render this nearly unbearable. Too late to fix the mic...should have been addressed before upload. Doesn't Stanford have a Visual Arts program?", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA8mmKBofbTEj", "comment": "Audio visual techs at Stanford are fucking awful seems like. All that feedback edging up in his microphone through the entire thing", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA8oMzu_Fe8AL", "comment": "You can just listen to it...", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA8vFcuFLQc6i", "comment": "Not so much sometimes it's beneficial to look at the video.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA92mBcvAG_R0", "comment": " @godlessheathen100  seriously?  I don't hear pops and clicks at all.  Nor did I hear the coughs people were complaining about.  I'm paying attention to the content.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA92mBnx2Xbu6", "comment": "The consensus in another discussion was that Saposky is wearing a device that keeps the camera pointed on him as he moves, so there isn't actually a camera operator there at all. Which is a pain for us when we want to see the whiteboard, but makes it much more practical for Stanford to routinely video a lot of classes.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA92mjX44FGSA", "comment": " @Joy-do9vv  e.g. 16:19 & 16:21", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Uggd-GsfrRNWcXgCoAEC.7-H0Z7-RlcA93D2WyQGdZq", "comment": " @Joy-do9vv  20:50 that can't be the case because of this", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg8UUMWm0ZuYn", "comment": "YouTube is not the waste of time that many think.", "votes": "30", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg8mH1FyYfgBY", "comment": "Definitely", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg8oTC8YGj2bP", "comment": " @coreycox2345  Time well wasted", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg8qwzmtjk0GT", "comment": "I agree with you, Geahk. My only regret is that I don't have the chance to talk to the professor directly. :)", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg92xIpG7a28h", "comment": " @sebytro  If you are in California, prof. Sapolski is scheduled to lecture at the Segestrom Center in Costa Mesa (Orange County) on February 17, 2020. But I think that you might get just as much by simply watching videos.", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg934f7lF4d3R", "comment": " @CaliforniaGirl-qk5kq  Thank you, but I'm on the other side of the Atlantic. :) I am enjoying his videos on youtube very much though. Happy holidays!", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg9IHPbVXayt6", "comment": "It's like auditing the class, where you have all the interesting things and no exams. No credit but no exams. I like this way.", "votes": "12", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg9ZNtvexU6ym", "comment": " @sebytro  $•", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgiZpUDS8i4KfngCoAEC.7-H0Z7-LUJg9aIZevQFbfp", "comment": "Auditing for free, bless my soul", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UghMkpD8G-q5_3gCoAEC.7-H0Z7-PK0g7-H0l6KTGpA", "comment": "Chutes and Ladders is a metaphor for life. ", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugjl4yBWjQynOHgCoAEC", "comment": "\"We're not a whole lot fancier than hamsters.\" ...love it :)", "votes": "94", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxrV4lt7VVb1pUTkup4AaABAg", "comment": "i noticed it and thought i would point it out... it doesn't hurt anything and it was amusing to me. could yall not read the sarcasm in my comment? he made the assumption I was an idiot", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwsb-ZeYQSWZXFlMJt4AaABAg", "comment": "Troll, who exactly did you think I insulted?  I expressed surprised at the almost 100% market share that Apple enjoys in that classroom.  You, on the other hand, seem to delight in insulting people needlessly.", "votes": "3", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy0aayWeXzshB65nzp4AaABAg", "comment": "Free education on youtube, im going to insult one of the humans that help make this possible a camera monkey. \"Pointing out the obvious brings me joy\"", "votes": "8", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyAg9_87Nf3qVS7WgN4AaABAg", "comment": "you know i was trolling for your comment", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwjsdTUh1tkUr_Vdit4AaABAg", "comment": "5 minute break at 55:00", "votes": "6", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxFlpZN3x2NWEy-JFt4AaABAg", "comment": "30:00  begins kinship/recognizing relatives", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgznPctLbZLvn8LIRoB4AaABAg", "comment": "42:00 he said how you would design this... that means intelligent design right?", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzJZxvYLOxJtlwxc0N4AaABAg", "comment": "travel!", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwzlBJboANG6NyJ1O14AaABAg", "comment": "nice utopian philosophy. I'm from Belgium. Always been bad at maths. Met a lot of nepalese guys working in restaurants . Usa people...you have to much land, to much ignorance. You know shit about nepal and belgium. But it all sounds nice, cool. Yeah man, yeah....bullshit. But nice teacher tough, he's got something smooth going. And as darwininan type he's right...but this comfortable usa arrogance....always has drawbacks on my parts.......you understand?  I hope?", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyM029K2cAXoP7Wtql4AaABAg", "comment": "The only part I hate is when he asks questions and I cannot submit one and especially when no other studend asks what I want to. This \"passive\" learning has some drawbacks that make me uncomfortable sometimes. Nevertheless these viedos are agreat gift to the whole world who have the privileges to speak or undersatnd english and have internet access. Fot that I am grateful, realizing that even free knowledge is pretty limited due to linguistic and social-economic (?) boundries.", "votes": "2", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg", "comment": "I hope the girl with the cough gets over it soon.  ", "votes": "439", "replies": "29", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyY64psrjBeLkMgZTl4AaABAg", "comment": "I don't want to minimize how great it is to have these online, though. Great lectures and kudos to Dr. Sapolsky and Stanford for posting them online!", "votes": "31", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugza2-ktnb_FU467AsJ4AaABAg", "comment": "Sapolsky is one of a kind, but, as an outsider, it seems like the discipline is overtly burdened with \"schools\" and the way the history of the field is intertwined into these lectures is confusing and contributes very little to understanding the science. I would prefer a more matter of fact approach which communicates the exact state of knowledge and what the correct approaches are to achieving conclusions. More emphasis on what we know and less emphasis on the history of the field.", "votes": "3", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxtR4krum5pQC-bAXJ4AaABAg", "comment": "Absolutely loved this one. Very important information here.", "votes": "5", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxTrqaTdUa0jBYxFuF4AaABAg", "comment": "Thank you, Stanford, for showing these lectures and for not showing commercials. ", "votes": "161", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxEWbFpOs95JQWvK7V4AaABAg", "comment": "Chocolate. ", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxdEJ_1H7JmsqrUgEJ4AaABAg", "comment": "So frustrating to not be able to see on the board what he is talking about at the very beginning of this lecture. P.S. I am very appreciative of theses videos!!", "votes": "32", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy2OjBMICbbvvCU2Al4AaABAg", "comment": "psst, I was joking!", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx20wIGneAXa4dc4QR4AaABAg", "comment": "priceless.. wish all my profs would teach like this.. I would learn so much more...", "votes": "16", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwzlBJboANG6NyJ1O14AaABAg.8GcJ4eDp1Jg8NCJPuA5N2A", "comment": "shut the fuck up", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyM029K2cAXoP7Wtql4AaABAg.8GbgeYzW5gI8_VxZQYM6GG", "comment": "Ask Google. Google is way smarter.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI78e_a9niQBsi", "comment": "Gingerzilla Yeah, I know. I’d be turning around to stare at her more than would be good for me.", "votes": "23", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI78h_DJvXdNdz", "comment": "God I know its so annoying! It doesnt sound like shes even trying to hold it back.. If someone did that at my university everyone would turn around and glare at them!  Surely if the lecture was being recorded and uploaded immediately, which it was, the considerate thing to do would be to not attend and watch it in on your own so youre not disrupting everyone else and forever tainting the recording with your constant unrestrained coughing.", "votes": "14", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI78sDlMlLp9kX", "comment": "She needs to lay off the smoking or something.. sheesh", "votes": "7", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79-7BTznZQyo", "comment": "Yeah, if Sapolsky was Trump he would make a big deal about it and shoot the video over again", "votes": "7", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI792mBNISITPs", "comment": "LOL, if she's not over it by now, she's in big trouble!  But for heavens sake, if someone has a cough, they can't control it, how about a little sympathy?  Probably not so nice for her to have that cough, either.  How about you pass her a cough drop instead of cvetching?", "votes": "61", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI795IyWOmvRKq", "comment": "yeh,y spread it around?go to bed,get well...watch utube/copy cuz its gr8'", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI798RfLlWrs_Y", "comment": "Hearing her coughs hit different during covid", "votes": "27", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79DFQV_uSSDP", "comment": "Roman Kov glad to know I'm not the only one being triggered", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79FFawfTEVGm", "comment": " @Joy-do9vv  that person coughed over 12 episodes.", "votes": "14", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79MVCx--064m", "comment": "I hope she recovers, getting over it sounds like she has heartache and not a cold allergy! Also, the comments here ...geez...Being bullied for a persistent cough doesn't sound nice... I'm sure there is a good amount of the grade on class attendance. Plus I can understand how the pressure is for some people in college, not sleeping, barely eating healthy...thus bad immune system...ergo more sensitive towards allergens! Ok I think I should stop with the save the cough-girl's honor thing....I'll stop! Also, heritability of this cough due to college life environment seems legit maybe? lol", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79MiwzKWmtVF", "comment": "seriously been coughing for the past 7 lectures.!", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79NOambFSbVo", "comment": "Grateful to know that I have been so absorbed by what Mr. Sapolsky is saying to have never noticed any cough before reading this:)", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79OAEI6tl_4E", "comment": " @littleblackfox1  this is a bit judgmental. Coughing isn’t something you can ‘control’. As a person with lifelong allergies and sensitivities to scents I can assure you that it’s reflexive. It’s a struggle to control in spite of using throat lozenges, drinking fluids, leaving the room. In addition microphones can distort sounds. Those present in the room are probably much less aware of the person(s) coughing than those of us viewing/listening to this video.", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79OQizO9FNk_", "comment": "could be tourettes syndrome. i do that and its a tic.", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79OQjHscGI2r", "comment": "i cant control it. if i hold it back it would just come out even stronger.. before you cast hate about something you can control. think about what its like on the other side of the table.", "votes": "6", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79OaDOYhUe32", "comment": " @littleblackfox1  shut up with your nonsense..", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79OaDQ2T6jxY", "comment": "Who cares..", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79Pvs5k-iWyx", "comment": " @charliesmash  It's funny how you think you can accurately identify someone just by indirect recording of their coughing :D", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79Rkv3CwRuou", "comment": "I see it as funny comment and the underlying comments disgust me.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79WKEKWLEXXe", "comment": "Especially  “now”", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79dI39e5VKJE", "comment": " @Joy-do9vv  it's called \"old fashioned courtesy \".  I guess they don't teach it any more.  Used to be if you were going to disrupt the whole class with a cough you left.  Not everyone is a \"victim\".", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79fM7ef5aIgI", "comment": "Covid hits hard sometimes", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79g1VsuzR_AX", "comment": "I could hardly hear her coughings, I wouldn't even once if you didn't point it out What's wrong with you ppl?", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79g7Zz9k7AHB", "comment": "She still coughing on 2022 I hope is not COVID 19", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79iYCmRpi5Eh", "comment": "November 2022. Still going strong.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79s8_8xcLSCk", "comment": "2023 and she’s still coughing", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79wT135xBYjX", "comment": "To anyone complaining about it, I think I heard the cap popping off & the actuation of an inhaler at one point. If she had asthma, I'd recommend you dress to stay cool toward the end brother lol", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI79xQe4hA_b1E", "comment": "legend has it she's still coughing to this day", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyypzzD84PopsaSY1x4AaABAg.8GcS3EpcSI7A2evuYUM218", "comment": "i hope the people in the comments get over the girl coughing soon", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugza2-ktnb_FU467AsJ4AaABAg.8GbSbVR1bzR92fqNv6Og53", "comment": "It's been 6 years since this comment has been posted but nonetheless I think it's important to adress this issue, so here's my take. From my perspective, there is a crucial difference between knowing what the state of the knowledge is and what methods are dominant at a certain time and actually knowing the history of a discipline. With the non-historical approach you would know the facts, yes, but you would have a really hard time coming up, in the future, with your own original and relevant study. Don't forget universities train people to be researchers, not living encyclopediae. By knowing where your discipline has been in the past, you have a broader comprehension of what is feasible and what is not, what has already been done and work or doesn't work, what kind of idea is associated with which specific field, etc.   Also I'm pretty sure humans have a much easier time learning when they are told stories rather than when they have to memorize all sorts of random facts unrelated to one another.", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugza2-ktnb_FU467AsJ4AaABAg.8GbSbVR1bzR9PdXHMbRD_t", "comment": "I believe the real point of these lectures is actually to teach you HOW TO THINK.  You've made it thus far with money or brains or some other virtue.  You take notes, stay up all night, take tests (regurgitate) but you still don't think.   He's upfront with it; he's exposing you to various scientific branches to get you to take your brain outside your box (career path).  Most of the people there are STEM oriented and will eventually need to come up with a study and a study subject.   He's explaining how to do that and test it through various other models.  Kudos Professor!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugx20wIGneAXa4dc4QR4AaABAg.8GbmJx3LuSK92mC6LS7j0W", "comment": "You know, I bet most Stanford profs aren't this good at lecturing, either.  I went to another well known university, and had maybe two or three really fabulous lecturers, and the rest were pretty ordinary.  My mom advised me to take courses - at least my electives - from the profs who were supposed to be the best, because they would make the subject matter facinating even if I thought I couldn't care less about it.  Interesting idea, that.", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugz0ww25_hN59Gu7J714AaABAg", "comment": "Actually, if you  continue inbreeding long enough, and eliminate harmful recessive genes from the pool, you will eventually stop getting the sort of defects associated with inbreeding.  A case in point is that of the familiar albino \"lab mice.\"  These mice have been so inbreed over hundreds of generations that they are all virtual clones.  Of course, in the wild, one pathogen could wipe them out entirely, but living under human protection they do just fine.  (Dawkins mentions this somewhere.)", "votes": "18", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw2u2iwcILeK5210It4AaABAg", "comment": "I know, sorry. Someone said it was his microphone, but it still bothers me to the point I cannot focus on what Robert says. ", "votes": "4", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugx2cEY39ohvVoR1QE14AaABAg", "comment": "I never even noticed that sound til I read your comment.  Now it's like a jackhammer in a culvert.  Damn you!", "votes": "2", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg", "comment": "I'm more inclined to marvel at natural selection for creating Sapolsky.", "votes": "226", "replies": "10", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyBP7bZDoeBORn2AGV4AaABAg", "comment": "Thank God for creating Sapolsky!", "votes": "5", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy8gO0zp6OCgzEX-hl4AaABAg", "comment": "I had no idea how large this class was, and how many people would have apple laptops.", "votes": "4", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgyPdrU3qtmg8Wz2lyZ4AaABAg", "comment": "Trust me, I tried to get over it, but I cannot. I have always had a hard time blocking out noises. I think my father raised me that way. I go nuts when I hear people chewing with their mouth open. ", "votes": "4", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxcQze1Mc2zytgQasd4AaABAg", "comment": "What do you mean would you ? could you plz make it more obvious ", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzMovPovfXJlPd5piJ4AaABAg", "comment": "Love how he talks himself into his own questions...beautiful: (In regard to a difference in bonding between vaginal birth vs. cesarean) \"I don't know, but that suggests it should be happening...and maybe I should find that out...\" Seriously, you can't ask for a better teacher than that!", "votes": "59", "replies": "2", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugwl4wXg7pyX6VfxXQ54AaABAg", "comment": "I seem to be one of the 5 people to have understood the Esperanto joke. ", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzSVoDqSfrWtxNFDxN4AaABAg", "comment": "I just found out !!  he doesn't have any facebook or twitter :l", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugw9I8b9KpxFDdbfauB4AaABAg", "comment": "Is he in ZZ Top?", "votes": "3", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzxCAjOdGoNbVB7m6p4AaABAg", "comment": "Fascinating!", "votes": "1", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgwGtHM845TL295AjVZ4AaABAg", "comment": "I started to google this Chutes and Ladders study while he was talking. I feel like a fool.", "votes": "256", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugxiv5kevIzB-cD1KYZ4AaABAg", "comment": "What a beard! I'm jealous. Can't wait till I get old enough to grow one...", "votes": "4", "replies": "3", "reply": false}, {"vid": "P388gUPSq_I", "cid": "Ugy-0wl-I6TpMsDsWwx4AaABAg", "comment": "@freethinkerer i was happy w/ this vid till iread this.... lol    : [", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzD6o6HOYQa5IYrDyR4AaABAg", "comment": "Am I the only one who is annoyed by the guy clicking his pen the whole time?  It has ruined the whole thing for me. If he sat next to me in class, I would probably stab him in the neck with his pen. My cortisone levels are at a dangerous level.", "votes": "1", "replies": "1", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgzgUYp_loeda-fcfGR4AaABAg", "comment": " believe is mother imunitet agaist feedist ingreasse", "votes": "0", "replies": "", "reply": false}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo69HebMVpux8R", "comment": "Materialists marvel at the creation and its manifestations; supernaturalists marvel at its Source - the Creator.", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo69J0FfnMjbTO", "comment": "And the Creator?  Self Created?", "votes": "5", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo69MmtytEUi17", "comment": "Ppp0p00p0lllllll", "votes": "2", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo69QODXvDiFMK", "comment": " @goddessservant6669  you have spoken the truth", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo69QPL403yWPf", "comment": "LoL what the hell did I type? 🤣", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo69TAdM6qlcG5", "comment": " @goddessservant6669  Ppp0p00p0lllllll", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo6A0wkXBD31Jm", "comment": "Marvel at the chain of events that he isn't named Rudolf Josef Himmler-Moustacheguy", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo6A0wqkQZHwu2", "comment": "I got a notification that someone replied to this, and I see now that this is something that apparently I wrote 11 years ago, and I have to be honest... I have no idea what the f**k I meant at that time.", "votes": "3", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo6A0xMrHyMMZS", "comment": " @Guitcad1  I gave you a 👍🏻. Did this series change your life?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgxWIaM1lGuyDi_0LE14AaABAg.8GcC6BchEo6A0xl60K-yTP", "comment": " @danaveye3977  It has indeed.", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgyPdrU3qtmg8Wz2lyZ4AaABAg.8Gbw_bU4prO95PyThOn6M-", "comment": "Freethinkerer D I hope you are more mature now, as the noise is one thing but being self-centered enough to need to point it out in a thread where people are focused on learning something is a different environmental heritage of your father.", "votes": "4", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzMovPovfXJlPd5piJ4AaABAg.8GbTTTBNncy9R0wxqycsWY", "comment": "It’s 9 years later….do we have an answer?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzMovPovfXJlPd5piJ4AaABAg.8GbTTTBNncy9TY7PefAh8W", "comment": " @4philipp  yup!", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugw9I8b9KpxFDdbfauB4AaABAg.8GbwXfT1jQw93CgoUse3t_", "comment": "No. But ZZ Top is in him.", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugxiv5kevIzB-cD1KYZ4AaABAg.8GcGU1NsICd9IJ6WP5udKE", "comment": "It has been 9 years, how's the ol' chin?", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugxiv5kevIzB-cD1KYZ4AaABAg.8GcGU1NsICd9JOtb0zOlD1", "comment": "Well, not bad actually. The chin is great. The cheeks? Not as good as I’d like. Thanks for asking ya madman 😄", "votes": "1", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "Ugxiv5kevIzB-cD1KYZ4AaABAg.8GcGU1NsICd9ZTk2hBsg2q", "comment": "Update?", "votes": "0", "replies": "", "reply": true}, {"vid": "P388gUPSq_I", "cid": "UgzD6o6HOYQa5IYrDyR4AaABAg.8GcdloI57Ir9R12R4tShDJ", "comment": "Yes you are the only one. Now focus on the lecture", "votes": "0", "replies": "", "reply": true}]