[{"vid": "pJDHi91yAaE", "cid": "Ugyhm07CGw-3WfWstNJ4AaABAg", "comment": "This is the way to teach. I don't need any graphics, music, \"interactive' bullshit. I just need a great professor, a blackboard, and chalk. This is awesome.", "votes": "3", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgwoiQnlAeZ7F2lOPt54AaABAg", "comment": "Aren't saturated carbons  bonds more stronger than unsaturated ones can anybody clarify that", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgxYW9jXHxCWuKLCt0V4AaABAg", "comment": "I love the teaching style of this professor, thanks for sharing. Professors like these are a blessing to student. He has such enthusiasm.", "votes": "2", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugwvg7-mbUh-U2NTWaR4AaABAg", "comment": "Easy", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugx3DkpjBC9DD2GGAXF4AaABAg", "comment": "This professor is amazing!!", "votes": "0", "replies": "1", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugy07aKjAsQMPQ1OADV4AaABAg", "comment": "thank you MIT for this OCW and instructor for such a magnificent lecture.....its helping alot", "votes": "1", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugi6Ti3eYwApKngCoAEC", "comment": "Thanks for helping me in my bio class.", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UghDHEY26zdjungCoAEC", "comment": "This is a valuable professor. His experience and depth of understanding are clear. The reason he uses the chair is clear. When he stands, he also hops. One leg is injured. He's giving it time to heal.", "votes": "11", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgiP1Zq74CjSAHgCoAEC", "comment": "What water researchers haven't figured out yet:  Convection Versus Plasma https://youtu.be/LwSyalcoRAk?t=11m30s  Surface Tension, Jet Streams, Storms and the Twisted Truth of Meteorology https://www.youtube.com/watch?v=C6GZEn7N7Ss  Impact of Polarity Neutralization on the Water Sciences https://www.youtube.com/watch?v=WSGv08Rb_Lo  How Non-Newtonian Fluids Reveal the Mechanism Underlying Ice https://www.youtube.com/watch?v=W6vPdAo78rU  My channel https://www.youtube.com/channel/UCcg8R1ALfDP7sGkeIEBjkMQ", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugig-6aTYTcnLXgCoAEC", "comment": "Good video.  I think this will help a lot of students on a topic that is generally confusing.  Here is some information on a cutting edge development in hydrogen bonding:  Science is confused about water because they are confused about polarity.   They see polarity as a function of \"polar' bonds (a \"polar\" bond is a covalent bond that has an electronegativity difference).  It's not that simple.  Many molecules have \"polar\" bonds but are not polar (they are not dipoles).  A polar molecule is asymmetrical in addition to having electronegativity differences.  And where it really gets confusing is when you consider that with water (and only with water) symmetry is variable--AND ACTUALLY VARIES AS A CONSEQUENCE OF HYDROGEN BONDING!  In water polarity drops to zero when symmetry is achieved through coordinated tetrahedral bonds.  The failure to comprehend this and its implications is the reason they are so perplexed by water and its many anomalies.  For example, once you understand this it becomes immediately apparent why H2O has its high heat capacity. Strangely, the professionals have no ability to grasp the importance of symmetry to polarity.  They write paper after paper and do video after video that demonstrates their ignorance of the intricacies of polarity and then they make lists of water's anomalies, pretending they have explained something that they have not explained. The following paper tries to get beyond that same ground hog day, over and over again, glossing over, inability to grasp what is really happening at the molecular level that is so typical of the study of water:  https://zenodo.org/record/37224  https://groups.google.com/d/msg/sci.physics/Cin1MQ4ZyFU/QmNEM9mnDgAJ", "votes": "3", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugg1NIuFzE82SngCoAEC", "comment": "Hydrogen Bonding As The Mechanism That Neutralizes H2O Polarity: A Unique Perspective On The Transition Between The Liquid And Solid States Of Water  This paper introduces a theoretical breakthrough: H2O molecules collectively neutralize their own polarity through hydrogen bonding. Dual (symmetric) bonds fully neutralize polarity, allowing for the low viscosity (high fluidity) of liquid water. Singular (asymmetric) bonds neutralize only one half.  Thus, situational factors that remove or inhibit the attachment of one of the duo of weak bonds associated with symmetrically coordinated hydrogen bonds effectively activates the polarity that underlies the structural rigidity and electromagnetic forces evident in ice and surface tension.  https://zenodo.org/record/37224  Click Link at bottom of page.", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UghM9Ww5EaS34HgCoAEC", "comment": "This might help: https://www.facebook.com/jim.mcginn1/posts/10205160797642100 Note link at bottom if you want to see full discussion.  It's all somewhat confusing, sorry for that.  But the central breakthrough has to do with H2O polarity being variable and not a constant, as everybody has been assuming.  And the mechanism is actually the completion of bonds themselves.", "votes": "1", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgjNeizmjKz5fXgCoAEC", "comment": "very easy stuff, so disappointing", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgitgHuRQlvk33gCoAEC", "comment": "Too easy.", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgxIIJoW0COPn57yGo14AaABAg", "comment": "he really loves his chair dragging around when he write something....maybe he sleeps w/ it", "votes": "1", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugxl4ZQOepWqxiMZjIN4AaABAg", "comment": "hi Y@ ", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgxwQ4IE1E4Qs1oQrdB4AaABAg", "comment": "thanks..great", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgwQB69q7c2LOzAKLZN4AaABAg", "comment": "what a boring lecturer from the school such as MIT ... no offense xD", "votes": "2", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugy53g-T_HzMNOXaeW94AaABAg", "comment": "it's very help me for the test next week. Thanks", "votes": "0", "replies": "1", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgyPPPGWq86FqSv1HJh4AaABAg", "comment": "The teacher is awesome, thanks for sharing.", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugx3DkpjBC9DD2GGAXF4AaABAg.8lYVRhB4bOA9PUWwzuj_EW", "comment": "WHY?", "votes": "0", "replies": "", "reply": true}, {"vid": "pJDHi91yAaE", "cid": "Ugy53g-T_HzMNOXaeW94AaABAg.8GcfhhqyD1z99qoEihJIZ9", "comment": "How was your test? Did you do well?", "votes": "0", "replies": "", "reply": true}, {"vid": "pJDHi91yAaE", "cid": "Ugwer3T2gxRLt8-d7HJ4AaABAg", "comment": "Teaching that illuminates rather than obscures.... ", "votes": "1", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "Ugy8ySQi3IXIOYvLuGt4AaABAg", "comment": "Thank you very much!", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgxbIcnyPGV53BuOR6l4AaABAg", "comment": "Very cool.  Thanks for sharing.  I'd love to see the next lecture!", "votes": "0", "replies": "", "reply": false}, {"vid": "pJDHi91yAaE", "cid": "UgzrQ87UcQJZo0CWVz14AaABAg", "comment": "thank you!", "votes": "0", "replies": "", "reply": false}]