[{"vid": "pNt5Ll6hGqo", "cid": "Ugzb6lFhJN3sasSUavR4AaABAg", "comment": "that feeling when Martin VD is in the thumbnail and you tense up ready for another crazy 1h20 lecture", "votes": "2", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgxISEUHmdsz5HDnE3h4AaABAg", "comment": "It would be really nice to have a lecture about generation after the counting lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugxa_GyXufHKWoptCd94AaABAg", "comment": "a) Definition of injective function is wrong. Instead of saying 'All elements of Y must be mapped to at most 1 element of X ', the definition must be `All elements of co-domain of X...`. In injective functions, there can be unmapped elements in Y - as he showed in his example.  b) The example for the permutation function is technically correct but it makes little sense to give indexed names to elements of a set. Elements of a set are unordered while indexing them implies some kind of intrinsic order.  c) I dont see why having a digit repeat in 8 digits should not be fairly common.", "votes": "0", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugx_s5N1URi1_XjYVut4AaABAg", "comment": "It bugs me that Marten never learned his symbols: () = parentheses {} = curly brackets, braces, or 'staches, because they look like a mustache :{D [] = square brackets or just brackets <> = angle brackets or fish hooks", "votes": "0", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwVL2em30Vqjc8LCTp4AaABAg", "comment": "I am not getting how he can map elements of a set to bits and say that the total number of subsets becomes 2^n consequently. What logic there is in that?", "votes": "0", "replies": "1", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugyq1L_IgnXvk7nEGCp4AaABAg", "comment": "Easier material covered in this lecture compared to previous ones, a nice relief.", "votes": "0", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgzbebvudNxiLjyNaWx4AaABAg", "comment": "very nice lecture :)", "votes": "1", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugxaw_jiu-AhhQBoVWR4AaABAg", "comment": "Is Pigeonhole principle the Dirichlet's principle? It looks so familiar", "votes": "1", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwzEl2utyqwaJYqCTF4AaABAg", "comment": "its very interesting thanks to all staff of MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwUxLtR9KODJc06dAt4AaABAg", "comment": "Pigeonhole op", "votes": "0", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwXoY0XtnGuMbDE70N4AaABAg", "comment": "Professor Marten van Dijk thank you for another fine lecture on Counting Rules. Discreet Mathematics takes on different ways of thinking in mathematics and Computer Science. Counting Rules are part of Probability Theory and this is a totally different way of thinking in mathematical terms.", "votes": "6", "replies": "1", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgxKQ2xPXWxstcWcgzJ4AaABAg", "comment": "His voice is so sweet, just loved it!", "votes": "3", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugyn6Tah6jsQPLjiwT94AaABAg", "comment": "ok Marten is back. brace up fellas.", "votes": "5", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugx5mQ368UqsTl67D4p4AaABAg", "comment": "Paper and pen/pencil best tools to keep up with mr. Dijk on lesson", "votes": "2", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgzjC3jQ2n-KBnTW74F4AaABAg", "comment": "prof Van Dijk starts with definitions, whereas prof Leighton starts with examples.", "votes": "6", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgxufJEHHusFXqbX3Mt4AaABAg", "comment": "Is this is a full course on discrete mathematics?? (Before ds and algo)", "votes": "6", "replies": "1", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg", "comment": "The example he gave about the 2 digit numbers is incorrect. There is only 45 different combinations for any set of 10 double digit numbers. If you multiply the first digit by the other 9, that's 9 different combinations of sums. To avoid repeating, you would take the second digit plus the other 8 digits, and so on.   So, maximum combinations is 45. 9+8+7+6+5+4+3+2+1=45 The total range is 99+98=197, which is the absolute maximum sum you can get from any two double digit number (assuming non-repeating, for obvious reasons), and the minimum is 10+11=21   197-21=176.   Since, there is a wider range, than there is input combinations,  It's possible for each input to have it's own output without repeating. In fact, just by using an simple excel spreadsheet, I found several combinations that works without repeating.   One such example was 10, 12,13,14,23,38,53,85,93,99. You could try to look for any two sets of numbers that have the same sum, but you will not find such a thing. There were several other combinations that worked, so, there was a mistake in the logic, mostly because it included all possible combinations between 10 and 99, not, just all possible combinations between any set of 10 two digit numbers.", "votes": "2", "replies": "8", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwFGiSOkV0VWH78GNp4AaABAg", "comment": "I found the explanation of the Pigeonhole Principle given in the book much clearer. It uses the same examples. (Chapter 11.10 The Pigeonhole Principle)", "votes": "4", "replies": "1", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwgDcWHE0rEsm0aObx4AaABAg", "comment": "Pigeon hole is so overlooked, yet so awesome 💕", "votes": "3", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwdjR2eRwbNt-YxBmF4AaABAg", "comment": "this is 10% of the permutation combination required for IITJEE", "votes": "6", "replies": "3", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwVL2em30Vqjc8LCTp4AaABAg.9p8VNZO3tRX9p8Vsk4SefU", "comment": "I just asked our AI friend and the answer is quite good: To understand why the number of subsets in a set with n elements is 2^n, consider that each element in the set can either be included or excluded from a subset. \r \r So, for the first element, there are 2 options: either it is included in the subset or it is not. Similarly, for the second element, there are again 2 options: either it is included in the subset or it is not. \r \r Therefore, for each element in the set, there are 2 options, and since there are n elements in the set, the total number of possible subsets is 2^n.\r \r For example, let's take a set of three elements {a, b, c}. The possible subsets are:\r \r - {}, the empty set\r - {a}\r - {b}\r - {c}\r - {a, b}\r - {a, c}\r - {b, c}\r - {a, b, c}\r \r There are 2^3 = 8 subsets in total, which matches the number of possible combinations we have just listed.", "votes": "1", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgwXoY0XtnGuMbDE70N4AaABAg.9R5gj_kyBke9X33TI-kpxQ", "comment": "Lies again? MRT MIT", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgxufJEHHusFXqbX3Mt4AaABAg.8zmTATyxXva93Vdql6q3UB", "comment": "yes", "votes": "2", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG910dxwQcTq9", "comment": "@Will McCullough how am i wrong when i gave an example that proves that this is wrong?  add up any of the numbers in my sequence and you'll see that it proves it wrong. none of the numbers add up to the same sum. i tested it. trust me, im 100% correct. the only way you'll get the same sum is if you add 10 and 12 and 12 and 10, which is just the sam numbers reversed.  For a proof to be correct, it must not be proven wrong. What i did was prove it wrong.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG910e6eAFtDh", "comment": "@Will McCullough you obviously know that for a proof to work, it must not be proven wrong. you do know that, right? you can say whatever you want but if i can find a sequence that proves it wrong, there is obviously something wrong with your logic.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG910g9gmcz66", "comment": "​@Will McCullough The 10 has only 9 other numbers it can be added to. Since the number 12 has already been added to 10, it only has 8 other possible sums.   This problem only has 9+8+7+6+5+4+3+2+1 UNIQUE possible sums. THIS is why it's wrong.   There is literally only 45 possible sums. Not sure where you're getting 2^10. You should use your brain, instead of assuming what you've been told is correct. That could be a fatal mistake.    Since the lowest number 10+11 is 21 and 98+99= the range is literally [21,197]. It doesn't take a genius to know that there isn't 2^n possible sums. Not sure where you got that number.   You should do a little critical thinking sometimes and think about the problem and not just assume what you're being told is correct.   That's not to say that the other examples he gave were incorrect. This was just one example that was wrong. That's all.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG912C25V_b3o", "comment": "@Will McCullough those sets are more than 2 elements but OK. Not to mention, the sets are not even the same size. but OK.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG912Eaj3I28j", "comment": "@Will McCullough maybe my assumptions are wrong but i assumed set size was 2 and they must be unique. When taking unique set of any 2 2-digit numbers, most of the time, you will find two numbers adding to the same sum. However, i specifically looked for a set where this wasnt true.  however, if the set size can be any size and it doesn't need to be unique, then yes, its always true.   I actually tested it out. Round 99% of the time, any random set of 2 two digit number to add up to the same size, and im 100% certain that's what he meant. Either way, im certain the example was to show how you can induce a proof not that his logic was 100% infallible.  not to mention, he specifically say the sum not the sums , implying its only the sum of 2 elements, not multiple elements.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG98Gm20vDo4c", "comment": "You can always refer the book, its free.   11.10.2 lays out this problem.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG99kI3wpWf4p", "comment": "You are absolutely wrong. He is talking about the sum of 2 possible subsets given a set S of 10 elements. He never says the subsets of S must contain only 2 elements. In fact they can contain any number of elements from 0 to 10 and in total they are 2^10", "votes": "2", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "Ugy5MweZCWHU12AG4KR4AaABAg.8z_3vaZEQEG9uKxGqGkQ9e", "comment": "{10, 13}, {23}", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgwFGiSOkV0VWH78GNp4AaABAg.8zBKVB5aWyc8zD8HkBzYYI", "comment": "Comment from india? IIT?", "votes": "1", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgwdjR2eRwbNt-YxBmF4AaABAg.8xCxUoSgqLY96hUuy2CohE", "comment": "Hahha, this has not finished yet", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgwdjR2eRwbNt-YxBmF4AaABAg.8xCxUoSgqLY96ut3wWmgI-", "comment": "bro see their recitation questions..", "votes": "3", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgwdjR2eRwbNt-YxBmF4AaABAg.8xCxUoSgqLY9MDn-zH_ajX", "comment": "what is IITJEE?", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgzVX7GR0KV41CWWqcp4AaABAg", "comment": "I wonder what students are doing these days", "votes": "5", "replies": "4", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgwV-eO7aKvtrXBqFPR4AaABAg", "comment": "I don't care what anybody says, he's a great teacher and this was my favorite lecture so far !", "votes": "25", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgzhOXDIBKSYBcth2lx4AaABAg", "comment": "If their are more than s pigeons and only s holes. Then their exists atleast one hole where two or more pigeons could fit.", "votes": "1", "replies": "1", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgzINR9RD9xlFkefybB4AaABAg", "comment": "Bu kadar kötü yazmak için hiç mi çaba sarf etmediniz.", "votes": "1", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugx23XIzjuEO16S1EqB4AaABAg", "comment": "I like that this course is free. <3", "votes": "9", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgzYH-t8AWBCgGeKv_l4AaABAg", "comment": "pi(Ai) = i is not well defined here, i is a natural number", "votes": "2", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "Ugw2JYo1da2Ygui-7Kx4AaABAg", "comment": "So is {Idea} is bijective to {ID}? He is not a bad prof tho.", "votes": "2", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UghhCV-9C3ZdbHgCoAEC", "comment": "if fight club protagonist had seen this lecture he would not have created Tyler durden.. would have slept like a baby", "votes": "5", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgjPs0RtcYZw-3gCoAEC", "comment": "sur满射 in单射 bi双射 division rule 就是排列组合", "votes": "1", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgjRikNKKKpp9HgCoAEC", "comment": "Important note: In his definitions, this lecturer mixes the use of underlining words/phrases for two different purposes:  1. To highlight the term being defined 2. To produce emphasis on certain characteristics of the definition  Until this point (all previous lectures) the convention was to underline for the purpose (1.) only, which is necessary since otherwise sometimes it may be unclear what is being defined due to the sentence structure and quirks of the English language.  (2.) is unnecessary - if a phrase shows up in the definition statement, we already assume it to be important to the definition.", "votes": "5", "replies": "", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UggLWixcf0nJTXgCoAEC", "comment": "Thanks for the series and both are great teachers, but I must say Tom has a much more inquisitive, clear and enthusiastic style than Martin.  @ 1:19:00 the intersection of sequences which occur in both sets have to either be subtracted.", "votes": "5", "replies": "1", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UggwBx1IX1h58XgCoAEC", "comment": "1:04:50 I did not get how he calculated n*(n-1)*(n-2) ways to choose the committee. Say we have 3 total members. Then it is not 3*2*1 ways we have to choose the committee. We only have 1 way to choose the committee. same with n=5 we have 10 ways not 5*4*3 ways. It would great if someone could tell me if I am missing something.", "votes": "1", "replies": "4", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UggEImUClkYyGHgCoAEC", "comment": "confusing", "votes": "4", "replies": "3", "reply": false}, {"vid": "pNt5Ll6hGqo", "cid": "UgzVX7GR0KV41CWWqcp4AaABAg.8w9bExW62EV91iqLHX-s97", "comment": "studying", "votes": "2", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgzVX7GR0KV41CWWqcp4AaABAg.8w9bExW62EV9MDnp2hwWQK", "comment": "These students already know these concepts so they are sitting learning what teachers will teach 1-3 years from this lecture date.", "votes": "3", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgzVX7GR0KV41CWWqcp4AaABAg.8w9bExW62EV9eR5cNPXlzU", "comment": "Sam Bankman was at MIT about time this came out , now his world youngest billionare", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgzVX7GR0KV41CWWqcp4AaABAg.8w9bExW62EV9pNWRwWZlQ2", "comment": " @urosuros2072  Aaaand he failed.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UgzhOXDIBKSYBcth2lx4AaABAg.8nZ8WA3XE6z9CcdUXMZn-v", "comment": "if and only if they want to go into the hole.  i take it that some pigeons just want to fly away.", "votes": "1", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggLWixcf0nJTXgCoAEC.8JeYqJ2QkkD9QVOcJH09Lw", "comment": "Nothing occurs in both sets thou", "votes": "1", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggwBx1IX1h58XgCoAEC.8GoiCvyXOQA8GooDnUEWmn", "comment": "Ok. My Bad.I think it is 3*2*1 different combination of committee that could be formed.", "votes": "1", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggwBx1IX1h58XgCoAEC.8GoiCvyXOQA8Gq6-m3JUVY", "comment": "ordering matters in a permutation by its definition so you have n! permutations for a whole set where \"n\" is the number of members of the set. if you had 3 playing cards and wanted to see the total ways you could order them, you start with three options, the three cards in your hand, then once you put down a card you only have two cards left, so you have two options, and then you only have one option left when you're down to your last card. so, 3*2*1 permutations for that. if you had 4 playing cards you'd start at 4 and you'd end up with 4*3*2*1, and so on.  in the example at 1:04:50 you're finding permutations for only three committee slots with a larger set of total people to choose from, where no one person can occupy two positions. from there we can use the same method as earlier: you have n total people that could be in those slots, so you start with n people, then you put one person in the first slot and you have n-1 people left over for the second slot, then you put another person in the second slot and have n-2 possible choices for the third. so, n*(n-1)*(n-2) gives the total permutations in this case for the committee, where n is the total number of eligible people for the positions.", "votes": "1", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggwBx1IX1h58XgCoAEC.8GoiCvyXOQA8GsVWsHWVZ3", "comment": "Thanks for the details. I was incorrectly comparing this to the first donut problem where in the sequence of bits the 1s are representation of Boxes and their position does not matter. As they indicate box separation. Do you know the solution for that issue. For example if we had 3 flavours and had to choose from 5 donuts. What are the possible combinations. similarly for n donuts from x flavours.  00000111 - one combination  00001110 - second. ...", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggwBx1IX1h58XgCoAEC.8GoiCvyXOQA8H-rHAI9glt", "comment": "Thanks for the details. This with the next lecture provides more clarity to the solution. I appreciate your help.", "votes": "0", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggEImUClkYyGHgCoAEC.8GFdF6bPcAY8GG1qYzU-oW", "comment": "Yeah, I agree with you. I always skip this insturctor's lecture and reading their lecture  notes only.", "votes": "4", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggEImUClkYyGHgCoAEC.8GFdF6bPcAY8ZhZvyXocEy", "comment": "He is Dutch, here in Holland whenever a Dutch teacher speaks English in the course, people get lower grades", "votes": "3", "replies": "", "reply": true}, {"vid": "pNt5Ll6hGqo", "cid": "UggEImUClkYyGHgCoAEC.8GFdF6bPcAY8nDf12sr_Q-", "comment": "C'mon, not a bad lecture at all. Just watch at at least x1.25, then it's got rthim.", "votes": "10", "replies": "", "reply": true}]