[{"vid": "Qfw0C0Ac-Tk", "cid": "UgymOXvhxfyHxgjKcgJ4AaABAg", "comment": "i like how even though the person at 43:53 was wrong, she later then used their answer to show how it was still important. ik it's a small thing but professors be rude.", "votes": "1", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgwPDUZ8zLlX_02on9l4AaABAg", "comment": "Mam could you please tell from which book should we study this", "votes": "1", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgzmAI5dlJw8CcdXqk14AaABAg", "comment": "I'm glad she mentioned the cytoplasm isn't an aqueous solution. I'm not sure why, but I've always assumed it was.", "votes": "1", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgwSpD4KEE-e4LSmqt54AaABAg", "comment": "Biology is FASCINATING but these lectures are so boringly taught!", "votes": "0", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "Ugw9YZp__nmKxzhMpGF4AaABAg", "comment": "(On Sunday of February 5, 2023).  On the Matter of Cell Trafficking and Protein Localization: 1) Protein (Structure and Function) Signaling and Organic Structural Physiology; 2) Cellular Tracking and Signaling; 3) Cellular Dynamics (First Signal Messaging can trigger a Cell to be Highly Movable; Lymphocyte (CD4+ Lymphocyte));  4) Cell Structure Along with Multiple Membrane Bounded Organelles (Nucleus, Rough Endoplasmic Reticulum, Mitochondrion, Etcetera); 5) Mechanism of Protein Dynamics: a) Targeting Sequencing Determining The Locus Of Activity of the Protein; b)  N or T Terminus Dependent Polypeptide Arrangement or Sequencing as Co-expressed with the Protein (Polypeptide) actually Direct Protein Transportation within (Nucleus, MItochondrion, Peroxisomes; Also the Peptidases are Specific to Certain Location and only become (Active) Compatible to Cleavaging Function when the Peptide Sequence-Dependent Protein (Enzyme of Interest) is Present; 1) Nuclear Membrane PTMs Dependent Actions through Nucleus Localization Sequences (NLSs): 1) Highly Basic Sequences; 2) Lysine-Rich Sequencing Signals Nuclear Compatibility; 3) Positive Side Chains and Arginine interact with Highly disorganized Sequences (Polypeptide Arrangement of the Nuclear Pore);  3) NLSs bind Importin and Thereafter become Admissible (So to Speak) into the Nucleus; 4) NLS Tags Allows to further Analyse this Function with Radio florescent Dyes or rather Proteins are Positively Nuclear compatible for Nuclear Activity by NLS linkage (A Mechanism of Synthetic Transcription Factors Manufacturing for Faster Hybridization in Pure Scientific Terms Investigations);  Mitochondrion Localization Sequences (MLSs) are Specific to the MItochondrion and Transportation Therein:  a) Argine(+)--Glutamine(-) Repeats Rich Sequences with Various Repeats Levels will Bind N-Terminus (Amino Site) and thereby Make transport into Mitochondrion (Amino Acid Sequence is Relevant to Cytokine Signaling in that they both Indicate a Physiologic Possibility by Binding Site [Receptor-Ligand Binding]); Protein Synthesis in the Mitochondrion (mitDNA and (mRNA Processing by mitRibosomes therein [An Inner Membrane Structure]) is Somewhat Identical to Monera's (Plasmids), but most Biosynthesis must be Imported from Nuclear DNA Encoded Protein Synthesis; b) The MLS or any other LS is Most Significant in Pathology and Medical Diagnoses of Deposition or Metabolic Deficiencies or Protein Mis-localizations (Amyloidosis, Possibly Granulomatous Diseases and Certainly any Autoimmunity disease [Antibody Binding Self-Antigen]);  c) Post-Translational Modification (PTMs) of the Protein (Allowing thereafter Protein Activity) by Reactions of 1) Lipidation is the Modification of the Protein by Carbon Polymerization (Bioinformatics Sequencing or Analysis is Revelatory of such Structure Modification (PTM-wise); 2) Phosphorylation (Bread and Butter of Cellular Signaling Chemically Wise) is biochemically active in Chemically Activation/Deactivation other Proteins (Protein-Protein Interaction Essential Chemical Reaction); 3) Ubiquitination; 4) and About 200 Other Possible Modifications That Allow the Protein Destiny Be More Definate unless Pathology is Present (Metabolic Deficiency Diseases Are a Prime Example of this Ill-Fated Fate); PhD Barbara Imperiali, es sehr gut zu Proteomiks tue aber man muss dass haette getan gewessen.  Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "Ugy13MqXdbu2eZhGZXl4AaABAg", "comment": "Advanced  I am elementary level", "votes": "0", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgxWiJEnHIvGgLMMjQ14AaABAg", "comment": "2022, and this is amazing. Thanks so much", "votes": "4", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "Ugz16Uhno-xKJ3m479h4AaABAg", "comment": "Is it a central dogma", "votes": "0", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgyMaYRUGnIlRnAI76t4AaABAg", "comment": "She is more helpful than my ACTUAL lecturers and I’m studying this topic😭😭", "votes": "6", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "Ugx4uEXwRMDp1pfL7qV4AaABAg", "comment": "Good lecture", "votes": "0", "replies": "1", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgwPvELQQfwIbrSnHt94AaABAg", "comment": "So if NLS is a post translational modification and is added after translation, then what enzyme is tagging the protien with NLS and how is the protien recognized by the enzyme ?", "votes": "0", "replies": "3", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgzHuZ8T8bXsF0_v4Xt4AaABAg", "comment": "It should be called \"protein trafficking and cell localization\"", "votes": "0", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "Ugyp0vhc0e9gjsW1zjR4AaABAg", "comment": "This is amazing stuff.  I always assumed that the biology of multicellular organisms is more complex than a single cell, but here I realize that the life inside any old cell has already a complexity comparable to a city. And la profesora has a really awe-inspiring way to explain it all in great detail, while she never seems to forget the big picture.", "votes": "10", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgzETDfdpieaEkxgCj94AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "2", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgxzYpZzMZmlxfEnDux4AaABAg", "comment": "Ur lecture is really awesome mam", "votes": "8", "replies": "", "reply": false}, {"vid": "Qfw0C0Ac-Tk", "cid": "Ugx4uEXwRMDp1pfL7qV4AaABAg.9U0Nw7olXCX9UA-iCIXupN", "comment": "My wonderful mentor thanks, mum", "votes": "0", "replies": "", "reply": true}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgwPvELQQfwIbrSnHt94AaABAg.9U0ND1I9Yec9z0Me9oSiiu", "comment": "the class of proteins which recognize the signal NLS called Importines , they see the signal motif in the peptide protein , take the protein to the nucleus and then the protein RAN will regulate after , seperating the importines from the Protein, sending the importines back to the cytoplasm then Ran will be recycled and sent back to the nucleus. Sorry the answer came late two years after but it was good question and it might help other students.", "votes": "1", "replies": "", "reply": true}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgwPvELQQfwIbrSnHt94AaABAg.9U0ND1I9Yec9z0PtVZ0sYX", "comment": "in the slides she wrote importines for example \" proteins ESCRT\" which are proteins in endomal sorting complex big number of proteins main role in protein and cargo trafficing", "votes": "0", "replies": "", "reply": true}, {"vid": "Qfw0C0Ac-Tk", "cid": "UgwPvELQQfwIbrSnHt94AaABAg.9U0ND1I9Yec9z0SSlDW6Tk", "comment": "to answer your first question : the types of PMT like ubiquitnation by ligase , these modification added after the translation , acylation by actyl transferase , phsophorylation by kinase protein , these are the main post modification translational   NLS is just a sequence in the peptide itself and it's cotranslated withing the sequence peptide so it's not a post translation modification.", "votes": "0", "replies": "", "reply": true}]