[{"vid": "QTdJiG7mV40", "cid": "Ugx9sO79wfduEfHyP6F4AaABAg", "comment": "Thank you MIT for this course! So helpful in my studies:)", "votes": "0", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "Ugzyrk7t9J21ma-TXpd4AaABAg", "comment": "The polymer protein stand carrying the Peptide carboxylic ameno chain, carrying primary genetic sequence for autonomous Operation production is missing from your Chromosome stick recount uptake. Your body collects polymer protein stand's from each autonomous system for G_nome Dna replication. Is that correct? Is the sickling caused by Iron Oxide as a Hexide Polygon bonded molecules that are imobile for renal expulsion?", "votes": "1", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "Ugz38UWRTvjfV9VEGF14AaABAg", "comment": "28:00", "votes": "0", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgyVr91dqQLPbcaaeml4AaABAg", "comment": "Great lecture, but what she said about the choice of Enthalpy vs Entropy argument IS INCORRECT. It is a bit long to explain clearly, so I am not doing that, but please do look it up.", "votes": "3", "replies": "1", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgzMJ6_wrqKiRp7Ld9B4AaABAg", "comment": "Thankss", "votes": "1", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "Ugw515ov7Q__fu0e2tV4AaABAg", "comment": "(On Sunday of January 29, 23023).  Introductory to Biology: 1) Enzyme (Reactive Protein) and Metabolism (The Collective Processes both Catabolic and Anabolic In A Homeostasis Context);  The Ideal of Substrate to Product Always Involves a Chemical Reaction (Catalytically Driven by a Protein) usually by a DNA Molecule-Encoded Protein (Rather than a Denatured, Spontaneous or Pathological Protein [Prion]); Pharmacology has the best of time with the Identification of the Protein and Processes of a Disease (Receptor-Ligand Identification) and the best of the profits in the Pharmacologic Inhibition (Although Agonism is Another Therapeutic Venue); The best of therapeutic However employ DNA-Encoded Proteins (ie Immunoglobulins [Antibodies and Recombinant Human Antibodies) and Links these with the Actual Pharmacologic Entity (The Best of Chemotherapeutics because of High Specificity and Metabolism Thereafter Yields Less Non-Targeted Toxicity).  Here too the Bonding (Non-covalent for the Links) and the 150 kDa Monoclonal Antibody (Which is the Epitome of Sensitivity and Specificity in Any Case); Enzymes and the Proteomics therein are not the same as it was 10 Years let alone 50 Years Ago; Anyway, the best to those who deserve the Optimum (Optima est Mea Imperatrix) PhD Barbara Imperiali.  Heil!", "votes": "0", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "Ugy4YSG0Tcvy5R7Ro1B4AaABAg", "comment": "ليس مجالي علمي فانا ادبي ولكن احب اتعلم", "votes": "3", "replies": "1", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "Ugzaq5Zx_ZCSfBXNVcl4AaABAg", "comment": "21:47 should be corrected to glutamic acid not carboxylic right?  18:03 I am sure functional properties of the RBCs are hugely impacted by this base pair change as well as protein interactions. Sickle cell anemia adopts a rough pushed structure compared to its normal biconcave disc structure that  largely influences a spacious surface area required for oxygen binding and transportation. Wouldnt this be hindered when RBCs beta globin is mutated forming a sickle shape and adopting a structure with a much more smaller surface area. On top of that limiting oxygen binding and transportation across the body.", "votes": "1", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgwbE52WEkBhikDjQz94AaABAg", "comment": "Is hemoglobin heterotetrameric or homotetrameric as the prof mentioned?", "votes": "1", "replies": "1", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgyaGv0MUjfDOq5nHHN4AaABAg", "comment": "does someone have the slides (PPT)? please", "votes": "0", "replies": "1", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgyyLY9Qu0r-4HKp9DZ4AaABAg", "comment": "what confused me is, Haemoglobin, isn't a quaternary structure protein?", "votes": "0", "replies": "3", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "Ugz0xI7-eeJo0Defpq14AaABAg", "comment": "Cat(cut)abolic @39, that is how I remeber   🙏  for a great lecture", "votes": "3", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgwOUD2TknrVcHTyVBV4AaABAg", "comment": "I was under the impression that Tyrosine was Polar Uncharged? Is this a point of contention amongst biologists or was I misinformed?", "votes": "1", "replies": "", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgxDxOScARFRJJhu3v94AaABAg", "comment": "Educators, when lecturing, often use labels incorrectly...homo...instead of hetero... and endo...instead of exo...! Why?  The frontal cortex consciously ‘knows’  the teaching agenda ...but on occasion the frontal cortex cannot keep up with the speed with which our ‘hidden brain’ is unconsciously sending complex motor ‘messaging’ via cranial nerves as we speak !    Seriously, the majority of educators have not done their homework regarding a) neurobiology and functionality of the brain, and b) neuropsychology and the mind...of their own brains. Likewise, the majority of educators have not done their homework regarding...How People Learn...even though the same lecturers are experts in their fields.  If you are a student reading this, learn about the above mentioned constructs. The Invisible Gorilla. Scatterbrain. The Scientist in the Crib. Hidden Brain. Why Zebras Don’t Get Ulcers. How People Learn 2nd Ed.  “There is no scientific study more vital to man than the study of his own brain. Our entire view of the universe depends on it.”  ― Francis Crick  Your learning experience will benefit from ‘it’...guaranteed.", "votes": "4", "replies": "1", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgxuviTpTmwnN6s_Jfd4AaABAg", "comment": "this series has reminded me how interesting biology is", "votes": "69", "replies": "4", "reply": false}, {"vid": "QTdJiG7mV40", "cid": "UgyVr91dqQLPbcaaeml4AaABAg.A2rBBOOJoyUA70GT0hluKs", "comment": "The way I understand it is: I guess if T=0, a cold environment is like a ball rolling in static potential, the only stable state is a local minimum of energy (H), the bottom of a potential well, with excess removed by friction. But otherwise equipartition wants to share excess energy with the environment (or in chemistry, the other side of the equation) in a way that depends on entropy, hence we need free energy. Basically, energy is conserved so it must go somewhere, rather than everything wanting to be at minimum energy. Systems with more entropy (e.g. more particles) are willing to accept more energy. For example in air, a molecule wants to bounce around, not be still. Of the many types which are just a Legendre transform apart, Gibbs free energy is chosen because its sign indicates reaction direction (spontaneity) under conditions of constant pressure and temperature.", "votes": "0", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "Ugy4YSG0Tcvy5R7Ro1B4AaABAg.9l0z4xOR1eF9qbUZCl179v", "comment": "Wow that's an amazing thing!", "votes": "0", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgwbE52WEkBhikDjQz94AaABAg.9Uj8o6hxIVQ9Wc5vxfdmYP", "comment": "I think she misspoke, and it is heterotetrameric", "votes": "3", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgyaGv0MUjfDOq5nHHN4AaABAg.9TOStN-fntV9TRtg75Lzkd", "comment": "This course doesn't have any lecture notes but there recitation notes, readings, assignments: problem sets with solutions, and exams with solutions. See https://ocw.mit.edu/7-016F18 for the course materials. Best wishes on your studies!", "votes": "9", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgyyLY9Qu0r-4HKp9DZ4AaABAg.9Sn8ezvpZm89Sn9PZmjjNa", "comment": "ok, got the answer i was lookin for", "votes": "0", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgyyLY9Qu0r-4HKp9DZ4AaABAg.9Sn8ezvpZm89ptsD0ELDuL", "comment": "​ @mohammedbleiblo3243  haemoglobin is quaternary str. Protein.", "votes": "1", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgyyLY9Qu0r-4HKp9DZ4AaABAg.9Sn8ezvpZm89pu3S9T95zl", "comment": " @Thakur_Kartavya_Singh  thanks for clearing it out.", "votes": "1", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgxDxOScARFRJJhu3v94AaABAg.9HTISbGG1pz9pd58upE93M", "comment": "hadd hoti he fando ki 🤣", "votes": "0", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgxuviTpTmwnN6s_Jfd4AaABAg.9A-sMd_XuzU9FlQkOMYDJj", "comment": "this seies have taught me how much I don't know about biology", "votes": "7", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgxuviTpTmwnN6s_Jfd4AaABAg.9A-sMd_XuzU9Wxu-i2T4yR", "comment": " @oximas  well typically the more u learn about something, the more u’ll realize how much you don’t know about that field.", "votes": "3", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgxuviTpTmwnN6s_Jfd4AaABAg.9A-sMd_XuzU9knpH4iwFbw", "comment": "Same, I forgot that phospholipid bilayers we're my favorite part of biology. They're just so interesting!", "votes": "2", "replies": "", "reply": true}, {"vid": "QTdJiG7mV40", "cid": "UgxuviTpTmwnN6s_Jfd4AaABAg.9A-sMd_XuzU9kt-DwoDAdp", "comment": "ikr! 😁", "votes": "0", "replies": "", "reply": true}]