[{"vid": "SA8dRTq3qUA", "cid": "UgwsTwH7U3JEydI_oL94AaABAg", "comment": "Amazing lecture, thank you for sharing this kind of lectures to the public.  I would like to add something:  at minute 24:34 I think it is phagocytosis, because the cell engulfs large and complex particles, like bacterial cells in the case of mitochondria. On the other hand, pinocytosis takes in fluids and solute.", "votes": "1", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgxgKo5HjO3aOC45Y_B4AaABAg", "comment": "Thank you Professor for your great lecture! and Also good to know that Professor is not Bold!", "votes": "2", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgzkAbB5Y6FBTB87ZQx4AaABAg", "comment": "(On Tuesday of January 31, 2023).  Biology and the Basic Living Unit within Life, the Cell: 1) Heterogeneity Therein (Cell Morphology and Typification is Multiple); 2) Kingdom Differentiation by Membrane-Bound Nucleus and Organelles:  a) Prokaryotes (Bacteria and Archaea); b) Eukaryotes (All other Kingdoms including Animalia and Humans); 3) Genomic DNA Dependency for Information Preservation by all Kingdoms; 4) Cytoplasmic Membrane Permeability (Ionic Na+, K+ and Ca2+) and Processes therein of 1) Endocytosis; 2) Exocytosis; 5) Mitochondrion (Plural MitProkaryotes", "votes": "0", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgzNFFNq6lJpwq2KIdJ4AaABAg", "comment": "Tough crowd - the funeral joke to start off was solid", "votes": "23", "replies": "1", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "Ugx0JG8teWTaXyBlKLB4AaABAg", "comment": "Critical problems of the membrane physiology of a living cell. https://youtu.be/OCqbYdItfvI \r Neovitalism of the 21st Century. What does it mean? https://youtu.be/mEGU-AnbRuA\r The great basic question of cell biology. https://youtu.be/DBoUTwT1YVA", "votes": "1", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgyvMwSvN8l12RVTBWV4AaABAg", "comment": "Did he bring the cap for that purpose only?", "votes": "4", "replies": "2", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "Ugx8tndhZxgUze-Izvp4AaABAg", "comment": "Which book to follow for general biology?", "votes": "3", "replies": "1", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgxWjD99w46XnmE8PwV4AaABAg", "comment": "Thank you for making these available to the public, they are great lectures!", "votes": "13", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgyDpGeF8wjWRljDfEB4AaABAg", "comment": "Membrane voltage diffy maintain... hydrophobic head.... It's like a flexible..depends on density charge... ?cell wall. Endo xo cyt Ctcl....eat malignanat t cell thingy Engineering issue? Mtdna matrix...mom? De Novo...from nothing? Old Ancient..bacteria intaking ..vesicle? And then mc lost it to nuke Er dissects mc Cytoskeleton Meiosis...mitosis.. Bacteria...circular dna We linear Chromosome...?..dna  Lysosome peroxisme Cytoskeleton..like bone? Made of fibrils?... microtubules have nucleues? Seperate chromosomes....... Depolymerization Pulling force Chromosme split....pulled to ends...  Malignanat t cells......size difference.", "votes": "1", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgwSVCQlrxRoF9Rcry94AaABAg", "comment": "So good to listen and watch! Does anybody know why microtubules are more efficient in pulling than pushing?", "votes": "1", "replies": "3", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgwTo6qyfyuFpK0Az0Z4AaABAg", "comment": "Wow!!!!!!!!!! 🙏🙏🙏🙏🙏🙏🙏", "votes": "2", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgxC1CEo2NQi2eVYbzl4AaABAg", "comment": "Thanks and love from india", "votes": "4", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgyBIfOjoXx_xTiR5Dx4AaABAg", "comment": "me coming to see reaction on comments when prof did push ups .....😂", "votes": "3", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "Ugx2rtJaYD5kNzDU8nh4AaABAg", "comment": "My opinion: too mixed and oversimplified and thinks many subjects are \"boring\". He has to prepare his lesson making the subjects not boring but very interesting! Wich they are!", "votes": "3", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "Ugw96GYcapP2QI6AnS14AaABAg", "comment": "29:25", "votes": "2", "replies": "", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgzyskqfbNPlbq0v1l54AaABAg", "comment": "21:42 Oh my God. If my professor would do this, I surely would laugh.  I love the way Professor Martin teaches. It's funny and easy to understand.", "votes": "15", "replies": "1", "reply": false}, {"vid": "SA8dRTq3qUA", "cid": "UgzNFFNq6lJpwq2KIdJ4AaABAg.9gTquChwr8J9jrRKQ02GRZ", "comment": "Exactly. However, my experience from teaching 20 years in auditoriums is, that you first have to engage the student and make a connection relatively slowly (\"what are your backgrounds, what are your expectations, tell a little joke first etc\") before students are comfortably enough that you can make them laugh using\"dad-jokes\". If you just enter with a funny hat, it takes \"professional stand-up quality\" to make them LOL right from the go.", "votes": "3", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "UgyvMwSvN8l12RVTBWV4AaABAg.9doRthts8R4A-ycKtoUusA", "comment": "to add color to the lecture, it's only positive, people pay attention more & learn more and feel better", "votes": "1", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "UgyvMwSvN8l12RVTBWV4AaABAg.9doRthts8R4A0bBSxcwhgd", "comment": "😊​ @julius333333 ", "votes": "0", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "Ugx8tndhZxgUze-Izvp4AaABAg.9dYxtrFL0MC9dcftB8jto7", "comment": "All readings are from the required course textbook: Sadava, D. E., D. M. Hillis, et al. Life: The Science of Biology. 11th ed. W. H. Freeman, 2016. ISBN: 9781319145446. See the course for more info at: https://ocw.mit.edu/7-016F18. Best wishes on your studies!", "votes": "5", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "UgwSVCQlrxRoF9Rcry94AaABAg.9WCMDRTwlzG9ZpbTab8Qj1", "comment": "Pulling is easier than pushing 😆", "votes": "1", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "UgwSVCQlrxRoF9Rcry94AaABAg.9WCMDRTwlzG9osIm09ZRn-", "comment": "He said it shrinks, but disassembling means tearing off the biopolymer. I need a more detailed mechanism for this force-generating apparatus.", "votes": "1", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "UgwSVCQlrxRoF9Rcry94AaABAg.9WCMDRTwlzGA1aTy9Zq9Yi", "comment": "Yeah. We figure without the specific molecules attaching to the area on the centromere, or other protein, that it is a charged bonding, but diminishes when the microtubule is disintegrated. Or, that ATP....> Adp is involved repeatedly continuing to charge/ hold the bond until the atp mitochondria are insufficiently produced. This would suggest that a surfeit of energy is necessary for a cell to split.  Ionic.  But never so simple - all those Krebs cycles are complex enough to maintain a consistent operating threshhold. Yet, cycling is a characteristic that allows for a circadian or other temporary optimality, with accumulation periods.  Cycling is a phenomenon that seems characteristic of life at allscales, as well as being niversal in physical universe, a characteristic of complex, system, as chaotic systems even exhibit occluded cycling, until addition or subtraction of energy bumps any system into different, but rather cyclic states.  This occurs even in mathematical equations with 3 or more independent variables.   There is no stasis in the universe. Stasis is an illusion fabricated by brains sensing scales of sufficient difference that motion, exchange of energy, is not useful insofar as a brain shaped by evolution to give attention to scales affecting the organism.  Inutility for trivial changes wouldn't be selected for as worthy of enough attention to form predictions from memory and macrosensory novel experiences.  I mean, to make simulations that matter, any brained animal has to distill, analogize, imagine some analog that imitates something worthy of paying attention to. We live in these heuristic fictions.  Science is the only generalization that must be internally & externally consistent, demanding replicability to be accepted, continuously. I suppose that includes swinging clubs and shooting projectiles.  There was no \"him\" going to be buried. It was already other things eating what he was, suppressed a bit by embalming chemicals.   We just usually don't get to see our friends bloating up with bacterial exhaust gases, and being et by things large & small. ( i do, and i like vultures because they, like us, eat the dead, turning them i to themselves.  I really loved being with a wolf who did that, until it happened to him, just as it will happen to you & me! We become part of something else, for a while, & then, something else. It was fun petting fossil rhinos and sabertooths, imagining living as them 30 M ya)", "votes": "0", "replies": "", "reply": true}, {"vid": "SA8dRTq3qUA", "cid": "UgzyskqfbNPlbq0v1l54AaABAg.9D_MCKS_jy39PN4bjNu8SV", "comment": "Why it's funny😭", "votes": "2", "replies": "", "reply": true}]