[{"vid": "SIOQgY1tqrU", "cid": "Ugy61HTrQfnKEj5o01t4AaABAg", "comment": "Lewis Amy Wilson Barbara Jones Anthony", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwvK437FDtlAADEzN14AaABAg", "comment": "Lee Susan Williams Carol Lopez Patricia", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwcgq9-xTQ_q-PL1hd4AaABAg", "comment": "Anderson Jose Young Kenneth Hernandez Christopher", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxHRfzEz5rmZ6KVvjt4AaABAg", "comment": "Martin Kevin White Jessica Wilson Jennifer", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwhD2CIXV3oEFOjLbV4AaABAg", "comment": "Robinson Edward Jones Robert Martin Linda", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxsOu7aBio-cDuS8nV4AaABAg", "comment": "Garcia Kimberly Hall Thomas Allen Donald", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwvDRs5CoidUgXhjGp4AaABAg", "comment": "I listen to his lectures when I cook and shower. I have autism and this makes me feel normal. Thank you for enhancing my life. I feel good when I hear this video.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwqMI7QAkmD_OjAbPd4AaABAg", "comment": "Lopez Michael Lee Kenneth Allen Barbara", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyyL2AUhBiiGzvmuuV4AaABAg", "comment": "i took sign language class, i forgot most of them, but it's wrong to say it has nothing to do with lips and tongue. in fact, the mouth movement is far more essential than the hand movement. you should consider the hands and the facial expression as merely something to help tell apart similar mouth movements. you can't communicate with your hands moving but the mouth shut because so many words share the same hand movements whereas you can with your hands down but mouth moving.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwHk9SfEBiunYruc8l4AaABAg", "comment": "1:36:00", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzC1hiOjpTa-6NcQbt4AaABAg", "comment": "1:07:10", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyylXNYviu9HOjGzCB4AaABAg", "comment": "21:00", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzU5GgXIDQz6zRda1h4AaABAg", "comment": "1:39:58 no mutual collaboration.   Would have made a major difference.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyTb2iPtwsaHstc4f94AaABAg", "comment": "1:00:12  this is interesting which leads me to ask about strokes when it happens.   Is it factual that majorities experience the left side of their bodies being affected?  Are their statics on this happening left vs right side effects?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx478NlcObraKowNpJ4AaABAg", "comment": "What did the girl say who knew the “pasteurised milk” sign?L around 14:00?", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxaU276ugkQMGSCB-14AaABAg", "comment": "Prosody: tone of voice and concerted aspects of demeanor (11:30 stillshot)", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzyOZqXMl8fhUzDCzx4AaABAg", "comment": "😱🫶🏼😱", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyustYYPL1eRxOtDEl4AaABAg", "comment": "#bagelguy", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyBIpckO-Z1qbEPqiZ4AaABAg", "comment": "I wonder why he doesn't want the last two lectures to be taped?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyEFFYIY3qhC9zS5W54AaABAg", "comment": "14:00, love what he said about the deaf university Gallaudet .. my brother is deaf and attended, it was amazing to see the unity , fluidity and growth of the culture without being hindered by hearing people in the normal world 😂   Growing up with a deaf brother has shown me exactly what this professor is teaching. Language is t just verbal/audible , it’s largely body language and facial expression. It was difficult for me as a hearing person raised with ASL to assimilate into regular western society due to the nature of hearing people being quite non-expressive in general. I perceived the world as a very unfriendly place coming out of an exuberant deaf culture , which was then taxing to my mental health. It’s been my life’s journey to learn the differences and affects of language barriers. Most notably my experience drove me to insanity trying to balance communicating to my deaf brother simultaneously translating to the world around me whilst developing in my teen years. I was constantly aware of how loud we are as a population, and if we used body language correctly we would be a more peaceable species. I became quite isolated in my adolescent due to overwhelm in the school system and in various jobs. But this lecture reminded me of the impact this situation has had on my life enough to give myself a pat on the back for even attempting to face such an unfriendly seeming world . Now I understand Perception forms your reality .", "votes": "0", "replies": "4", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx478NlcObraKowNpJ4AaABAg.A3WZT6hxa_OA5mn2UURu1P", "comment": "Past Your Eyes  - it's a pun with sign language", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxaU276ugkQMGSCB-14AaABAg.A2g6laRdwmzA2g8qa98L1X", "comment": "18:03 damage and uni-lateral jugular-shot of anaesthetic", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyEFFYIY3qhC9zS5W54AaABAg.A0zLLclaQ5lA0zNy7u87J2", "comment": "The story in the bible about the Tower of Babel.. how God confused human language to humble them, is my favourite because I have seen it so evidently in contrast to the deaf community versus hearing.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyEFFYIY3qhC9zS5W54AaABAg.A0zLLclaQ5lA0zOQJPzdT-", "comment": "It is true that if humans could communicate effectively  cross culturally, we would be too clever for our own good. There is a humility and beauty in language barrier, which reveals to humanity our need for each other.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyEFFYIY3qhC9zS5W54AaABAg.A0zLLclaQ5lA0zOUFUww3m", "comment": "ASL is the best language and communication style, I believe, for trust building and emotional revelation.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyEFFYIY3qhC9zS5W54AaABAg.A0zLLclaQ5lA0zPB0GFbOE", "comment": "Another issue I struggled with while transitioning from ASL in my nuclear family structure to belonging in larger society is that I was perceived as arrogant or aloof because I would stare at before prior to the conversation in order to read their body language - a custom of the deaf community . Also I was perceived as rude because I would overuse body language such as pointing or facial expressions that could be translated as condescending to a hearing person. In our culture its typical to overuse facial expression if we think the person we’re speaking with is unintelligent- so as to overcompensate for a lack of verbal understanding. I now realize that this is why at the age of 27 having had 25 various jobs not being able to hold one down, and feeling burnt out and exhausted is largely due to this interpersonal problem. Very sad to think at the time, I didn’t consider mentioning I had a deaf brother or that I was raised with ASL, as this would help others to understand my mannerisms.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzM4e7l9qiIBqHqRdN4AaABAg", "comment": "I would argue that language is a form of control. It certainly controls what the mind thinks.", "votes": "0", "replies": "4", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwkpjmcZEG8lfoOR494AaABAg", "comment": "Why isn't there the lecture of biology of religion?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxUIvyHsMy6G5M5mjp4AaABAg", "comment": "At minute 55 The idea that new languages are invented by kids. Immediately it came to mind. CS Lewis inventing elvish which a lot of adults and children then learned. In more recent times the Star Trek franchise invented Klingon which some folks speak.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxnDs5CpVK6H0vDHLR4AaABAg", "comment": "ne vous rapppeler du crime comis a staford", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzvCcytQUAiqLXKWGB4AaABAg", "comment": "58:25 - languages are made and shaped by the young. the old rarely pick up on the changes", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw4PpgYsQRicaaKlVp4AaABAg", "comment": "TY, VM", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwenBSysR839w7yIDF4AaABAg", "comment": "Nope, Dan Everett has shown the Piriha don't have reversion. This is the newest theory. They have no future tense and no past tense, no numbers, no colours, no god.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz16zEt34CPUogJknx4AaABAg", "comment": "Sorry, Professor Sapolsky. The Pideha in the Amazon (cf. Dr Dan Everett) have no god, no numbers, no colours, no recursiveness, no future tense, no past tense. They never talk about the future or the past, because they weren't there to see it happen. They're very happy, some of the happiest people in the world. Hunter gatherers in a very abundant environment, they spend all day having sex with other peoples' spouses, drinking and lying on the beach talking with their mates.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwNXkAiERrGaquRSfl4AaABAg", "comment": "+ how many times did you watch the \"pasturized milk\" part?  _ yes!", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxPsp9B7Dt5eJqR0bB4AaABAg", "comment": "🎉Who was the king that killed all those first-born children? 😮\"Probably, there were scores, scores of kings, I say.  There are pyramids, even casinos that boast immortal names.\" 🎉 the pseudo us who names of the deed and took the blade.  Like fire birds in Daniel, and the veins in James, all those dead-gone children. SHOW US THE NAMES.  1:07:57.  Sous-peer what?  An supeer ❤ wharf-mind group?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxf83nZS7xsUf2tm914AaABAg", "comment": "Nor kinda, sorta, you know.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxHeS_rZ698v1iHYW54AaABAg", "comment": "Sapolsky is the best lecturer ever", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwqN8Xy6CjcsZt39QV4AaABAg", "comment": "1:08:45 translated it goes one two three four five bout'a few. But language is a tool, and knowing how to ride a bike doesn't teach you how to drive a motorcycle. Hence it's all about the possibilities of exposure.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwsXGSNtHQTR3KXQnJ4AaABAg", "comment": "Imma name my daughters Alexia and Aphagia", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgztUOpUCXvibnezQ1h4AaABAg", "comment": "Man, that ape speech arc of this lecture was a rollercoaster! I was really rooting for them being capable of actual language in the end, but it sounds like that's most likely not the case. I'm gonna have to dive into this more to see what eventually became of that bonobo chimp Kanzi and the research surrounding their speech.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwTtVyXVWo5lkBO3bV4AaABAg", "comment": "أنا بعرف اني محكي عربي ..او عم اكتب اعربي او يمكن عمفكر بالعربي ... رغم اني استاذ انكلش ... و رغم انو انا  لاشيئ بين العقول الي علقت بكل  صدق... بس دايما اللغة الاولى هي القلب خاصة اذا بدك تقدم شكر من قلب صادق و دايما كنت قول في مطارح بحياة الانسان كانت ولا زالت عاجزة اللغة عن وصفها خاصة اوا بدك تشكر انسان من قلب صادق متل الدكتور هاد . مهاجر سوري مر من هنا و حب يكتب شي بصدق.", "votes": "7", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3Tno23L7WbZTtiMl4AaABAg", "comment": "good work", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxZ9Kahk4LPFTw84K54AaABAg", "comment": "I genuinely love that Dr Sapolsky gave that history lesson on lanuage in primates despite the fact not much knowledge was gained from it. Entertaining all the same", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw_DzszDKS_9GXruVV4AaABAg", "comment": "Globalization has deteriorated the diversity of language according to the professor.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugws4vJ2ccxuFErqBe54AaABAg", "comment": "I live in Cambodia and I infantalize all the children here because they are so cute, though they all think that old foreigner man is crazy.   I just tell them they are a good boy or girl in both languages and to be good in school", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzM4e7l9qiIBqHqRdN4AaABAg.A0aHF3Jwa1AA0aHNcXfmDm", "comment": "Regardless of whether or not you agree.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzM4e7l9qiIBqHqRdN4AaABAg.A0aHF3Jwa1AA0aHYXZlgbL", "comment": "Language extends far beyond our capabilities.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzM4e7l9qiIBqHqRdN4AaABAg.A0aHF3Jwa1AA0aHbJ6y5i7", "comment": "The planets are talking to the sun.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzM4e7l9qiIBqHqRdN4AaABAg.A0aHF3Jwa1AA0aHtGZdrHQ", "comment": "The only way to visit one is to speak the language.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugz16zEt34CPUogJknx4AaABAg.9zD8ceriPJx9zjjAbwIrwC", "comment": "Bro chill, you ok? need a beer?", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwsXGSNtHQTR3KXQnJ4AaABAg.9wNFbcNPVlX9zjjJH_FOov", "comment": "that's a fantastic idea, I'm going to steal this", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzdvJvAiWlfBm-BgQV4AaABAg", "comment": "the lecture on religion is missing from the stanford playlist...", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxcgCRfQ68tI41Ylyp4AaABAg", "comment": "14:41 neurobiology", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6PgWC2LEAcZy7tNB4AaABAg", "comment": "I would love to know Mr. Sapolsky's thoughts on these subjects in context with ChatGPT.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyo45TaCOi7XShl89J4AaABAg", "comment": "Great guy to do time with.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyFOa5E3GJwZrIh2N54AaABAg", "comment": "People speak baby talk to pets because pets (especially dogs) have evolved to be proxy-babies.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzLxq4V-ZBjDW2GuOZ4AaABAg", "comment": "about non-egocentric languages, in Ukraine we're kind of both, but an example is \"вгору\" which means ↑up and literally translates as \"in a mountain\" and we have a word \"додолу\" which means ↓ and literally translates as \"towards a valley\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxSIXsPD9ZPCcnS2dd4AaABAg", "comment": "It distresses me that someone as brilliant and perspicacious as Saplsky has to pay attention to the likes of Chomsky. Both ideas he attributed to Chomsky--the quantification of unit words and recursion--are not only demonstrably wrong but catastrophically so, revealing Chomsky's structure is a house of cards and not at all realistic.  More Chomsky halfway through. Skinner's idea of behaviorism is woefully inadequate but probably something that does affect language. Chomsky's ideas were so bad they kept linguistics behind for a quarter century. All this got fixed with cognitive linguistics by the early 1990s, but neither Chomskyites nor Skinnerians are any longer part of the party.", "votes": "0", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxd0tKKlPCA7d_ntDd4AaABAg", "comment": "Give yourself 1month to forget about drawings you made today. And you look at them pretending to be a stranger. Refreshing self examination is the best tool for self discovery. Knowing yourself is the best treasure. Let’s go established presumptions.  Be open to all solutions.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxnGHW6FjngM9CYAdR4AaABAg", "comment": "Take a shot every time someone coughs lmfao", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzqE5Ku4HX_ux-NFPh4AaABAg", "comment": "Had a concussion by baseball and when the coach was driving me home, he asked me for directions, and I was surprised as everyone in the car when halfway home tried to say, “make a left here” and just wordless sounds came out.  As far as can remember, understood what others were saying and knew what I wanted to say.  Nice to now know what part of my brain was messed up.  Had to just point for the rest of the ride home.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw0PkBWQK_BcZ0TGpx4AaABAg", "comment": "People watching this because they have an assignment for college..  me a construction worker with nothing more then a high school education watching this because it’s interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxxHZoHrzqV0NINAqN4AaABAg", "comment": "1:03:03 A pipe falls from the ceiling", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyFbHY07qVl3RJEbJ94AaABAg", "comment": "Hi. Phenomenal lecture as always. With regards to accents in deaf people, they do occur. My stepfather’s parents were both born deaf and used BSL, and when his mother was signing and vocalising the sound of the word she wanted to say at the same time as signing it, her voice produced those words in local, Northumbrian, accent, despite her never actually hearing the words.", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzOkjyajyWTOGUjY7N4AaABAg", "comment": "1:00:00", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxoWl1ZPYv_IPGgeCR4AaABAg", "comment": "Given that light is mitigated by moving through the Iris Human eyesight be in fact be default in/by nature  These are some very impressive Stanford Lectures, Do be aware, however, many people in the audience may have more sloth like explanations for Biology  Many people in this world are already agitated by  start of the normal day, thus - many of the lectures centered around mental conditions may be taken by many as threatening.   Personally, I urge everyone to remember that Youtube is an artistic platform and should not be taken to literally. Remember to have a good day. x", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwGxFc39CHEH-JcTXt4AaABAg", "comment": "Lera Boroditsky was born in Belarus. In the USA since the age of 12. Professor of Cognitive Science at the University of California, San Diego.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwdZVcyHHJurTaZ_Rh4AaABAg", "comment": "Amazing lecture oh my fox my favorite so far !!! It was so fun", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzE4akuErFyjtRPDNR4AaABAg", "comment": "Why would there be a finite number of words?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyuzgddyew-lCCFuWR4AaABAg", "comment": "Just for clarification: both the primary motor cortex and Broca's area are found in the frontal lobe with Broca's area just anterior to the premotor cortex. Just in case anyone else was thinking the same thing.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw-8fYGefbVRO3HpYZ4AaABAg", "comment": "Dillon E.T. enters the lecture hall, excited to listen to Professor Robert Sapolsky's lecture on language. As he listens, he realizes the significance of language in creating compelling and engaging characters for storytelling.\r \r \"Excuse me, Professor Sapolsky,\" Dillon E.T. says, standing up in the audience. \"I have something to add to this discussion.\"\r \r The professor pauses and nods, inviting Dillon E.T. to speak.\r \r \"As a time traveler from the future, I have created a method called Composing Simulations,\" Dillon E.T. explains. \"It is a method for creating dynamic and complex characters for use in storytelling. It involves identifying a story, defining the character's qualities and motivations, adding story elements and other characters to the story, and using an A.I. to compose the character's story.\"\r \r He continues, \"Language is a critical component of character development in storytelling. The characters' personalities, emotional intelligence, and moral values all affect the way they communicate with each other and the audience. Through Composing Simulations, we can use language to create compelling and realistic characters that resonate with readers.\"\r \r Professor Sapolsky nods thoughtfully, recognizing the potential of Dillon E.T.'s method in the world of storytelling.\r \r \"Language is a powerful tool that allows us to communicate with each other and with other species,\" he says. \"And Composing Simulations provides an innovative way to use language in creating dynamic characters for storytelling. It's exciting to see how language and technology can intersect to push the boundaries of storytelling.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzdvJvAiWlfBm-BgQV4AaABAg.9uwZKL1PjVG9zjjXiP1VcR", "comment": "you can find it (or at least an older version of it) by searching for it on it's own. I guess it was just to controversial for the official Stanford channel lol", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxSIXsPD9ZPCcnS2dd4AaABAg.9snQf9qxFIN9zjjwe_KYEI", "comment": "I have very little knowledge or training in linguistics, but I've read Chomsky and I thought it was somewhat coherent. If you could direct me to some sources or thinkers that explain why his view is wrong, I would greatly appreciate it!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxSIXsPD9ZPCcnS2dd4AaABAg.9snQf9qxFIN9zjp_7gyJLx", "comment": " @rodriguezelfeliz4623  George Lakoff, Women, Fire, and Dangerous Things, and Construction Grammar and its Application to English by Martin Hilpert. Also for the history, The Linguistics Wars by Randy Harris. All have videos here.  Chomsky's stuff is admittedly seductive, but it's just a toy. It fails catastrophically at a low level of complexity. It simply cannot, for example, handle \"There's Daddy,\" perhaps the first sentence many kids learn, in any sensible fashion.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxSIXsPD9ZPCcnS2dd4AaABAg.9snQf9qxFIN9zkaHjs-gz8", "comment": " @deadman746  thank you very much! I'll check them out", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxnGHW6FjngM9CYAdR4AaABAg.9q9qAs_iAIN9vXErQ9CiBE", "comment": "can no longer follow lecture.  now subhuman", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyKWSanxYifrswt3P14AaABAg", "comment": "52:40 THANK YOU", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyc8FHClJmrxkJtk3l4AaABAg", "comment": "1:01:50  thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyUVzyjvpRze3q37it4AaABAg", "comment": "First time I have ever listened to this professor.What a remarkable man.He is undoubtedly a genius in his field.What a privilege to be able to listen to him.What is so obvious,is how humble he is.I admire him!!!! Michael Einkamerer from South Africa.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwqIQIRMFWPXviaFJN4AaABAg", "comment": "these lectures are pure gold", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyhNkbOkfJ1Sf38Ygp4AaABAg", "comment": "20:25 Great disclaimer on the WADA test, I think its better to brain-scanning people than using anesthesia in half of the brain but people still love barbiturates", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy47fLmTlbZuXMfeLx4AaABAg", "comment": "I'm obsessed with the 2 lectures that won't be taped... please if someone can get them I'd be grateful. the 2 lectures are:  - Depression & Biology of religion", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx_0wCAwKMrrabmViJ4AaABAg", "comment": "Helen Keller's epiphany in realizing \"the word, wawa, meant the thing, \"water\" took her from rotely reciting words that she had learned to using them as TOOLS. If we should consider language as a technology, what new understandings might emerge regarding brain structure and organization?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxAsaw_MK-MZPQ_gj54AaABAg", "comment": "I love these lectures.", "votes": "5", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxNM3MbFv_CVY8Mo-t4AaABAg", "comment": "0:58 Playing DeBussy.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyfvJVcnj308jvqDNt4AaABAg", "comment": "CAN A COLLEGE STUDENT REALLY \"ACQUIRE\" A PHENOMENAL VOCABULARY OF 60,000 WORDS? At 47:00, Prof. Sapolsky emphasizes the explosive acquisition of new words by children. \"By college, a typical person has a vocabulary of 60,000 words...There is an innate drive towards language acquisition.\" This number floats along the waves of demonstrating that kids are able to generate structures of grammar they have never learnt or encountered before, i.e. 47:55 \"They are constructing rules out of imperfect, partial examples...You can have statistical learning.\" At 48:12 \"You can pick up the rules from statistical patterns.\" This is the key Chomsky argument. Still, this seems more aimed at generating constructions, rather than generating words. Generating new words is not as easy. There are a few ways that can generate new words by using some simple rules. For instance, from grammar, you get grammatical, perhaps grammarian (?), ungrammatical, grammatically, etc..But that does not get too far, here in fact you’re just deriving variations on the same basic word, not acquiring a new word.   The number of \"60,000 words\" at college level seems simply a rhetorical exaggeration to make a basic point, not a scientific result. Even if you imply passive recognition and understanding in listening and reading, rather than active acquisition and  use in speech and writing. Note that a taxi driver can get by with 50 to 100 words, ordinary daily life requires at most a few hundred words (if that many). A college student may get by with 1,000 words, and that is already a huge number. Only a small % of the population is called upon to use a wide variety of words. Mainly professionals of language, who use it all day long: writers and speakers: lawyers, politicians, diplomats, orators, journalists, teachers, academics, comedians, preachers, etc. — perhaps 10% of the global population. Their children start life with a huge linguistic advantage: They are exposed from an early age to the richer vocabulary and advanced sentences of their parents. Note, in the same vein, that Prof. Sapolsky's father had been an academic professor, a historian of architecture — an early mentoring support that must have given our learned Professor an early stimulation and continued guidance for developing his own passion for using words.   A top professional writer with many known books to his credit may use up to 5- 6,000 different words. The Belgian writer Georges Simenon is famous for having written 500 books using only (computer count) 2,500 words. A similar statistic could be set for science writer Isaac Asimov, also with 500 published books under his pen. The Authorized King James Version of the Bible uses 12,143 different English words for a total count of 783,000 words (or about 1.5%). Milton reaches that level of 12,000 different words. And Shxpr is alone in his class, with a never-equalled use of about 20,000 different words (ignoring the easy variants of the same basic word), according to David Crystal, in a grand total of 884,647 words. Of those, over 1,700 words were the first recorded use in English, although many of his creations didn't stick. In terms of creating new words that have become accepted \"neologisms\", radically new words accepted in the common language,, Milton is the top generator in English with 630 words added to the body of the English language, against Ben Jonson with 558, John Donne with 342 and Shakespeare with 229. But \"acquiring\" (whatever that means) 60,000 words? As a college student? Not in your wildest dreams. A wonderful exercise could be to just scan all the 27 lectures in Prof. Sapolsky's course presented here by Stanford on YouTube, and thanks to the subtitles, count the different vocabulary being used. Then add to the review the words in his 6 or 7 books, and count again. No need to include the public lectures, or various articles, as they practically use all the vocabulary already recorded in the lectures and the books, and would add only marginal new stuff. So what would be one good estimate of the total different words? 5 to 6, 000 words? That would already be pretty sensational. True, you could argue, Prof. Sapolsky certainly \"knows\" many more words passively than the active vocabulary he's used in his lectures and writing. Granted, but then, as a wild stretch, twice as many? As a (generous) guess, say 10 to 12,000 total? Perhaps. That, in our pleasant flight of fantasy, would put our Stanford Professor in the Milton and Bible class. But, still, no way ever to get to 60,000 words. And we're no longer speaking of a college level here, but of a passionate, unstoppable, full-time, expert professional word user.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxi0HMLUzIcfW_B6v54AaABAg", "comment": "At about 52:30 he talks about teaching kids how to speak a language and describes it as sitting next to a child and teaching it to use sentences. I come from another cultural background (Ukraine), so I'm really wondering - is that common throughout the USA? Do people in UK do that as well? Non-english speaking countries are also welcome to answer. How often and for how long is it done? He looks surprised that other cultures don't do it and that's a recent (1000 years) invention of a western civilisation. However I've never heard of anything like that. Can someone provide me with more details on how it is done?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxsnr509ozIzf6f1s14AaABAg", "comment": "mandela effect be wilidng i really thought there was a depression episode and it was close to the 22  video", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz-HRGmD2e56j3Gd7R4AaABAg", "comment": "Bravissima! to Abigail Nichols for showing the way. An OUTLINE OF CONTENTS should figure at the top of each lecture, as Abigail did for this Lecture #23. Language. Such an outline inserted in the introduction in SHOW MORE would immeasurably add to the use of each lecture. It would considerably facilitate the search and locating of a desired segment in all those 25-27 lectures. It is  highly surprising that the good professor SAPOLSKY never thought of it before. It would be pretty easy for him to instruct some of his graduate student-assistant to add such OUTLINE OF CONTENTS to each lecture. We can only hope he will agree with this suggestion, hear our message and act on it ASAP. It is not too late. The whole world is using this famous set of lectures as their introduction to the wonders of neurobiology and the mysteries of behavior. Everybody would benefit from this new feature, so obviously needed and until now so incomprehensibly neglected.  ROO BOOKAROO, Nov. 2, 2022", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzCQ1IEgq3H7TrEzz94AaABAg", "comment": "6:11 What about kanji? There is a non-arbitrary relationship between the symbol and the meaning", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxYeqdSoxsOkGoSg9F4AaABAg", "comment": "Biology of religion (\"not taped, for a number of reasons\") sounds interesting. I would love to hear how religion is considered related to evolution. Any notes from that lecture that can be shared or maybe a list of literature for that?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxAla-YPTllkeDUwS54AaABAg", "comment": "Notes of this series was shared by someone in comment section which I lost, kindly post the link again to download it", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz-WBU833kfM25R3pF4AaABAg", "comment": "these lectures are the BEST thing on the internet !", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx2m5r4x9ZuOOjiSOF4AaABAg", "comment": "1:18:40 humans trying to talk to apes", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgylHftSsafWqUMECRt4AaABAg", "comment": "Just bought \"Behave\" Looking forward to reading it. Love it so far.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzXbSuyD_NBYem_k0p4AaABAg", "comment": "Schizophrenics who are born deaf will \"see hands\" instead of \"hearing voices\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy47fLmTlbZuXMfeLx4AaABAg.9kp0DLdlhKu9zjkbLMcZMr", "comment": "You can search for them on their own. The religion one that's up here is a bit older, but it's great. Regarding the depression lecture I have not been able to find it, but I think there's one talk/lecture he gave (though not in the same format)... I think it's called \"depression in the US or something like that\". Hope this helps and is not too late!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugz2q78amw6LHgaqLIt4AaABAg", "comment": "I found this guys wonderful lectures on accident when i fell asleep with my headphones in a couple months ago and woke up to having a dream I was skydiving with a talking pig and monkey, & it was because of this 😆. Now I think I have listened to almost all of his lectures!! Loved the one about the butterfly effect and fractals!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgymHILUqV5XE9GfYDp4AaABAg", "comment": "46:31  That is not language .That is rules of language expressing", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxch2unm44VYHO2fJl4AaABAg", "comment": "hahahahahaah Chomski  Communist that defends Capitalism  .Hahahahahahahahahahaha", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxtPc53skGFlo7Qdt14AaABAg", "comment": "35:11 '' Something that child never heard''!!!!!!--------------------Or , YOU THINK , that child never heard!!!!!!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwOUz013879vK7ZmVl4AaABAg", "comment": "I'm surprised that he didn't talk about Alex (Animal Language Experiment), the African gray parrot.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyhIvtliGMadmPloZ94AaABAg", "comment": "Gee, I never thought one day I would laugh out loud in a neuro-biology-lingusitic class. This guy is a legend.", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwb6nonkxAYAtFwPx54AaABAg", "comment": "🙏☀️♾🖤", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyJP8Z3kae_qSPUbaF4AaABAg", "comment": "1:30", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzaUK6otrmbAG_RFmB4AaABAg", "comment": "What a great mind. Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyd4BYeRfTb82ZHrlF4AaABAg", "comment": "I’m from Brazil. Came to the US 20 years ago . Unfortunately didn’t have a chance to attend college . I’m so into science , specially neuroscience . I’m so grateful for these vids you have no idea how important they’re. Thank you very much for sharing all this knowledge.", "votes": "23", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxL03sVNs148w2xuN54AaABAg", "comment": "animals do lie, my cat deceives me all the time", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxU0AZLXlMGWKDd8CV4AaABAg", "comment": "how apt to forget word salad during this language presentation lol! also, did what he predicted about brain imaging replacing the anesthetizing of the brain hemisphere turn out to be true?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6qI8TuV0Tk1DFV_V4AaABAg", "comment": "this guy is my childhood hero. Wouldn't want it to be any other way.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy4PGa7uIs_rZBvKNF4AaABAg", "comment": "Thank you, Dr. Sapolsky and Stanford Univ.! I really enjoyed this lecture.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxyoN95ce9S3aNAbAt4AaABAg", "comment": "Is there a test/quiz we can take to get credit for this?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxaBPMyEuzdygRr1CR4AaABAg", "comment": "45:00. Intrinsic motivation. Explore and play. Fun to learn and figure out things without external reward or motivation.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzzb5_WA5eocdZka1h4AaABAg", "comment": "What is that meaning?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzaLPZWEgxR2y6EbJt4AaABAg", "comment": "Jobvites 5", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6lS_DAIDs4KhyOeJ4AaABAg", "comment": "Were the last 2 lectures taped? He said this at the begining and I seriously hope that isn't true. I dedicated alot of time to hbb in and out of the lectures and loved this journey. I hope I don't get let off unfinished.", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyP7upAt5MAczVgcwd4AaABAg", "comment": "great", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6lS_DAIDs4KhyOeJ4AaABAg.9bJDtca7h_g9cclQMlfzVM", "comment": "https://youtube.com/playlist?list=PL848F2368C90DDC3D  Here's the playlist of every lecture The individual differences lecture is there but not the one on religion", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyXFBmJOdXb_v7pu0t4AaABAg", "comment": "Scrolling and looking for I fell i asleep comments but guess this is gold, lemme watch this for real now.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6gRUZW3gF4xGVx8R4AaABAg", "comment": "Nice video", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzklnDsTHMxuMwbfdN4AaABAg", "comment": "#interlinkedinternet", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx8tjPUxYUOF6cqlUN4AaABAg", "comment": "Terrace is like a movie Villian", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwbvsl9cSu_4t6iKMV4AaABAg", "comment": "34:36", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzGk8u6v3hWitvbDZh4AaABAg", "comment": "26:00", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugys2GNPc1fWdBLYe0l4AaABAg", "comment": "23:00", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwZXjyNP8eN0RJmp6Z4AaABAg", "comment": "There is no such thing as Tourette's disease.  There is a Tourette's Syndrome, and it's not about cursing.  It's about tics.  It surprises me sometimes, how few people, especially doctors, understand this disorder.  One psychologist actually had the gaul to tell me, \"oh, it only lasts a couple of years before it's cured.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6C_qJPq8YKy3tZ2p4AaABAg", "comment": "The last two lectures aren't going to be taped?? 😭!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy_goXpqCT1RmWuKWh4AaABAg", "comment": "No matter what true crime or zit videos I fall asleep to, I always wake up to this guy on auto play. I’ve never even looked for him but I always wake up going “huh, fascinating”", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxZEw9SrxIbLVK_tOV4AaABAg", "comment": "IQ you have to explain first in your great team", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyyNVp3Qei-F9jq0wp4AaABAg", "comment": "How essential of it.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzYZtQD0sx-rEpwivF4AaABAg", "comment": "They to speak to spirt other hum.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzwlwFtGqwxIldcDiN4AaABAg", "comment": "I think you're right because it's mother's 🥃. I think you're right because I think the baddies are still in spirit. Ok", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyFHI96MMIA1HpQdKh4AaABAg", "comment": "Hi fact find out about you .my feelings where one of angry. Discomfort. They made a new film about Hitler. War again. I through I never hear about him father or mother. Poor woman. I through no one can judge pain or praid like you. It the time measurement for you My mate said would you like to like in that time. Hell no. Sciencies rule the day they got a test for that now.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz69d2gO4ovtE32RAh4AaABAg", "comment": "I am a mamel.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzcILYa_peFuUDbqXl4AaABAg", "comment": "Hi hope you're ok. I like light. I sit in a room. The door open. I see light coming through the door. Then I changed my head I see different light. The way I move my head and my eyes are in my head. Different piont of view and so different light I see. It's fantastic me. I sure it does sound like you.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyJJKih0DrtO1Zdq0R4AaABAg", "comment": "awesome human being !  big love to all head banging mind benders here xx", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwPpW2ZUG_YMGjhLvB4AaABAg", "comment": "Interesting how when studies aligned with Mr Sapolsky's view present data things can be exactly equal but when they are not we adhere to the butterfly effect of data differing to a infinitely small degree. Nice how that works out for him. Anyhow, good lectures when taken with a grain of salt.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwdhCEiRegtWNPlmXd4AaABAg", "comment": "Nice jargon", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxvMAO83D8TKLWc4qZ4AaABAg", "comment": "I use this  to add fancy words to my essays hahaha", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxWpRt0RAc8yJDVrIV4AaABAg", "comment": "в подростковам возрасте обдумывал, до 9- подрастковава возроста, до совершенолетия, и после прешлось отказатса, самаанализ, сверить своё, с кампетентными людьми, с где то тремя, разных полов, пративоречия, во блага, и чтоб потом не искажали в своих целях, слечь на пару лет, или пока путешествую подкидовать друг другу, информацию, как я не буйный, и против насилия был, а больше на диолог опперался, не боялся за свои слова получить, сёравно на комплекцию, пока не почуствую действительно угрозу своему арганизму, не разу не вырубили, и не кого не выключил, и спор не стоил того, не оброщялся, к анонимным психологам, по телефону, так как не хотел  грузить, по этому частые прогулки по несколько часов, и другой ход мысли, иза другой церкуляцыи крови, не грузил себя фезическими нагрузками, пока мысленый процес не исташит, по этому бесоница чаше всего, и работы с небольшим физическим уклонам, чтоб поддерживать форму", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx3f7_OnKuCOcGGpbZ4AaABAg", "comment": "Jesus loves you ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxaZBSniTMjQTEpYBx4AaABAg", "comment": "For helping my reputation is been fuckkkk you will pay  You guys keep calling innocent people terrorists and all that evil names  But to the real terrorist you are protecting?  That is why I disconnected and continue with my life ...  People like you with no heart  I consider that everyone is AI-hybrid-human  I am not special trust me ...   That person don’t need my heart ❤️ for what, ? to hurt me? ... I don’t work with evil fake energy... only with real energy or hybrid   I just did my work and that was prevention free Missionary work ...   I have a great life with real family and friends ... trust me helping evil strangers is no my job   Sorry but next!!!!  Keep fucking yourselves and good luck animals with our real 👑 education 😎✅👑❤️☝️😂 you will never get out of you hell ...   To get out of you hell you need to talk to god ... I am not god  Sorry 😞 you don’t know me ... and I don’t know you ...  I continue with my real 👑 family and friends   I am a wealthy person ... I am only VIP for my family   many people denied me ... and I denied them totally...   I am not  the person you guys are looking for ... you are mistaking me ❤️  I Hope you find the right person, to help you with your problems 🙏 ...  Poor people and rich people don’t fit in the same universe... or the same room   We are not the same ... sorry keep with your rich better then everyone else life ❤️ good luck 👍  I have a question why I can’t subscribe in YouTube for been direct and for been an adult ? 😎🤪 why punishment to me?  Or controlling me?   You don’t control all this terrorist organizations... but you control me ?  Sorry but only god control me ...  not a terrorist criminal like you and your people...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyQWuhqhjZNV2DHkXV4AaABAg", "comment": "Modeling. #fashionforever is #kabuki ya #noh? #Masks The research continues. @1:14:25  Leading into Phenomenology (intentionality, like for Asian thought in translation!) #om #psych!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyFz7MWKNp5ZwNMda94AaABAg", "comment": "Wonder who his teachers were", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyBrzDIWDpLiArppgF4AaABAg", "comment": "Wonder where all these students are and what they did with this info", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyTMiW2bXkZCJwlWWV4AaABAg", "comment": "I might be 11 years late but am loving chilling to these", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwnnmaG90WmTJsztwl4AaABAg", "comment": "Has this man ever met or talked with Irving Finkel? If not then I think the two of them discussing various things would be extremely entertaining and informative.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyOUifHzkoXAKoC6q14AaABAg", "comment": "The french institution that decides about which word is french or not is the \"Académie  Française\".", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugylh5R6XaX_LjjJA_14AaABAg", "comment": "His style triggers my desire to grab my pen and notebook and start note-taking!   Do students even still take notes ?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwHZr4Hkj3L95lD2b94AaABAg", "comment": "I always wake up and his lectures are playing. I wonder if I’m uploading his information into my consciousness while I’m sleeping?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx1wITg_hiTYevfWp14AaABAg", "comment": "Funny how I hated being forced to learn but now at 28 since it’s now my own choice I love it lol. Ban compulsory education !", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxm-gc1Do4Sy9gTWGx4AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6RdfHgnO5hUG6E494AaABAg", "comment": "Squirels can lie.  They will hide nuts in one place if another squirel is watching then move them later.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwG7rSTf5-ExAKC32t4AaABAg", "comment": "Just realized there are only two videos left after this one and  it bummed me out :(", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxsROm8Tdrx3wVwWAp4AaABAg", "comment": "Just realized there are only two videos left after this one and  it bummed me out :(", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzmjzbsRnCwjC75muJ4AaABAg", "comment": "Again, how people think of all their pets. \"They understand me\" nah bruh, they just to fixated on food, and you give them abundance of it.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzvB-69_CdvTYtreM94AaABAg", "comment": "To copy a wise man who was praising Mary Robinette on short story lectures :\"i can't beleive this is free\"  I pay premium, so not me.... but still", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw-oP8yvUpZltE6bCd4AaABAg", "comment": "Did he record the last two lectures? Re announcement in the beginning", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgySGzVITUNetvYEiCN4AaABAg", "comment": "substantive choice.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwtekdHNkOWmRlpdTV4AaABAg", "comment": "\"january twenty four intraday low of four thousand two hunderd and two dollar in the s&p five hundred. since that date, the market has priced in one to two additional federal rate hikes this year, crude oil is up ten percent, the fourth biggest stock in the s&p five hundred   meta platforms imploded and, yes, russia has massed troops on the ukraine border. with it all, the equal weighted sp five hundred is less than seven percent  off its peak\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxJnbi2DAmdldXVA-F4AaABAg", "comment": "thunbs down every year spam", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgylfL0uDZLAjLGgYyt4AaABAg", "comment": "The echo in the audio of this video is painful.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzY4H22aO0ozdrzTyh4AaABAg", "comment": "A gerund is any verb that is used in noun form. Example:  \"The amount of time I spend on this question answering thing is trivial\"  in this case the word \"answering\" is a gerund since it is used as a noun (interestingly enough this makes the word question behave as an adjective rather than a noun - called an \"attributive noun\").  I love these lectures because I'm the type that obsessively absorbs information.  I get a bunch of information from the lecture, and supplement it by pausing the video and researching terms and studies he references in passing to reinforce the concepts.  All this just to keep the gremlins in my head quiet so I can focus at work (I'm a programmer lol).", "votes": "2", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx4WWTAq-AdTDSiihN4AaABAg", "comment": "I adore Dr. Sapolsky, but the \"mmpop\" sound he makes at the end of each sentence is driving me crazy, lol  If \"punctuation\" had a sound.... 🤣🤣🤣🤣🤣🤣🤣🤣🤣", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxNMeiXHMMfFQ4ixgZ4AaABAg", "comment": "Gonna be honest, had to skip the last 2 videos. Stuff was making my brain melt", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxg3LF9ULxehlSjPat4AaABAg", "comment": "It's actually pronounced like this: moondoorookoo. But with no pause. It's a fast and closed vowel. Munduruku. With the enphasis at the last sillabe.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx--P5fmnWtHXdczeJ4AaABAg", "comment": "about 53 min: wow - all that early education... somehow I knew it was fishy. My daughter struggled with it, in the sense of trying to fit in, but it meant so little to her. Her teachers thought she was retarded but she wasn't, and the more they spoke to her simply and carefully the more wretched she became. We went home-schooling instead, there was no choice. She has since topped her law school. I've become very guarded about the 'goodness' of early education and till right now I thought I was alone on the planet in that.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzjwvrMz_Zb7zm1Ak94AaABAg", "comment": "38:06", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyFETfoMluL-ygR1BJ4AaABAg", "comment": "Does anyone have studies about how the Broca's area and other parts of the brain that are associated with language and how they look in autistic people?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzDQ1zGwTWUlX4HcEl4AaABAg", "comment": "Nice to learn new things but still sad for these poor animals .", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzNOYM1DmB94Yn8O4d4AaABAg", "comment": "This thing about languages affecting how we think.  One would believe that this might happen to human-conceived things like numbers, as mentioned in the video, but it could not happen concerning things that EVERYBODY who had all of their senses working properly had in common, like, for example, COLORS.  Yet it is true there too!  The big example of this is the word \"ORANGE\" in English.  That is a color that anyone who is not color blind (and most of them) can see and it is definitely NOT yellow and NOT red.  So, this word should be in English almost from its start, right?  NOPE!!  The word ORANGE is from the fruit and is very new to English, which is why there is only a single word for this color and THERE WAS NO WORD FOR THE COLOR ORANGE BEFORE THE FRUIT BECAME POPULAR IN ENGLISH!!!  How is this possible?  We have been seeing a color for hundreds of thousands of years, at least, and we had NO word for it AT ALL???  Sounds insane, but it is true.  Go figure...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyrrwrVdlDB3BFrhjx4AaABAg", "comment": "That there are specific brain areas for SPEAKING a language that are INDEPENDENT of the brain areas for UNDERSTANDING THE SAME LANGUAGE SPOKEN BY OTHERS is a unique (Thank God!) event that happened to me just after I graduated from high school.  My telephone rang and I answered it.  A woman's voice said something to me in English.  I KNEW it was English, but I COULD NOT UNDERSTAND A SINGLE WORD, as if it were in Greek or some other non-English language!  I asked the woman to repeat what she said and I COULD UNDERSTAND MYSELF SPEAKING IN ENGLISH.  She repeated her statement and I again got the same result.  This, as you might imagine, greatly disturbed me, so I again asked here to repeat what she had said twice and again I could understand myself speaking English with no problem.  This time I CONCENTRATED on what she was saying (hard to explain how, now) and suddenly it was like a switch being thrown and I could understand her perfectly and she had indeed said the same thing three times, but now I could understand every word.  I did not like what she said and hung up, but this event has bothered me since that time.  At the time I had no idea that the brain has two interlocked, but separate, portions for hearing and speaking a language, but something selectively switched off one of them (the hearing part) in my head without touching the speaking part at all.  Never happened again, but it still worries me as to what happened here...", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwqX4Jt5zWQWWteLYF4AaABAg", "comment": "A point:  In our universe many things have to ALREADY be developed before some OTHER thing can happen -- there are CAUSES and EFFECTS and they must occur in a fixed order.  For example, a seemingly silly one would be:  What came first, flight or wings?  No matter how you might look at it, if you try to fly without ALREADY having some sort of wing, no matter how poor it might be as a wing (as long as it can work for some realistic situations), you may survive some wing-required event where if you tried to fly without it, in many case you would end up dead after a long fall (from a tree or cliff or whatever).  When you start thinking this way, you have to apply this kind of logic to almost EVERYTHING that happens, particularly in the growing up of a living thing -- some combinations in order will kill you and others will allow you to live, even though the same pieces are involved in all combinations.  Learning to speak is just as or even more complicated as flying, so the what is the cause and what is the result has to be worked out first before you can start to really understand what is going on to allow this chain of events to happen.  To summarize:    Random events without some already existing structures to sort them out as good or bad are almost never going to allow a person or any other living thing to become an adult with all of its body and mind intact and fully operating like others of its kind; there are simply too many things that can happen, most of them being fatal...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyYL7sSlC3w1i4auA14AaABAg", "comment": "1:04:00", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx67UtDpe8bHGYvH8J4AaABAg", "comment": "you yup you yup you transend indeed.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzHaGFQOA4kiecZGQp4AaABAg", "comment": "The Biology Of Religion - I wish they taped it !", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw4XR4apX73scL-9lR4AaABAg", "comment": "Attempts to teach apes language starts at: 1:18:50  Koko the gorilla discussion starts at: 1:28:03", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzwq6biuSEoUNdCG2d4AaABAg", "comment": "He has good beard.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzY4H22aO0ozdrzTyh4AaABAg.9YUC5kzxML59YkfTUQFubz", "comment": "Good luck with mr. Grimlin, tell him hi for me 😂😂😂", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzQX2iqERatWB1sALh4AaABAg", "comment": "I speak English and Greek and prefer the versatility of Greek language by far. Thank you for your wonderful lectures that we are able to listen to .", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxwrSuwrP-_uq_oABp4AaABAg", "comment": "Language, of course, has not  only  communication and expression of ideas,   but  a  creative  function   such   as「 דבר 」   which   is    called   in   Hebrew .", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzYPZOK7azg_aS6TF14AaABAg", "comment": "지존엄마랑 아빠랑 아주 말장난 아빠가받아주니까 주거니 받거니", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyRIzuoUOubuN2d4l14AaABAg", "comment": "I was so close to getting a minor (or even double major) in Linguistics when I was in college, and this lecture has brought my obsession with neurolinguistics rushing back with fervor. Every lecture of Dr. Sapolsky's that I've watched has made me want to go back to school, which is not something I ever expected to feel!! I have no higher compliment to give him!", "votes": "1", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzvIBv_2qgThz2PfGJ4AaABAg", "comment": "That \"past your eyes\" milk lady who figured it out is on another level.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxZvikQmgf8f9QJAHV4AaABAg", "comment": "all american men need to be bald.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy34HYkyrArYh8AL9B4AaABAg", "comment": "What does the definition of telepathy actually, really describe and what empirical evidence would prove its  existence? By definition telepathy can not be empirically proven since that requires use of the known senses.  Telepathy; Definition: \"the communication of thoughts or ideas by means other than the known senses\"   Telepathic \"language\" has to be universal!   Believing in and communicating with God requires telepathy. So religion is a telepathic societal norm!  Telepathy is devoid of spacetime. By the simple fact that the concept of telepathy exists suggests that credence be given to it. Since religion is a telepathic societal norm the leap of faith that telepathy is a real phenomenon is a small step.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyHZEio5X5m-oq_Njt4AaABAg", "comment": "This is my favourite lecture our of all of them", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx2a67YzwLgDJPFYet4AaABAg", "comment": "Why not tape the last two? Students not showing up?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyMVdxQ8L6KEcYPZMx4AaABAg", "comment": "if i understood- there are some people who have trouble communicating their thoughts BUT they can sing their thoughts because this allows passage through the limbic system   maybe it is stretch but could the same be said about telling a \"half truth\" joke? such as a group sharing dinner. person 1 takes seconds, thirds before the group has finished their first share. person 2 tells a joke \"do you think you've eaten/taken enough?\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz-FQVMh-tjvb9ulMl4AaABAg", "comment": "This guy's lectures are awesome. If by any chance he happens to be reading these comments, or anyone can pass on a message to him, let him know how much I enjoyed his lectures from the other side of the world. And thanks Stanford for sharing, that is extremely benevolent of you.", "votes": "15", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx441TJkUoXnCnVpSN4AaABAg", "comment": "Amazing in all his teachings.I truly love him.", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyH3BmegwZE_-u9HSB4AaABAg", "comment": "7:38 Motherese = use of babytalk. I would like to know, if peers and gentry would have 'applied' more motherese to their children than commoners. My mother never used Motherese on her children and might have gotten into an argument about this topic with the neighbor, whose husband was a pediatrician due to an anonymous influencer. My husband's mother has probably not used motherese on her children, because she did not have a bubbly personality. My father was not a good communicator (verbally), therefore I assume, that he wasn't motheresed either. Chimp Kanzi's logical progressions might have a link to my, until recently, anonymous half-brother (?) Hans(i). My father sometimes only talked in facial expressions similar to Luis de Funez (the Gendarme of St Tropez). His Grimassen or Prosody sometimes gave me a headache, that always affected the left side of the forehead. I never tested, if my mother could have motheresed it away by using baby talk on me. Limbic hyperactivity as a trigger for cursing has not been mentioned in my book by Geoffrey Hughes 'Swearing - A Social History of Foul Language, Oaths and Profanity in English'.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyhALSIdTzaSq0sBiZ4AaABAg", "comment": "So my dog can learn English if I squeak slow and clearly", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyOLdq2rKvn2WxpcrV4AaABAg", "comment": "The question 🙋‍♂️: is Language a fictitious and fake abs deceptive tool for scientific analysis, diagnosis and discovery and Exploration and conclusion!? Who is agree and why ? Who does agree and why ?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzOcmR2p1vclblax9d4AaABAg", "comment": "💯", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwo1zDP76-PRpHH2Q94AaABAg", "comment": "It wasn’t Donald and Gadaffy was it?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg", "comment": "This man is incredibly intelligent and a wealth of knowledge in his field. I’d love to have a lifetime pass to sit in on his lectures. Thank you so much for making this available to the average person.", "votes": "172", "replies": "14", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyE6GYN1VPX80aDNu54AaABAg", "comment": "Imagine being married to this brain x", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugydc5rvJGukS2JGa2d4AaABAg", "comment": "There is an innate sense of” language “ in our selves. Be on guard. The world is always trying to use language against you", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyRIzuoUOubuN2d4l14AaABAg.9XA1uHv4jNi9YE4po5c1uF", "comment": "I hope you do Andi wish you well!!! 💖", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyRIzuoUOubuN2d4l14AaABAg.9XA1uHv4jNi9YGXL0s_gTI", "comment": " @retard_activated  llaughedcried is same person as Andi?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyH3BmegwZE_-u9HSB4AaABAg.9Vi-xcum33u9VltM3rNrZf", "comment": "This looks like a comment written by  extremely sophisticated AI.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsL-mhWbK", "comment": "Bj jbjbbjjjjj jjjjjjjjbbjjbjbj", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsM4nZi2G", "comment": "Bjjbjbjbj bjjjjjjjjbbjbjjjjjbjjbbjbjjjbbbjjbjbjoj jbjbjbjjbjjbjjjjjbjjjjbjj", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsMu05fCo", "comment": "Jjbbjojbj jbj oh j ojo j be ojjojo. J j obj", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsMvzK_G7", "comment": "Jjbbjojbj jbj oh j ojo j be ojjojo. J j objb", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsN4SJDe5", "comment": "Bjbjjjjbbjjbj", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsNLgWguL", "comment": "Bjbjjbbj jbjbbj j", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9XhsNdFiSHd", "comment": "Jjbbjbjbjjjjjjjjjbjjjjbbjjbjjjbbj", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9Y4pRmtnpxw", "comment": "'his field' seems to be all human life from the neurons up.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9YE3GelTjCH", "comment": "You know you've reached a whole other level of sleep deprivation when your eyes are reading \"sit in on his lectures\" only my brain goes \"lap\".  WTF is wrong with me 😂😂😂", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2oga9ubBl9aKC_N", "comment": "No one is average.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2ogaA-uOuKY8PxD", "comment": "I agree. He is very smart 👍", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2ogaA-uOvXxMFjH", "comment": " @madacetv I am 😔", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2ogaA7kMgrWfVZc", "comment": "I am 63 I quit school at 14 hitchhiked around the country then at 20 I moved on campus at a university got a library card and started studying on my own. But I had to wait a couple decades for me to discover YouTube and this wealth of information I’ve listen to all 25 lectures. I started listening to them in 2013. Life is good.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxWq3HY6wrVNXaCE8p4AaABAg.9V5ATzS2ogaA7kWaTuT2E3", "comment": " @madacetv  I'm pretty sure, by definition, there are people out there that would fall into an average baseline grouping. As painful as it my seem in this \"everybodys a winner and there are no losers\" society we have average people and we have some that are average²...", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxLP9n06BYrvm9HdVd4AaABAg", "comment": "Wednesday  when the mind attacks its self ..lol travelling saleswoman problem.. insular cortex  responsible for American  revolution..lol", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxx_GPFMl9zcxSzhER4AaABAg", "comment": "Just today wrote my TSA essay (oxford psychology test) and I quoted this lecture four time, cheers Sapolsky!", "votes": "3", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx2X3u2Vo5tAU12fOJ4AaABAg", "comment": "Why doesn’t anyone EVER ask a question?? I’ve had several", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxA9HruNr3tH6iqT4F4AaABAg", "comment": "Prosody is the timing integrated into the syllables of speech, which shapes the meaning behind our words.  These words are generally produced by the left hemisphere's motor system through sequences of muscle movements necessary for human speech.  Prosody is separated from the visual array of muscle movements, and the right hemisphere re-integrates prosody into the speech in real-time. The end result is a pattern of speech with a pattern of light (sounds) mixed with a pattern of darkness (prosody). I have a book about it coming out soon. \"6-6-6 The Boundary Between Light & Darkness\". The motor system of our frontal cortex is as complex as the universe itself.", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzeqOXznk-cDTIbLBh4AaABAg", "comment": "if whit shcizophrenia you can hear voices are they like revelations by god or just becoz you can hear someone else voice not telepathe", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyPIwfsz_zLDLyhtNJ4AaABAg", "comment": "So kids do have their own language lol And here I thought that was just something adults said so they can pretend to understand children. Also I didn't know people with hearing impairments improvise elements of the brain in order to comprehend the world around them", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwLFa1MvPmfZsz6cuh4AaABAg", "comment": "it's kinda sad that Penny remains so prolific in her content that people still do knot know that apes learning sign is a bullshit field rife with animal abuse", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy5dqjbZXbAR7L0CW54AaABAg", "comment": "4:10 this is not true. There are several languages that do not have nesting clauses or recursion. Most famous is Pirahã from Brazil", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyDeQ_sgPXY34NTYXp4AaABAg", "comment": "I wish there was more documentaries about him and his work also I wish that you'd be able to watch him perform his lectures and teachings and theories in a more comfortable atmosphere where hes more relaxed would be the probably the coolest thing in the whole world.", "votes": "10", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzXCt0kmqBZeuiSrq14AaABAg", "comment": "Humans can use symbols (sound and visual \"objects\") to stand for actual things in discussions.  Maps, for example.  A funny story has a small expedition using a local guide and that person has NO ability to understand such symbols and they try to get him to help them with their map.  The results are very funny, but do you know of any other living thing that could understand what a map is and how to use it?", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzj5D4-ZFconqN2uzR4AaABAg", "comment": "This one is good too", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwR-2LN6a9sk1bAc5x4AaABAg", "comment": "from mex. thanks for all this knowledge coach abaut the brain and theirs more funtions in kids and babys and persons too in animals really make me feel so outgoing this environment thanks editors", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy63t_l9uXargKPCk94AaABAg", "comment": "This guy needs to work on his up-tones and down-tones", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwjYdb6CQfUpgoi6Ld4AaABAg", "comment": "In utero,hearing cadence, etc", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzc4HIwpqVzMUKKK0J4AaABAg", "comment": "at about 5m53s: \"we don't have the actual words being tied inextricably into their meaning, you can not look at a word and say 'woah, that word has an awful lot of right angles in the letters there, it must be a word that tells you about, you know, this kind of philosophy'\".  I think \"Philosophy\" is used here as a straw man. But there is a word that comes down to us from the Greeks which has the property: \"parallel\". the two els - originally lambdas - are there to describe parallelism: \"parallel\" is \"like (para) lambda-lambda\".", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxhDmmK1Wjt2a9j4C54AaABAg", "comment": "There is more knowledge being effectively delivered in 10 min by prof. Sapolsky than television in a 24 hour cycle. It’s unfortunate we live in a time of such wonderful technology and wisdom but digress to the trash that is being blasted onto whomever may be within earshot through tv and Facebook.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwTuZ3W9FeFmWtmDYd4AaABAg", "comment": "In fact for early bilinguals, languages grow scattered in the same area when they are similar, like French, Italian, Spanish, Portuguese all piggybacking on the same grammatical structure, but if it is combinations of languages of different root or conception like Chinese and French or Finnish it creates different areas in Wernicke.", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxOX8-7GYxitpTX4dV4AaABAg", "comment": "The story about gorillas is the most mindblowing thing I've ever heard... that's insane!! (in a good way) x)) Any1 knows where can I find the whole story about those experiments?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyGAlHz7vPG_7Nn0X54AaABAg", "comment": "Italians might have huge basal ganglia, they always raise their hands when talking", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwBqa5jh_BK1rtypTJ4AaABAg", "comment": "wut", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxx_GPFMl9zcxSzhER4AaABAg.9UKxDDFm6XZA6opB_511ta", "comment": "I aced the tsa btw, flopped my interviews and didn’t get an offer but still sapolsky rules", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxA9HruNr3tH6iqT4F4AaABAg.9TZZHrfFQuP9YE61qFtLEh", "comment": "I would love to read it. It's such an interesting topic and it really enhances (perhaps too much if you're like me with some special challenges) how you read and understand others. :)", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyDeQ_sgPXY34NTYXp4AaABAg.9Sw2GuwHPeA9YE4SiNbPUh", "comment": "He seems pretty relaxed to me.... It bugs when he makes a great innuendo and it flies right over everyone's head, lol We do have the wonderful privilege in indulging his lectures at our leisure.... That is truly a gift to humanity. 💖 He IS the coolest, lol But you're right, if he's trying to find balance and perform multiple times a day just think about how much hilarious he could be! 😂", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyDeQ_sgPXY34NTYXp4AaABAg.9Sw2GuwHPeA9nq4Ond4fBy", "comment": "Yes there is a great documentary called Zeitgeist Addendum and zeitgeist moving forward, it should be mandatory to all students.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyDeQ_sgPXY34NTYXp4AaABAg.9Sw2GuwHPeAA6KlnAcdRsc", "comment": "he did an episode on Chris Williamson's podcast and it was a good watch.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxypRM2Epck5gxP8Id4AaABAg", "comment": "I am not intelligent enough to fully understand this discourse.  But I am vaguely stimulated in my brain 🧠 by listening to the So-called Socrates styled socialism soliloquy", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxFCK0q_14evietg1N4AaABAg", "comment": "1:18:42", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwaLmoFy3pfve-daPN4AaABAg", "comment": "we’re is all the other lectures. number 7 then 23, what about 8-22", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxh9Q96GJKm49Pbu_54AaABAg", "comment": "“Language shapes thought.” Listen to the Joe Rogan Experience podcast #1691 with Yeonmi Park. Yeonmi states that the language in North Korea is completely controlled by the regime and it causes people to think much differently than we do, I.e. less emotion and autonomy.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwiMvTUKttIl9qNG3l4AaABAg", "comment": "How come creating new and unheared sets of words, proves that behavioural Language doesn't exists. For me, if a kid knows that \"love\" is for things he like and that he knows that he likes \"ice creams\". I can't see why he couldn't say : \"I love Ice cream\" He just need to learn through rewards that it is good For him to say what he loves, by saying it this way : I love ...", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzVsk4S_NQRa3RUVAF4AaABAg", "comment": "this was the day of my 15th birthday", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwGJSmlMIjmvFKYRCt4AaABAg", "comment": "Thank you for sharing your passion to all minds being curious.  Allow me to rephrase the purpose of the french institution: la académie française: the preservation of the french language not its modernisation - adding new words.   As the use of English terms by media increased over the years, the Académie has tried to prevent the Anglicization of the French language. For example, the Académie has recommended the avoidance of loanwords from modern English (such as walkman, computer, software and e-mail), in favour of neologisms, i.e. newly coined French words derived from existing ones (baladeur, ordinateur, logiciel, and courriel respectively). (Wikipedia)  I really appreciate your teaching.  Thank you for that.  Very seldom quality comes in a gift box with no price tag..   👍🌹  (Your class should be mandatory already in preschool…)", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxQh98hJrP8e957wIZ4AaABAg", "comment": "Why is this causing so many flashbacks to all my CS classes?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzU_3VqKnR0KyqeEpB4AaABAg", "comment": "Thanks 🙏🏽 Stanford University for this FREE World 🌎 class lectures I have learned a lot tremendously in such a short span of time I’m obsessed 🤩 🙏🏽🇵🇭🇺🇸❤️‍🩹💗💕", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyRDdqHiuUEa1ApDtp4AaABAg", "comment": "One of the absolute best teachers I have encountered in years.   What a mind!", "votes": "5", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxDq4d1jnuDbYAvD494AaABAg", "comment": "I would like to see Mr. Sapolsky's thoughts in images. I'm sure it would blow my mind.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwjUYm-uXySr25KIbR4AaABAg", "comment": "Tamil had a grammar book two hundred thousand years ago..as in how other languages should be used in tamil..it's know n as tholkappiya m", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwG4J1qndS4elUlOf14AaABAg", "comment": "How is babby formed?", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx2MQHrZGpN7GbbslV4AaABAg", "comment": "You can''t hsve partital words?  What about \"bruh\"; a partial word for \"brother.\" No disrespect to Chomsky.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz4zIURcVqjiEwtvRp4AaABAg", "comment": "Does anyone know if the Personality disorders, infividual differences lecture was taped after all? I'd like to listen to it", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyLoQwufkjsghU23Jp4AaABAg", "comment": "Brilliant 👏", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyDHJJY-Q6VjN4eUhV4AaABAg", "comment": "This is a big part of democratizing education - it shouldn't matter how much you pay for it, what matters is that everyone has equal opportunity to learn. The world needs more content like this.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzEuRl3zyDAOgbLPZx4AaABAg", "comment": "Is this undergrads lecture? It's a combination of math, science and the art of language. Mindblown", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy8FeGjZ2_L2lAffIV4AaABAg", "comment": "anyone else watching this in 2021 cringing at every cough…", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzA0wJigFiJmakK7N94AaABAg", "comment": "Royale with cheese...originally \"RoyEL\" EL being God-like or close to or of God all because of the metric system.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwiMvTUKttIl9qNG3l4AaABAg.9QafbzlQEGo9S05avG71ti", "comment": "That’s semantics, if I understand what you’re saying. It’s the language itself that is not in any real sense ‘learned’", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwGJSmlMIjmvFKYRCt4AaABAg.9Q_1qf3FC8G9S01CAn5Xu8", "comment": "What a ludicrous system. ‘Computer’ IS a french word if it’s used by french speakers to mean the thing that they mean by it. It’s just shallow nationalism.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwG4J1qndS4elUlOf14AaABAg.9Q2cXEZuhlg9SlIqJCkjhd", "comment": "In the womb by the god of israel", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg", "comment": "10:00 green", "votes": "0", "replies": "8", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyhNsbazXOIFGS_2W14AaABAg", "comment": "Feel sad for those who won't get this video on their recommendations.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx817OVhWlU29xU-dN4AaABAg", "comment": "while it does suck to hear the numbers of linguistic extinction it makes sense given the ridiculously rapid rate of linguistic creation :/", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxgHBJk_cl3wGGUn4B4AaABAg", "comment": "We want biology of religion lecture!", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgybQd7NAVds5zuFC6R4AaABAg", "comment": "He speaks super fast.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwNVzk_vITmV05TEQB4AaABAg", "comment": "I'm just greatly thankful for his lectures for free, I didn't even have to enroll at Sanford for this. Cheers, I'm learning more there than in my University even though I'm form Management background. Thank you.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyXy6PzMbFRiHQ_TJ94AaABAg", "comment": "I wonder how they use language subliminally influence some targets to commit suicide for improving the genetic quality of society. Isn't that genocide and eugenics?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyXJfF0DWk3isTvXsF4AaABAg", "comment": "The neat pantyhose seasonally detect because mountain really kill beyond a conscious parent. illustrious, ruddy temper", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyYX-rhIQBCqfGTmap4AaABAg", "comment": "july 2021 i wish i could meet him", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxt4e8MnUVTP8Viizt4AaABAg", "comment": "I watch his videos up to 5 a week... semi or sleep learning ...when I semi nap,,,,, I wish he had a book list for someone like me with a 2 yr college degree and my question is can I become smarter?????????", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz4kHgrjduorwfGFax4AaABAg", "comment": "🤮🤮✡🤮🤮", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxFa3VvfUSivw3qpGJ4AaABAg", "comment": "I listen to these lectures to learn and to help me sleep. Thank you 🙏🏼", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgysLA6pg1HUvapjmnJ4AaABAg", "comment": "This guy is a racist", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyjuzEvsEkYz1apNWV4AaABAg", "comment": "Il y avait des choses", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyfn6KvijXDFFxEuyx4AaABAg", "comment": "Vegetable salad, language salad,....(student off camera says:\"word salad\") ....Yes!.  You guys come down here and teach this and I will go up there and check my email. :-)", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwhjuzCbVIwPgpFpSt4AaABAg", "comment": "1:06:02 --- Sapolski talking about how we imagine the progression of time, as being left to right or east to west reminded me of a joke that another Standford professor made while delivering a lecture on relativity  I'm having trouble finding it, but in one of Leonard Susskind's relativity lectures, he makes some joke along the lines of \"English speakers think of time as going left to right, Hebrew speakers think of time as going right to left, traditional Chinese speakers perceive time as going top to bottom, and only physicists understand that time goes bottom to top.\"", "votes": "9", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxYkwqL5tVsUem70ZB4AaABAg", "comment": "Take Advantage of Jokey Premium Super Fine Ground Coffee. Basically after that you can digest bread products. Acetone poisoning by those that share. Apparently they also kill each other. Would be interesting to analyze a crime data and see whether people that drink this coffee still end up with neurological disorders. #This will kill a fly#Coffee for safety. The never prioritized, that was the whole problem, perhaps because those that have tried it were at the lower level of their discipline. Key? \"I EAT CHEESE THEREFORE I AM\". \"SO I CAN HEAR YOU BETTER\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz9mgTh7achHHL35WF4AaABAg", "comment": "1:28:00 Robert Sapolsky on Koko the gorilla", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwVmqrcw9tbm0csdRZ4AaABAg", "comment": "A friend of mine was stuck in Word Salad during a bout of serotonin syndrom. She could only say 3 words. We were estatic when she could add one more. Thinking back I wish I would have asked her to identify objects with her finger to see of she could.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3b_XGeK3nL2hkzBt4AaABAg", "comment": "49:45", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9OoisBvJ9oo", "comment": "17:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Ook56--4i6", "comment": "27:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Oom7pgtyyh", "comment": "35:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Oos4VMYqNW", "comment": "40:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Op0RSk6A2z", "comment": "1:00:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Op1rfUSBQp", "comment": "1:08:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Op5rfYHiyI", "comment": "1:23:00 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYUd9P_BWt3QiO_gZ4AaABAg.9OnWp16VIFW9Op9TvZJRcS", "comment": "1:42:46 green", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwhjuzCbVIwPgpFpSt4AaABAg.9NmCb6-eCO29aPBWhTm5Kh", "comment": "I don’t get the punchline but I like it", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugx7wnCBEUbdlU9J6S94AaABAg", "comment": "13:27 \"the first word you learn in ASL\"", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg", "comment": "Gonna leave this here for an assignment...  0:37 | Announcements 5:26 | Arbitrariness of Language  15:53 | William's Syndrome  17:37 | Language is Lateralized 23:29 | Language Salad 27:52 | Whistling Language  35:36 | Tourette's Disease  44:43 | The Generativity of Language 54:24 | Brain Coding for a Second Language 01:00:57 | Myelin  01:15:03 | Intentionality of Communication", "votes": "356", "replies": "12", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy7Ax7X74QPp7qzS0F4AaABAg", "comment": "Basic human knowledge, skills with memory associations. This series plus the behavioural context goes with Dr Lynn Kelly's book on The Memory Code in action and conjunction with Actual Intelligence cause-effect of Intuitive behaviours.   Free Will gets downplayed because it is not particularly common, but it is like preparing for possible catastrophes by having alternative planned strategies in mind from which to choose according to natural-normal awareness of empirical shaping circumstances. Ie Intuitive-experienced reaction to situations is often associated with \"Wisdom\". ----- In the Universal echo-chamber context of holographic e-Pi-i pure-math relative-timing ratio-rates \"language\" communication projection-drawing in/of QM-TIME Completeness Actuality. It's all-ways all-at-once sync-duration vibration in which human language is completely embedded manifestation of superimposed probability connection.   This is Observable, Theoretical assumptions and testing assemblies of abstractions is required by Sciencing Re-search such as in Animal Models. Dr Sapolsky's lectures are comprehensively suited.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwG8oopwUH9Dl1ixHZ4AaABAg", "comment": "Now I have to find a way to hear those last two lectures. Why not talk about depression? Seems like an important topic.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyiC__kBpQkQdTO2tF4AaABAg", "comment": "Metaphysical Hierarchy: Mystic... beautiful dreaming Magical... harmony Musical... language of music Artistic... pictures/metaphors Poetic... language of words Numerical... we are here  Mystics create the most joy (smart). Accountants create the least joy (ignorant). Yet accountants rule the world (ignorant).  Ever notice that beings who speak in the language of music can create joy that energizes thousands of beings to celebrate and dance?  Ever notice that corpses who speak with brain numbing, soul sucking numbers do the exact opposite?  Sanction, starve, torture, murder and bomb (wheeeee)!  Ignorance (hate) is bliss for vampires (greed). But not much fun for the humans (love) who they are sucking the joy out of.  Vampires (greed) are inhumane because they are not human. The evangelical counting corpses commit crimes against humanity because they are not human.  Light and truth (love) cause vampires (greed) great pain and suffering. That's why the words democratic society (socialism), \"care for all\" and \"green new deal\" cause the counting corpses that rule US such misery.  Vampires (greed) are \"blind\" and cannot \"see\" the ignorance of transforming heaven (peace) into hell (war).  The counting corpses are also blind and cannot see the ignorance of transforming this paradise planet lifeboat into a polluted pig pen.  The evangelical monsters are \"desperate\" to control a darkship called the Whitehouse. Because working in the dark to suck the joy out of life and devour earth is the only way that the loveless, lifeless parasites can survive and thrive.  Unlike earthling poets, artists, musicians, mystics,human beings and creators of joy...the evangelical counting corpses that rule US can't create harmony (real intelligence) because vampires (greed) are far worse than stupid. The loveless, lifeless parasites are ignorant (dead).  Darkness (business) exists so that stars (light and warmth) have a place to shine in heaven.  Stars like US don't exist to be sucked out of heaven by a giant black hole in space called \"greed\" and it's ignorance (hate).  Also, Love (god) spent billions of years creating this paradise planet lifeboat so that her miraculous works of fine art called \"life\" have a beautiful place to \"be\".  Love didn't spend so much time creating this paradise planet lifeboat to be depreciated, hated, polluted and destroyed in a brief moment by hostile alien vampires (greed) and their ignorance (hate).", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyBIPow9rSt-OMgNzd4AaABAg", "comment": "Try getting a job with this guy's bullshit.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyRjvYa7TBLJ01B4O94AaABAg", "comment": "23:26 I can't believe Prof. Sapolsky didn't know something.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxs3QEACsLGCE41uAJ4AaABAg", "comment": "❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz3cpd9Xi-F_Nr7YvV4AaABAg", "comment": "This is some of the best educational content I’ve seen since I discovered Noam Chomsky. Thanks!", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx7tOtH7_F8gln97Td4AaABAg", "comment": "I really wish somebody put barbiturates into my carotid to see what happens half brain unused. tha would be cool", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwXSv164izxDjhb9VR4AaABAg", "comment": "The wry cellar roughly doubt because tank occasionally fail below a physical target. possessive, hushed pimple", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyo48OMeBkvrtRGO_J4AaABAg", "comment": "The whole cheque meteorologically pause because gearshift resultantly head atop a useful form. worthless, unique expert", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzJD3w2RUE-tzihVhF4AaABAg", "comment": "This is where the pros of social media and the ability for anyone to make video channels outweighs the cons. There are many cons and heaps of crap out there but coming across real intelligent content like this is just amazing. There are even other professors out there that just don't deliver it in as engaging a way as this guy. Or there are professors who are just brainwashed with ideological stances and being conduits for that. But, this is something very special indeed.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwL0TJultU4VyxBZZZ4AaABAg", "comment": "The whole sweets singly groan because twist alarmingly hop pro a unsuitable hyacinth. little, careless french", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxRLR-iC8Mbzav9a794AaABAg", "comment": "The acid mark clinically obtain because trombone coincidently thaw under a violent drug. disastrous, special panties", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwg4BB1OkaJQ0NRU6d4AaABAg", "comment": "Early on in this lecture, Sapolsky mentions some of the following lectures not being taped. As such, 'the biology of religion' is not part of the series.  Fortunately, you can just find it here: https://www.youtube.com/watch?v=4WwAQqWUkpI&ab_channel=RaulSoto", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw2sGEHx500I2GvqLt4AaABAg", "comment": "What a wonderful way to craft your own Renaissance education under the Masters of our day! I'm grateful for this and all of his lectures and I am grateful that Stanford allows it to be broadcast to the rest of us!", "votes": "71", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzGBFl311xMrOisjqJ4AaABAg", "comment": "The tawdry meal additionly remain because eye concurringly replace an a early badger. erect, impossible seat", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwDVoo-UPYChDlOwqx4AaABAg", "comment": "The juicy grey proportionally meddle because energy compellingly tour mid a flawless debtor. aboriginal, irritating servant", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyUvzTD4qUdUZkAw3h4AaABAg", "comment": "If a culture has no linguistic way to distinguish 3 from 4, or 5 from 6, does that also mean that they would not be able, for example, to see 4 sticks, and put down another group of sticks that also numbers 4?", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69OmZSjFstWL", "comment": "bless u", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69QQf5BojFOg", "comment": "bästa mannen", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69VQ5H2j48lf", "comment": "👍❤️🇺🇸❤️👍Thank you a be lots !❤️.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69X9kX1UD8JW", "comment": "Lies again? Vigrx Plus", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69YZA40ZnmCC", "comment": "Not a literal index. Interesting to know a scholars points of interest about this video.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69_EGfcEFQ9z", "comment": "Thank you", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69bpQBDeEuh9", "comment": "Thank you so much !", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69fg-U89hXp5", "comment": "Can you do this to the remaining 25 episodes of this lecture pls.? 🥺", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69kSJ5YKYDC9", "comment": "Correct me if I'm wrong, but I believe therese a lecture missing. One in which the class apparently learned about the Random Cells or whatever.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v69mZZzfoZ5yo", "comment": "​ @NazriB  ??", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v6A2g8pzxK2dt", "comment": "Thank you! I was just about to do the same thing but, uh...the dog ate my desktop. And my phone.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxEWEellTIMwq17AuF4AaABAg.9Mgm1-qW4v6A528lmbeTyf", "comment": "Could u also send me the homework solution? xD", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw2sGEHx500I2GvqLt4AaABAg.9LspSYyan5U9So4iYRZFM7", "comment": "That was my motivation too! Gotta be like the polymaths that came before lol", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwcSA8cq4Rue4Kyx7F4AaABAg", "comment": "The statuesque mark premenstrually order because macrame elderly slap above a nondescript hawk. crazy, precious porcupine", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyDhkDswdJY_jk5-vN4AaABAg", "comment": "I can volunteer my ex wife for similar communication experiments if needed.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx5Ff5kx_SeVq28GdZ4AaABAg", "comment": "Great talk but please stay still LOL", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx7AGTMnG5B2fdj21Z4AaABAg", "comment": "The peaceful event posteriorly suck because nut additionally try minus a abashed collision. measly, near brother-in-law", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwEseKcadKyz6OU-1N4AaABAg", "comment": "wow...swarm intelligence ... i know im 10 years late", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzqhv9M9DtZsUm-WhV4AaABAg", "comment": "He is articulate. However there exist strong indicators that suggest his pathology is that of someone who thinks himself to be above his fellow humans in such a way as to view them as objects to be controlled for evaluation, as a god may view a bug.  Let us not forget, we are human beings, and no human being is merely a means to an end.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxp8off1RXcsfalA4F4AaABAg", "comment": "I am not sure if teaching language is a western invention.. if you look at how more structured Sanskrit is for instance along with existence of older versions of universities, language teaching must have been going on there for a long time, if still relatively recently from evolutionary standpoint. It will be very unlikely that you would get a language where letters and vowels are prearranged basis mechanics used to pronounce them to turn up merely as a result of children learning by observation. There has to be a scholarly process involved. I am not sure about Chinese civilization but if someone does, please shed some light on it if you can", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyJwLhjbgRqXoye44F4AaABAg", "comment": "The way this man creates humor out of nowhere makes him a great stand-up comedian of his own sort.", "votes": "50", "replies": "4", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxnUEeUn_WsUYI_c4R4AaABAg", "comment": "I am going to show my kids these lectures instead of sending them to school.", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6Hyq9qdun4IjKpdp4AaABAg", "comment": "like so many others, I absolutely love this man's lectures!(edit: I'm grateful to Stanford that they're willing to share these lectures with us, we listen to a top notch professor for free!)", "votes": "57", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6jKlt4g9ZPyBuHZh4AaABAg", "comment": "That's  an  Educator !", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxrw_JwFqUXGYmEjfh4AaABAg", "comment": "The profuse exchange comprehensively delay because mini-skirt karunagappally part mid a adventurous margaret. cagey, milky snowflake", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzJbsoBXfZjUfh72FB4AaABAg", "comment": "I like the way he looks, the sound of his voice, his vocabulary,  the fact that he moves, his jokes. I am a quiet person I don't speak, most of the time. I would like to be able to take off, like he does.", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzg8VrUd7ZI-Ft15Tp4AaABAg", "comment": "At about 1 hour in, on the Piraha: Besides that number thing (which is more like 1 thing in opposition to a second than two things), they upset Chomsky to the point of calling Everett a charlatan and a liar because Everett points out (in his Don't Sleep. There are Snakes) that they don't seem to do recursion.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzFVlagRlyTyJ861Qt4AaABAg", "comment": "The alert development singly remember because alley renomegaly poke modulo a agonizing cowbell. hanging, voracious tree", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyqRksgEQQ1LJaSZXh4AaABAg", "comment": "M", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw_TYG7g4ni9uxjR2t4AaABAg", "comment": "Why did they not put ALL of his lectures up here, there are at least four more that I`m unable to find on YouTube . Please put all of them up for all of us so we may learn.", "votes": "4", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwM4IPLtFOMBjUAMO54AaABAg", "comment": "PAST-YOUR-EYES-MILK [pasteurized-milk]", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzqdEhwNpmVp2bjw694AaABAg", "comment": "The steadfast fifth ultrascructurally start because peru periodically analyse during a bawdy hippopotamus. laughable, feeble feigned mercury", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxkylcO2-e-vuG8mYt4AaABAg", "comment": "The ablaze idea disconcertingly discover because friend sicily tame lest a encouraging step-brother. narrow, unaccountable nurse", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyJwLhjbgRqXoye44F4AaABAg.9LJeZVJpVau9Tm3W6PetJa", "comment": "It's hilarious listening to him explain how erections work. 🤣", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyJwLhjbgRqXoye44F4AaABAg.9LJeZVJpVau9UMNLn1S7w5", "comment": "He is so funny. And he is not pushing for humour, that's what makes him a geniuly funny person.", "votes": "8", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyJwLhjbgRqXoye44F4AaABAg.9LJeZVJpVau9YE3kEx9GIt", "comment": "Dr. Sapolsky. Researcher, lecturer,  doctorate, author, advocate and comedian 😁 The reason so many grads actually retained and remembered his lectures. 😁😁😁", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyJwLhjbgRqXoye44F4AaABAg.9LJeZVJpVau9nq3_Fe3n3y", "comment": "Stand up comedian are nowhere near, these are intelligent jokes from a real highly educated professor.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6Hyq9qdun4IjKpdp4AaABAg.9L6bDkpvS7O9guw-any96e", "comment": "YouTube used to be SOOO good. 🥲❤️ these remind me of the old days", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw_TYG7g4ni9uxjR2t4AaABAg.9KI-xPOsiML9N8gcsUUUi1", "comment": "I was looking for this, please share the topics so that I can study them myself. One is on depression as he mentioned and do you know about two being not taped?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw_TYG7g4ni9uxjR2t4AaABAg.9KI-xPOsiML9QZndhVO3Zf", "comment": " @saketgawali1981  Somewhere I heard him say, he would skip the one about depression, then go to Religion and finally to (other?) \"Mental disorders\" and: \"i don't want those two being taped\" ...", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw_TYG7g4ni9uxjR2t4AaABAg.9KI-xPOsiML9QZtQGn9Erm", "comment": " @onghuttau  the missing lecture being mental disorders? Thank you", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyKYTl-RglEoFTSKUx4AaABAg", "comment": "Way better than Chomsky's ideas.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxPb5j-3lfjKJFEQTV4AaABAg", "comment": "How come animal language is not arbitrary, given semanticity (monkeys, I think it was Velvet, separating emotions from the words they use, saying \"move up it is not safe down there\" vs. \"move down it is not safe up here\"...)  It looks like what makes lying possible in humans is arbitrariness, then if arbitrariness, at least to some extent, happens in monkey communication, then lying should takes place in their communication as well. Can that be that arbitrariness is not common to all animal communication (e.g. dogs)... that is it is degraded from humans down to lower species... ?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxHCfULZ5gIZi3FOcB4AaABAg", "comment": "nice", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxYQlMXIUZTCBkw-UR4AaABAg", "comment": "\"New languages are invented by kids and nobody a whole lot older than them learns the new language.\" Conlangers: Hold our morphosyntactic alignments, we'll be right back.", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzmEP5DbzHiAGU4wDR4AaABAg", "comment": "[3:33]  Bull...   [in partial jest, +w/ all due respect, my man]", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxHJZF1U7fM-c_HuKR4AaABAg", "comment": "Pardon my english but if the number of words are finite, the number of combinations must also be. There are many combinations indeed.. not infinete tho... what am i missing here?!", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx74DFnR31nLtpaVIZ4AaABAg", "comment": "The lame preface predictably fry because legal neuropathologically brake behind a responsible payment. inquisitive, hateful alligator", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxwkVkqWBJT29mj0BV4AaABAg", "comment": "Robert is my favorite is primate.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw1NionCuyR5xuxYmJ4AaABAg", "comment": "There are just two languages, good language and bad language. Good language before marriage and bad after marriage.  Happily unmarried people can testify to this fact.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxbSeXb9K5dE6okJEl4AaABAg", "comment": "I'm happy to report there are other instructors this good. He is very good and thankfully he's not alone.", "votes": "38", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyXW0SReFHHhjNBixZ4AaABAg", "comment": "Dear profesor, human is not animal. I know, you try to explain human as an animal, but this is totally wrong way to understand human behaviour.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxie1q7Bv2BK6mVgmp4AaABAg", "comment": "this guy lost me.....", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwu6HzzWPaXOmb-ZyR4AaABAg", "comment": "\"Two silver backs you know\" here i wad thinking of actual gorillas, and he meant  Chomsky and Skinner XD", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzUCwO9A2TjNoWKWNJ4AaABAg", "comment": "The abortive meat functionally itch because debtor adventitiously knit an a scintillating jasmine. daily, crabby gladiolus", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyzkjT0kpYgCnRfgd14AaABAg", "comment": "Excellent, fix the echo.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwgijCElZyBNqdv7B14AaABAg", "comment": "The confused guatemalan corroboratively guess because cement commercially disapprove of a  fascinated television. disgusting, eminent angora", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwBqQVf7IJ4Wx9ZZVZ4AaABAg", "comment": "So...Roughly speaking...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyUNaL6x1WUMfiItsR4AaABAg", "comment": "Great content", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyv2oFfqnqZNa7Idm54AaABAg", "comment": "Would have loved to see that biology of religion lecture", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx62e3fHIYFJFcRkrp4AaABAg", "comment": "best there is.... only, the idea of arbitrariness has been substantially challenged....", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxYQlMXIUZTCBkw-UR4AaABAg.9Jvu-luvsYN9LWW0R11zzL", "comment": "Dialects are formed. New colloquialisms enter the language. Some are adopted, accepted, made standard. These are vocabularies, like argot or slang, that kids create, not languages.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxHJZF1U7fM-c_HuKR4AaABAg.9JbM1msQiYa9L41duk2nYu", "comment": "The combinations are unlimited for language elements, in the same way that even a binary digit system is unlimited for generating an infinite number system: the limit is in your ability to employ or generate every element of the infinite system.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxbSeXb9K5dE6okJEl4AaABAg.9J0U6sQT-GY9Qd6Ut_z5eB", "comment": "Who else is there?", "votes": "8", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxbSeXb9K5dE6okJEl4AaABAg.9J0U6sQT-GY9l_JojXKT2f", "comment": "Please share your knowledge with us!", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxbSeXb9K5dE6okJEl4AaABAg.9J0U6sQT-GY9uc1zvGxZYf", "comment": "Links or it didn't happen...", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyXW0SReFHHhjNBixZ4AaABAg.9IuuzIn82GF9K-N-t0GIAO", "comment": "Humans are animals", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugyv2oFfqnqZNa7Idm54AaABAg.9IVrW-EhVOT9IgYT8Lsdpg", "comment": "Hi, here it is, slightly less recent, nonetheless containing more or less - as I understand it - the same thing that the one in this series should: https://youtu.be/4WwAQqWUkpI Enjoy, this is truly fascinating 🙂", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxovdGosiQR468gRSB4AaABAg", "comment": "Although I did enjoy the anecdotes about primates, but I would have loved to hear a bit more about human language.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgztXWioSjn3uu-aboN4AaABAg", "comment": "oh look a conifer manly palmer hall man grand symbols of the mysteries endocrinology pineal pine cone spin doctor. pine nuts pine cone pin-e c-one odes strophe antistrophe e-pod-e. pin-e c-odes", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwXMXyunSqNNi4mMmp4AaABAg", "comment": "The flashy timer ultrasonographically trick because partner commonly annoy aside a blushing canadian. spectacular, dramatic glue", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw1oQVo02hyczCwHF14AaABAg", "comment": "Does he really not know what a gerund is?", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzROVZoTo1pTERSyEd4AaABAg", "comment": "The ASL pun in the expression for pasteurized milk is a pun in spoken language inserted into into ASL by persons with a knowledge of the relavant phonetics, so I'm uncertain where the good professor is going with this as it certainly isn't an internal ASL pun.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw7BqZ5A3W_x3JKNh54AaABAg", "comment": "excellent lecture for a linguistics enthusiast!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyDMhJf8X6xA7X11dN4AaABAg", "comment": "wish the last 2 lectures were taped", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwFVhD2deL8K4UpToF4AaABAg", "comment": "Professor am sitting in our empty amphitheatre here in med school imagining am attending your lecture ❤️❤️ hope I'll get to meet you one day", "votes": "8", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzmJu2YaTegniWrMlR4AaABAg", "comment": "We need another update on the \"Zebras\" book, please.", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx-eIqjTnmTanfOQH14AaABAg", "comment": "11:55, 13:40, 27:30, 33:07, 44:55, 52:30, 1:34:26", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy1rYl1f8iR9ZoBGVJ4AaABAg", "comment": "LOVE ALL THE LEARNING!", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxRE4XSKx1mKVemf9N4AaABAg", "comment": "Do you think that we can't teach other animals language because they dont have a long development period like we do? I mean if language describes stuff going on around us, and we learn the language semantics before we can act it out, if this order of process must be maintained,  the other animals just dont have enough time to learn then. Maybe we ought to try teaching other animals with comparable juvenile period lenght", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxmwrbImoHRc0vK28h4AaABAg", "comment": "So curious what he thinks about dogs like Stella and Bunny with those talking button mats", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxa8gR_w1xIUOJW_th4AaABAg", "comment": "The eager sponge acutely gather because weeder temporally burn above a unbiased trade. macho, voracious seagull", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwqwz4XfIeSHhLGDsF4AaABAg", "comment": "This man is my idol. He's been pushing me to pursue my academic achievements for years now.", "votes": "9", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxWEfI3uRnMAaqAiCR4AaABAg", "comment": "Someone want to help me translate these readings into Spanish, please!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyfuNtynnlukp03dtB4AaABAg", "comment": "Dr. Stanford is on the stampede...The stampeded knowledge  level.Stay original Dr. Like you  are", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxyFsN14T8rJpL4maF4AaABAg", "comment": "When he discusses William's Syndrome, and explains IQs around 70, I immediately think of TV writers.", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxdcDkzqoUubM5FD1h4AaABAg", "comment": "Great lectures! super helpful but wow like there has to be at least 5 or 6 really sick people in that room with all that coughing.", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwnweuqzJYkaJhTIR94AaABAg", "comment": "what about parrots? so you're not going to mention the slight resemblance to human language that they have? like are you fucking stupid? what makes a parrots vocal system different than monkeys? idiot..", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw1oQVo02hyczCwHF14AaABAg.9HyJvfhKp789L4JpxFX15a", "comment": "That is the best way to teach that paying attention to those kinds of details misses the framework he is pointing out.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw1oQVo02hyczCwHF14AaABAg.9HyJvfhKp789L4X2G_r2yb", "comment": "His wonderful facility of speech is his flow of consciousness presenting what he is interested in, so he has almost no hesitations of word choice, he can trust that he is sharing what he is interested in, and what he doesn't consider important will not be emphasized.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyDMhJf8X6xA7X11dN4AaABAg.9HirYHZA9ED9IgZ1Gd0TE7", "comment": "There, a similar one from him: https://youtu.be/4WwAQqWUkpI", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxdcDkzqoUubM5FD1h4AaABAg.9FptIYcKE979M01KDMXhHz", "comment": "Freshers flu", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzAy9vaAIkG1BIjQEx4AaABAg", "comment": "How come he fails to mention prakrit and sanskrit?", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw-oHah1ICnrQXSFnJ4AaABAg", "comment": "he means 'BRITISH SIGN LANGUAGE',  someone let him know.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyFnSIaB9JtWqPI9yl4AaABAg", "comment": "This guy is brilliant.  I'm about to binge on all his lectures.", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgywVb30wUIYepzXf294AaABAg", "comment": "Go to  iTunes for better quality", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy8uwqO1yxg0N8whGN4AaABAg", "comment": "One of the smartest people I've ever listened to.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyu49fhKKI_eo_57KJ4AaABAg", "comment": "Recursive~ relating to or involving the repeated application of a rule, definition, or procedure to successive results.   If you were needing it as I just was - some breakdown of recursive", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwjzTayWQK2CkctgHt4AaABAg", "comment": "Prof Sapolsky's sense of humor beats any comedian I have heard, professional or not. Science based humor goes deeper than most other forms, especially when the science is about human behavior, which includes comedians.", "votes": "50", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyQhqaMENvQrYuWoAp4AaABAg", "comment": "He is one of the best lecturers I’ve ever seen.", "votes": "10", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzJ1iMOHvrf26aPXcp4AaABAg", "comment": "“I am feeling a corrosive sense of disquietude.”", "votes": "4", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzAfFUfyyYGoFLftx94AaABAg", "comment": "So if you had a stroke and lost say English, could you then learn Chinese or vise versa ??", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyiua2LoBf4vJ4Cng54AaABAg", "comment": "Dr sapolsky we are waiting for season 2", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx3Z4QxBmc35tFUGBx4AaABAg", "comment": "Too bad I got to these lecture so late.. Fuck Netflix... this is amazing.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw5n-RalVUN04JpIbN4AaABAg", "comment": "\"Adults do not invent new languages\"  Tolkien: hold my English degree", "votes": "193", "replies": "5", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzcBpPb8v3Twz6AoN94AaABAg", "comment": "Hello, thanks for uploading and captioning such great lectures! Having these available and accessible is an amazing resource.  Small caption correction: At 30:20 the captions read \"will produce a Chinese Broca's aphasia, or an alexia,\" however, this should be \"will produce a Chinese Broca's aphasia, or analexia,\".  Thanks again!", "votes": "4", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz122Q2y4ztBVb-0j54AaABAg", "comment": "While it's absolutely interesting, this doesn't seem like a class where you could be tested on the content of these lectures any more than just memorizing trivia from it. This is more storytelling. By hearing this, you're not building a toolbox of strategies to solve future problems. It's a narrative. It doesn't let students prove or disprove anything being said.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw20RVPXx2Oe_-OZQJ4AaABAg", "comment": "4:40. What he calls generativity is better called discreet productivity, and it's not about words, words can also be infinite. It's about category of sounds. English only has a few sounds ~36 IIRC, but you can make infinite words and infinite sentences. About embedded clauses, it's contentious whether it's universal, but even then, it's not necessary to argue for universals.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzfW1-hhEuXmMw9FvZ4AaABAg", "comment": "He was so ahead of the fashion curve when it came to the beard.", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyQB0NhtR7vky4OZWp4AaABAg", "comment": "yes sir, you are another proof that left-handed people are the most intelligent ones", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgypSR0HMomdseReM5p4AaABAg", "comment": "This guy is shmart", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxgCMAWIkn0wVC-8bd4AaABAg", "comment": "all I remember was past-your-eyes milk and koko...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwjzTayWQK2CkctgHt4AaABAg.9EqYnwpfszu9YE2z8DqCSV", "comment": "Puns hit different when they're being signed, lol 🤣🤣🤣", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwjzTayWQK2CkctgHt4AaABAg.9EqYnwpfszu9YmfVchUP3a", "comment": "The best jokes are always about human behaviour", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzJ1iMOHvrf26aPXcp4AaABAg.9EXFIUuAurp9GLYP5TYrSr", "comment": "I have been saying this to my girlfriend. She looks at me as if I'm a bit sick.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw5n-RalVUN04JpIbN4AaABAg.9DT_13ScLiP9SPGfWpMHFk", "comment": "Elvish", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw5n-RalVUN04JpIbN4AaABAg.9DT_13ScLiP9XZs98MuyM-", "comment": "I take credit for inventing the word \"slackadaisical.\"  Meaning \"lackadaisical\" but also with the judgmental addition hinting at \"slacker.\"  A lackadaisical slacker, in short!  Much like my lazy bum self, no doubt!  Of course, \"slackadaisical\" isn't in the dictionary and is strictly my \"invention.\"  But I'm still fond of my little invention and use the word with much glee from the time to time with my \"in-the-know\" friends.  Can we say \"Bravo myself\"?  Yes.  We can.  And we just did! For that matter, I also came up with a Japanese word \"Zurusha.\"  (Accent on second \"u.\")  The word \"zurui\" means \"unfair\" in Japanese.  I wanted to be able to say \"unfair person/people,\" so I added the Japanese suffix \"sha,\" making it, in this case, a person.  So \"zurusha\" means \"unfair person/people.\"  Not in any dictionary, and strictly of my own \"manufacture.\"  My wife and I use the word all the time with much silly glee.  Not in reference to each other, happily.  Can I say \"Bravo myself\" again?  Yes, \"by gum,\" I can.  And did again!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw5n-RalVUN04JpIbN4AaABAg.9DT_13ScLiP9aPByH-73xZ", "comment": " @Radiatoron88  imma use slackadaisical", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw5n-RalVUN04JpIbN4AaABAg.9DT_13ScLiP9aPTC1VtMB3", "comment": " @maryu8328  I hope you enjoy it as much as I have!  \"You go girl!\"", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw5n-RalVUN04JpIbN4AaABAg.9DT_13ScLiPA-Kux6FAsIC", "comment": "He based his languages on other languages.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzcBpPb8v3Twz6AoN94AaABAg.9D-AtZ7qSoI9D-Ia34wras", "comment": "Additionally, at 1:08:14 it reads: \"So these two trials-- the first is called the Paraha. And the other is called the Murdruku, I believe\" should be \"So these two tribes-- the first is called the Pirahã. And the other is called the Munduruku, I believe.\" These tribe names occur again at 1:08:30 and 1:08:41. Thanks", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugz122Q2y4ztBVb-0j54AaABAg.9CruNQzCavd9L4ZA_8BPZz", "comment": "What do you think the content is? I find the groups of related factoids are to show you directions of approach to the problem of disagreement on what language is.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxIte5lzIKqxLDlAW54AaABAg", "comment": "6 year old shy creative female child was forced to write with her right hand after presenting with a left handed writing preference. The incident was so upsetting she was suddenly made mute for 6 months and began to suck thumb. The only way they could get her to talk was to let her sing. they put her in daily music classes.  This sounds to me like a BROCA APHASIA. You mentioned how broca aphasia stroke patients even if they couldnt talk they could sing.  She developed cyclical selective mutism as an adult. In her 50's she developed PTSD.  Is it possible she suffered a stroke when they did that at 6 years old? Could it be possible that the incident did damage to this language center and a broca aphasia resulted?   Is it possible to verify this is what happened via catscan or mri? Is there a treatment to repair it or some kind of therapy?  Symptoms still surface apparently during times of stress.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzVNGpToxOGwTMGjIl4AaABAg", "comment": "I mean, if you know ASL you literally cannot convey anything if you're tapping the table with your hands but I get it :D", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy95t_DMi4tNFl9jEZ4AaABAg", "comment": "Recurssion is a word in programming referring to to infinite repetition. Fycompa is an anti-epileptic with few side effects. but does cause increased fear but not anxiety, constipation. keppra is an anti-epileptic that causes kepprage and personality change that is permanent for side effects. American sign language and Japanese sign Language are very different. But they have poetry in most sign language that get's lost in translation.", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxK-RZty2pcZXo-c1l4AaABAg", "comment": "This peer group learning theme is typical for environments where bilingualism is not a positively charged issue, typical e.g. for the US. In most European countries children at home speak almost only their parents' language, which leads to all kind of other problems - they have difficulties of learning the dominant language et . So that American children don't want to speak their parents' language is due to embarassment and shame.", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzUpz6pHig16_JSwoZ4AaABAg", "comment": "these lectures are legendary", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyCAz2mAy63-vDaYBh4AaABAg", "comment": "don't mean to complain over something as beautiful as these lectures...but by god, if you're going to cough the whole time, just go!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyk7G4pKvtJ9Ow6NeJ4AaABAg", "comment": "Whoever came up with the “past-your-eyes milk” pun in ASL can't have been deaf all their life, otherwise how would they have known that “pasteurised” and “past-your-eyes” sound so similar?", "votes": "16", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwlxYCZ3J0kfIlD_eh4AaABAg", "comment": "Too bad last lectures were not recorded.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzbNKygqapVI6N8Hel4AaABAg", "comment": "NO!!!!! Not KOKO! Dear God in heaven how COULD YOU? YOu break my heart, stomp on it, grin, then hold it up to my face and squish it through your fingers!   THis is exactly how my husband informed me of all the dirt he knew on my childhood favorite TV program, \"The Howdy Doody Show\"...he whispered softly in my ear shortly after I met him: you know Buffalo Bob was a lecherous old drunk dont YOU? YEah  he was constantly trying to stick it to Princess Summer Fall Winter Spring chasing her round and round  the SET! ANd one day while the camera was still running still on the air and the kiddies were yaying their little heads off, Buffalo Bob slurred \"There, that ought to hold the little bastooords til next week.\"  Buffalo Bob ended his days owning a bar in upstate New York....  Got my PhD at Northwestern in 79....KOKO WAS all the rage then! A cult hero at the time. MY world is littered with fallen heros.....that is your fate when you live a long life.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgypWHVzME8yk-4Qu-p4AaABAg", "comment": "Wow it took me a good while to understand the \"pasteurize milk\" in sign language thing...", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyEj_Mq-KREDBCIRqt4AaABAg", "comment": "Imagine getting snitched on by a gorilla", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwJIhFNJPtdDG2IMEB4AaABAg", "comment": "This guy totally rocks....", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwERfPtARcUC2bniqd4AaABAg", "comment": "Noam Chomsky triggered me to watch this ,very nice.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzWU6QFistEKJ9_0394AaABAg", "comment": "I wish my GPA was better right now. I'm here to figure out a few things a out myself, without which I stand paralyzed. But I swear I won't be thwarted.    Just putting a private thought out there. Hopefully nobody sees it.", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwfWI81cQVF3RE_hpZ4AaABAg", "comment": "Human contact commits to the voice... when we speak we connect and it’s like contact. Everyone’s together.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy3awiPk5InRUG2XKt4AaABAg", "comment": "How would u react if someone told u I can't speak but ,I can sing...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzWYr6v444fQAhwjZp4AaABAg", "comment": "11:45 31:51 44:14 1:00:45 1:17:45", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxETVy0hF_azk4_KcJ4AaABAg", "comment": "where can I find biology of religion lecture???", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzBRn02WLN4rbO22C94AaABAg", "comment": "To hell with coco the gorilla - he plagiarised & still passed where I've studied my butts flat out yet still got lots of assignments unfinished - the university in London won't let me back in campus to enrol & complete my 3rd yeas business degree.  Here is the verdict; I so hate coco  :)", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyRHvKR0osvF0xGgb54AaABAg", "comment": "I need assistence on Post Epic Educational Videos depression now!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxK-RZty2pcZXo-c1l4AaABAg.99rRi89zX1r99wf3Nc_igR", "comment": "That's exaggerated, most 2nd gen immigrants and almost all 3rd gen immigrants in Europe don't speak their parents/grandparents language. At least that was my experience with North africans and turks in Europe", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxK-RZty2pcZXo-c1l4AaABAg.99rRi89zX1r99xRx1u-5xc", "comment": " @oussematrabelsi9429  very interesting in Vienna (Austria) over 50% of children that speak the language of their parents at home are non- German speak, these are certainly not all of them 3rd or 2nd generation immigrants but many of them are. Almost all Turkish immigrants of either generstion speak Turkish at home and many of the ex- Yugoslav immigrants as well. These findings are not only statistics but also almost all the people I know speak in their mother tongue at home, mostly not the standard version but a \"kitchen\" version of it - regional dialect, not a big vocabulary etc.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugyk7G4pKvtJ9Ow6NeJ4AaABAg.99S3GteeiLG9H4wb1gauoL", "comment": "There would have needed to be continuity with the hearing population, so I assume deaf kids had hearing kids they were friends with and wanted to communicate with. Pasteurized milk is probably one of those hearing friends explaining the discovery with the deaf friend. The hearing world most likely develops faster than the non-hearing world.", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugyk7G4pKvtJ9Ow6NeJ4AaABAg.99S3GteeiLG9SoDH-Punhi", "comment": "I was wondering be the same thing. Is it possible they use phonetic symbols to learn how to pronounce words?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzWYr6v444fQAhwjZp4AaABAg.96vgMSiYZqp9Hw0kfEomY-", "comment": "Thanks sir", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwHue3HXLd807XzXux4AaABAg", "comment": "Not bad, but much of the data is sorely outdated.  In fact....much of this has a social leaning and not \"unbiased\", but maybe the cleaver sociologists may point out that human behavior and it's research is the new \"j curve\", so the \"tech\" or \"data\" is advancing super fast.   Most of these terms presented here although many still used?  We have many different perspectives when it comes to the way we comprehend the brain and it's functions.  Just as well we have made many more social understand changes.~~~~~~~~~  I hear a lot of under preach to embracing simpler languages to allow for lower IQ's?  Over embracing simple syllable words in favor of complex ones so we can over harvest \"diversity\"?   Hmmmmmm.   Tribalism because Japanese is too hard for my brain to understand, so we shouldn't aim for it and nurture simpler cultures and favor them?   Hmmmmmm.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyWq09qyFYoFOzy0VJ4AaABAg", "comment": "What about animal behaviour and the subject ;) Bilge", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxhDyGuSiSMjrqZtTx4AaABAg", "comment": "Around 1:10:00 Well, also our Germanic number system evolved from one, two, three, four, and a lot as an orginal way of counting and much later it rose to ten, which meant originally \"full\" or \"complete\", and higher numbers.  We know that four must have been for a very long time period our highest number as eight means \"double four\" in very original proto Indo-European language. Explanation: hunters and gatherers did not need higher numbers. Just when human beings started to become animal breeders the numbers grew with the number of animals in their herds.", "votes": "17", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzMleZ6mPliErQQ4vV4AaABAg", "comment": "49:44", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwLv0tYS4Qo1cT8bwp4AaABAg", "comment": "Please be careful and more specific with how you present the Sapir-Whorf hypothesis, which, in its strong form, is not supported by evidence and is considered discredited by linguists.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3DWYhW8wYapiI-R14AaABAg", "comment": "Prof. Sapolsky: In relation to your statement that languages are created by children; I wonder what is your opinion on  programming languages as they are completely generated by adults and describe concepts that are completely absent in childhood. For example, the concept of a Flip Flop in electronics, that is the basis for abstraction on what happens inside a computer. Are these processed in a completey different portion of the brain?", "votes": "0", "replies": "5", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx5NlUD9eq44wN_aCV4AaABAg", "comment": "In his last book \"Behave\", he explains how one blind patient had a stroke which destroyed parts of his visual cortex and how this person lost the ability to read as perfectly as before. Oh you think having a stroke in your visual cortex is no big deal if you are blind? Sounds like not.   personal timestamp : 1:22:45", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzGRgz_qVAVWAZrDnh4AaABAg", "comment": "лекции 10лет!! очень интересная!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwb4FZhiqYw_IK4Z794AaABAg", "comment": "This guy is talking about a million different topics, this is disorganized and confusing.  Thank God I didnt have to listen to his lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxDyy6r5t9JO04sXJ54AaABAg", "comment": "Little Leva Tolstoy didn't just throw a tantrum about being addressed improperly by his wet nurse. First he got a wet rug shoved in his face repeatedly for spilling a jugful of kvass over a clean tablecloth. ))", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyMss-zsQsF0iPErrV4AaABAg", "comment": "Prosody", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx4nrxNGrvGgWnEUuB4AaABAg", "comment": "Fantastic lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwWtvN0hBqkaE_Plnd4AaABAg", "comment": "IT ASTOUNDS ME JUST HOW GULLIBLE PEOPLE ARE TO BELIEVE THIS STUFF.", "votes": "0", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxqElSqsCcu3rPjq-N4AaABAg", "comment": "yes this man have some awsome brains", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxDtTV_6AmicTCUz9V4AaABAg", "comment": "So there is no proof one on one speech therapy works in acquiring language????", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzGMaYyqh1eyxzwmGV4AaABAg", "comment": "My son was really good at deciphering tone of voice but was nonverbal(autistic). It makes sense he was right brain dominant. Learn something everyday lol", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg", "comment": "Has anyone else noticed that Sapolsky hardly ever, if ever, says ”uhm” when lecturing?", "votes": "506", "replies": "40", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwVHwN1jU5XsCjrnup4AaABAg", "comment": "Can we put in a request for a dolphin language lecture?  Do they tell jokes?", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwSfE2AxvJn0qRxtOB4AaABAg", "comment": "Do dog fanatics love cats? NO, not at all. Do psychiatrists love animals? Not at all. Do sadistic clans love animals or children? Not at all. Do rapists love animals? Not at all. Do \"sluts\" love animals or cats? Even more, than any rapist, dog fanatic and hooligan will be able to. Do satanists love animals or children? Not at all, they hunt and terrorise them even into death by torture, as are psychiatrists and terrorists used to in their hate to animals and as the sadists, which are used to torture, beat, chase and terrorise animals \"this sluts\" and humanbeings out of their way, which at least don't laugh about those sadists, which are used to torture and beat and terrorise animals and humanbeings out of their way,at least all those, which could be in despair about the damage and loss, which those brutals in their love to injustified cruelty and sadistic violence are used to, which is the torturing, beating, chasing and hunting to death of animals and humanbeings alike.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyRTod_7EdzUlpv7hl4AaABAg", "comment": "There are a lot of audio cutouts in this track. Could it possibly be re-uploaded?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyWq09qyFYoFOzy0VJ4AaABAg.94rvyB_ERGi94rw7CPMMlQ", "comment": "Is the mechanism .", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxhDyGuSiSMjrqZtTx4AaABAg.94pbNvwx2fZ9YVG6z1nwps", "comment": "its interesting that 4 is the bench mark there, as its generally agreed upon that 4 is about our working memory capacity. So maybe not only that they didn't need higher than 4, but it was the max amount of chunks we could easily work with.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwLv0tYS4Qo1cT8bwp4AaABAg.93rwGTk-FWj9L4O-TnREOU", "comment": "In the video he says that their hypothesis is endlessly debated, and he relates some examples \"viewed as giving really major support\" and \"potentially deeply constrained by language.\"", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3DWYhW8wYapiI-R14AaABAg.93cCmgF2Trw93rw60iLeFs", "comment": "Computer languages are not natural languages, do not have similar rules, and are not processed like them", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3DWYhW8wYapiI-R14AaABAg.93cCmgF2Trw9L44rCjg0XJ", "comment": "The continuity/development of your original language is never sundered: even if you learn/generate another language system, it remains a subset of your 1st language.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3DWYhW8wYapiI-R14AaABAg.93cCmgF2Trw9L4WPZ7U2bw", "comment": " @clydewatkins9891  I find this hard to accept. I speak three human languages and 4 computer languages, and even when i tend to derive concepts from all, i also invent my own words that are understood by my peers that are completely unrelated to all languages human or computer. I don't see the derivation when I, as an adult, make a new vocabulary. German and English are related in vocabulary but the grammar is completely different, more so spanish. I guess I don't know what you mean by \"language\".", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3DWYhW8wYapiI-R14AaABAg.93cCmgF2Trw9L4p9unW5Rs", "comment": " @jaimedelosrios2977  Thank you. I'm sorry if my brevity caused misunderstanding. I found the professor's \"only children create\" to be a delightfully productive clue that THAT development of language is a different kind of development than what you do after you already know that there is such a thing as information, communication, one-to-one correspondence, true/false, symbols, modifiers of symbols, meaning, understanding/misunderstanding, agreement, meaningful conventions of ordering symbols, conventions ordering the exchange of information, need to verify minimal complete meaning and minimal complete communication or to check for and correct error, joining minimal complete communications to make extended exchanges, and I trust you can continue that for a long time. Leaving this and much more is needed to create language completely unrelated to all languages.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw3DWYhW8wYapiI-R14AaABAg.93cCmgF2Trw9L6imfDS0Dy", "comment": " @clydewatkins9891  Thank you for the attention and time you spent on my comments. I am still struggling to understand the cathegoric statement that \"only children create\" but I think that is something I need to figure out for myself. I have always been skeptical of statements about things that only children can do, for example perfect pitch in music; but then again it may be that I never really grew up. :)", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwWtvN0hBqkaE_Plnd4AaABAg.927R81N5xwb92GcisaSE6O", "comment": "?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwWtvN0hBqkaE_Plnd4AaABAg.927R81N5xwb92HXxLeBNfF", "comment": " @sequenceleaflet6568  PURE GARBAGE. IMAGINE TAKING OUT BANK LOANS TO LEARN THIS BULLSHIT AND THEN LATER ON YOU ARE IN DEBT. AND AS YOU GET OLDER AND WISER AND REALIZED THIS WAS ALL NONSENSE WHICH IT IS. THE GOLDEN GATE BRIDGE WOULD LOOK QUITE APPEALING TO YOU IN THIS CASE.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwWtvN0hBqkaE_Plnd4AaABAg.927R81N5xwb94As_69qYEo", "comment": " @Frank289100  It seems you've fallen off the short bus buddy. Are you lost? Where are your caretakers? Do they know you are spewing your stupid all over the internet?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm91NKW2J-CR5", "comment": "He says, \"ok\", a lot, though.", "votes": "42", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm93DSE1aNLYb", "comment": "I notice \"and\" a lot, where he leads directly into the next thought, and the entire lecture appears to be a single very long sentence.", "votes": "103", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm93bhtHetxEZ", "comment": " @annatrombley5607  it structurates what he says for his students. It's some kind of auditory dot.", "votes": "27", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm94RA-UPaJGA", "comment": "Yep. His stream of consciousness is great. I doubt he attended Toastmasters.", "votes": "27", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm98wElSctIli", "comment": "Yes, very few wasted words or sounds. I like listening to him a lot.", "votes": "30", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9BVAhC6cDa8", "comment": "If you are speaking about something you are interested in with sincere amezement then you don't need to prepare your ideas first.", "votes": "16", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9CPM2z09dC8", "comment": "haha my favorite is \"ooh\"", "votes": "17", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9H01YjIsP9b", "comment": "He likes to use the neat trick that is substituting \"Okay\" in places he might otherwise resort to non-speech.", "votes": "9", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9I-EvB_Ta31", "comment": "confidence in knowledge base obtained early on in his learned communication process", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9JuEQD1c3nH", "comment": " @annatrombley5607  Everybody says OK a lot. It's the most widely used word in the entire world.", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9OEyhRtiItQ", "comment": "Absolutely. He has a mastery of the language, deep knowledge of the subject matter and the passionate desire to educate. He knows what he's talking about and how to speak properly.", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9OWPYi8ZAhh", "comment": "No filler words. He’s incredible", "votes": "6", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9Ox1InfY7kx", "comment": "\"What's that about?\" tho", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9QQf6X-E2Tz", "comment": "wow", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9Qb_pIF98i4", "comment": "It’s not magic, it’s skill and practice. Teachers don’t just adlib their lectures.", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9RThmG6EaAt", "comment": "No need for verbal fillers when your that intelligent", "votes": "7", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9RvCBoj5-gO", "comment": "FrankMeister392...well the absence of 'um' and 'uh' did not dawn on me until I came across your comment.  What HAS got me very curious is that- with so much nonstop talking, he is definitely losing hydration - and YET has no water there to sip on. I keep wondering about this. Maybe he hydrates significantly during breaks (?), and of course, we just never see that in these videos.  I just 'discovered' these YT lectures...having become curious about him and his (disillusioning) declaration,  'we have no free will'...followed by his brief explanation WHY in a recent interview I watched. This came up in his (also fascinating) interview by Addrew Huberman (Huberman lectures every Monday on his neuroscience Podcast)...and is, himself, a fascinating Stanford lecturer.  Someone mentioned in Huberman's comments' section that Sapolsky also lectures on YT. Idk if Sapolsky has his own YT podcast, but in searching YT for his lectures, came across these Stanford U Lectures of his from 10 yrs ago.  So, yah, I initially began watching these trying to figure why he believes we have no free will - hoping I'd somehow find him to be wrong about that...and now I'm hooked on this series of lectures. Nevermind that they are 10 YO. As disappointed as I was about his stance on man's free will, with these lectures it is beginning to dawn on me why he's come to that conclusion. I can see now why he does not believe in free will, much to my chagrin.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9Sxhk3x9FEl", "comment": "He just knows what he's talking about: he's very competent, has a wealth of knowledge and I suspect he's got a very high IQ.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9Sy-__GUmVv", "comment": " @Khiff  'suspect' his genius no longer!  He's a recipient of the MacArthur Foundation Genius Grant. You know that saying...'you 'become' like the five people you most hang around with in your life? Well!!  I'm hanging out  ALOT with Sapolsky on YT  (o.k., not literally but I AM an avid watcher of his lectures)...so fingers crossed that at least some of that genius will rub off 😅  Also, book, 'Behave', is just as fascinating as his lectures!", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9SyXLZqNp0e", "comment": " @barbarafairbanks4578  I know, I read his book. It's just brilliant.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9TX8Vfvpz9F", "comment": "Myl lm m mock  He hmm hmhhhmhkhhmhhe  Hhhk h  K kHahn Hhhumyh.  I you you  UC I’m muuluh do muuuukuhuuhymhukuymk kyuvvkuukbum hkuuum  yuk uh k Myka    H.   Myu my high.   He mymhh yk kevin h Kim kI mmm k.  H. He you  Unk know   Jnlnn  no job ppkmll. Lonkook. O nooookk kook k m lokokkmk m I mkI look 👀 k Kkkkmo No ok ok p.  The konly looks on kn kk  loop n. The m I pomp kthis on  The kk are ok ko✅ pthe n moI kI was Oopk. N kI n N O.  IThe k pnI k N onn k n look 👀 on knn The     KThe n I n popular  o  Ik  N   NThe k I  N Nah    Kk on lol The    K k nI kl no.  The  No n o momnknknkknkn kis nis nnn of k nknknnn forget bn. Onna and onn non K in nnk humu yuk. K me ymkmh is y uh. K me yuk hkhe my sister h mmh. Mmmyk mug my yum i. I’m yk ymyk. friend look", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9TX8WvvundP", "comment": " @clawsoon  no o. Pink kk k  Kno nonn On i n I. K. N. Nbnb  O N. PThe kno boo  P. Noooo kk kno K. Pop N. K no   lol n  Okl K O  o nooo   Jo k m on nk The   Pop   Kno   Kn", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9TX8ZZmyKJR", "comment": " @Sqlut   k kk No I’m no seriously n   Nun nk N Pk I’m no mom   N no knkno kkkpkn P nkpink p k N  K O kno Kkno   No i n  Nko  N. On kn  Kkk pbn Kn nipknkni   Inp i N kno N kn Nn K no nk kn N kn sun nnno kkpnnok no  Knknn kn npnmkn N kpnknp np kpn Kn kk  N N Nnpkknpnkknkn kn non n kn", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9bPW4LfcqxJ", "comment": " @TipoQueTocaelPiano  but most people don’t know what it means lol. Owl klear. All clear", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9bXMhwDhV4A", "comment": "Noticed this with Sean Carroll. Became off putting eventually. Uncanny valley.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9c5vaExEp91", "comment": "As someone with MERLD yes 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9e95NAlAZN2", "comment": "He's a mmaster.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9p8MKCGAqYm", "comment": "he does do \"uhh\" a lot in the beginning", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9vvOiosl68e", "comment": "It seems like he doesn't even pause to take a breath!!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9w5QjyXwbJS", "comment": "I like when he says “ohhkay”", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9xH5leTSQiL", "comment": "ok", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9xWluLqn_2D", "comment": "So what?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9y4pyeDJyFv", "comment": "Literally never. Very smooth and efficient with an enormous volume of speaking. 1, 2 hour lectures delivered effortlessly.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9yCCoLFyPAa", "comment": "Cos he doesn't stop talking", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9z6I76j51jO", "comment": "0:16", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCm9z6xxT7wnQK", "comment": "Now I can't focus on what he's saying because I can't stop waiting for him to say 'um' 😅", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCmA-MGbiaTfzY", "comment": "Years of practise ?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCmA-MGoSMBBOn", "comment": "​ @annatrombley5607 thanks.now if i try and give my daily lecture for mi turd,it's all umm..kay's 😬", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCmA-UvJWQIdnz", "comment": " @Sqlut it’s like Tarantino", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL6CfQ5ziw6rOWSe94AaABAg.9-P-RLwcaCmA7kMO7Z_hH9", "comment": "A common trait, 99% of people that know the subject they are talking about will never use well,ah,umm😂", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwVHwN1jU5XsCjrnup4AaABAg.8zyh3g9Zdey9Fmtx2WH4vI", "comment": "@Jack Don this idiot didn't even mention the language of these other magnificent animals like dolphins whales and parrots.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzRIPxEN09oQcmETVR4AaABAg", "comment": "whatcha mean we can't have partial words? (just used two in that sentence) Never heard of a ha penny (another partial IMO) May be texting wasn't as popular 10 yrs ago.....lots of partials used there or am I misunderstanding his definition of partial? I'm using this basic definition - existing only in part; incomplete.", "votes": "2", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyGqWo-MhiaeIV65wJ4AaABAg", "comment": "camera operator wants to be a motion detect security camera sooo badly.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzoR_cE7w7LHVIY9G54AaABAg", "comment": "I speak mother-ese to my dog, except I really am  trying to teach her language.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwNvOrhf6mZ_owl7F14AaABAg", "comment": "Great book “Are we smart enuff to know how smart animals are”", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgygfFTUiT8OhK6CAoh4AaABAg", "comment": "Fascinating!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx2ZMXSwV4wsw9yXs14AaABAg", "comment": "I was expecting something about esperanto, there was a reference to it in an earlier lecture.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxsA0FiMlMKW9I3aYd4AaABAg", "comment": "23:30 wisdom of the crowd. Just get a big room full of every major and ask a question, someone will probably know.", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwyaXJbuPjxspib-J14AaABAg", "comment": "If Wernicke is a Poobah, what is Sapolsky?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz92ugn4LzPX2tQokV4AaABAg", "comment": "I've found this whole series fascinating but for pure entertainment value the whole story of Koko is a high point.", "votes": "5", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyo2JZyEbfgoL5YWV94AaABAg", "comment": "„Last two lectures not being taped” - no!, Im heartbroken", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwt0wPWHvnlKK2wm_B4AaABAg", "comment": "These lectures are pure gold.", "votes": "29", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgygmRk_C4zqx_ygGpR4AaABAg", "comment": "Pity this lecture doesn't discuss the effects of written language.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzWr-3iDhWbY-bfxMh4AaABAg", "comment": "easily impressed fools", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzviocxok4jGXCxSxN4AaABAg", "comment": "What happened to Donald the chimp??? Easy: he's now the POTUS!!!!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwgpvsna8f25D8h8iB4AaABAg", "comment": "A useful distinction that is not mentioned, is the distinction between prescriptive and descriptive liguistics. Prescriptive linguistics is the \"how to speak properly\" taught in formal settings, descriptive linguistics (the area that most linguists study)   is the study of how language is actually spoken. Descriptive lingustics includes the study of Patwas, slang, pidgins, and any other form of communication that exhibits syntax.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz-2cD8wFFFNckBUAx4AaABAg", "comment": "https://www.youtube.com/watch?v=dvlsdOiOSN4 Williams disorder", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwwIK8ta9hiumLo4aV4AaABAg", "comment": "I'm shocked more cultures didn't count in ways like 1,2,3,4,5,6,7,8,9,10 - than intervals of ten. 10,20,30,40,50 appose to 1,2, more than 3.. and 1,2,3,4, 5 or more than 5.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzUTC4uRlW7RFMTJK14AaABAg", "comment": "I want to see the missing lectures.", "votes": "13", "replies": "4", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzz8q18aVGa6sl1TOh4AaABAg", "comment": "Do male dog owners speak motherese to their pets?  Let's find out. 'Rinka-chan! Who's a good dog? You are! good girl! Good dog! You are so good at being a dog. Rinka-chan you are the best at being at being Rinka-chan! that's what i like about you Rinka-chan!' Yup. higher pitched and i repeated 'good'  4 times. Holy Ｃｏｗ！ how could i have graduated from UCSC class of 2000 without learning that. Rinka-chan is a 15 year old Shizu with glacoma. We rescued her and gave her a loving dog friendly home.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx_r9wjhQi-iMxXY9p4AaABAg", "comment": "It is known that while adult wildcats rarely vocalize, domestic cats do it constantly.  Might this simply be because cats learn quickly that humans communicate that way and so they imitate what humans do as best they can?  I did once have a black cat who was very good at giving \"the look\", so certainly domestic cats are adept at non-verbal communication as well.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzRIPxEN09oQcmETVR4AaABAg.8yx-lWpMW5N94GID_vyNf6", "comment": "when you are shortening word, in text or in pronounciation,  you still use the same word, just in short version. Each word is corresponding to some entity/object/action/property/whatever, and you can't half-mention some entity in your speach (be not mistaken with mentioning half of an entity). Other POV: usually most of words are derived from other words by some change in one single morphem - sounds very simmilar, sematics  does not change that much, but that still is a new word. So, your shortenings are not halfes of worda, but whole words, new ones.   There can be other hard-to-resolve speculation though... What if  someone stops his speach right in the middle of pronounciating some word (for example, signal suddently lost, or talking person was instantly killed to prevent him saying magic word), and that was some long complex word, context is  almost absend, so you end up with half of spoken word phonetically, and also in semantics: part you have heard allows you to reduce the set of possible entities(ones speaker wanted to designate with that word), but meaning is till ambigous. Or  you heard some words at noisy channel: some bits of info gone, but some persist (btw, if you have lost just 1 bit of info, that can be rendered axactly as half of the word, because now it is reducing possible variability twice worse than before.   P.S. Well, ok, let's assume your examples are partial words. But that leads us not to conclusion of inital statement's complete falseness, we just need a tiny alteration: \"you can't have irrational amount of words\"(amount, that cannod be represented as fraction with some natural numbers. you can compose 1/2 of word, 3/5 of word, but i bet you cannot show me some  e/Pi of word", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzRIPxEN09oQcmETVR4AaABAg.8yx-lWpMW5N9L30Sd8HQQe", "comment": "He indicates \"partial meaning\" by the term \"partial word.\"", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxsA0FiMlMKW9I3aYd4AaABAg.8xSkZFLlyu08xfY-htvYh6", "comment": "No, you find the answer when you AVERAGE ALL their answers....it isn't some ONE", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxsA0FiMlMKW9I3aYd4AaABAg.8xSkZFLlyu094GKGxfHSsh", "comment": " @marie-christinavirago3909  , no, you find the answer by averaging ONLY ANSWERS GIVEN BY ppl with decent understanding of problem. If you ask everyone what some exact value in a given interval will be, you'll always end up in tight proximity of exact middle of interval, since normal distribution is symmetrical and has it's math expectation in the middle. averaging ALL answers feels kinda\"like \"several millions of lemmings cannot be not right!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugyo2JZyEbfgoL5YWV94AaABAg.8w_Qx87uF3j8xHM0K6KRew", "comment": "Wonder what the last two lectures were about?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzWr-3iDhWbY-bfxMh4AaABAg.8v_yIBZRFHe9D_bdqgLWty", "comment": "Are your shift and period keys' broken?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzUTC4uRlW7RFMTJK14AaABAg.8tJcq8yVf9l8yuz1FNLPUK", "comment": "Ken MacMillan you can, search for \"biological underpinnings of religion\"", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzUTC4uRlW7RFMTJK14AaABAg.8tJcq8yVf9l8zD8LRny3KZ", "comment": "https://www.youtube.com/watch?v=NNnIGh9g6fA&list=PLD7E21BF91F3F9683", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzUTC4uRlW7RFMTJK14AaABAg.8tJcq8yVf9l92crHCJCXkH", "comment": " @viniislaif1532  Honestly that's my favorite one.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzUTC4uRlW7RFMTJK14AaABAg.8tJcq8yVf9l9IgYp6rTfgL", "comment": "The one in religion is here: https://youtu.be/4WwAQqWUkpI (not the same series, but more or less the same contents, it seems)", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGVL96DQ3s1wFARJh4AaABAg", "comment": "Judith Rich Harris' work which Robert Sapolsky loves to quote does not take into consideration the fact that 200 years ago and for a million years before, hominids grew up along side their parents.  Peer relationships would have had far less of a developmental influence.  Furthermore, intergenerational wisdom, which is unlikely as well developed amongst one's peers, is less well transmitted for the majority of children whose main role models may only be their peers.  This may be the central reason why a deep sense of meaning or a \"crisis of meaning\" is more prevalent among today's youth besides the lack of a moral/ethical grounding from science that was integral to traditional institutions of belief.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwuseE4G16lDz9aWsl4AaABAg", "comment": "thank you sir", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxhk95IhvadWzQ7-IZ4AaABAg", "comment": "Love the idea of Robert Sapolsky being suddenly so hungry he starts giving a lecture regardless of whether there's any relevant audience around", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz5Tv1ZaNlsvjcOgD14AaABAg", "comment": "Love these lectures, but many languages don’t have a finite number of words. Agglutinative languages can create words on the fly.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgytKd25fM66UmJ78bl4AaABAg", "comment": "Consider the following: If one were to take any language and put that language together in all the various ways that it could be put together, all the wisdom that could ever be expressed by that language would be in there, also all the greatest and most moving speeches.  Now sure, there would be a huge amount of junk in there, so proper discernment would be needed.  Consider also: Un-named concept -> Given a name (could be a sound, symbol, etc) -> With an attached meaning -> And maybe other meanings depending upon context -> And maybe even other names with the same meaning.  One could have a lot of fun mixing up concepts, names and meanings, basically creating your own language, especially if it's different than common languages to really mess with people.  (Of course those other people might shun you because they can't understand you and then might fear you and/or believe you to be delusional.  But, it could still be sanely done.  Future psychological experiment?  Hmmm..........).    oslojhjfdoewuwoijioej!!??", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg", "comment": "55:50 Only kids create languages?  What about Tolkien?  People who created Star Trek languages?  Seems it's something adults can do.", "votes": "0", "replies": "20", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw-2D---JKpezSI0C54AaABAg", "comment": "All ethology is, is anthropomorphization of animals. Instead of scientific observation and reasoning, you put the animals in a cage, confine them with human limits, wring them out, and compare the little bits of what they can do within those limits to what the limits are. Sad. Look at the nature of language; spontaneity, infinitely inventive, and compare that to your methods. Real sad.", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg", "comment": "Sapolsky perfected teaching with a trademark style to make it impossible not to grab and keep your attention to completely learn. Gifted like no other teacher can.", "votes": "428", "replies": "15", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyfvMGlU2AEkJoke114AaABAg", "comment": "Isn't possible to download these subtitles? It would be so helpful to actually read it as a text.   Anyone any ideas?", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy_QQq3j_z590gc7WZ4AaABAg", "comment": "Hey there, one thing about Brocca region, it's not primary motor cortex so it's not about moving lips (pyramidal path). Instead, it is secondary, cognitive-coordinative region that regulates function of the motor stripe. Connections are made during language learning process, so it's obvious it's not hard-wired to specific organ (like primary motor cortex neurons do), but more elastic one. regards", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyLbamTAj-R3JgpluV4AaABAg", "comment": "R.I.P Koko", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyYLF5J9Nqvxi71fEJ4AaABAg", "comment": "I personaly don't agree with the statment at the 1:12:35 about feelings and multilanguages...  I speack 4 languages (Portugues / French / English / Spanish) and I don't feel that my expressiveness changes when I switch the language in my brain.", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzn2D4rAjG09SeDsXt4AaABAg", "comment": "Fascinating lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugykmtu99UTWH5vQ26p4AaABAg", "comment": "Interesting, but this guy need to PAUSE and stop walking back and forth...too stressing to watch for an hour! 😎", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxdhcDU_Ke0qRT_hPt4AaABAg", "comment": "Thank you for enlightening us. Seriously.", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzEKT2-dAwHd8cpEPZ4AaABAg", "comment": "This guy b mad dumb", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy3ORBVJ96geGqKiFp4AaABAg", "comment": "Dear Students,  Please be considerate toward your classmates and bring cough drops and water with you to class. The coughing is very distracting, making it difficult to stay focused on the sound of the professor's voice. It's also spreading germs to other students. No one needs to catch your cold. This has been a PSA. Thank you. 😊", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxNIc7QqipkHs3uGKJ4AaABAg", "comment": "The aboriginal languages directions research: https://www.ted.com/talks/lera_boroditsky_how_language_shapes_the_way_we_think", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyfKGdCJM289EWKKj94AaABAg", "comment": "Don't use motherese with babies or dogs or any life form.  What a put down, grins.  Consistency.  Simplicity.  Routine.  Contact with your animals and learning THEIR language!  They do not need to know our language!  They need a language between their owner and themselves.  One word or two syllables consistently used and they will love you and reward you with cognition.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzjhE-aFp07FWa4Lxx4AaABAg", "comment": "doctor Robert Beatles language genetic manipulation professional this and that type of red herring . five whores that changed history t(IHS) doctor Robert changed base it's all good god doctor Robert the Beatles.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz5Tv1ZaNlsvjcOgD14AaABAg.8oGHjyeyB-O9L3172UDcWV", "comment": "That is still not an infinite number of words.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB8oPYx2cWVrO", "comment": "No, not all. Besides those are conlangs and other kinds of genre-specific stuff. Here we're talking about the gradual evolution of natural languages in the wild, from one generation to the next.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB8oPoX8hlS0N", "comment": " @musical_lolu4811  Thanks for the clarification, if only he'd been as clear.  His statement is like saying \"no fruits are yellow\" and when I point out there are bananas and pears, you have to step in to clarify he was only talking about plums.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L4JA2IGFWL", "comment": "\"Create\" was used because he means create. Those adults did not create something entirely unrelated to anything that they had done before.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L4PuWO8olD", "comment": " @clydewatkins9891  Oh so now I've learned from you that every adult artist, writer, musician doesn't \"create\" at all.  Only kids can create.  Gotcha.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L4znoKewju", "comment": " @annereilley4892  Thank you. Such was not my intention. Rather let me encourage you to develop your consciously developed growth as the best artists, writers, musicians do. Sharing that is your adult creativity. Let's expand, rather than limit, our creativity. How much do you think tolkien and star trek languages expand what children do? How much is beethoven's dissonance and it's integration, picasso's painting, joyces writing, from the requirement to leave behind mannered and derived productions in order to be truly creative? How much is repetition of what has been done actually creative?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L52b3iHgDg", "comment": " @clydewatkins9891  I think you've gone a distance from the original point into interesting philosophical questions, but not really what is being addressed here.  Going by the definition of \"create,\" adults like tolkien have created languages.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L56aWd7ONb", "comment": " @annereilley4892  Yes, and looking in the direction shown by \"only children create language\" shows the definition woefully limiting.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L58kBv7NQH", "comment": " @clydewatkins9891  Ok, so that's where our difference is, I'm just going by the definition as it is and you're going by how you think it should be.  If you can somehow get the definition to change how you want, then I'd agree with you", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5Ax0Q-5ds", "comment": " @annereilley4892  It may be more accurate to say that I do not make stone idols of definitions, and didn't define anything. Scientific advancement results from expanding context, define how far you can sail before you fall off the world? You will benefit from a new way of defining the area of interest.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5CXCrA-Sf", "comment": " @clydewatkins9891  I hope you the best of luck on your journey to expand the current definitions!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5FaDtP3xf", "comment": " @annereilley4892  Thank you. Every good thing will happen to you. Please keep studying what prof S meant by only kids create languages, and why that is something different from what tolkien and star trek did.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5IOKBbgEA", "comment": " @clydewatkins9891  I think he needs to come up with another word besides create, because tolkein certainly created a language.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5NqoFxWJy", "comment": " @annereilley4892  That is so wonderful a thinking to share that I feel tickled. Computer or connection is glitching all day, but I got a hint of what the children are doing on Jaime DelosRios thread here, in answer to his incredibly intelligent assertion that he communicates in ways unrelated to any languages.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5QZvrLNHr", "comment": " @clydewatkins9891  I don't doubt his ideas are wonderful and he's thinking outside the box.       I have never questioned his ideas. Your summary of his ideas is identical to what Jaden Smith said, \"If Newborn Babies Could Speak They Would Be The Most Intelligent Beings On Planet Earth.\"  Maybe he consulted with Jaden Smith or vice versa?   They seem to both have the same train of thought. My one and only point I've made from the start is the misuse of the word \"create.\"   I thought we already had agreed his definition of \"create\" doesn't match the current one? When words lose their meaning we can't reason.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5SM_r48iX", "comment": " @annereilley4892  We need meaning and definitions. Much frozen meaning is more the intolerance of ambiguity than it is the fluidity of communication.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L5UUp28XlZ", "comment": " @clydewatkins9891  I'll use that next time I misuse a word. Jeff Goldblum said something similar when a fan misused a word, \"I like your fluid, you know...wet clay version of the language.  I think I'll start peppering that into my conversations starting today.\" Gosh, we have Jaime DelosRios with the same ideas as Jaden Smith and you with the same response as Jeff Goldblum.  It's gold!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L8upfPasB4", "comment": " @annereilley4892  That may be your own reflection you see. Does grammar prescribe how we speak, or does it describe our speech? When a new word came up, the american said I'll look up the pronunciation, The englishwoman said I don't need to look that up I'm English.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L9-AqGNjMH", "comment": " @annereilley4892  Ha! I meant that when we cease to insist that standing still is necessary so we don't bump together, then we can dance, but we have to be even more attentive to kick each other.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L9LXimQ1PY", "comment": " @annereilley4892  Whups, I guess some people might see the dance as an excuse to kick people, but I didn't think of that till I saw that the \"not\" didn't get in my kick each other phrase.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzaagmQfXlHtP_HcD14AaABAg.8nsQcuDb-zB9L9YZ2vhItT", "comment": "​ @clydewatkins9891  I'm all for new words, go for it.  Lots of new words have been created recently. I've only been making one point and that is by the current definition of \"create\" he made a false statement.  We both agreed on that. I never disagreed there could be more done to expand our current definitions, maybe some are out of date or too restrictive. Until such changes, the words are what they are and should be used appropriately.  When you create your own rules for words, it's going to confuse everyone else who is going by the book. Reminds me of a quote from Curb Your Enthusiasm.  \"You know what, not everybody knows your rules Larry.  You got your own set of rules, and you think everyone's going to adhere to them, but they're not because nobody knows them.\"   Maybe you're Larry David?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw-2D---JKpezSI0C54AaABAg.8nMnrckEqmC8oPZ4wKKhTZ", "comment": "Go cry somewhere or whatever, dude.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugw-2D---JKpezSI0C54AaABAg.8nMnrckEqmC8oPv_gH_4Bh", "comment": "There's no need; saying what is, with what is strictly observed, is enough.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_92jck-eRFJc", "comment": "I think he could learn how to interact with the students more, eye contact, more personal history more self degrading jokes?  Otherwise, I would be a very happy student in his class.  Even though I am major ADD (and proud of it)...", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_96_v7ax6fO6", "comment": "Let's dial it back a bit buddy, sure he's good but there are plenty of good teachers out there who can easily rival or surpass Sapolsky's style.", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_98GiVB7UxEU", "comment": " @stormysampson1257  Sounds like a lot of ways to teach less information in a given amount of time.", "votes": "16", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9D1fM3vf8lj", "comment": "Agreed. Haven’t find any better lecturer", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9D1hNpBcwai", "comment": " @davidsan9654  This page is specifically about Sapolsky so I was logically providing my opinion of him accordingly.", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9D1hcA8fhH-", "comment": " @CyberneticArgumentCreator  It is higher education college class so it is designed to be longer analysis of the subject.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9YGL3L_j5Qy", "comment": "I concur", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9ZprT80fuBs", "comment": "My neuroscience prof in undergrad was every bit as good in terms of teaching style.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9Zpt-BAEyNX", "comment": " @trishemerald2487  Sapolsky had his own perfected gifted style. There may be others, although Sapolsky is unique in his style.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9_CwyLk2dlT", "comment": " @davidsan9654  No doubt about it. Lecture 25 of this Stanford series is about INDIVIDUAL DIFFERENCES, and that applies to teachers as well. Each one has a different style, and a different effect on students. Any comparison by a student is limited to a very narrow experience and concerns a very narrow sample of teachers. Each commenter is strongly biased by his recent and extremely limited personal experience. None is an expert. As our Incredibly Learned Professor explained in the previous lecture 22. EMERGENCE & COMPLEXITY, it would take a huge quantity of comparisons to establish a semblance of the Wisdom of the Crowds, with none right on the dot, but somehow circling around it.  Until then, each exulting student's acclaim of \"The very best!\" is a highly subjective comment with little objective validity, just a shout from his limbic system and dopaminergic system. In fact, each glowing comment here is about pleasure and fascination, ecstatic wonder at the breath-taking performance of our Incredibly Learned Professor. The reaction is more about the astonishing effect of the lecturing as an amazing show, and its unstoppable energy, and none about learning. \"Quite interesting\" he would remark in one of his apartes (his way of making a quick pause and catching his breath for the next outflow). This normal enthusiasm does not justify pooh-poohing all the other teachers active in other great universities who may well prove in their own styles as efficient, and possibly, more so than our INCREDIBLY LEARNED PROFESSOR. For instance, a simple test of efficacy would be, after  each lecture, at the door, to get a response from each student who attended: \"What is it that you remember now from this lecture? How many points?\".  It is undeniable that our Incredibly Learned Professor is obsessed with the desire to cram the densest amount of incredibly (no pun) diverse information into the tightest of time, without taking any break in his breath-taking speed, as if he were a thoroughbred racing for a top trophy. Experienced orators who want to make an impact with their message know that in order for your message to sink into your audience, you need to take pauses. The pauses are what allow the amygdala and the hippocampus of listeners to store the torrent of information received from an orator at their own natural speed.  I, for one, watching each lecture on video at my leisure, find it necessary to hit the pause button, backtrack on some passages for a few seconds or minutes. And eventually, to view a given video many times, 2 or even 3 times to be able to register the immense quantity of facts of each lecture. I often feel the need to go to his books, ZEBRA and BEHAVE, or TESTOSTERONE and MONKEYLUV, for more detailed explanations.   Occasionally, I even need some more precise answers on names or concepts from Wikipedia. Following our Incredibly Learned Professor's method, I find it necessary to go back in time, one book earlier, two books earlier, etc, reviewing all the previous phases of his personal intellectual/emotional development to fully understand his present style of lecturing. I even was brave enough to go all the way back to his very first book, STRESS, THE AGING BRAIN & THE MECHANISMS OF NEURON DEATH” (1992), hoping to glean some additional insight in his approach. Yes, there's no doubt about it, there are different styles in teaching, with different efficacy, as will be explained by our very Incredibly Learned Professor in the last lecture No.25 on Individual Differences.", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9_IawORbffK", "comment": "ouo", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9bbbO-WhpNj", "comment": " @roobookaroo  i agree with you, it's a lot of information packed in. When I was a student in college, I was able to really focus and absorb, however, now I do pause it, go back over what he said, and after the lecture i need some time to let it sink in.  Sometimes he talks faster than I can listen.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9dEO40XaCGD", "comment": " @davidsan9654  Bravo. A bit of common sense. All those guys here meet Sapolsky and compare him with the small number of teachers they've known in their lives. And immediately they are carried by their personal enthusiasm, that is, the reaction of their limbic system to the external trigger (experiencing Professor Sapolsky in action). And, on the basis of that very small sampling of teachers, they jump to an absolute judgment about the whole field of teachers, \" Gifted like no other teacher can.\" Which is a bit far-fetched. How many have they known? Say 10, say 15  (a pretty high number, most unlikely). It's certain that in the thousands of US universities and colleges there must exist many more excellent, fascinating teachers. As the psychologist Daniel Kahneman emphasizes, the ordinary man, spontaneously believing his intuitions, has no sense of the dimension of statistics in his judgment.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9fAJwyBxttq", "comment": " @CyberneticArgumentCreator  saying more info doesn't necessarily mean you TEACH more info. The only metric for good teaching is how much the student can recall after your lecture / HW / exercise or whatever method you used. This lecture was literally about the concept of teaching language and you didn't understand the basic idea of what marks real learning.  Don't get me wrong, he is good. But there are certainly better teachers. He's clearly above average, but not exceptional. I love his lectures; but they could be better.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwvMv4004nGRQ_Tk1d4AaABAg.8nDSZGcFrb_9mGuUdnyPJI", "comment": "There is no universal way of teaching. In fact, optimal teaching differs from girl to boy, from young age to old age.  Sapolsky combines a direct approach in regards to the lecture and an around the subject/calm indirect  parabolar way when engaging with the students. Its weird to talk about this language style during teaching while he is lecturing about how to use language. Theres a funny mention at 7:36 of a style of language called \"motherese\"... mother-ease ... which is something he'd also have to do if he was a kindergarden or elemetary teacher. Unfortunately, he is not. He teaches college students which are way past they're motherese days. There's less need of sugarcoated language, high-pitched and sweeted when you're talking with grown adults nearing their 30s.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyfvMGlU2AEkJoke114AaABAg.8muICCo8yqB8mvoaKVbjN2", "comment": "He has a book summarizing essentially these lectures. It's called \"behave\" I believe :)", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyfvMGlU2AEkJoke114AaABAg.8muICCo8yqB98AgykXdzmG", "comment": "look for robert sapolsky rocks on google, there is a page with resumes and handouts =)", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYLF5J9Nqvxi71fEJ4AaABAg.8mJFKNzlhCB8rJUSX856Fr", "comment": "I wonder if that’s because all of the languages, that you speak, are related to each other.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyYLF5J9Nqvxi71fEJ4AaABAg.8mJFKNzlhCB9L4YN-sUjIG", "comment": "The subjunctive and some of the cases in my romance languages and in my german change my expressiveness greatly.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugy3ORBVJ96geGqKiFp4AaABAg.8lpxiBFJyZN8mCUvP47JSy", "comment": "it´s always a mess", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxNIc7QqipkHs3uGKJ4AaABAg.8lpRxmxxB3U8lpS4XEI4qs", "comment": "It is very interesting. However, big names in the field of cognitive science do not agree with that.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugyg4oaBenu5tWLPFnJ4AaABAg", "comment": "What an amazing teacher !!!!   Like some many I am fascinated by WHAT EVER he is teaching.  in school I had only 2 teachers that got through my thick head, Miss Butts- 7th grade math, and Miss Sharp- 8th grade English.  So few teachers that actually teach.", "votes": "12", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyDVcwP_gIZ7I3efYZ4AaABAg", "comment": "Professor S completely misrepresents the behavioral view of language acquisiton.  His lack of understanding this view makes it impossible for him to speak with authority on the subject...although he is confident in his ignorance.", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzywkcXuyVgLd5PPd94AaABAg", "comment": "I am so grateful for professor s lectures!", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6dTu56gyIYPEZJD14AaABAg", "comment": "I love Sapolsky and this lecture is great. A couple things he gets wrong though or doesn't go into all the nuances. 1) Broca's area isn't just for language productions and mouth movement. Its most prominent role is in word order or \"syntax\" and more specifically in syntactic memory. But neuroscientists have moved away from models of Broca's region for syntax, Wernicke's for semantics and towards more complex models that focus on different pathways around the perisylvian fissure (the fold that splits the brain right there). Angela Friederici is one of the best researchers in terms of language in the brain if you're curious to read more.  2) He dismisses B. F. Skinner's contributions to language research way too fast. The history of it's actually very interesting. Skinner wrote this book Verbal Behavior that adapted behaviorism to studying language. Chomsky wrote a review of it that not only decimated it but pretty much brought down behaviorism and started the \"cognitive revolution.\" It's a brilliant take-down but the problem is that Chomsky basically just makes a lot of straw man arguments of ideas that Skinner never even held. Anyways, Chomsky's influence lasted for decades but there's been a resurgence of interest in Skinner's approach. In fact, the statistical methods that Sapolsky mentions where people learn language based on the probabilities of certain words being next to each other owes a lot to Skinner. Types of reinforcement that can be adapted from behaviorism can account for these probabilities. Statistical models are increasingly in favor and pushing out Chomsky's generative grammar. Especially since the computer models of language that have the most success (like Google translate) are based purely on statistical models. The types of learning behind these neural networks have close parallels to Skinner's operant conditioning. Anyways, Skinner's been laughed at in linguistic circles for decades but he's been gaining ground recently. It may go nowhere but he shouldn't be dismissed so fast.", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwlvGO37Hi-zCzDJ6F4AaABAg", "comment": "Can't wait till wednesday", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyCHKThWLvx8PVPQNJ4AaABAg", "comment": "\"daN\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyU3z5Xmnzoq9-VhVp4AaABAg", "comment": "What I took from this -- nouns are fixed points of speech", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz2b_JFi7Z2v3zHVAp4AaABAg", "comment": "Love this guy's books. Your library probably has them.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwzFxOrKGY6Y8yyLwR4AaABAg", "comment": "The primate parte is so cool", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwZO58UQmtjndTJnht4AaABAg", "comment": "Half way through the video \"I hope he talks about Koko\" ... Yes! He's talking about Koko, and debunks the whole thing, wow, did not expect that.  Would love to hear his thoughts on Alex the african grey parrot.", "votes": "8", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzWG6soulLo37KNwkt4AaABAg", "comment": "\"off the rack hominid\"  stashing that for later", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzoRiSVWduspIeQxCh4AaABAg", "comment": "This guy knows teaching", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxkqKnjDVcDyuyyuXZ4AaABAg", "comment": "great", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw_I_tVazmxA0LpLod4AaABAg", "comment": "The word that springs to mind is 'tenable'. More nonsense on the çampus'!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyo-24brKODWBVBrtZ4AaABAg", "comment": "I love vegetable salad", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg", "comment": "I want to marry Robert Sapolsky.", "votes": "69", "replies": "16", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzIKHdFGLsulxigyAx4AaABAg", "comment": "combining this course while gaming is perhaps the best entertainment ive had in many years im going to try all the interesting ones from stanford and then move to mit", "votes": "5", "replies": "4", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggmYNn0Z5RW2ngCoAEC", "comment": "Royal with cheese", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghnupRw8TefcHgCoAEC", "comment": "The linguist's name is Lera Boroditsky. Here is one of her terrific lectures on language: longnow.org/seminars/02010/oct/26/how-language-shapes-thought/", "votes": "16", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgizMDoWSElt-ngCoAEC", "comment": "i guess people who deslike this were holding the phone upside down!", "votes": "19", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyDVcwP_gIZ7I3efYZ4AaABAg.8lB8ARTahjj8oPZLHcDON7", "comment": "Poor you.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyDVcwP_gIZ7I3efYZ4AaABAg.8lB8ARTahjj9D_bR6lH2b1", "comment": "What is he misrepresenting?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugx6dTu56gyIYPEZJD14AaABAg.8iyHoTBeTKC8lstaTCPSco", "comment": "Julian Bass-Krueger nah", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwZO58UQmtjndTJnht4AaABAg.8dR6mBWljUW9RvEq74dH1M", "comment": "Automaton  Gheeze, he debunks Koko? 🤯 Ugh!  I haven't watched this, just somehow landed here looking for his #6 lecture, having just finished #5 - but since I was here I dallied long enough to read a few comments before I left in search of #6.  Oh, boy...yah, that's exactly where my mind would go...'Koko's a fraud??'😳 bbbut...what about Alex? Not Alex too?...please?? Not Alex😟 I am disappointed enough over his stance on 'free will', i.e., we have NONE - which I am (unhappily) beginning to understand...(and I'm only up to lecture #6!   What ELSE in my little comforting/consoling belief bubble about humankind & the animal kingdom is he going to completely debunk?🤯🙄", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwZO58UQmtjndTJnht4AaABAg.8dR6mBWljUW9S00HxXkakI", "comment": "Koko wasn’t a ‘fraud’ exactly, it was just that the researchers really didn’t know what they were doing and were not well taught enough in linguistics. Apparently one of the students they had ‘talking’ to Koko was deaf (ie he was actually fluent in American Sign Languge) and he immediately knew that Koko wasn’t doing anything remotely close to language. In fact she wasn’t even learning the signs at a Pavlovian level. It was just body language mirroring.   I don’t know about this parrot but if anybody is claiming today that an animal is learning language, that probably is flat out fraud. Nobody could think an animal can learn language any more.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig8nEd48lKDi9", "comment": "I’ve a beard...", "votes": "6", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig8nzCjvTB4f1", "comment": "Stay away from him-he's mine!", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig8rOWGu6T4yb", "comment": "Lucky bastard lol", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig8rPxGtbvR6L", "comment": "Nichole Shut your mouth, you’re not alone. I’m a year late with my comment, but this man is making me feel so smart. I listen to all of his lectures 😀", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig8xOPZUbGvn_", "comment": "Didn't I see you in every Atheist Experience comments section? I want to marry you.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig91h2vF0Y-w-", "comment": " @henryporter101  Pan paniscus society based on reactive socially functional group bonding compared to human society after the agricultural revolution based on competitive possessiveness over inheritance, private property, virginity and maximisation of birth rates according to antinatalism based on consent.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig93S8RV91tB_", "comment": "Sistah, you want to marry Robert Sapolsky?  If you came home, and began talking about your problems with your boss, he would interpret you and take 25 minutes to explain why you should be quiet and listen to him talk...haha.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig93SQJknDA55", "comment": " @a.m.6847  He would probably think that competitive marriages are just a byproduct of pastoralist and farming cultures (similar to pan troglodytes socies based on proactive political games over status due to environmental scarcity) compared to reactive socially functional group bonding found among specific extinct hunter-gatherers and in pan paniscus society.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig94NcX1ySxzz", "comment": "Too bad he’s probably taken and for me he is straight.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig96f5KIeLFDR", "comment": "same", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig9E77r-zoqmF", "comment": "It's just his pheromones getting to you.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig9E7d-Ko-_u8", "comment": "John Ferguson ❤️❤️❤️❤️", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig9E7d1sVYQ-G", "comment": "Nikolai Jermihov you did lol!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig9E7d6qZ5M2j", "comment": "strontiumXnitrate Thanks, boo ❤️", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig9E7d8xo88GM", "comment": "Spetet those smart pheromones lol!", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGX85pR-Bgg58FpSd4AaABAg.8XVU0NC6xig9FNfGLFgONt", "comment": "Marry me instead", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzIKHdFGLsulxigyAx4AaABAg.8W_uKK7j7qY9SeTHCVV0C_", "comment": "Good for you - pretending to educate yourself while pretending to play a game. Do one thing, do it properly. Then do the next thing", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzIKHdFGLsulxigyAx4AaABAg.8W_uKK7j7qY9SmM3x1F_M-", "comment": " @madisnomme  i guess you are not then pretending to be alive while pretending to write smart comments on youtube   you may have been right partially that mutlitasking is questionable, but since i loved sapolsky so much i actually watched his classes about 10 times (while gaming), replacing the usual music for his class, and now a couple years later i find that my internal ai has learned about 80% of the facts and 90-95% of the overarching points and lessons, and i had lots of fun while doing it, so i think it was worth it.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzIKHdFGLsulxigyAx4AaABAg.8W_uKK7j7qY9Ssn6dvm7-g", "comment": " @bntagkas  you see. Instead of sitting down, focusing, maybe taking some notes and learning, you do it over and over, getting sporadic and vague bits here and there. Take responsibility. Commit. Suffer. Do I want to game the best? Do I want to learn the best? Stop the deceiving yourself. Your life and experiences will be so much more gratifying and authentic. Try it!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzIKHdFGLsulxigyAx4AaABAg.8W_uKK7j7qY9SyuAa-GXNy", "comment": " @madisnomme  i dont understand what you dont understand. i suffer every day i dont need to suffer more. the way i did it i maximized the amount of fun i had and ended up learning as good as i was ever going to learn. it took more time, but i had that time. on top not only did i learn, as a hobby, but i maximized my fun while doing it. i dont understand what you dont understand. suffering is something to be avoided or reduced, its not a virtue.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugjjb8B7b_-5TngCoAEC", "comment": "How come a deaf person can realize the relation between \"pasteurized\" and \"past your eyes\"?", "votes": "4", "replies": "5", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugg_K2TeFzq_8XgCoAEC", "comment": "Despite this being a teacher-centered lecture, it was really fun to listen to, and quite educational.  Correct me if I'm wrong though but I thought communicative aspects of language that were not related to speaking were called paralinguistics and prosody had to do with verbal/oral contours like pitch, rhythm and pausing and such.", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgiK5V8i20m_RHgCoAEC", "comment": "At 25:10 he talks about recordings he used to demonstrate at that point in lecture. Could you add links to description?", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghaeHCJmNXgYHgCoAEC", "comment": "The \"past your eyes\"/pasteurise, is only a pun if you can hear \"pasteurise\" spoken in english. So it's not a sign language pun, i.e. people who only know sign language won't get the pun unless it is explicitly explained to them.", "votes": "2", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggyMcWU1uioGngCoAEC", "comment": "\"New languages are invented by kids and nobody a whole lot older than them learns the new language.\" (Mind blown)", "votes": "131", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghjyUfMLW8FFHgCoAEC", "comment": "There also is a whistling language in some villages in Turkey. There must be videos online. It could be a 15,000 feet high equator situtation.", "votes": "7", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghdyvuQwpJq8HgCoAEC", "comment": "Cetaceans (some odontoceti so far) are able to transmit precise, perhaps symbolic representational information about performing complex skills and sequences. Since sound imaging differs from abstraction in important ways, and since emotional and arousal states cannot be hidden from their detection, we observe yet other species whose brains are not evolved to coevolve around deception, for which a certain symbolic verbal communicator's brain is designed.   Numerous cetacean species have brains 5x human, with the now-surprising Physeter macrocephalus (Moby Dick, most of whom were genocidally slaughtered for two centuries, for lamp and machine oil) having the world's largest at 9x human, with new evidence of observational capacity and some kind of descriptive communication - teaching or learning skills through sonic observation and/or expression in water far too murky for visual learning.  Neocortex, allocortex, and neuronal density differs in various brains; Since some modulation has been found through certain glial cells, the issue is still quite opaque and unknown to human research.  Alliance Francaise limits their language to a smaller total vocabulary. Very top-down. Most other languages accept new words, especially scientific.  Ravens and many other animals, like the human animal, can hold 7 objects in mind - above that counting is necessary. Oddly, Clark's Nutcracker remember some 3,000 locations. They perhaps use up space for spatial memory that downslope birds use for more social skills. Location and orientation skills are an ethological subject worthy of extensive discussion, having to do with cognitive choice.   Dr. Irene Pepperberg at Purdue and other U's later, worked with a parrot, discovering an intentional and highly social communication capacity, able to vocalize pronouns and emotional responses in English.  Other birds pass that self-recognition test in mirrors, pecking or grooming at dabbed-on objects - once used as an attempt to prove that humans and a few primates were the only animals with \"consciousness.\"  I remember prosody as being emphasis, rhythm, and tone variation.  Intentionality: A young adolescent Wolf who cannot understand human nuance, would become excited as I finally responded to a new intentional signal. A teacher, indeed! Since wolves wag tails in highly specific ways only in concordance with intent (unlike the very neotenous domestic canid), dominant and assertive wolves raise and flag their tails (yes, they mistake the obligate curled-up husky, UNTIL they realize that it is not offensively intended. They learn nearly immediately that gesture of domestics does not share their wild species' meaning). Tail wags of different speeds, styles, and heights have different distinct meaning to observers who share understanding of the signal.  Hormonal signaling is highly important. Wolves have a great number of exocrine glands- even we retain differentially-smelling hand and feet exudations.  A little evidence of hormonal reception as communicationevoking intentinoality: I've seen 2-day old passage of familiar canids immediately excite and promote social signaling and inquisitive tracking - different by far from prey-signaling and mere asocial curiosity; also seeing tracks washed away by waves evoke excited acceleration, gazing toward likely direction, pursuit - all with momentary stares toward companions to signal intent.  Meanwhile the record for developmentally-arrested dog word understanding exceeds at least 400; while different breeds have lost some social attention for wolf language - gestural, postural, ears, facial, contextual.  Familiaris retain recognition of some C. lupus vocalizations, but are mired in excessive usage. Wolves meanwhile, extremely quickly use the trope we call Theory of Mind in increasingly efficient glance/context intentional signaling. With long association in free and wild conditions, the Wolf would respond to my teasing pretension to not- or mis- understand with variable nips (hard! if it was urgent or his mood was short), up to the hilarious grasp of an entire thigh with a just-firm-enough alligator grip, dragging me toward the intended goal or action). Just as human babies learn meaningful sounds from adult interaction, so do wolf pups learn significance through resting in direct physical contact with elders. Species with separately mobile ears, from ungulates to social canids, appear to have the  ability to monitor aurally in two channels. One ear attending to a bonded one, the other monitoring the environment, suggesting that differential stimulation of one side of the brain may very likely be occurring. Silent communication or signaling is important to most mammals. In addition to ASL, ESL, etc. another syntactic human language is Plains Indian sign, which is taught while speaking to youth and tale-telling, the best teaching method I've seen(!)", "votes": "9", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgiK-pDP2oXf33gCoAEC", "comment": "uhmmmm..... Kanzi is a boy", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggfVp5bwgIlT3gCoAEC", "comment": "Regarding 1:16:15, and the inability of dogs to \"Lie\" via pheremones and their anal glands, I think that's not a fair measure. When Humans are nervous or anxious, they can't just decide not to sweat and smell either, but Humans can obviously still lie in spoken language. On the contrary, the act of covering their scent glands by lowering their tails seems like a pretty direct analog for a human \"Lying\" about their emotions by trying to suppress a smile or an anxious facial expression that they don't want to convey.", "votes": "15", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggzI3NHr7q6qngCoAEC", "comment": "If you wanna hear a somewhat female version of sapolsky, check out Tracy Harris!", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjRv-EBxk1-xngCoAEC", "comment": "I deeply enjoy these lectures. I would enjoy them even more at higher resolution and most of all a pop-filter used during the recordings, because every time this genius speaks towards the camera there is resonant noise. The content is, however, priceless. Thumbs up and thank you.", "votes": "7", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghZ0rcDvRlXT3gCoAEC", "comment": "goodness, where has he been all my life? he is amazing", "votes": "41", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugh4eJRbOwjfSngCoAEC", "comment": "does anyone know why religion lecture wasn't taped?", "votes": "4", "replies": "5", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjeUyLzQ15NDHgCoAEC", "comment": "As for the people who supposedly cant differentiate between 8 and 10 or other numbers, you have to consider that their mind can still conceptualize the number without being able to verbalize. For example, an individual could hold up 8 fingers and say \"that many.\" The language has not limited the way they think. When they run out of fingers they could use sticks or rocks as counters to do the same for higher numbers.", "votes": "7", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgiyqwI8o1JxcHgCoAEC", "comment": "Thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC", "comment": "This man is my idol. He's been pushing me to pursue my academic achievements for years now.", "votes": "347", "replies": "12", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjT5syig_Cq3ngCoAEC", "comment": "It's worth doing some research on Kanzi to get familiar with his capabilities. Koko is awful and it's important to know that, but she stole time that I wish this lecture had spent describing what really is possible.", "votes": "2", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugj9mn4ehjCiBngCoAEC", "comment": "According to Daniel Everett the language of the Piraha people lack both embedding and recursion.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghrqsOnoaaQlXgCoAEC", "comment": "He's really full of himself.", "votes": "1", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugjidd4VErP2pHgCoAEC", "comment": "Sapolsky is a great lecturer and presenter, and I enjoyed this lecture. However, he really does misrepresent the behaviourist angle on language (and I don't think the behaviourists were correct). Firstly, the fact that he refers to 'negative reinforcement' when a child produces sounds that make no sense, shows that he is unfamiliar with the terminology and thus probably behaviourism. Sapolsky also fails to understand the behaviourist concept of 'generalisation' , and that generalisation could account for for unique utterances.", "votes": "3", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugjjb8B7b_-5TngCoAEC.8OX0ycrEO8R8XfgLU_UB6p", "comment": "They can't. It was an ignorant example.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugjjb8B7b_-5TngCoAEC.8OX0ycrEO8R8YhzP-40Qg0", "comment": "partialintegral they are deaf not stupid.", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugjjb8B7b_-5TngCoAEC.8OX0ycrEO8R8_liAX-cBjt", "comment": "I had the same thought - it was likely a hearing person introduced that sign! But it opens another question: How do deaf people read? Hearing people learn to read by associating letters with sounds, and words are then sequences of those letters/sounds (more or less.) For the deaf, there are signs for letters but there is no similarly helpful way that they combine into the signs for words. Whereas pictographic written languages such as Chinese do have elements of an intuitive graphical structure that doesn't depend on sound..", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugjjb8B7b_-5TngCoAEC.8OX0ycrEO8R8_lywrIp6lr", "comment": "Tom Bayley Associating sounds with letters is a modern way of teaching people to read. It's not at all necessary that someone understand the patterns of how certain letters appear in different words to represent the same sounds. That just makes it easier to remember spelling and pronounce new words- something mute people do not need.   Letters can simply represent the specific component combinations necessary to write a given word- like if you replaced every word of a language with a random number that uniquely represents it. The numbers do not need to follow any pattern for you to learn or understand the words.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugjjb8B7b_-5TngCoAEC.8OX0ycrEO8R8_mw2EndHht", "comment": "Of course I know that, or else deaf people could never learn to read or write! But the phonetic connection seems to me a huge advantage for a hearing person. Most 'spelling mistakes' are mistakes at the grapheme level but because they still make sense at the phoneme level they can still be decoded. And often we deliberately mangle the written language this way, in text messaging for example - it's kind of  cool. I once read a book partly written in phonetic english (with a strong regional accent!) - I imagine this would be largely opaque to a deaf person. Feersum Endjinn by Ian M Banks.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghaeHCJmNXgYHgCoAEC.8LZZGTEVTcp8h2kx6CkD7U", "comment": "No, it's also a pun if you can read lips", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghaeHCJmNXgYHgCoAEC.8LZZGTEVTcp8nduEEmqMaV", "comment": "I was shown the schoolboy 'pasteurise' joke by my wife (in the UK) at least fifty years ago, using a milk bottle (\"What sort of milk is this\"? she said, as she passed it in front of her face)  I assume that the signing community became aware of this widespread joke (in UK anyway) and incorporated it with their 'udder fist' to extend the joke.  Therefore, hearing the words spoken would not strictly be necessary for them.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghaeHCJmNXgYHgCoAEC.8LZZGTEVTcp8qIUIi0Fw60", "comment": "They can read....", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghjyUfMLW8FFHgCoAEC.8F4X3JVyJI58S-HZ2FcTaX", "comment": "in the Canary island they whistle as well 'silbo gomero' from La Gomera island", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UggfVp5bwgIlT3gCoAEC.8DafAlO_VIV8lojKlSjaEB", "comment": "Yes, I agree with you; blushing is an incredible example of this. Its really difficult to compare the two species, and not being a biologist I can't even begin to imagine how! I suppose it would be interesting to see in dominance match-ups between dogs, whether they can be taught to suppress the 'whelping' vocalization :p I also think it's not a fair comparison because in many cases adverse situations in humans may evoke emotions (fear, anxiety etc) but because the situation is controlled, our rational brain has time to override the emotional burst of the limbic system. A better comparison could be if you scare some humans out of their wits and then compare to dogs, but I doubt that would be ethical! I realize this may not have targeted your concerns directly, but just my thoughts on it :)", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UggfVp5bwgIlT3gCoAEC.8DafAlO_VIV9CEdR6VFfai", "comment": "There are subtle differences to take into account first before comparing how humans and dogs communicate.  Dogs communicate hormones, this involves producing and comprehending hormonal messages, we do not, we can detect hormones just in a subliminal way. A single human might be notably nervous while lying but is not our capacity of smell hormones the mechanism to detect it, is the cognitive process of communication.  If humans can lie, might include the fact that some of them are good at it and some of them not.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UggfVp5bwgIlT3gCoAEC.8DafAlO_VIV9L4SS4gpxSv", "comment": "When you distinguish truth from lies, actual/real from false, then you can lie. Deception that is entirely redirecting or avoiding of attention is not a lie. Would you call the animals action to attract attention, telling the truth?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZ0rcDvRlXT3gCoAEC.8CHJwuxBUSI8ltmImEUYqm", "comment": "Elvis Macpherson xxxbf", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZ0rcDvRlXT3gCoAEC.8CHJwuxBUSI9Sw2PxIwDHu", "comment": "Wow", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugh4eJRbOwjfSngCoAEC.8BSdx-B07XT8EC1cFC_O6A", "comment": "+Carlos Andr&#233;s it was, I have listened to it before.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugh4eJRbOwjfSngCoAEC.8BSdx-B07XT8F4TX-CIUdk", "comment": "It's this one /watch?v=4WwAQqWUkpI   as you can see it could be cosnidered controversial.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugh4eJRbOwjfSngCoAEC.8BSdx-B07XT8F4TmpJNEZg", "comment": "It's this one /watch?v=4WwAQqWUkpI", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugh4eJRbOwjfSngCoAEC.8BSdx-B07XT8HMVhLCz1xq", "comment": "Awesome! Thanks dude!", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugh4eJRbOwjfSngCoAEC.8BSdx-B07XT8UUplLUIl_d", "comment": "Probably to avoid controversy.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgjeUyLzQ15NDHgCoAEC.8AuyIm0t5ld8Xfge7bsixZ", "comment": "Yeah numbers and counting aren't the same thing. Stanford has math videos on here that discuss that subject", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY8iwc0oVgnvr", "comment": "Same here, 5 years and still going for me :) Only because, THIS GUY! ;D", "votes": "11", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY8mjHkd-1w8G", "comment": "Same", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY99NXnwvQJ_7", "comment": "I am a retired psych prof...the three statements below are  great compliments to any prof but what every good prof really wants most is for,you to then make that JOY of  of learning all yours  irrespective of your prof...to learn for the joy of learning purely for itself.....go forth and inspire NEW learners.....turning on the minds of others is the highest calling of them all and yes Sapolsky ignites that first spark particularly well...kudos to,him but more kudos to YOU for developing in yourself the craving to know more. And more and more...may that give you joy all your life!", "votes": "14", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9BpGkjVbww5", "comment": "I revisit these lectures constantly, you never stop seeing things in the world that do with them.", "votes": "9", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9EQK6k6cVhM", "comment": "Oh nooo, my god, what about Kim Kardashian then ?", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9HJVYlxmABA", "comment": "Yeah right", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9Hm-2XQh4IK", "comment": " @UlanKG  Who?", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9OyDXAaCuIm", "comment": " @muffinspuffinsEE  p", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9PIElkUUahE", "comment": "V @muffinspuffinsEE  you boo ya a       C          Man V Ia   B man VCR books b V.     V  oIdo  a the a the a the a C V and and V to    Cc to V. V V V V V V V V     C            V.   V V V be get  getbe get to V be get be Get be get be get be get be get be get bet V ter g. et getting t C", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9SR9R5zshTr", "comment": "@teflontelefon nb v", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9_NjwSd9vOT", "comment": "hey, we have similar names", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg60h1TrKdCUHgCoAEC.8As3eKy2hHY9aLuXAKYiJh", "comment": "6 years later   Did u achieve your academic goals? Or are you still pursuing?", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgjT5syig_Cq3ngCoAEC.8Alg5hqvC_d8ijEsVlxSTe", "comment": "Unrelated to the video:  Your username is awesome and I wish I could have it.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghrqsOnoaaQlXgCoAEC.85kV3Qhqu878ZK0bvWBRwa", "comment": "Vector Shift He is a professor of this at Stanford, that's a pretty good reason to believe he might know a little something about it.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghrqsOnoaaQlXgCoAEC.85kV3Qhqu878ndz7yRy-m2", "comment": "I read it as 'confidence', because he knows his subjects so well.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugjidd4VErP2pHgCoAEC.84B47FqthWY87dhS7Xg6U-", "comment": "+Ag8MrE   Go and read Spitz", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghulqU41bczdXgCoAEC", "comment": "Thank you for uploading this.", "votes": "5", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggHaiuY4yyUPXgCoAEC", "comment": "sir ,,, thank you for this words, we learn something too with your efforts....", "votes": "5", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgiNViwA9ttiRHgCoAEC", "comment": "Let's say that, one day in the future, we are able to convey meaning through a combination of virtual reality and some sort of international icon or picture language.  Would we still be using the same areas of the brain as we do now with \"modern\" languages?  I noticed he said that in Chinese, they use a \"slightly different\" area of the brain.  I was wondering if we would be using an area of the brain that would be near this Chinese area of the brain.  I like how Terence McKenna put it....  \"to SEE what we mean.\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugg_SzUc_ahxt3gCoAEC", "comment": "what happened to Donald?! I can't seem to find out anything about him apart from how he died.", "votes": "0", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugglp9DAY5Rkw3gCoAEC", "comment": "As a non native english speaker, that pun really doesn't make sense. Two level of translation.", "votes": "0", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjwI-ZBrVUcWHgCoAEC", "comment": "oh god, sapolsky this lecture is great but yet again you're completely wrong about everything about behaviorism.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjEyConA_3MoXgCoAEC", "comment": "pedagogue sans pareil", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghZHD6vrmu3iHgCoAEC", "comment": "I always thought that humans also have fear pheromones and also can't stop them from spreading fear smell when they want to lie. ", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghlByIE-3dK-3gCoAEC", "comment": "All languages show recursivity. But then there's the Piraha Dilemma....", "votes": "11", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjhOCpUkJ9OungCoAEC", "comment": "My dog opened his mouth like a human and said \"I'm e-a-s-y\" during the time of the sirens sounding...I knew he could do this because he had heightened perception and that he noticed my call...I put my belief in him that he could do it and he did so he got his reward when I took him for a walk...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggXZYBBkHMYfngCoAEC", "comment": "I believe in the future dna can be found through spoken word based on the fact that no one can speak the same words the same exact way~", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC", "comment": "Wow.  I would have gone to college if I thought it was going to be like this.", "votes": "87", "replies": "7", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghPB5qjrREsL3gCoAEC", "comment": "Why not tape the one on personality disorders? I want to watch that now that it's been mentioned...", "votes": "2", "replies": "3", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugj_7zPWB3ykangCoAEC", "comment": "Enjoyed that one very much. I do not understand the details, but it was enough to keep me interesting and then fortunately lighter stuff begins after one hour.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UggupvZMeWugo3gCoAEC", "comment": "Oh Koko...", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjeVqXhNrIIGXgCoAEC", "comment": "Motherese doesn't appear in communities in Papua New Guinea and Samoa. They don't even talk directly to babies until they're toddlers. Since households in these communities contain many more family members, however, these children are still surrounded in language, and develop language at about the same rate. (Ochs and Schieffelin 1984)", "votes": "9", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgjTMD_GnggftngCoAEC", "comment": "yea, I remember the book \"coco's Kitten\" in gradeschool. so cool", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC", "comment": "Re animals not lying. My sister's dog lies like a rug. When she comes over to my house where my dog's kibble is on the floor (being protected by my dog). Her dog goes to the window and barks... at nothing. Then when my dog goes to the window to see what's out there her dog runs over and eats her food. Eventually my dog figured it out and quit responding. Isn't that amazing!", "votes": "82", "replies": "8", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UghZzrVOuCogYHgCoAEC", "comment": "awe man, that lecture sounded awesome! Biology of Religion ...why no not tape sir?!", "votes": "65", "replies": "4", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwXMW0g0unzqG4odq14AaABAg", "comment": "too expensive in america", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugg_SzUc_ahxt3gCoAEC.7-H0Z7-4uW58Lj4dsM4I3r", "comment": "Ginny R who the fuck is donald?", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugg_SzUc_ahxt3gCoAEC.7-H0Z7-4uW59L4G-yxvRmu", "comment": " @debrascott4434  Watch this lecture, he was raised with a nonhuman simian and learned nonhuman ways.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugglp9DAY5Rkw3gCoAEC.7-H0Z7-1gOe74ltWBSEHaU", "comment": "SpyMonkey3D at around 14:00 the pun is \"past-your-eyes milk\", which sounds like \"pasteurized milk\".", "votes": "6", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugglp9DAY5Rkw3gCoAEC.7-H0Z7-1gOe8_ljDUnsuRA", "comment": "Ivan Pavlov But don't you need to be able to hear to get that pun? I guess the letters are somewhat similar, but for example how does a deaf person know that 'ize' sounds the same as 'eyes'?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugglp9DAY5Rkw3gCoAEC.7-H0Z7-1gOe8ijEMgTugWm", "comment": "Just a guess here, but maybe lip-reading ability makes the pun possible?", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZHD6vrmu3iHgCoAEC.7-H0Z7-IEMY8DHEgIu6C4M", "comment": "+Anna Kubasiak  Technically whenever Cortisol is produced, its breakdown products must eventually be emitted; but human as opposed to dog doesn't have a pheromone gland, and it will take a while to take effect over sweat glands, will probably average over time, and will not be perceived by humans' inferior sense of smell.  If human were to pee themselves, then the fear will be given away, certainly happens to some humans.  When people lie, at least if any hope of being successful, they shall convey wrong facts, instead of wrong emotions. When an emotion needs to be lied about, often the only chance is to conceal it under another similar or stronger emotion. Dogs conversation however is not declarative in nature.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghlByIE-3dK-3gCoAEC.7-H0Z7-Px_K8ltE43PDkmn", "comment": "the 'establishment' doesnt like his work. ive read his book, and its great, but im not a linguist. it doesnt seem theyve given Piraha the credit and study it deserves.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA18uFOPjHDWgu", "comment": "College is way better than high school. In saying that, he is an exceptional professor.", "votes": "20", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA18x2M5X5E4zc", "comment": "It's not too late.", "votes": "10", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA193zW1Xv8Mgk", "comment": "So relevant in these times now, 8 years later.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA19Fme_XnJgC8", "comment": "@Essa Mi what the fuck did you think it was?", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA19GIF617YhrC", "comment": "I am picking up the pieces of my brain off the floor.", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA19O1oqlCGxEP", "comment": "The best Teachers can do this, but not all of those who teach are like Sapolsky. :-) collegiate experiences vary! I hope you keep learning !!", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgixabSkZp2bl3gCoAEC.7-H0Z7-GeA19P6sUxpkOio", "comment": "Hahahahahaha me too!", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghPB5qjrREsL3gCoAEC.7-H0Z7-E0yL72DOI5wAfx8", "comment": "***** Can you link to the talk on personality disorders?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghPB5qjrREsL3gCoAEC.7-H0Z7-E0yL72LNauguTV7", "comment": "DrSpooglemon  there is a search bar available for all youtube users buddy (:", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghPB5qjrREsL3gCoAEC.7-H0Z7-E0yL72Nc6X5sUNk", "comment": "you guys are right. i apologize for the interruption X:", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgjeVqXhNrIIGXgCoAEC.7-H0Z7-O-MU9L3zspxUV-O", "comment": "If adults speak to those toddlers only in the same way as they speak to 30 year olds, then they do not use child directed speech", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz7A3YfSW0hQQ", "comment": "Type this into google \"dog cognition communication.\" You will be surprised at just how well dogs are able to communicate with humans.", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz8jL4YPVzj0w", "comment": "SweetPea Brown This! Wanted to say that on Netflix there is a documentary called the Hunt and the water buffalo will buck while running away from African painted dogs to say \" I can go all day\" seems like his example of the Dog has more to do with animals knowing more pheremonal information about. In that sense you couldn't lie to a dog and say u weren't scared when u were really, either.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz8lZLwSziCA0", "comment": "Yeah for dogs without direction and help from humans.  They are smart.  If they don't do what we want it is OUR FAULT.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz8x2M3B0tJeo", "comment": "Chickens are basically my favorite thing on the planet, and most roosters lie to hens. They'll pick up a twig or a rock and tell the hen \"Come here, I found food for you!\", but when the hen comes over- just kidding, there was no food. I just want sum fuk.  The hens wise up after a little while, but sometimes when they want to mate they'll pretend to be fooled by his ruse.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz8xHLe3PxqGU", "comment": "I have a dog who distracts the other in the same way...he keeps falling for it 🤣", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz9L3w6lIHrGB", "comment": "Animals know that attention is directional, but redirecting another creatures attention is not the same as lying.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz9N8W02aSsqK", "comment": "\"what's up with that?\"", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgiTrT9xAaNsRHgCoAEC.7-H0Z7-QjLz9NIeLfBBhGj", "comment": " @alexkbeck  1] Ethologists report an animal commonly knows its fellows and prey and predators direct their attention to the animal and to where it directs its attention, and that their attention is not then directed somewhere else. 2] Animals commonly signal their location and/or where their attention is directed, and they know the receiver commonly responds by directing its attention there, and away from anything else for instance those babies. 3] Because so many animals do this routinely, it is simpler to infer that this normal and common distractive hunt and play behavior is a better explanation than projecting human categories not demonstrated in animals. 4] A more helpful projection of human behavior would be to say the dog signaled, I am here or My attention is directed there, but those are not lies.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZzrVOuCogYHgCoAEC.7-H0Z7-M-Px74pRdVwoGxE", "comment": "You can find an older version of it on here somewhere.", "votes": "15", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZzrVOuCogYHgCoAEC.7-H0Z7-M-Px99NZdFhu09A", "comment": " Wiley Combs  Thank you for that link so much Sapolsy on Biology Psych of Religion...saved it look forward to it", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZzrVOuCogYHgCoAEC.7-H0Z7-M-Px99N_K7SM43F", "comment": "Something I have really noticed in a close Spanish speaking friend..I am intermediate Spanish speaker living in a Spanish speaking  country...In Spanish she speaks passionately..lots of infection of high notes and low notes in her speech...could by a recipe take the tomatoes  level them, sautee them comes out like a passionant love loem... in English perfect no accent and her range is all pure business...zero emotion or passion as if she is a recptioanst in a law office...very weird when she speaks alternately in one language then the lther... almost like there are two personalities there...now I know perfectly normal.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UghZzrVOuCogYHgCoAEC.7-H0Z7-M-Px99hmq-1R78j", "comment": " @latinaalma1947  From personal experience I have to agree. sometimes I feel like a kid when speaking Chinese because my vocab is so limited, lol.", "votes": "3", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzL1Fm9Un19B9QeLmd4AaABAg", "comment": "that coughing girl needs to see a doctor. ", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz_KPNN0DxTywB4wr94AaABAg", "comment": "Very enlightenment lecture! I should consider watching the whole course.", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy9ALLFl915-mfMy714AaABAg", "comment": "It is an enormous pleasure to listen to this man. Even for me, into other discipline different from biology and relatives.", "votes": "19", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz3CaoXJ25xgxMrgEN4AaABAg", "comment": "Agreed. It's probably a bit more about the university not having the time/budget to set up captioning on the video? I'm hard of hearing and live in what's probably the \"deafest\" city in the U.S.A. Lots of TV captioning is fairly badly done. Either by automation or by humans who aren't doing their jobs all that well.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxGQUUMOFfWnXxjFXh4AaABAg", "comment": "The video isn't captioned. You're getting auto-captioning. Computers are fairly bad at understanding English.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyIOuUgmAaOSWuxTct4AaABAg", "comment": "i've heard there is a tribe in south america who can only count 'one' 'two' and 'many', being confused working with mathematics above 2", "votes": "12", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy9Vk_ls4UT4MCuoup4AaABAg", "comment": "Excellent lecture. Rockin' beard!", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwXK2feyDF0wvhAXOp4AaABAg", "comment": "This lecturer is fantastic. So... disdainful.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzATm0sbr-zurApNa94AaABAg", "comment": "This is university, probably bongs cannabis and DMT :D", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy808VLX_TanMLJHA94AaABAg", "comment": "this guy is such a beast...like a walking detailed encyclopedia of intellectual cliff notes, yet the contest is so advanced", "votes": "4", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxsalCUZWM1q7Ysbc94AaABAg", "comment": "All related to the biological underpinnings of religion video.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyXm7iMt77853ZmqVZ4AaABAg", "comment": "2:29 lecture", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy6TM2Lkyq29uP3O8x4AaABAg", "comment": "did you record the last lecture? It doesn't seem to cover some of the stuff you said it would in the schizophrenia lecture. I'm not sure what you're religion lecture was about but many devout religious people I speak to are ok about speaking about that kind of stuff.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxvoPtuehRmkbufyx94AaABAg", "comment": "does Sapolsky have other stuff on language? seems here that he's just giving background and not too interested (doesn't seem to know or care what a gerund is; his memory slip for \"word salad\" seems to mock the term) - but if Pinker called him out, he must make some bolder claims elsewhere. is there a video where Pinker talks about Sapolsky? ", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw1Lv5wgika3CWv_h94AaABAg", "comment": "god damn, thank you so much", "votes": "5", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyPTiWmp8vYRVMHK2B4AaABAg", "comment": "Look up Sapolsky's \"Biological Underpinnings of Religiosity\"", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw2VpcIo-IqDAXC9d54AaABAg", "comment": "This one? /watch?v=4WwAQqWUkpI", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzGi5mkF3mqsQs5bql4AaABAg", "comment": "That thing where that they then put that thing in that brain so language goes away... I get similar effects on weed. iunno.. weird innit.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxnbOH0aiBgtYzTIRJ4AaABAg", "comment": "Probably the latter one.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzaqISX_K-ibXYkAI94AaABAg", "comment": "Motherese isn't a universal among languages.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzL1Fm9Un19B9QeLmd4AaABAg.8Gc7TOir6Xn8ndzTPYST2k", "comment": "What coughing girl ?", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxGQUUMOFfWnXxjFXh4AaABAg.8GbUVwb43li9G7mZptgCKy", "comment": "Year 2020: Youtube removed manual captioning, AI is taking over.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyIOuUgmAaOSWuxTct4AaABAg.8Gcgu0LhpFz9CvIaDE6yZf", "comment": "Lemme reply this comment from 6 years ago with the name of that tribe: Pirahã tribe from Brazil", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGi5mkF3mqsQs5bql4AaABAg.8GchesIyjvK8ne-zV01Mil", "comment": "It's a complete mystery how you get the same effect. Maybe it depends on the type of environment you are in when you smoke the weed ?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxzkaxQ-uiPKgsmo-Z4AaABAg", "comment": "I think you misunderstood what he means. For inner-language level (inside the language itself), for some languages at least, all words have logical roots and they are produced in a very systematic way, Arabic among these ones. But for outer level, between languages, words seem arbitrary in terms of their relation with objects, otherwise we won't have many different words for one object, they must be uniformed among all languages, but that is not the case. I hope my point makes sense :D", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzXzc8fY04Auepk4rV4AaABAg", "comment": "what he said doesnt apply to greek language because all words have totally logical roots from real life and are NOT random and meaningless mixtures of letters as usually in english words for example...", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy4FcRwhaBegJgrjph4AaABAg", "comment": "watch?v=4WwAQqWUkpI", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzQfUEiDRFrl2SnBWt4AaABAg", "comment": "Isn't it such an insult that they didn't? It was for sure on purpose, because we clearly, as a society, can't handle it!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugyy4NgOVpKl4xn6HKN4AaABAg", "comment": "'Past your eyes' sounds like 'pasteurize'. As in: Pasteurized milk.", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxwridH8zQsv380EyJ4AaABAg", "comment": "is there any chance that transcipts will be made available?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwPGOsEtCcgh35Nq3t4AaABAg", "comment": "It's not my first language, so, what's the meaning of \"pass your eyes milk\"?", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyivyyplEU9t-mE-Fh4AaABAg", "comment": "and on next Friday, we will be studying Beard Growth for Bosses", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgycfegWQBNC7bIaVQt4AaABAg", "comment": "Check Rate my Professor: Robert Sapolskky", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzkV4Oqqw4ZB4j3n8p4AaABAg", "comment": "I wish they'd make you give back the GI Bill money.  It doesn't seem to have done anything for you, including the self-referentiality of a three year old:  \"If I don't get it, it must be shit, because I can't possibly be ignorant of new developments or behind the times.\"  Do you think a degree fixes you for all time?  Even a dental visit can't do that.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg", "comment": "I get the impression from this guy that you want to pay attention when Noam Chomsky has something to say.", "votes": "50", "replies": "7", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxpnM3mzqFfQP0HNZp4AaABAg", "comment": "Watch the lectures right from the beginning. A lot of what he says is linking back to things he's said previously so that the course is a coherent whole rather than individual lectures. I've read two of his books, and his writing style is like his speaking style - many jumps and discontinuities, which lets him talk about more stuff in less space. It works well if you remember everything he's said previously, which means you remember the whole course rather than (as I said before) bits and pieces", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxlnnX7sOLVtBUGFRJ4AaABAg", "comment": "You`re really the Man with the plan, aren`t you? Like you I also think of Knowledge as the most important thing in the world, just like Love. In fact, I kind of saw myself in you, beard and long hair (I wear contact lenses).", "votes": "1", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugw8sH_c5sRblxjRXtJ4AaABAg", "comment": "great proffs", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugy5IIqGzSAYjASioYl4AaABAg", "comment": "I second this^", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzx-D2-hkps1ZKUG3R4AaABAg", "comment": "Pro. Saplosky is a great tutor!", "votes": "2", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyLYxd0uHNz02f1nUd4AaABAg", "comment": "It's because you've been watching Kesha videos.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugwnq7yqsK2n3DO7UO94AaABAg", "comment": "a bit too left brained for me tho..", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzYLRzHTiDmcKiDAdZ4AaABAg", "comment": "Great work ! i'm so thankful for having got a chance to watch this online !!!!!!!!!!!!!  :)", "votes": "6", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugx9wgYYq4DQNbhyQgB4AaABAg", "comment": "Thanks.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzXzc8fY04Auepk4rV4AaABAg.8GbVPZyawkX9JPf3Qc3B2N", "comment": "Expressive yes. That's where in the bible, especially the new testament written mostly in Greek, you find the 3 terms fur love . Literally. Agape being the most intimate, as in, how you say,  agape mu, I love you. That being what you'd say to your partner lover what have you.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugyy4NgOVpKl4xn6HKN4AaABAg.8GbgSvAMaGv9AMm-PGEPdL", "comment": "Hellsconsort this pun only works if you know that the two sound alike. Even knowing how to read and write, deaf people would not understand the pun unless they had been taught how to pronounce the language despite not being able to hear themselves, which of course is usually the case. One argument against completely separating deaf language from audible language.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgwPGOsEtCcgh35Nq3t4AaABAg.8GbY8_8DmEE8xa4jSLaM1r", "comment": "Pasteurized milk. You can Google it :)", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF99hkHA_Pvdb", "comment": "yes", "votes": "2", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF9Dl0o8VHAIL", "comment": "Chomps the penis truth be told.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF9GJmHhrscjN", "comment": "Nim Chimpsky agrees", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF9J0UCHIJp8J", "comment": "saw chomsky speak at Stonybrook University", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF9KwkDICJtMX", "comment": "Except for anything related to politics", "votes": "6", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF9Q3EoxwAKrw", "comment": " @davissae  cry baby 😭", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzGTGqYYtJ-IyoJ5Mx4AaABAg.8GbzX2VHYwF9TM2MDnuTY0", "comment": " @davissae  Recently Noam’s opinions have been bizarre.  Eg, the unvaccinated should be separated from others, if not voluntarily then . . ..  Sounds like he would be happy in Australia.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxlnnX7sOLVtBUGFRJ4AaABAg.8GcgdmJyOIQ8Lj5DnMKqFA", "comment": "FinnishPractice 🙌🏻😩 yaasss queen", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzJU1XpkcnnFExXRMN4AaABAg", "comment": "Legit question and no one should attack you for that - science is about asking! My thoughts: Deceive !=  lie. Animals evolve survival strategy with deception and encoded in their fixed action pattern. Some animals stress out to activate adrenaline, others, like the mimic octopus, mimics their enemy's predator. Lying would require you to go against your fixed action pattern. An argument is that humans lie, but not always well (we have fixed actions, little \"tells\" that reveal we're lying)   ", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg", "comment": "I'm relatively very ignorant on biology, so don't attack me YouTUBE comment makers... In the lecture he states Humans can lie and I assumed he was saying exclusively among animals. Today I thought of the Cuttlefish which has \"metro-sexuals\" that trick the \"neanderthals\" into thinking they are women, then bump ugly's with the babe in heat. Now I also think of the opossum which brought us \"Playing Possum\" and so on. Definitely lie's.", "votes": "1", "replies": "13", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyJCqrguaHuy-Xjvfx4AaABAg", "comment": "My nefew (5.y.o.) invent new word! CHOCONILLA ICE CREAM! everybody understand, of course! :) (čokonilija in croatian orginal )", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxAsrmdUfm72zFPM4p4AaABAg", "comment": "right on. ", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyaiN64e66aBawN_HZ4AaABAg", "comment": "Or just  one apple two apples three apples .... ;)", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwS9VU7B7tY9Ws0vFt4AaABAg", "comment": "i hope he never shaves. when go to class next month", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz_W1-qQ7f3pLLDgp54AaABAg", "comment": "I post videos covering linguistics and language acquisition/ learning.  MY How Your Mind Lies To You would probably be of interest to you.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxImLCkC_W3--Xw-8Z4AaABAg", "comment": "I'd love to see one of your lectures Christopher.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgztTnWIpw4s9YHbWv94AaABAg", "comment": " Professer Sapolsky, nice to meet you.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwzEKhkz2iNGAbyWQd4AaABAg", "comment": "These lectures are amazing but it's kind of ironic that the topics with most interest in them - depressions - are not covered by that particular year's lecture... I'd totally love to hear his version of this lecture from this year. Two years worth of  new insights...", "votes": "3", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzs1m3Gu7Q_tRXoCmh4AaABAg", "comment": "Amazingly he does not state that ASL is limited because primates do not have the Efferent nervous control of the hands like Humans. Also they must acquire syntax while young (just like deaf kids) and they are slowed by ASL. He ignores the entire field of lexigrams: which has shown language generation of novel sentences. He is also not up to date on his recursion discussion in the field of linguistics. He should have some Grad Assts fill him in.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxG8FVAna6fnBjoG5R4AaABAg", "comment": "I think that animals can lie, though the quality of their lies isn't very high. More so, when people are really scared they can't really hide that - they may attempt to represent the fear as excitement but its rarely if ever works. A big flaw in the lectures. Maybe he tries to stick only to the well proven and accepted papers.  ", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz-nLaob05pJPCYsJt4AaABAg", "comment": "clearly infinite ", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugxo9Dxtuk6sn5AWxbl4AaABAg", "comment": "i wish the biology of religion video was taped :{", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzOWZqrpf-ckEZJovR4AaABAg", "comment": "genius! marvelous ideas.very well said", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzwHEdMXz4F6yIRGHF4AaABAg", "comment": "@vickprint Was he a source in Zietgeist Moving Forward? I can't remember the guy's name from it. ", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzmB8OBrgg60R7S39d4AaABAg", "comment": "I'm so high.....And I'm so lost in his words, that I'm not.", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxHzbd0woxzIF7Qb2Z4AaABAg", "comment": "Stanford, could you please forward this message to Professor Robert Sapolsky, I'd be willing to get him really high and listen to him for hours. I mean, indica or sativa, whatever his taste(he seems like a sativa guy to me, but maybe thats just my preference) I'd be willing to keep the bongloads going as long as he could talk, any subject or just freestyle.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugzc7m1HfRt9KE0qn-Z4AaABAg", "comment": "The 'biology of religion'? You have to post that one!!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg", "comment": "i am OBSESSED with this amazing mans lectures...        thank you stanford for allowing these to be online.  youre changing/educating lives/minds and thank you for that. ", "votes": "458", "replies": "7", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg8f6jOgS7TIE", "comment": "[... I assumed he was saying exclusively among animals.] To some extant, it depends on what you are defining as a \"lie\". Camouflage is a built in biological lie, or deception. But Sapolosky does point out lying in other animals.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9L4Cgjw_zQI", "comment": "Many creatures have the association of attention with its direction, and demonstrate both avoiding attention and diverting it. Camouflage is avoiding attention,  holding still is avoiding attention; and those kinds of tricks directing attention away from you and your food are still not lies except to the extent that you DEFINE the possum is active to present the truth and the male presents as male to show the truth.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9L4PYFTE1yy", "comment": " @clydewatkins9891  How would you define a lie? I'm assuming it's reasonable to consider a willful act of deception as a lie. Although, people like Sam Harris are wearing me down on my position that free will exists. 🙄😑", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9L560CR1w3Z", "comment": " @WNYmathGuy  Thanks for helping me think. I have looked up millions of definitions so much that I am wary of definitions. Your assumption seems reasonable to me. I have learned to be wary of my assumptions. My own coordinating comparison is to consider the case of when I hide my housekey under a rock in the garden: I am certainly being willfully deceptive to everyone in the world. Am I lying, or is that a lie? If that is a lie, then when animals manipulate your attention deceptively, that deception is a lie. When the sharpster fools the mark in a game of hide the pea under one of the shells, is that a lie because it is a willful act of deception? I like the examples of misdirecting attention as examples of deception because I interpret animal deception as varied ways of misdirecting attention, and find that accounts for the behavior.", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9L7AmvI4CMp", "comment": " @clydewatkins9891  That's really interesting. I like the nuance you are sussing out. As I first thought about it I was trying to separate the key under the rug as not a lie. because you are protecting yourself while enhancing convenience. I saw the cuttlefish move of effectively dressing in drag to get with the fertile female as a lie because those smaller cuttlefish males are deceiving the stronger male cuttlefish to obtain the resources they are fighting for. It sounds like theft of a certain form in my head. However, if I change perspective, the smaller cuttlefish is merely getting his turn with the female as she desires, so its camouflage is a way of protecting its security while maintaining convenience.   I think I don't know what a lie is anymore. =))  In a way, I have known for a long time that our laws (especially the biblical ones) are relative to power dynamics. Somebody with more power than me can hide truths to my detriment and their benefit as a sovereign, but if I do the same, I'm guilty of fraud, or perjury, or slander, or etc. as well as being subject to penalties. Murder in war is just protecting freedom if I do it, terrorism if they do it.  Does a lie just require setting an origin of who the subject is and which direction the loss goes from that origin?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9L9Wa2dh8Qx", "comment": " @WNYmathGuy  Excuse me that I have ignorance to show rather than understanding. I sometimes say truth is harmony or concordance with actuality. What is truth? It may be that what are lies will be understood by relating them to truth. I am often limited to finding relationships rather than understanding.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9LBotLZZ1wB", "comment": " @clydewatkins9891  Why do you think you have ignorance to show? Shouldn't you be considering it curiosity? When we find something that doesn't make sense to us, we become curious. In this case, your curiosity is showing me that I shouldn't have been so confident in my initial comment.   I don't know if I like relating Lies directly to Truth. If a person makes a statement in error, they deviate from the truth in the same way a liar does, but they aren't lying. In this distinction, the very unknowable motive of the subject determines whether they were mistaken or lying. I think in practice, we assume the motive of a person after they repeat a pattern of saying things that are demonstratively not true, then assume they are just liars.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9LBzQUCloGW", "comment": " @WNYmathGuy  I observe that some persons need things defined as the source of reasoning, but much more that is undefined can be brought to attention. Scientific method looks for repetitive systems with their resulting predictability, but much that can be brought to awareness is not repetitive even if not strictly unique. My errors and misunderstanding, being greater than my understanding, give me more to work on. We use experience that is undefined, you are an integral part of the world even if there will never be another one of you, I try not to limit myself to, or by, my understanding. There is relevance to what can not be understood. I favor bringing in truth to extend the lie problem to  the realm of working on definition. Chang observed language and definition to be too limited because they are cumulative, limitative, discordant and delusive, impotent and wasteful, and clinging. Korzybski observed that understanding has levels of abstraction and he developed the ladder of abstraction: vibratory energy and process level, individual experience, object, symbol, description, inferences, generalizations. Much misunderstanding is just failure to observe the limits of definition, and  confusing that your communication may not be on the  level of abstraction that you assume or may be another level than the person you are trying to communicate with.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9LC96tCcygR", "comment": " @clydewatkins9891  You have an interesting writing style. What do you think it's attributable?   I know mine is not a very normal style either. I've been ~consiously~ mindfully trying to write and speak in a way that I can't be misunderstood for decades, but I still fall short of the goal.   I don't think it's perfectly right to say the scientific method looks for repetitive systems, but it is a correct statement.  This may be just a semantic alteration, but ... I think the scientific method looks for causal relationships that can be controlled by humans with value-producing leverage. I think the scientific method also looks for stochastic systems, but when they are found they are documented and avoided because they can't be monetized. Any inquiry where the scientific method is applied is hoping to find a useful repetitive system, but it wouldn't really be the scientific method if it didn't try to disprove the finding of a causal link.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9LIF-OYQUlo", "comment": " @WNYmathGuy  Einstein on deduction said, \"there is no logical path to these laws, only intuition grounded on sympathetic understanding of experience can find them,\" so we naturally go from being restricted to applying every regular pattern to experience [and often assuming that the pattern has more to do with the experience than with our framework of understanding], to applying every nonlinear and progressively changing pattern to check for congruence with any kind of predictability, long before anyone thinks of stochastic systems. I like to stimulate people to show intuition and sympathetic understanding. Other teachers knew Einstein's point so spoke in parables. You have wisdom that surpasses. When the parable teacher said \"I say to you\" various times, I thought \"Know the source of your ideas.\" Then I saw, \"Know the level of understanding involved.\" If I were not so simpleminded, then I would speak more maturely. The most wonderfully interesting people have troubled themselves to speak personally with me. Even 48 years ago I had met one fellow who told me that he had helped more people than anyone else in the world, I knew a classically educated greek and latin speaking man who had taught himself old english and italian and chinese to read Ezra Pounds works in the original after which he wrote a letter in chinese to Pound which led to them corresponding in chinese till the end of Pound's life, I told a fellow who picked me up hitchhiking in western Colorado that I was 3 days from checking a railroad job in Parsons Kansas which stimulated him to tell me of moving there by covered wagon 67 years before where his dad worked the RR till 1910 they travelled by covered wagon 3 months to homestead in Colorado, seeing many people on a beach in the florida keys meeting with where ya from and how long have you been here caused the young wisewoman to advise us of the value of saying interestingly what interested us to stimulate the reply. So yes I go around telling people \"Every good thing will happen to you.\" I have the world record that more people have told me \"Every good thing will happen to you\" than anyone in the world. I tell everyone \"You're natural state is ecstatic wonder.\" Apparently I have a high tolerance for people looking at me like I am sprouting a 3rd head.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9LIZ4fqCibg", "comment": "Language is a gate of consciousness, and your search can lead you to our joint responsibility: consciously directed growth.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9NIjQLWwBsd", "comment": "I spoke to invite transcendent insight. The other way is use Korzybski and Chang for slogging logically. Method and its focus should balance. 1] A lie is a violation of communication expectations 2] So, at least one meaning of \"lie' is as an explanation of that. #1 finds the context of \"lie\" is offense, the offense common to [a] my countryman acting counter to standards of our common society offends more like a criminal than the outlanders' actions [b] a native speaker of your language who insists on speaking the 'wrong' way rubs you the wrong way [c] music of your chosen style played incorrectly can seem more an outrage than the aliens tunes [d] the apostate is vilified worse than he who never committed to your creed.  Much anxiety results from thinking your expectations should be the actualities. And so on. Society works by knowing everyone will act as expected.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgznF6_uZHOV8xVP1zl4AaABAg.8GcHaXVrsyg9O2CJEzP64x", "comment": "A variant of that last hypothesis on how to contextualize \"a Lie\" to help define it would be to posit:  floodlight or global awareness can falsify the system ie lie, where falsification of a detail present to attention only [spotlight attention] does not falsify the system, or agreement, so it's deception.  This allows a creature with global awareness to, for instance, fake a direction of movement to signal intention in a game without it being a lie, the deception does not violate system or agreement.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "Ugxo9Dxtuk6sn5AWxbl4AaABAg.8GcKShrgIHv9IgZ4Vb9cH2", "comment": "Here is a less recent version: https://youtu.be/4WwAQqWUkpI", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxHzbd0woxzIF7Qb2Z4AaABAg.8Gc1rsbA4Xt94GISC1BfsK", "comment": "doubt, that whis proposition could be interesting to a guy, who talks so much about dopamine", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9I9V0EN_XcD", "comment": "simp", "votes": "5", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9MEuCREKzJh", "comment": " @seferkeshet  your brain is rotting online little parrot", "votes": "9", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9RTgQvyh-GO", "comment": "Me too! And the above comments are stoners!", "votes": "4", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9VQJlxPJpxZ", "comment": "Do not forget language scientifically is considered fake tool to express facts !!!", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9ZWAZDo8xWT", "comment": "I'm OBSESSED with him too!", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9ZnzU9fOIgA", "comment": " @normawatkins875  Yes he is doing best job (my favourite i.e that of a professor).His beard adds up to his nerdy cuty cuty professor personality", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgxVXyoGd9PEcZWXNvh4AaABAg.8GchykMxC5R9jqvXndWqMQ", "comment": "This is why we have internet!", "votes": "1", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgzTbF7fPMu3cKOFwgV4AaABAg", "comment": "Very intellectual man.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyF1SCiaxThAXia7St4AaABAg", "comment": "acquire knowledge by any means, the main thing that it could benefit", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzzEvhi1jiFoo4hQex4AaABAg", "comment": "Thank you Stanford!", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxTp6Dm6igZ2_U2x0t4AaABAg", "comment": "@ShahrozS   \"Can someone tell me how a finite﻿ number of words can have an infinite number of combinations? Sounds like a logic error to me.\"  By using the recursive nature of the language.  \"script\"  \"post script\" \" post post script\"  .\"grandfather\" \"great grandfather\" \"great great grandfather\"", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgwflGouJkBLfs7bvJl4AaABAg", "comment": "@ShahrozS It seems weird at first, but here's the deal.  If you start with a simple sentence like YOU ATE THE APPLE, according to the rules of grammar, you can simply add an infinite number of phrases to it.  For example I KNOW YOU ATE THE APPLE, and then BILL SAID \"I KNOW YOU ATE THE APPLE\"  Now, of course, after a while you don't really have a sentence that a human could understand, but the principle still holds that you can add at the front, the end, or embed in the middle.  Make sense?", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxTekhLpNS-ktL9ye54AaABAg", "comment": "@wordsandcolor It's not like mathematics though, in mathematics individual numbers 0-9 are altered to make different reflections of the original digit, and can be combined to form completely new digits. In language, individual letters CANNOT be altered to form new letters, and word combinations can only be placed in sensible combinations in sentence form. Like take these four words, APPLE, YOU, ATE, THE.  Now tell me how many different possible combinations can be made from those four words.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6g4lLUKzLYGGfIpJ4AaABAg", "comment": "Can someone tell me how a finite number of words can have an infinite number of combinations? Sounds like a logic error to me.", "votes": "0", "replies": "1", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgzKilVsKXXXtFQTOz14AaABAg", "comment": "kids start to comprehend language before they produce it, because wernicke's area becomes myelinated before brocas area? I think that is weak basis for such a conclusion, but it might be true.", "votes": "0", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyGUfMpNG8aQq_xkUF4AaABAg", "comment": "I feel like I'm watching a new Darwin. I can count on one hand the number of lecturers who are so engaging!", "votes": "2", "replies": "2", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgxfACs-Cr_7kt5Jtqh4AaABAg", "comment": "Related links:  Stanford, Stanford, Stanford, Stanford, Ke$ha - TiK ToK. :S", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyWNEtVQp5480dzr4V4AaABAg", "comment": "great upload! thank you", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "UgyKKtzZiz0B6BHmMMV4AaABAg", "comment": "I love this guy : D", "votes": "1", "replies": "", "reply": false}, {"vid": "SIOQgY1tqrU", "cid": "Ugz6g4lLUKzLYGGfIpJ4AaABAg.8GbPWRfXdPm8hao7ANDP1o", "comment": "It's the same as with digits and numbers: we have ten digits (or even only two, in a binary system), and we can express infinitely many different numbers with them. We do need for this the ability to form arbitrarily long sequences.", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGUfMpNG8aQq_xkUF4AaABAg.8GcBtHkUV-A9HnA5veOHi5", "comment": "who are the others?", "votes": "0", "replies": "", "reply": true}, {"vid": "SIOQgY1tqrU", "cid": "UgyGUfMpNG8aQq_xkUF4AaABAg.8GcBtHkUV-A9RpALonDuls", "comment": " @katerinafilippova2319   John McWhorter and Bob Briar are both clearly in love with their respective fields and have hours and hours of lecture material online. Jordan Peterson's Maps of Meaning lectures are also highly engaging.  Aronra has a series of videos going through our phylogenetic tree along with so many other videos that he is essentially the largest resource on mordern cladistics.", "votes": "0", "replies": "", "reply": true}]