[{"vid": "TcvY8Nt0ZGA", "cid": "Ugywmr9wLuu3jt9O9YJ4AaABAg", "comment": "I guess there is something fishy with Q1. Maybe Wolfgang wanted to ask if we can measure freq. better than the Fourier limit in classical picture?!?!", "votes": "0", "replies": "", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "Ugw6wBdVSJVthWr6eoZ4AaABAg", "comment": "What a wonderful lecture!  Being a Mechanical Engineering student who studies Physics as an amateur, I found this apparently simple lecture somewhat hard, and I had to follow it slowly, trying to grasp every concept he explained. Everything he said had words of wisdom folded into it and to absorb it completely I had to pause and absorb it.", "votes": "0", "replies": "", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgxqjM_LAkpwew_SwAF4AaABAg", "comment": "Someone explain to me how the fourrier transform of a classical oscillator signal in time, oscillating at only one frequency (just like it was drawn in the presentation, without noise), does not equal to a δ(ω-ω0)....", "votes": "0", "replies": "1", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgxPSAur6ciEKTmNJMB4AaABAg", "comment": "I think the confusion around 40:00 comes from the professor not explaining experimentally how the preparation of the cavity is done. Theoretical physics only make sense when you are aware of the experimental processes being theoretically discussed. It's easy to forget that as a professor, when you gave so much knowledge about your subject, beyond what you teach in your lecture", "votes": "0", "replies": "1", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgysrUjy1HyWXMzKJjp4AaABAg", "comment": "What does it mean to \"saturate\" a 2 level system? I tried googling \"saturation of 2-level system,\" and \"saturation in quantum optics,\" but I am not finding educational resources... any direction would be appreciated. Thank you!", "votes": "0", "replies": "2", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgyZ4fmDc-qC2aLY-g54AaABAg", "comment": "You are the world's greatest prof and have given food and water to so many people through GPS.  Thanks for your lectures. I did a  phd in atomic physics but due to psychological -> psychiatric disorders I have to open something intellectual like a dip tea shop and then after learning how to do transactions, sell rubiks cubes and chess. I do make posts about atomic physics across my social media and run the codes once a while. Will be doing this or 30-60 years more and your lectures and demeanor offers inspiration. Have been trying to give 5x5 prof cube to as many profs as possible and 7x7 dir cube. I have a habit of donating to MIT Caltech IITM and IISc alum organisations.", "votes": "2", "replies": "", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgzNfWuNZgFfjmD_ejh4AaABAg", "comment": "Wonderful lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgyL_Q_1wV8JHXHGgiR4AaABAg", "comment": "There seems to be a bit of confusion in the Q1 (4:40): YES, we can measure a frequency of a purely classical harmonic oscillator better than the uncertainty suggests (if we have good SNR). But, NO, the uncertainty doesn't hold for purely classical system (cause we can measure frequency more precisely).", "votes": "8", "replies": "", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgwqOB-FBWg7JdBcjMJ4AaABAg", "comment": "Resonance 2: Electric Boogaloo! +MIT Resonance", "votes": "2", "replies": "1", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UggxPI4rBlUdsHgCoAEC", "comment": "Thank you very much Professor", "votes": "1", "replies": "", "reply": false}, {"vid": "TcvY8Nt0ZGA", "cid": "UgxqjM_LAkpwew_SwAF4AaABAg.9itRoSGNF5i9rrMxE45gnM", "comment": "That is a sine wave in infinite time. But you make measurements for a finite time  Δt in real life. So if you take the Fourier Transform of a function that is a sine wave only for interval Δt and zero elsewhere and plot its frequency spectrum, you will find that it is not exactly δ(ω-ω0) but has a finite peak at ω0 and width Δω0.", "votes": "0", "replies": "", "reply": true}, {"vid": "TcvY8Nt0ZGA", "cid": "UgxPSAur6ciEKTmNJMB4AaABAg.9f-8tWLOzca9lSAc-KjNSD", "comment": "I was thinking similar isn't the reason question 2 is yes is because there is no harm planks constant in the numerator..we still cannot measure any better than h bar/2 right due to the uncertainty pricnciple..barring any entanglement induced exceptions or some other exceptional curcumstsnce I haven't thought of..if there was an h/2 then it would be no basically in most conditions if Inunderstand correctly?", "votes": "0", "replies": "", "reply": true}, {"vid": "TcvY8Nt0ZGA", "cid": "UgysrUjy1HyWXMzKJjp4AaABAg.9bGAKR7VRA_9eeWEyT5Aju", "comment": "I think he was talking about saturating the excited state in a 2 level system. Similarly, saturation in quantum optics may be saturation of a mode", "votes": "0", "replies": "", "reply": true}, {"vid": "TcvY8Nt0ZGA", "cid": "UgysrUjy1HyWXMzKJjp4AaABAg.9bGAKR7VRA_9pl7bXcwS85", "comment": "In two level system, you cannot excite more than half of atoms to the excited state. Therefore, if you have half of atoms in the excited state, you saturate the 2-level system. In harmonic oscillator, before you excite half of the atoms to the first excited state (lowest excited state), atoms in the first excited state transfer to the second excited state.. If you have atoms in the second excited state, you are in three level system (ground, first excited, and second excited state).", "votes": "0", "replies": "", "reply": true}, {"vid": "TcvY8Nt0ZGA", "cid": "UgwqOB-FBWg7JdBcjMJ4AaABAg.8tUisUESMLp9f--6-GblPZ", "comment": "😂 He's back... For everyone who believes in the beat 😅", "votes": "0", "replies": "", "reply": true}]