[{"vid": "tUMb-3pW6cM", "cid": "UgwFTzGAhqItcKfamjl4AaABAg", "comment": "Como aprendiste tanto? te admiro y gracias por compartir tus conocimientos", "votes": "0", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgwhcLQre7yRoRK7K1R4AaABAg", "comment": "Thanks for this, clarified everything very nicely for me", "votes": "0", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgiuTbXU1YZDJXgCoAEC", "comment": "You should do lectures shirtless :p", "votes": "4", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgxXF1LZUa2nJiTDKz14AaABAg", "comment": "Hey, sorry for the late response, just saw the comment now. A bimolecular elementary reaction is a reaction that begins with two ions, molecules or atoms that react in a single step that go through only one transition state.", "votes": "1", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgwiLnxT51TKEGOQ4XJ4AaABAg", "comment": "An elementary reaction is simply a reaction that occurs in a single step with a single transition state. Bimolecular means that we begin with two atoms, molecules or ions. Therefore, an elementary biomecular reactions is a reaction in which two molecules directly react in a single step, undergoing a single transition state. The overall order of the reaction is 2 because the rate law depends on both of the molecules. ", "votes": "1", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgxBu2Et5Su0zt5Phqx4AaABAg", "comment": "Hello,  What do you mean by step 1 is an elementary bimolecular reaction w/ overall reaction order of 2?", "votes": "0", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgxsYBN6C-o2pc9hfKh4AaABAg", "comment": "what do you mean by bimolecular elementary reaction?  ", "votes": "0", "replies": "", "reply": false}, {"vid": "tUMb-3pW6cM", "cid": "UgythH1jONzURDsW9994AaABAg", "comment": "Hey! You would probably be told in the question which on is the slow-step. When you are actually doing the experiment, you can tell by how slowly a certain step occurs relative you another step.", "votes": "1", "replies": "", "reply": false}]