[{"vid": "uqU9lmFztOU", "cid": "UgyMWcEi9mpIBtced3J4AaABAg", "comment": "Conflating Darwinian Evolution with Mendelian Inheritance, Epigentics is still Darwinian!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxG2ZXQXE34tlpDQEh4AaABAg", "comment": "I have a very weird question to ask...How do you know what you're saying is true?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwgYC3EvXFjiFd8jx54AaABAg", "comment": "Drake if he just embraced his Jewish side", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxsiyqLhAglbgVGxph4AaABAg", "comment": "Now I am thinking how naive I was when I believed that one case on history was essential to prove a theory, exemple the hipocampus and the only guy with epilepsy, instead of actually know that those studies were also clandestine or ilegal using people as cobaia. On the second war Germany used jwes to make experiments.  Honestly I realy don't want to imagine what's happens nowadays.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw4QDT93aEZBU7SyT14AaABAg", "comment": "2:25  7:00 27:00 58:00 1:06:40 u can just with a thought change the way ur organs behave like sight of seeing someone u hate activates SNS same way it activates on blood loss. 1:09:00 autonomic nervous system can be changed  over time, in terms of of how receptive or when it turns  on and off   >>> biofeedback to lower Bp w/o          med", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx0DCi4CYQjQMf3EVF4AaABAg", "comment": "“DRAKE?!”", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwiWDYpzjx0v49o_bp4AaABAg", "comment": "my sympathetic nervous system goes nuts for educated hotties...", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzzp0CkKtUBv2Kmf-h4AaABAg", "comment": "Bro looks like a 3d render on the thumbnail", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw4d3Xx1Ca7uVrRolt4AaABAg", "comment": "You are a delightful presenter, I've smiled and giggled. Quite truthfully, I could not get up and talk to a crowd of people I don't know.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxXjRr0c2FMZy9u3UB4AaABAg", "comment": "She is incredibly cute, really lovely bubbly person, bit distracting really :) He was good. But as a teacher Bob is on another level.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw3eduHEuZg6L20Pjp4AaABAg", "comment": "This dudes game is insane", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwNWfqlxAEEN2znyGB4AaABAg", "comment": "If drake was in earth wind and fire", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxMsP-rnJrtyvRzpmV4AaABAg", "comment": "\"Take the information and use it to manipulate people, this is what education is\" Words of wisdom", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwMuXvjQPFBWoSUmql4AaABAg", "comment": "I want my best friend back\r \r he raped my soul when he left me", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxjsg6vn1WaRcpq4z54AaABAg", "comment": "If someone told me that Patrick has purple shades on the desk, and is currently wearing flairs and rollerskates, I would believe them.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyGGQ_3Gm9Xxk5J3u54AaABAg", "comment": "Here is a happy little brain", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwm5Z4NeozDJtpVdKR4AaABAg", "comment": "drake", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgylAv9wkV8aOLYJZnd4AaABAg", "comment": "Noise in the brain can be seen as echoes of the irrelevant processes that have their own meaning, in the context of a process under consideration. Could all the naturally-random noise of Grand Central Station gel into a Sex in the City monologue?   Reality is the structure of the weights that impact decisions.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwpYTJcZTN7WU1iGCp4AaABAg", "comment": "Introduction and Speaker Background\r \r Patrick House, a neuroscience PhD student at Stanford University, introduces himself. [00:00]\r Works in Robert's lab, a first-year student focusing on neuroscience.\r Overview of Previous Lecture and Basics of Neurobiology\r \r Recap of the basics of neurobiology covered in the previous lecture. [00:27]\r Discussion on communication between neurons, presynaptic and postsynaptic cells.\r Introduction to Memory and Plasticity\r \r Exploration of memory and plasticity in neuroscience. [00:57]\r Questions posed about the duration of memories and the impact of environmental context.\r Stephen Wiltshire and Memory Abilities\r \r Introduction of Stephen Wiltshire, an autistic savant known for exceptional memory and sketching skills. [02:25]\r Mention of Wiltshire's ability to recreate cityscapes after brief helicopter rides.\r Long-Term Potentiation (LTP) and Hebbian Plasticity\r \r Definition of LTP as the overarching mechanism for memory in the synapse. [03:50]\r Introduction of Hebbian plasticity: \"neurons that fire together wire together.\"\r Historical Perspective on Memory\r \r Tracing the historical understanding of memory from the belief in new neurons to the discovery of synapses. [05:17]\r Emphasis on the current view that memory involves changes in the synapse.\r The Hippocampus and Visual Mnemonics\r \r Emphasis on the importance of the hippocampus in memory formation. [08:09]\r Visual mnemonics provided to remember the association between the hippocampus and memory.\r Factors Influencing Memory\r \r Discussion on adult neurogenesis, stress hormones, and alcohol affecting LTP and memory. [13:22]\r Mention of HM, a patient with selective hippocampi removal, unable to form new memories.\r Variation in Memory Abilities\r \r Exploration of individual variation in memory abilities. [16:19]\r Reference to the spectrum between those with no hippocampi (like HM) and those with exceptional memory skills (like Stephen Wiltshire).\r Expanding the View of Neurons\r \r Call for an expanded view beyond the simplified version of a neuron. [23:23]\r Indication that future lectures may challenge or expand the current understanding of neuroscience.\r Conclusion\r \r Summary of the introduction to memory and plasticity. [24:48]\r Emphasis on the need for a broader perspective in understanding neural processes.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyHusJo8PfkR-GyQ8t4AaABAg", "comment": "Im studying lateral inhibtion/excitation and the mosquito bite example just make it click for me. Awesome 😊", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzJBtzIoDlEuoLKBq54AaABAg", "comment": "Where is Nathan Wooding he’s the best neuroprofessor ever", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz4kzhL3IcaEutOY1F4AaABAg", "comment": "The man who presented first was excellent, the woman later, while I'm sure she's very knowledgeable on the subject, she distracted from the lecture with her constant giggles.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwVeVv2qJtNFLzpa094AaABAg", "comment": "Lady acting sus af", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwMsrB5vi8diXZ7Sw14AaABAg", "comment": "One of the videos in the series where I really wish a cameraman would've panned up to the projection or screen from time to time", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx5iKFdzMam9sbbdcl4AaABAg", "comment": "brilliance", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxgGToT2cQHXwxOkLB4AaABAg", "comment": "Slides and drawings are super helpful for keeping the class (and the speaker) focused on a thing.  When you're just talking forever.  Also, as many small, direct, straightforward words and sentences are particularly useful when trying to communicate clearly.  It's one thing if you're giving some political speech like Obama or you're on a date or you're in a job interview and you wanna use big words to show off, but especially when you're teaching undergrads, you should really model yourself after Dana did rather than Patrick with his overly cerebral and philosophical tangents  His stories were good, though  Also some amount of jokes, actual emotion.  I liked her slide with the monkey.  Brings you back to attention, so easy to zone out during a long lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzz9j9CmCOCnG7KmDh4AaABAg", "comment": "I didn't know Drake was a professor lecturer before he became a singer.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyNAvqgvdl6VXJRd054AaABAg", "comment": "hi", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZuzLCXsNaPAvwkHV4AaABAg", "comment": "This guy is so nervous. It's amazing he could present his content so clearly and accurately, while at the same time being so nervous. Normally, people only feel nervous a little in the beginning before they relax, as they get into the zone, but this guy could not manage that. I guess he was constantly aware of himself talking to an audience.", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzRVyqEq_TIe_SlXwZ4AaABAg", "comment": "These lecture series although no 13 years old or timeless like Carl Sagan‘s cosmos  Patrick is a brilliant educator but am I the only one that is distracted by how handsome and sexy he is?  But the Content of his lecture is so riveting and his delivery is so engaged though classically statuesque in a very Greek sense the beauty that is young man beholds this is over powered by his brilliance", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxmSscNJM_HJqHgBEl4AaABAg", "comment": "You guys know that both type and token #identity don't work?  #Learn the philosophy of mind!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzohvPlmLH588CFLZ14AaABAg", "comment": "Was so listening my sympathetic  nervous system reminded me to take my medicine.  Was very relaxed watching in bed.  She was really cute good lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwd-nT0AUNIGWCgF194AaABAg", "comment": "years later at a Stanford reunion, when asked why he completely abandoned his Neuroscience PhD,  Bob Ross responded: \"There are no mistakes, just happy accidents!\"", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzHOF8hOusPvQK_vyV4AaABAg", "comment": "I love this lecture series. I really do.  Buuuuut I also think that lady towards the end could easily steal my heart.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxe4lasKKljA3NEg3V4AaABAg", "comment": "how lovely and professional both of you are", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwRdJ5OF_vSxzCxfWt4AaABAg", "comment": "BUTTON UP YOUR SHIRT BUDDY", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwIPE_PldAABscXJhp4AaABAg", "comment": "Drake's cousin was the intellectual in the fam", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugyv5vR35roFwus06Ap4AaABAg", "comment": "Wish she could enunciate better. Its all coming through mumbly. The automated closed caption can't even tell what she's saying and there's no back ground noise. I'm sorry if she's working with some kind of lisp. Honestly, can't understand every 10th to 15th word and sometimes a few words at a time. Why on earth would someone want her to present? We're there literally no other students who could do the lecture or no other females willing to present? I just don't understand why someone would let someone who can't be understood present almost an entire lecture. I've had to rewind and replay sections 5 or more times just to figure out what she MIGHT be saying. Has no one ever heard this woman speak before, my goodness!", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyuD3NSA85JT0N-w_J4AaABAg", "comment": "I think there was a mistake here. Nitric oxide, formula NO is not the same as nitrous oxide N20. You get nitrous oxide at the dentist, not the nitric oxide. and nitrous oxide is not used in the body to send signals.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz_o5OS33DZj5tH1SV4AaABAg", "comment": "Neuroscience doesn’t encapsulate the non-evidential and that’s where a lot of individual progress is made, the answer then is to bring our attention to our perceived value of a particular idea or sense and to lock in on that moment and expand.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZuzLCXsNaPAvwkHV4AaABAg.9p4oqjIi1QVA7RA8HKtPXF", "comment": "I don't get that impression at all. Of all the TAs that have presented thus far, he comes across as the most experienced and professional in his approach. He has a great off-the-cuff delivery in his speech, one that he delivers with a fair degree of confidence.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwRdJ5OF_vSxzCxfWt4AaABAg.9lwp4ZpmBmO9unMxv9xbwS", "comment": "No way.  😂", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxOoR__EvM6412qhet4AaABAg", "comment": "\"Neurons that fire together wire together” are the words of Dr Carla Shatz (not the words of Donald Hebb as is commonly claimed).", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxV6KQN0B4xVN-2clN4AaABAg", "comment": "My parasympathetic nervous system turned on when the lovely lady came on to teach oh my gosh o.o", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwoy0remCVlTctnFQJ4AaABAg", "comment": "So I looked up Patrick House (Pretty sure that was the first guys last name), looks like he's written a book called \"19 ways of looking at consciousness\". Haven't read it (got plenty of other things to read), but wanted to throw it out there.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwSTu11oP08wReo0X54AaABAg", "comment": "1:01:09 the shape representing GI tract is very suspicious", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgydO_WRaebKVkhiTlp4AaABAg", "comment": "This is amazing. Free education if you care to know more than you did 30 minutes ago and are motivated to find it.", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwfJ0-sw1ClofDykGF4AaABAg", "comment": "wtf is he looking at over his shoulder?", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz6h6TH2P1MTNE50X94AaABAg", "comment": "First part of the lecture was extremely informative and interesting, learned a lot.  Second part was also... very interesting... slight bit distractive but I didn't mind", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx3x2aWaDf54ttJcdx4AaABAg", "comment": "Stephen witshire sounds like someone sir baron cohen doesnt want eugenicsd away /lh", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwrItlP2TN1xWfCLdJ4AaABAg", "comment": "Brook from one piece", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx1JCC_QfnWOx_xgTF4AaABAg", "comment": "year 2010, stanford university students still laugh at the idea of a woman talking to them about orgasm", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxJajLmPd7yjfplSEx4AaABAg", "comment": "46:58 Somewhere in time...", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw7Ds428Ygc0pMKAMd4AaABAg", "comment": "Great to let your grad students teach some lectures.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwElqV25L8qvO22Gfd4AaABAg", "comment": "i used to be able to imagine locations and have characters do stuff in there in my head i don't really do that anymore though", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyBgwyHeFVqNImuibB4AaABAg", "comment": "The major weakness of all those Sapolsky videos is the refusal of the camera to rise upwards to focus on all pictures shown on the higher boards above the head of the presenter. Similarly, when the drawings happen to be on the board to the extreme right of the wall behind the presenter, the camera will not swivel to show that board. In all those cases we have to guess the details of the pictures, the projected images, or the drawings. The cameraman remains glued on the face of the presenter. A practice that truncates the full impact and appreciation of the lecture. \"Tis a pity.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwc7pAGh5xXqK4SHBd4AaABAg", "comment": "Love the hair.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw0gWK0QzVItXw3Icx4AaABAg", "comment": "All this dude needs is short shorts and roller skates.   😂", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxuQnGh0ayUbpn-sAp4AaABAg", "comment": "Such good lecturers. Patrick has such great cadence and Dana has such great humour. The subtle things which make their incredible subject knowledge and pedagogical choices come alive. Excellent", "votes": "19", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwuB7jk15ALywG6vRl4AaABAg", "comment": "Is his shirt open to a bare chest? Am I crAzy?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyidDWD6YJOHQPehcZ4AaABAg", "comment": "LTP long term potentiation", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxHNnkq7BxfBYJw-EN4AaABAg", "comment": "In one of the other lectures it said that men rate women's voices as more attractive when they are ovulating? Is Dana ovulating in this video?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwfJ0-sw1ClofDykGF4AaABAg.9eEhOTBRl4Q9unNBienjok", "comment": "The projections we don't get to see", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw4VJAJciW0y7obV1l4AaABAg", "comment": "47:00", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz0DN_p-gDPn1ZN1xd4AaABAg", "comment": "my sympathetic system had a huge reaction to dana <3", "votes": "1", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwk60-X9EzgZg0wf5x4AaABAg", "comment": "Awesome lecture! Can you share slides, anyone? Also, I'm wondering whether Stephen has some brain advantage when it comes to memory or he is just obsessive with his memory palaces.", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxwRMKvfIw2eCZdHZZ4AaABAg", "comment": "I wonder if the sympathetic nervous system is hyper-activated when you eat psychedelic mushrooms. Since you feel more hyper and your senses, especially sight are more sensitive, while touch I think is dulled down.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwIM43854zV-TE0ZuN4AaABAg", "comment": "feel like ptsd is a trade-off of having ltp in the first place", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxUWxYvl1nItDhgNAR4AaABAg", "comment": "Nerds, please don't try and be cool, you can't pull it off. Just being a nerd is cool enough.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxMTi5wtviD73ojg_Z4AaABAg", "comment": "The brain is a machine.  Memory is a mechanism", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx_rj9YkICo-BQG57l4AaABAg", "comment": "Preganglionic autonomic nerve axons are myelinated, postganglionic are unmyelinated. This is just to qualify what was said in the autonomic lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxoos3VWnJuMtaSZZp4AaABAg", "comment": "🤣🤣🤣", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw6lvdXleP6SNUVSqt4AaABAg", "comment": "you steal his gurl i might.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwTc20uXA16rjvVACl4AaABAg", "comment": "Torsten Wiesel is still alive! He is 97 years old. Hubel unfortunately passed. Thank you both for your work!", "votes": "8", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZqKTBM3Nnwa7rY5x4AaABAg", "comment": "His brain is so big it grows out of his skull. My boi is rocking an afro, got a class full of black neuroscience majors feeling comfortable lol", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwK5K_x85j-qtEk_Y94AaABAg", "comment": "For some bizarre reason, I thought this was Drake :0", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwzCwsVk-dOqqrG4WB4AaABAg", "comment": "I call it pattern thinking (autistic thinking which, taken to extreme, allows savantism) I can imagine for visual thinking autistics it would be a imagined visual world, but since I think in movement it's like all my memories are on a web and I can \"feel\" when one is pulling on another, it takes me longer to piece them together (mostly sorting out what's causal) but after calibrating with years of self-study of psychology I'm starting to predict where the gaps in my learning are and how to find them (one such prediction led me to find this course) and if I eventually cover all those gaps I genuinely believe I'd have an amazing ability to spot the gaps in the field as a whole and similarly predict where to look for the answers. Mostly just shouting this into the void, I can't afford uni either financially or energetically rn but since I know how to actually research and self-teach I'll be chugging along in the background figuring things out but gee, it'd be cool if I didn't have to grind myself into powder to prove my brain actually works like this before I'm given the chance to make use of it's potential.", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw35ddNsHgSe-fxI654AaABAg", "comment": "i almost fell in love", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzQoePTBycdTZtIUaB4AaABAg", "comment": "She was waaaaay to sex focused, and I think it's because she wants to appeal to them and that's how she can relate. . .", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzWEJR0MQUkgCfGC9l4AaABAg", "comment": "Excellent lecture ! Surprise! Grandmother cells have been found and are precisely described in a Scientific American Issue published in 2020 dealing with the neural mechanism that underlies facial recognition.", "votes": "43", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyQqhXBJXsNlKnzhHR4AaABAg", "comment": "Thought drake and bob ross fused before I clicked in here", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzLmXHPonzmM4UOA9h4AaABAg", "comment": "all american men need to be bald.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzbB6c5RpLzm0j9lQp4AaABAg", "comment": "Dana is sooo cute.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz0DN_p-gDPn1ZN1xd4AaABAg.9ZLn-Aag8359ZLn4Yj0q6F", "comment": "also parasympathetic", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzWEJR0MQUkgCfGC9l4AaABAg.9X0G7QTfoh39ZXBubUg2UP", "comment": "Jenifer anniston", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugyhk_3pB4XjT42vxeN4AaABAg", "comment": "whew that autonomic nervous system", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwyoboo4-P3wNKmPod4AaABAg", "comment": "\"And that's like, uhm..., really cool\" 😛", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzbRchmRvciGyrp5zF4AaABAg", "comment": "What you describe in a hippodrome; I call  it  emotional association. I can store memories by ort of energetically storing in my cells/being. I remember this state and then I can remember facts etc. T is difficult to describe, but I taught myself his technique before the smartphone made things easier. I can remember dreams and I can  know that I am sleeping in my sleep.  I have also taught myself to wake up from paralyzing dreams or set my bioclock alarm in order to wake up on time if needed.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugze0XTYEDYQLOR6CTl4AaABAg", "comment": "Throughout all these lectures there's a constant coughing of people who should rather be in bed than spreading viruses and annoying people. WTF is wrong with them? If you can't keep silence you shouldn't be attending; if you need resting time to heal, you shouldn't be attending.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwoOOg4EWWZ2HSqXVd4AaABAg", "comment": "Where can we subscribe to Dana Turker ?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzPBQsBC-hQSiyaHCF4AaABAg", "comment": "Emotional fight and flight system", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzQDMifLr2WnkDtvot4AaABAg", "comment": "It's stupid rite.....I mean if psych thinks or hears a person will me violent..basicllay free food and accommodation... Which dumass invented this.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwwmyu9gYb_amXaHp14AaABAg", "comment": "If u don't have anxiety...when we shud....does it misfire and finish off.. Accounting", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyQmNhVU8cMFoCSslJ4AaABAg", "comment": "I have sensed static noise...be quiet in clozapine? Cud have been a local experiment... I am seen as a great intelectual here. One time they tried to make me president of the flat association. Very interesting neurosciences here... I'm a virgin tho....that's the only equilibrium I can't figure out.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy0-iyGlCx-5Witmbh4AaABAg", "comment": "Dr doesnt have to be afraid because govt doesn't have the job of spying on drs..unless..blah balh ..law", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwYZFT0OQRJ17zY97V4AaABAg", "comment": "For more or less equilibrium happens.... I shud have that in mind..but if u r  PTSD for veterans.....cbt. Why the extreme violence was done...if it was wrong accept it was wrong....PTSD resolves or calms....instead if Dr says u were wring and brain wrong...PTSD needs meds more..", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy1DvpRPKCsB2CwFYZ4AaABAg", "comment": "No neurotransmitter...heterotgentic LTP ATP transfresse phosphate.. Hippocampus.memory.. ...amyglyda ok.. cerebellum kearning..ok Susskind....I think I saw some of his and thought some seemingly logical physics.. I got some like with long time lack of learning...i still got..umm..something.. I remember during my break(which may be immunjty?) Unless the cold isn't taken care ..2 weeks... In any case that theory is done with. I used to theorize events .... Higher dopamine allows for higher brain function...but at a cost.... If caught with dopamine pumping(antidepression?).. U cud get screwed..in 2006?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz1POzZ33ge79UVUjx4AaABAg", "comment": "Glutamine..excitatory. How to calm? Chamomile...reduces stress..but not anxiety..?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwfBrpj3KAHot6EIb54AaABAg", "comment": "She definitely activated my SNS", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyDgC2imYGAsdc6cdR4AaABAg", "comment": "I genuinely thought it was a video of a lecture that was recorded in the 70’s because even collar of his shirt is not dissimilar to the 70’s style and somehow he looks as if he is from that era !", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwdk9zvNP2Y78zZy2V4AaABAg", "comment": "Oh the biology of PTSD memories. Sounds super interesting.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxgA3Vj1_W6UOyudXp4AaABAg", "comment": "\"Hello is this Bob Ross\"?  \"No this is Patrick\"\"", "votes": "1", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgySuOSCtR3fw_LOcYN4AaABAg", "comment": "The lady is a really good science communicator, I think I saw her as a guest on a yt channel I subscribe to.  She's talking about stuff in a relaxed way for some of the stuff. So far the guests have been top notch and would make great teachers.", "votes": "17", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzZyuVeoRoBMiDETTt4AaABAg", "comment": "girl walks to you, smiling, telling you a \"cool fact about erectile dysfunction\", the classic", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyJheY1MuxWEdQE-u94AaABAg", "comment": "🤓💛", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy0-iyGlCx-5Witmbh4AaABAg.9V4iO7Zhzqg9V4iQfUx79g", "comment": "Which is best to be at equilibrium...?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxgA3Vj1_W6UOyudXp4AaABAg.9TTuTiy5eck9To9DQV-wZG", "comment": "this deserves top comment lmaooooo", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugyj_1G0FL_HteLkR1x4AaABAg", "comment": "How can he be a good scientist with such poor natural language skills.Sometimes, it is quite a pain trying to understand him", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw8N62U_rzntOmUJl94AaABAg", "comment": "Real life spike Spielberg 😅😅😅😅", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyTaCJzEFwBRQ5QuBx4AaABAg", "comment": "i´ts cool have a class about memory and the teacher says you don´t need to remember something.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzRvMxlhlORRgUMipl4AaABAg", "comment": "straight to the comment", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzMLnD11L8feIUCcMZ4AaABAg", "comment": "This look like drake for real", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy2HPjddSS9FMWZuit4AaABAg", "comment": "i cant be the only one to see that she gets aroused when she speaks about erections and ejaculations by the way she touches her hair etc?", "votes": "0", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw1aiHgVYQwOZVWCAN4AaABAg", "comment": "40:44 lmao I was just itching my foot because mosquito bite me", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgySR4JiI9Mme4e6csJ4AaABAg", "comment": "Love your hair 😍", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwPN_6JKP8X5RqsUmN4AaABAg", "comment": "Autistic memorization be like: I can't parse what's important so I'll just hold on to all of it!", "votes": "1", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzlXARCyLaYVSJ2Nk54AaABAg", "comment": "The mind body split presupposed is an error.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyMJ5sqFIZMdtDTOy54AaABAg", "comment": "This is utter nonsense sold by a guy with his shirt open. He's older now and wears glasses but is still as misinformed. Sellling science with caveman looking \"sexy\" teachers.", "votes": "0", "replies": "4", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxqQJy793A-OzJ4KkV4AaABAg", "comment": "Respect I know I'm ten years behind but I respect Ur great work thank u and Robert sapolsky", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZHo8IZ5-XhjDd8-p4AaABAg", "comment": "This guy looks like a JoJo character", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz2JeLWFG1l-vyw57R4AaABAg", "comment": "Ok", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzrJ7PQlV9tS211RW54AaABAg", "comment": "I wish Dana wasn’t talking like a valley girl in a frat party because her subject is pretty interesting and definitely necessary for future lectures but it was hard to follow.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyD88E0NRdBFeStbQt4AaABAg", "comment": "He has the most Amazing Hair!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgznHwWmpwh6Pn0J6Ip4AaABAg", "comment": "The last part was very orgasmic !", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxcqhbHgu-b2ZO6pSd4AaABAg", "comment": "I wonder if spongebob house made a video to", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxk4e2Quo6ADkmWuxt4AaABAg", "comment": "What makes people evacuate when in fight or flight.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyK2Z_Fhd4O-114CGx4AaABAg", "comment": "What causes that fire that you feel when your in love at first sight", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy2HPjddSS9FMWZuit4AaABAg.9R0la79sA4-9ROTs8AmywG", "comment": "She listens to a lot of bedtime stories alright", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugy2HPjddSS9FMWZuit4AaABAg.9R0la79sA4-9ROZ558bn7s", "comment": " @tommytllefsen3863  she and Aff Row having a lecture before her sure has a bedtime story together", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwPN_6JKP8X5RqsUmN4AaABAg.9QWhnLiZGHW9dpyodalq-M", "comment": "'highlight only the important sections'", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwPN_6JKP8X5RqsUmN4AaABAg.9QWhnLiZGHW9dqSKTcNANq", "comment": " @Summer-uq1vr  OK! -highlights entire paragraphs", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyMJ5sqFIZMdtDTOy54AaABAg.9QP0y3k1p3-9QSYKgcRdR5", "comment": "Ok bro. Those are just summaries of our knowledge of the field.. this is the results of years of research.   You better have some strong evidence that is « utter nonsense ». If so you should definitely write about it, probably would get you a Nobel prize", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyMJ5sqFIZMdtDTOy54AaABAg.9QP0y3k1p3-9QSuD7xjYaV", "comment": " @wakatpr6583  this is right out of the sixties -- shaggy \"intellectual\" with a cult following -- sorry to upset you in your hero worship -- pop stars in psychology coming from natural sciences get a hold of people's visual imagination first (great hair), sexy open shirt in the classroom -- listen to the words and arguments -- and three cheers for exotic \"intellectuals\"", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyMJ5sqFIZMdtDTOy54AaABAg.9QP0y3k1p3-9R9thygjKGa", "comment": "So with other words, you are more concerned about the lecturers appearance. That’s not much of an argument", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyMJ5sqFIZMdtDTOy54AaABAg.9QP0y3k1p3-9R9ymB_vK2l", "comment": " @4philipp  in the sixties (when this pic was taken) they dressed up this way (beads, frizzy hair etc.) to be a cool intellectual -- this fellow is a leftover from that era -- all rhetoric, underlying PC, New Yawk intellectual gone west", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzhbTmZ1-L9OXpMaNt4AaABAg", "comment": "Drake with an Afro?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwCypqX8HblWk0hoth4AaABAg", "comment": "ı can't focus because of valley girl accent xd", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwhfzfL5i3FLAQGoHR4AaABAg", "comment": "First part memory and LTP till 47:00 Second part autonomic nervous system", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzYiNRBw_umioRzvGt4AaABAg", "comment": "Sapolski gives this guy hair advice.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyJqAC4uKLDXSz0nMR4AaABAg", "comment": "Combs his hair with an egg beater.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxTK5TIzUrZi1iI6b14AaABAg", "comment": "Keeps asking, “Right?”  Why is he asking me?  He barely makes sense.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxEnsoNBoYflBhpxNF4AaABAg", "comment": "Why do all College professors look homeless", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgztmLw27O1p0_sYg1x4AaABAg", "comment": "She's adorable and bubbly with an outward spark the guys didn't seem to have (or at least outwardly express as strongly). She's got a childlike fascination with what she's talking about, which is exactly why I'm sure she went far. And that makes my heart happy.", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwsxmYn_3iF3SV8q4Z4AaABAg", "comment": "I'm in", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzr53jntb32iVvzkDJ4AaABAg", "comment": "dana needs a little more practice", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzZFHdLvhs9GHgytsd4AaABAg", "comment": "When I was 19 in 1973 I had a Botany teacher who turned me on to the sexiness of science…. This woman reminds me of her.  Not physically but comfort/excitement when talking about reproduction…… Luv it", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwTsv_PjZpu_MuPt0h4AaABAg", "comment": "This guy is more relaxed, and explains better so i can remember. He is very tuned into delivering, information, TO, remember. ☺ Really great class ! He has considered 'us' memorizing easily. Thank you, so very much !!!", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzeGWbOv0dYx5wD9Xx4AaABAg", "comment": "Is the female teacher a valley girl?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzwHG9jCKyj5FZKIkJ4AaABAg", "comment": "This guy looks like new Tekken character.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwjnrcOiV_UCpS0wyd4AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyNXdrdDEHYBhqv6HJ4AaABAg", "comment": "You down with LTP? Yeah, you know me! ☻", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw2QNicdgN87lXPV3Z4AaABAg", "comment": "\"In a scale between one and even, I can't\"", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzL6rPhQAW2XLl9GxF4AaABAg", "comment": "Thumbnail looks like a 70s Drake.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgybkKMzW84UXgjCzz94AaABAg", "comment": "if this was filmed in 2010, why is this guy dressed like it's 1970.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwiplTVXjKMJX_eORB4AaABAg", "comment": "The guy, awesome! The lady, not so awesome :P", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxEnsoNBoYflBhpxNF4AaABAg.9OwnQgPDn6b9R9sbG003Au", "comment": "Priorities. Sone want to look like models, some are more concerned about what they do.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugxt2soSmt6nx_tKr6B4AaABAg", "comment": "I thought the senator bourse emperor was Nero", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzd8HR6YQqGxyhyepR4AaABAg", "comment": "I realy wanna touch his hair. Is there a name for this?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZWbo8Nc5u2XxhQUx4AaABAg", "comment": "9 lectures in and I didn’t expect to end up with a crush.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwHEQ_ozJ2nk6KFHNp4AaABAg", "comment": "Dana is so cute, her mannerisms especially so.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzh7TH1A8ZCRjL156d4AaABAg", "comment": "He has nice hair.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwjPJ1POhgL1ZSH2Sl4AaABAg", "comment": "Sorry, she makes a very unprofessional impression continuously plucking at her hair and giggling.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZhpKydH_cBjg9YVp4AaABAg", "comment": "The female teacher looks quite silly in her presentation, alwats giggling like a small child.....", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyDDcW_vWU4Codn2T14AaABAg", "comment": "this is not patricks fault at all but I cannot follow this lecture, all of these neuroscience terms are going straight over my head!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyEA7OWYg4LoAWuKJ54AaABAg", "comment": "she is the best", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxoLgRnUtPkvr9zcQV4AaABAg", "comment": "Omg everytime i hear that okAYYYY , it is like a needle telling me to listen.", "votes": "9", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwLppc8I0QiJ5olVyN4AaABAg", "comment": "Look up \"science of fatal attraction\" by Patrick House on YouTube. No more hair :(", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw0kPpUokAbi_d-NWl4AaABAg", "comment": "WTF is LTP?", "votes": "0", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyhY7aEWWsi2zimh9x4AaABAg", "comment": "is there anywhere to see the slides?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwm6xNoV_WTXIxq-uB4AaABAg", "comment": "Pretty sure this guy sold me lantern oil in The Legend of Zelda: Twilight Princess", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgynQvYxhingov3tOHt4AaABAg", "comment": "This great lecture by Patrick House got me to google him.. found several articles including some fiction, look forward to seeing if his writing is as good as his lectures.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxKOHFiDwMSb3GheJF4AaABAg", "comment": "She's just adorable.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy2qV0hIhmzjCMc2g54AaABAg", "comment": "The female lecturer is so sweet! Too many inappropriate things spring to mind. The lecture is very informative and interesting throughout, as usual. Really good presentation from both presenters. Kindest thanks.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxiBvjMrx8YeoolUx54AaABAg", "comment": "Gsus, why do men ( myself ) fall in love so easily?  more important question: how can she be so cute?  She must be even cuter now, 10 years later.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwKh38OQB-joLh3wql4AaABAg", "comment": "am i the only black person who's screaming 'give that afro'?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyWHH8Frm81NRIhokx4AaABAg", "comment": "ermahgerd nerscience!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw0kPpUokAbi_d-NWl4AaABAg.9L0-oBZw2kX9R9ttC8KDGo", "comment": "Watch the lecture again, and again until you know", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw0kPpUokAbi_d-NWl4AaABAg.9L0-oBZw2kX9RAOZrGTTm3", "comment": " @4philipp  I did but he never says it Long Term P???", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzxZJGfzAATNhsuHUR4AaABAg", "comment": "The first half was the first lecture in the series that wasnt accessable. Insufficient explanations without being able to view the slides.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw6z1213H8lzucMRMN4AaABAg", "comment": "I learned a bit about the function of the brain way back when I took Psy201 & 202. These video lectures are a very welcome addition and expansion to that knowledge. Thanks.", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxr0myU0mS3hlYeBEN4AaABAg", "comment": "humans dont remember lists they remember journeys  when i remember facts i link them to other associated facts, so when i start talking about  something anything, i get 1000 paths to follow and i can literally follow those paths forever because they keep leading back to everywhere else, but at the same time they are all their own trails/a fact", "votes": "0", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwaUHRjFtBFnA3CArN4AaABAg", "comment": "Drake looking different here", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzZMdvsRCOojOyeH_14AaABAg", "comment": "So the \"truine brain\" theory is basically disproven now, correct?  It's thought of more as a heirarchical system now.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx6moS7kuUTFjigxIN4AaABAg", "comment": "The more I watch this Stanford series, the more I begin to believe that shall we say \"nonstandard\" grooming patterns are endemic to this culture. Sapolsky is clearly allergic to razors. Then we have this guy o.o", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw9S4uHIF4WGrIcqjV4AaABAg", "comment": "The aggressive slave firstly refuse because rotate exceptionally whistle amidst a funny node. married, tidy bass", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwhCwjJNDrJBmt4JMV4AaABAg", "comment": "By the time I got to the end of the lecture I had forgotten what it was about.  There's also an angry hippo on my lawn ...", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw-tznxEvAj4-GbgzN4AaABAg", "comment": "Am swallowing the lectures like a spongbob but wish the camera could show the power points.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwWR49fuvf-ZZftjtR4AaABAg", "comment": "Orgasm? I'm sorry, can she demonstrate what that is?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwk35oAIwYXC7jmvX94AaABAg", "comment": "Just fell in love with her", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyH0v-WIOOUOmK4h114AaABAg", "comment": "''Because of our tendency to explain what we dont know in terms of the smallest unit of a thing that we do know...'' :D", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgytnL0XDw6zLByMerV4AaABAg", "comment": "OKAY!!😁", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwtUAK2zLoXDqjhA3R4AaABAg", "comment": "She’s so cute!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxSUeqRGupJHnDOo2p4AaABAg", "comment": "She's the rapper!... (from the rap video at the end of 'Introduction to Neuroscience I' ) ...wierd sentence", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwMh_aodq560eE8DcN4AaABAg", "comment": "34:50, 40:55, 56:33, 58:27", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzfmKycpHEs1tAWC4l4AaABAg", "comment": "The lady is really funny, but I can't stand the way she talks. When she says 'OKAY!', she sounds just like Bill Burr when he's doing ''lady voice'', which for some reason is always bitchy. I'm not saying this lady, probably phD by now, is bitchy too. She's actually funny in a goofy kinda way, but she sounds like a valley girl, right?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwN0K6zpDb4bjmC4mV4AaABAg", "comment": "To be honest, she sounds like she was destined to become one of those shallow airhead chicks that talk about  birkin bags, guys, sex, cosmetics, but got saved by rich parents and somehow found herself to be teaching a class at Stanford. Sorry but I can’t take her seriously with that high-school teenage girl accent.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw1ZhFBRCOyEu0Nl4Z4AaABAg", "comment": "how do you explain freewill?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxuDgcsm_v-OocPPDN4AaABAg", "comment": "The way they present the information is seriously engaging and I need to learn more ✨", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxr0myU0mS3hlYeBEN4AaABAg.9IbFRXDhGQ89IbGTof81Cv", "comment": "i spent my teen years remembering everything... was so stressful. id spend more time going over the days events than having the daily events lol  but with a judicious application of 1000s of blows to the head and lots of alcohol for a few decades now its mostly a mater of choice", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugxr0myU0mS3hlYeBEN4AaABAg.9IbFRXDhGQ89IbHWT5oGWz", "comment": "becoming a hermit and avoiding interacting with other humans setting off my stress hormones probably helps alot also, but its interesting about alcohol i assume thats why i only like weed and booze and cant handle the stimulants :P also possibly why i remember all my experiences on speed extra even when i was drunk as a skunk (i drink to black out, its the only parts of my life i dont remember in granular detail although it is getign better as the decades roll by", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugxr0myU0mS3hlYeBEN4AaABAg.9IbFRXDhGQ89dpzQfKuucn", "comment": "'humans'? Some of them do. I relate heavily to your explanation but these are not the predominant neurotype's experiences lol", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzYu98IQpGuiElzwVB4AaABAg", "comment": "Where’s Robert 👀😭", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxXAul0_KhcOiY7y-54AaABAg", "comment": "Black face bad, black hair good.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxJBh5pr5aCLIBqay54AaABAg", "comment": "Anybody know how conciousness, pain or pleasure are created by the brain?", "votes": "1", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx_Eb9oo5MbNqLosep4AaABAg", "comment": "I love his hair sm", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy2_l5Y0giL-RZJUuF4AaABAg", "comment": "This is the cutest girl ever. Coolest personality.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx-5uslvKMN58QZnep4AaABAg", "comment": "I've never heard anyone say ok so fast.  The young lady was very entertaining and very knowledgeable.  She just needs to learn not to apologize.  She has the information, not the students. One bodily function I've yet to hear about is the evacuation of the bowels.  It happens in combat when the rounds are thick in the air.", "votes": "1", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyRDJ78VW9u8Af_c-54AaABAg", "comment": "A distractingly inept performance reflecting poorly on the instructor and the institution. ('like', 'akay', 'heh heh heh', 'sarreh'' etc.) I really don't mean to be cruel to the young student. However, it is not acceptable in a renowned institution of learning to be a den of baby-talk.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwByx81-vmqT7gYi5l4AaABAg", "comment": "He looks like he's come right out of 1970s!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyFNx8XbhGTSF-N1qh4AaABAg", "comment": "Great class!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwSqANKeBCtb4VPTsd4AaABAg", "comment": "I hate to say it, but I'm finding it really hard to follow the second lecturer. It sounds like she's questioning everything she says. I'm aware it's a regional accent, but I find that it makes her harder to follow.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyqhZ4453thmKS2bSF4AaABAg", "comment": "I love this guy. He's really clear and I'm very able to understand this. No diagrams though? #sadface", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyUjmpmwSb_JiVisQV4AaABAg", "comment": "Bob ross", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwTmGemU1agZaHpyml4AaABAg", "comment": "I've watched too many scam-baiting videos. When I heard the first speaker's name, I assumed he was Indian.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyBkpCzeSdvK4mfhe14AaABAg", "comment": "I loved Dana Turkers presentation style, she was so engaging and charming and managed to hold the audiences attention so well. All the students presenting are very informative and interesting but i think she was my favorite, just holding the rooms attention and talking with so much passion :)", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugyi9uyp0Y4HS5JmE954AaABAg", "comment": "That is a really bad haircut.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyBK2MF0LNYFKlA0yd4AaABAg", "comment": "I wish we could have seen the visuals Sapoisky was referencing 😓", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwCBI6FggQY9Wf_UHV4AaABAg", "comment": "Someone “got” Caligula...", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwslHpQd962mJ9L7J94AaABAg", "comment": "But how sweet the girl is at the end !", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzw7-OuvlSVyOw_pR14AaABAg", "comment": "theory", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyUuQgPCdSPBpT7JP94AaABAg", "comment": "i hope they´re doing fine", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxJBh5pr5aCLIBqay54AaABAg.9FPo5P4RkGS9xhjEQ_XkM7", "comment": "Consciousness is very complex :) pain and pleasure have quite different neural mechanisms", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugx-5uslvKMN58QZnep4AaABAg.9EzKjqfc8Ex9dpziD90qmZ", "comment": "Feminine socialisation and the way she'll have been taught to mask:((", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwGiakm7v-31JZfN3F4AaABAg", "comment": "Omg this man. 😍😍", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyP4cS7nAIYkpAmDuJ4AaABAg", "comment": "why does this look like a gta cutscene?", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyOzw0mbRMLc4Uj37Z4AaABAg", "comment": "She is more cute and enjoyable than Sapolsky himself.", "votes": "7", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwX8I4fv2BQjJm9zvF4AaABAg", "comment": "Feels like the 80s", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy1cootGDpoNvj1xih4AaABAg", "comment": "You are now autistic savants", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzcOrqbo8VcqulC83R4AaABAg", "comment": "Her \"ok\" was the most sexy \"Ok\" I have ever heard.", "votes": "8", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxxHQp2N9C8g5CYX-J4AaABAg", "comment": "I loved Dana's class. So much fun.", "votes": "16", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzJL9jn9VWF8BfKyrl4AaABAg", "comment": "that second speaker is so enthusiastic and beautiful, its cute.", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw4atL5WzgRhuNi8iZ4AaABAg", "comment": "Bra that's a good look", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwFxpRbUg7LzzRshKp4AaABAg", "comment": "I honestly dont understand these parts of intro to Neuroscience (only the very first part by Nathan). I'm just gonna wait for Dr Sapolsky to come back.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg", "comment": "It brings me joy to watch uni students in an \"introduction to neuroscience\" class giggle and laugh at the word \"orgasm\" ..", "votes": "178", "replies": "7", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugys9DlGz7TOyUGWrYJ4AaABAg", "comment": "my sister is studying in Stanford University..", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxiaoZPsIwVixrDpk54AaABAg", "comment": "I guess, it is the first time in how many years  i fell in love... With that gorgeous positive lady :) Through space and time indeed. It is year 2020, Moscow. So i am afraid there is no chance for myself and Dana to eat some icecream together. :) Alas.", "votes": "4", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzEjAplSnpMJtgzycZ4AaABAg", "comment": "Its 1975 I'm just keeping the funk alive", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgypKtZ9PTCI-TsRKPh4AaABAg", "comment": "Fascinating Patrick House et.al. open access paper on \"Predator Cat Odors Activate Sexual Arousal Pathways in Brains of Toxoplasma gondii Infected Rats\" at https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0023277", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyYXlKy84ZSrVOcHZ14AaABAg", "comment": "I thought it was young robert sapolsky", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyptSQWek4kh0bzHeh4AaABAg", "comment": "Robert sapolsky beard + Patrik hair awesome combination", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugypd8bYayzjDlO3M2h4AaABAg", "comment": "Dana what’s your number?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyM17USrN9dMuYheCl4AaABAg", "comment": "I think it was Steven Pinker who said something about having outstanding hair as an academic is some sort of (possibly career) advantage.", "votes": "4", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxgjUab3mEFypSmyTd4AaABAg", "comment": "Can anyone do me a favour and explain to me what \"LTP\" is please?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyOzw0mbRMLc4Uj37Z4AaABAg.9AX9Q6hgljs9KzJ1C8WB_b", "comment": "Enjoyable as a youtube audience perhaps but if I am paying for the course I would rather have a TA or a professor who conducts lecture like the first guy. Enough humour, crisp language with not many filler words", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyOzw0mbRMLc4Uj37Z4AaABAg.9AX9Q6hgljs9L46SsgVl_E", "comment": " @chan625  i am 100% with u my man.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugy1cootGDpoNvj1xih4AaABAg.9AFhV3fVzDM9dpzvxo8-iK", "comment": "?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9e9ANaOAMF7Cs", "comment": "Americans be like", "votes": "15", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9eA-bz9LddHTK", "comment": " @fionafiona1146  double fiona’s be like:", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9eA1EfBNnomEm", "comment": "A foreign concept to most. Truly a wonder what it is", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9eA4ZQuLpTPkG", "comment": "Why?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9eA4Zb3g-l6Ab", "comment": " @ashleyashley9008  because it feels so juvenile :)", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9eA6hc9p50qhn", "comment": "i don't think it's about the word, it's about her. she's so adorable that whatever she says they giggle", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzqN6g4jk2VmZXLMxZ4AaABAg.99aoVmGaz9eA6iNWtoxxnk", "comment": " @xiaoyangzhou9538  nah, it's definitely because of the word. She is speaking plenty where they don't giggle ..", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxiaoZPsIwVixrDpk54AaABAg.99AQHasE4mk99PZMZ7AlAi", "comment": "She is already a doctor", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxiaoZPsIwVixrDpk54AaABAg.99AQHasE4mk9KHj-mBT7lv", "comment": "Mans was down so low that he was hitting on a chick talking about neuroscience to a class 10 years ago. Keep fighting brother, go get some post-nut clarity💪", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxiaoZPsIwVixrDpk54AaABAg.99AQHasE4mk9KIGJJsocNN", "comment": " @alexanderpoole4526  Ha-ha-ha :) Dude, it was the pandemic lockdown, what do you expect? Of course I was down, but things slowly have been getting better, thanks to for-nut test shots, bestowed by your prayers. Cheers mate.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyM17USrN9dMuYheCl4AaABAg.98XZLlIy_hq9O1vIQfpb-Z", "comment": "Hm. 🤔  Perhaps because it makes the wearer of the hairdo more recognizable and easier to talk about?   For instance: \"Did you hear that young TA giving this lecture? I thought he was great.\" - \"Which one, i don't remember. There where so many...\" - \"You know, the one with the hair!\" - \"Ah, right! Yes, he was good indeed.\"", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyM17USrN9dMuYheCl4AaABAg.98XZLlIy_hq9OGokKpWS6e", "comment": " @saschamayer4050  I love it! :D", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugy29EfXkTlcy_2mTPx4AaABAg", "comment": "Why do animals and probably humans defecate and urinate themselves when they're in flight-or-fight response, when they are clearly under sympathetic nervous sistem control? Which inhibits peristalsis.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwdDX-3oJ1Wfe4-kZt4AaABAg", "comment": "Steven Wiltshire isn't mute.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwYrxmbK9cBdu91csV4AaABAg", "comment": "TFW you pay 40+ g a year for a school and get a cutsie girl who like really like isn't like ready like to be a prof giggle", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwZPHuVh1Wns6BfAep4AaABAg", "comment": "Is this Drake?", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxbYTT3SU4UWQW1EnF4AaABAg", "comment": "Okayh!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugya0fYsplg4J6eGKHt4AaABAg", "comment": "Man, these are boring lectures. Thanks anyway.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg", "comment": "She's very nervous but o so charming. I have the feeling I'm listening to a very excited friend. I actually was falling asleep but her hyper enthusiasm has awakened me. My brain is entranced by the magic sparks and fun. I'm sure this is gonna stick. Thank you! ✨✨", "votes": "191", "replies": "9", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyxAOI4agJAW-cjxNJ4AaABAg", "comment": "I love this man! His hair! His persona but most importantly his intelligence....♥️ Look like a man I would bump into in the 70’s.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw8BrHlnS71bK98Bl54AaABAg", "comment": "I learned a lot about myself studying neuroscience.  I added some screenshots from this video in my neuroscience page. I hope it is ok. http://www.kinberg.net/wordpress/stellan/neuroscience/", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwfUDI0LaPD9fAzyQl4AaABAg", "comment": "well that latter half was incredibly difficult to follow.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwuvIOfR7hhFKaH1fh4AaABAg", "comment": "oKAyyy", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyQuV92z5LWk1WkGHB4AaABAg", "comment": "Recommended books about savants: the mind of a mnemonist (walk through childhood) and The man who mistook his wife for a hat (drawing cityscape)", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxasyxynLn32RqP0Qt4AaABAg", "comment": "Disco stu is pretty smart", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwRXxIToE41VtymErl4AaABAg", "comment": "I would love to study at Stanford,", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwIkamLPhaJTYd5iFZ4AaABAg", "comment": "Wish we could see the slides in the first part.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxX5OCcQZLaHV5FG_h4AaABAg", "comment": "Zidan with afro hair", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwbKATJXbCMYgIaKXx4AaABAg", "comment": "so information is just an energy flowing though different types of synaps.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx_118vaPj18hnpeY14AaABAg", "comment": "This was an interesting lecture.  It would be interesting to know how chronic pain and neuropathic pain work from a neurological point of view.", "votes": "10", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwSrzGN-TRe9v3BKbN4AaABAg", "comment": "Why does LTP not work another way in other parts of the brain and has to necessarily be connected to memory?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwXC4Db8KMILo9Seq14AaABAg", "comment": "Dana is so freaking cute I can't concentrate. Proves what she said about the sympathetic nervous system", "votes": "32", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwZPHuVh1Wns6BfAep4AaABAg.97PNRWgRRwY97T4gC42FP2", "comment": "Yea he came from the future.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9H2i50Nb3jY", "comment": "She's cute as hell, too, let's not beat around the bush", "votes": "24", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9Oz7JhT5IVN", "comment": " @jonanasbananas2944  you forgot to mention how amazingly humble you are, too", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9OzG8mfPeqU", "comment": " @cjc813  Don't won't to sound like I have sunken into a dark hole of moral relativism, and that I have blindly come to accept the fractured postmodernist condition where everything is guided by local narratives and blah blah, but I really don't understand the use of being humble. In our Flemish culture it's extremely important to fake a humble attitude, and in some other parts of the world like Ivory Coast it is not. I've noticed that marginalized communities especially aren't too hung up on the humble facade. It's important to love oneself in a culture where one is undervalued.", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9OzGcqXmphJ", "comment": " @cjc813  be a proud weirdo cjc813", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9PfLSL42gkt", "comment": "I don’t think moral relativism and humility have a relationship unless humility and judgement necessarily have one… thinking you are the best but acting humble is not automatically fake… consider athletes who celebrate victory “like they’ve been there before”", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9PfR9AzPbhl", "comment": " @forresttravison406   Well, I just didn't want to sound like a moral relativist. I know humility is important in a lot of cultures. We might have internalised this validation up to the point that we mistake it for common sense. I would then sound like someone who doesn't believe in this obvious universal good. (A moral relativist?) Excuse me for not being clear on that point.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9Pr-YHobuqi", "comment": " @forresttravison406  \"Acting humble\" implies in some way performativity and self-expression. I believe it to be harmless if people are excessive in their excitement about themselves and others. Some communities even encourage these kind of sentiments. (Here again a link with the postmodernist condition: end of les grands récits, fragmentation, local narratives...) Personally I know nothing of athletes who celebrate victory \"like they've been there before\". All I know is that being an expressive critter on Flemish ground is way too tough depending on what skin colour you have or what sex (or which combinations) because being considered \"humble\" is very much a matter of hierarchical structures.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9YkqU-BL_tD", "comment": "prolly just adhd. I dont think she felt nervous, just a bit sporadic as if it was her first time.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxLjN7QMe49FtrKlb54AaABAg.96JmfwtVrNs9xhihuuusBm", "comment": "Passion is so contagious!", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyQuV92z5LWk1WkGHB4AaABAg.94q30GbBXjE99iN1OvtZIq", "comment": "Stephen Wiltshire (speak: wiltshar) in the Oliver Sacks book An anthropologist on Mars in the chapter Prodigies and he is not mute but has autism", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugx_118vaPj18hnpeY14AaABAg.92wD4SiCYl39rwzYFkrTT6", "comment": "😢", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwXC4Db8KMILo9Seq14AaABAg.923PRcbp_Jc9CNK5uKd77L", "comment": "Lame...", "votes": "5", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwXC4Db8KMILo9Seq14AaABAg.923PRcbp_Jc9CPSmG_ZWbi", "comment": "She's very smart, I downloaded mp3, so I just hear her, Its tough enough for women in STEM.", "votes": "4", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugze9_eJHiLIdXQA_S14AaABAg", "comment": "Hypoglycemic state do not rise insulin,  it does immediately a food not fat its detected after a hypoglycemic state. Fasting promote BDNF ask Dr Jason Jung Canadian Kidney specialist about Jews learning some Scandinavian language in weeks in a concentration camps. Ask Dr Permuter about BDNF and exercise in a fasting states????.Nevertheless interesting but try to be precisely", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzFjTUq5ZfbmHPwG2J4AaABAg", "comment": "I am very interested in this subject and appreciate your sharing the knowledge.  It would be helpful if you could post the info referred to above the lector in a corner of the screen so we all could see it.  This would make it easier to understand.", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzTahJPT8Z8H1pSucV4AaABAg", "comment": "Uhkay", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzpoSNbay3PD-ls9R94AaABAg", "comment": "ROTHSHIELD", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwkYQPOPOEo2TyLznN4AaABAg", "comment": "Rothschild Step DOWN", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyqDNm5LJU-u9o8TFV4AaABAg", "comment": "CENSUS to MAILBOX", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyFRyXmu72AqKcIzJV4AaABAg", "comment": "Q and A sheet PAPER", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxKTRcWR6RDwVMO4md4AaABAg", "comment": "I was always wondering why people in countries such as USA and other western countries getting motor diseases such as ALS, Alzheimer and Parkinson more than the Asians. Today I learned high stress levels can bring down dopamine levels and this can create motor diseases in long run and in the same time high levels of dopamine can cause schizophrenia(Using excessive levels of marijuana and other drugs). This shows us the importance of having a moderate life and the importance of the culture asians have practiced over the years.", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugybpvbh_zfCjc2qdUV4AaABAg", "comment": "Patrick is/was really good at this. Dana not so much. The way she is constantly nervously laughing and apologizing is kinda annoying me.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyNcY5mvAvcLgoxGP94AaABAg", "comment": "I'd never be able to pay attention to what he's saying he's that attractive.", "votes": "12", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzAMp5DxFRlK8I-gnR4AaABAg", "comment": "i like how she is so eager but should stop saying OK", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzDxyZZr3sDzdW-5sZ4AaABAg", "comment": "Faaaarrr out man✌", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw3T-YxSC3Ad23RTeF4AaABAg", "comment": "The Master Would Not Approve. There Is No Way Out Of Here. It Will Be Dark Soon. There Is No Way Out Of Here. It Will Be Dark Soon.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz-ylMfKmcbQSoyxcx4AaABAg", "comment": "Love how every time she talks about it, it's a different animal I'm running from...a hippo/rhino/snake/elephant/hyena lmao I need to stop pissing off the zoo animals", "votes": "100", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyvkHJHe-fVAPY5ERh4AaABAg", "comment": "A-KAY!?!?!?!", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwCraHomnK47Rbm5tl4AaABAg", "comment": "im starting to think this was in the 70s", "votes": "6", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwLm498iBKNznfVo8d4AaABAg", "comment": "So good, thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxEX3Mmhhtx2EVyZDd4AaABAg", "comment": "Is this the cure for autism?", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy4__vfy8dpFnlwUkx4AaABAg", "comment": "Great lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzuWV8QAupSetYkIoF4AaABAg", "comment": "This comment is not intended to be confrontational or anything like that, but Ive never seen someone looking as much as a video game character as this professor.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyNcY5mvAvcLgoxGP94AaABAg.90nR-bMyX-j92EyEvVIClj", "comment": "🤨", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyNcY5mvAvcLgoxGP94AaABAg.90nR-bMyX-j9BMICk1AuSb", "comment": "Hahah I’m crying bc he looks like my ex.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwCraHomnK47Rbm5tl4AaABAg.9-ZjwIh0m8J94wXPF3wr9R", "comment": "Sameee", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwCraHomnK47Rbm5tl4AaABAg.9-ZjwIh0m8J9ANaRYdw3w7", "comment": "2010/11?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxEX3Mmhhtx2EVyZDd4AaABAg.8yt9O0SWh6h9dq1nm4l63S", "comment": "Lmao what", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzfmCZJOSCuXmgKUPZ4AaABAg", "comment": "Pat was great...Dana was too but I just wish she didn't present every statement as a question", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwlMJ6gNTeR13j8L-B4AaABAg", "comment": "They both did alright, but man, Dana made presentation fun and easier for me to digest. Loved it.", "votes": "46", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxObj22wZH9Zzkw3794AaABAg", "comment": "15:30 why can't I just picture hippos in a camp. memorizing information. I keep my neumonics super tight and simple.", "votes": "15", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxYRGVOUSzRn8xr0vZ4AaABAg", "comment": "This guy is so groovy, this is the best disco I've ever been to.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxHXatW-VzEOyp-zTh4AaABAg", "comment": "dna. rna,...etc.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyIgGw9nOfLtmKD7IJ4AaABAg", "comment": "Take a shot every time she says okAY!", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxjMIBMeBDMQNHr8bV4AaABAg", "comment": "I had lunch with Wiesel and Kandel one day. Wiesel is alive and well, and both of these Nobel prize winners are now interested in aging research!", "votes": "2", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxRO3XBmUG-JwFWpDB4AaABAg", "comment": "Very good. Would be helpful to see the slides. He knows the subject and I would surmise he has a well developed prefrontal cortex.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxie2tq9bdcQLWth654AaABAg", "comment": "Is he gonna mention at some point that this ground breaking experiment to detect the role of visual cortex neurons, was done by sticking probe into cats brain and showing them diapositives", "votes": "4", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwbseW1W5aQbon_DzN4AaABAg", "comment": "Think Twice", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwinfiMAWziiLbpCxd4AaABAg", "comment": "Easy way to remember the autonomic role in the male reproductive hubbabaloo is (p)arasympathetic for erection and (s)ympathetic=ejaculation therefore; (a bit pedestrian) but unforgettable: it's just Point and Shoot ;).", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxV1IH2YLtgHLccT1J4AaABAg", "comment": "This guy, too has it down with the Sapolskyan humor \"and you have to invite them to your wedding...\" etc.", "votes": "34", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxeeo4WZE7pKQraOsV4AaABAg", "comment": "Is this for real? I thought this was a remake of The Mod Squad", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxfPguk4e4iuuP2uAd4AaABAg", "comment": "Shame the camera cut off his  screen. Would have been nice to see the diagrams etc.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzolvqjGBDc9HQnwwF4AaABAg", "comment": "to de the", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyD2uBdTnxwnibAHQd4AaABAg", "comment": "You're all autistic savants now🧙🏼‍♂️", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx2BKzuPp72eC5BpV94AaABAg", "comment": "The Human, trying to understand its self. That's all of us right now.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwsxeh_T2sQFUfQWP54AaABAg", "comment": "💕", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwm-3WOqphwgHbeF8h4AaABAg", "comment": "I have tried the method of loci or whatever it is called, but I'm terrible at it. I just really love numbers, so when I'm memorizing long sequences of numbers, I just recall it by \"reading\" it in my mind :|", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx7EcNeT7WIrYA118F4AaABAg", "comment": "I'm impressed by the work Dana Turker obviously put into preparing her part of this lecture (this is not what substitute teachers usually do).  I hope her career has prospered in the years since.", "votes": "6", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwlMJ6gNTeR13j8L-B4AaABAg.8yBNz3FVeUX8yIvb6OWky_", "comment": "Really..I thought Dana was great but honestly a bit awkward to watch...I feel like some of the laughter we heard was because the audience was feeding off the nervous energy she was giving off...but I still totally respect the fact that she got up and delivered a great lecture...I still feel like Pat was a bit more relaxed and was able to talk to us a bit more comfortably", "votes": "6", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwlMJ6gNTeR13j8L-B4AaABAg.8yBNz3FVeUX9b945SiMF2q", "comment": "You probably have a heavy sex bias because I wouldn't even compare these two. Patrick gave an amazing lecture for a TA.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwlMJ6gNTeR13j8L-B4AaABAg.8yBNz3FVeUXA-c-uYVxukz", "comment": " @nackedgrils9302  you probably also have a sex bias then!", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyIgGw9nOfLtmKD7IJ4AaABAg.8xEh_LNCJDK9-OKE0uB98-", "comment": "Actually, I went for every time she said \"like\" ...like...you know, like, whatever... like. Way more shots!  😉", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxjMIBMeBDMQNHr8bV4AaABAg.8x3ktjof7P69R9nXeQfk1W", "comment": "They better hurry up before they run out of time", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugxie2tq9bdcQLWth654AaABAg.8wC8baVwvTI9R9nkflJHgN", "comment": "Nice detail but irrelevant in this context", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugwm-3WOqphwgHbeF8h4AaABAg.8qkJU5b43tc9R9sjRd7WEw", "comment": "Grouping similar to phone numbers can work too.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugx7EcNeT7WIrYA118F4AaABAg.8qQ6qyUYETo9xhioJ7uMbh", "comment": "I think she's an Assistant Professor now!", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgzyxaqXjmujf_d9vuJ4AaABAg", "comment": "it's \"spectra\" sir, not \"spectrums\"", "votes": "2", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwcAhjDyNUb3OA2j894AaABAg", "comment": "49:57 you'll know when it happens", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzpi_orEMTTCf1yHd14AaABAg", "comment": "I watched 50 % of all the lectures and finally, I have to write a comment: The accent is one thing, but her (over)acting of a childish teeny is confusing and partly irritating. Giggling when talking about sex, erection or going to the toilet is embarrassing. If she wouldn’t be looking well and behaving like an insecure young women, the audiance wouldn't laugh + it would be very awkward. If it wouldn't be for the slides, I would have skipped her presentation. Actually, not a good advertisment for Stanford. On second thoughts, it shows, that they give everyone a chance to be part of the university ;)", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz9u6DiJOIexjyuv2V4AaABAg", "comment": "He knows how to get down.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwKLm-_LGJmngyQyBV4AaABAg", "comment": "38:00 Hinting at the deep learning for vision.", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzSA39s3SxcB1jIX3J4AaABAg", "comment": "Wow, Robert Sapolsky is really young and tall here. It appears he always has been a beatnik hippy. Perhaps a bit of research in the local Barber shop?", "votes": "9", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyE57jgn049ujNStmx4AaABAg", "comment": "Who cares if she says like a lot and giggles. She knows what shes talking about and is communicating effectively.  If you can't learn from someone whos speaking clearly and knowledgeably because they are acting \"young\", thats on you.", "votes": "7", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy4xTusxTTIrJMjSlh4AaABAg", "comment": "The miniature of the video looks like a scene from a game/movie that I've never played/watched", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzq8pnsm5T5I-zo1n14AaABAg", "comment": "totally a flight guy <3", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyZH1hG6kZAgzheCyh4AaABAg", "comment": "After 47:15: Isn't she pretty!!!", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyOpBkYuEl28LXCbWF4AaABAg", "comment": "Patrick is way better.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy1AHhbIoK9_QP1m5N4AaABAg", "comment": "CoolStoryBob", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyUbVkHokGh89cfuPF4AaABAg", "comment": "A little maddening that the speaker is looking up and gesturing to an illustration on the board that we cannot see!  By the way, LTP, long term potentiation is a good example of evolution knowing how to reinforce important threats of death that an organism experiences, and emphasizing them in memory. Much to the disadvantage of sleeping patterns of war veterans who suffer with PTSD. Hence the veteran, for example, mentioning his experiences in the Battle of the Bulge sometime seeming as fresh, as if it happened yesterday, including the sights and smells. Even if 60 or more years ago", "votes": "10", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxigUXu0CJsVD4I6VF4AaABAg", "comment": "Did anyone count how many times did she say \"sorry\"?", "votes": "2", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyfxUCruQHJsGGvVUV4AaABAg", "comment": "he is gonna be dr. house o_0", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyyDncOxNvSUdqR_mJ4AaABAg", "comment": "What an annoying camera! Why camera is not showing the diagrams, images, etc?", "votes": "2", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwn6t7kcAd_q27s88x4AaABAg", "comment": "36:54 Marie Curie won the Nobel prize twice.", "votes": "3", "replies": "4", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxVJ3zjQBnTYrhJlXR4AaABAg", "comment": "Watching this on 9/27/2018, the day of the hearing of Kavanaugh and Dr Ford. Of course she can remember a salient event more than he can remember it, especially if drunk.", "votes": "1", "replies": "5", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwGktMjSgbWkQ4KO6h4AaABAg", "comment": "Where are 12 and 13?", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxmdLHrD8gKL-UaRON4AaABAg", "comment": "30:58  He is holding the paintbrush.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzyxaqXjmujf_d9vuJ4AaABAg.8qLrlXkD8Yh8zLaeJZYX-d", "comment": "Incorrect. Spectrum _noun\r_ spec·​trum  |  \\ˈspek-trəm\\\r plural spectra \\ˈspek-​trə\\  or  spectrums   (https://www.merriam-webster.com/dictionary/)", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwKLm-_LGJmngyQyBV4AaABAg.8p997fjhstU91ylW3Z9MS2", "comment": "nature \"hints\" at so much computer science, they even mentioned an if/then statement to describe behavior in earlier lectures which is sort of a core principle of programming", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxigUXu0CJsVD4I6VF4AaABAg.8ma6Ct4Myah9-cg4tx5lsZ", "comment": "ill watch again and count A-KAY?!?!?!?", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyyDncOxNvSUdqR_mJ4AaABAg.8ly2seq5v7W8n04JVbfMGZ", "comment": "One the earlier video, the TA mentioned their email address was written high on the board, maybe that's why.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugwn6t7kcAd_q27s88x4AaABAg.8lioqLlwbOe8p0IraPYhXJ", "comment": "Not in the same field.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugwn6t7kcAd_q27s88x4AaABAg.8lioqLlwbOe8p3ZTGeMsoo", "comment": "Mattias Sarling  Isn’t that even more impressive?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugwn6t7kcAd_q27s88x4AaABAg.8lioqLlwbOe8pphMFBHk6D", "comment": "you are right, that was inaccurate. It is not possible to win for the same field, as alreay Mattias stated", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugwn6t7kcAd_q27s88x4AaABAg.8lioqLlwbOe9-ZkOGF2Z0Z", "comment": " @chrisjokuhn3968  No is not, john bardeen won the physics nobel twice.  Pierre Curie  also was nominated for both prizes, but he died before getting the second one", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVJ3zjQBnTYrhJlXR4AaABAg.8lin3JQN9-N8oUtZwYygpc", "comment": " origindirewolf   You're missing the point. We're talking about bio-chemistry here. Certain chemical molecules affect how memories are formed and retained.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVJ3zjQBnTYrhJlXR4AaABAg.8lin3JQN9-N8ohQEXaUo8t", "comment": "origindirewolf  Have you been on jury duty? Once you do, you will understand the importance of memory in the judicial system. It’s fondamental.   Now to go back to neurochem, memories are everything, they are the foundation for our sense of self, our perception of the world, feelings, thoughts, skills, abilities, actions... our whole lives are based on memories.   A baby has the same amount of nerve cells as an adult, but is only lacking memories, they are the skeleton of the thoughts. The alpha and omega, if you remember what that means ;-)", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVJ3zjQBnTYrhJlXR4AaABAg.8lin3JQN9-N8ohQZpdkTYr", "comment": "origindirewolf  In case you need help understanding: in criminal proceedings you build a narrative to convince a jury. The jury will rule based on their own memories of their own life experiences. After the ruling, the case law system will keep those memories alive for centuries.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVJ3zjQBnTYrhJlXR4AaABAg.8lin3JQN9-N8oisIz8e2Cy", "comment": "origindirewolf  Dude, you’re dense. I suggest you take a deep breath and calmly read again. But unfortunately I suspect you might be too far gone, your comments are going in all directions erratically.   Part of me wants to patiently explain again, but part of me says “he’s nuts, stay away from that deplorable”.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVJ3zjQBnTYrhJlXR4AaABAg.8lin3JQN9-N8oiuEK44rrI", "comment": "origindirewolf  Let’s try again:  In criminal trials, each side uses a single common pool of data.  Then each side builds a different story, a narrative, using memories and emotions, themselves based on memories, and thinking processes and methods and rationales, themselves based on memory.   One set of data, 2 different narratives.   Then, both narratives are presented to the jury, and both sides try to convince the whole jury, by appealing to the jury’s emotions and memories.   After the verdict, the case is archived and will serve as jurisprudence for future cases. Centuries from now, lawyers will “remember” previous cases, and the memories of the case will be used to judge other cases.   So, in conclusion, memories are the central part of thoughts and actions in criminal trials and life in general. For example, you probably have painful memories of feeling inadequate and discarded because you’re not intelligent enough, and those memories influence your angry reactions.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwGktMjSgbWkQ4KO6h4AaABAg.8lFC6S_0a7I8lFCNra7nQ1", "comment": "nm found them", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg", "comment": "Patrick's lecturing style feels very Sapolsky inspired - which is a hard style to pull off so kudos.", "votes": "396", "replies": "8", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxVYw3gOR9eDZm4e4N4AaABAg", "comment": "god this girl should not be presenting at a university, i would be pissed off if i payed to sit through her saying 'like' every other word and talking about erections and orgasms.", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxc6I4dKV7MrARi4kN4AaABAg", "comment": "if you cant stand this guy speaking, skip to 47:00 and if you cant stand the even worse girl that follows, just skip, the lecture will do nothing but confuse most ppl more than they need to be", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgydKAXCMt7qT36zlSp4AaABAg", "comment": "I like how she's saying \"nyorvooz sistaaam\".", "votes": "29", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyEJORfTKdGluPqMsl4AaABAg", "comment": "Speech class is needed", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy51-N03oUJMHTV5B94AaABAg", "comment": "where are the slides he is looking at all the time?", "votes": "8", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzTNl4zBdp_fMxGn094AaABAg", "comment": "I ignore people and kick them out of my mind  if they don't pronounce the words properly from to A to Z VOA special English", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw08u9OjmKxGlUOHQ14AaABAg", "comment": "Introduction to the 1970's II", "votes": "24", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyzQ2WQ1sdQ488T2r54AaABAg", "comment": "Dana Turker demonstrated a subtle connection with her audience, an emotional rapport, not just an awareness of them as she spoke, but a sort of receptiveness to them, that serves her ability to convey information.", "votes": "3", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzV19HSF-pQgmD3w9h4AaABAg", "comment": "April 23, 2010? You spelled April 23 1977 wrong.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwhtmVuTkdGfaztyZ14AaABAg", "comment": "FRO!!! How’d this guy escape from the 70s with all the fabulous hair! Love it. Who says neuroscience isn’t sexy?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwUn9-WyjW8HfFxCZZ4AaABAg", "comment": "Enthusiasm for the topic...", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxJzcK8EM0ubjuoFBh4AaABAg", "comment": "I will have my daughter watch the last part of this video to see what she may...or more importantly...may NOT want to do while teaching college students. Saying \"like\" too much is distracting. As is body language such as grooming behavior while trying to convey information. This is not a criticism. I think this young girl probably did her best. She may have never done this before. I don't know I'd do any better. Still, for any teachers to be- this may be interesting to take a look at and compare against other styles of conveying information. There are styles of teaching that, in my opinion, may be better suited for conveying information.", "votes": "8", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwnh8PE3IqP-dhxO8x4AaABAg", "comment": "The lecture is good but the videography is poor as the speaker is visible all the time in the camera but not the Presentation. So in my view a poor direction of the videography from my point of views as a learner", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwaNG8zgWmCvnNjiwh4AaABAg", "comment": "From 56:59 to like 1:01:01 People laughing at every word cause she a girl", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx0Ifm0uy0pG8AjFYZ4AaABAg", "comment": "Where is Patrick now?  I thought he was excellent!", "votes": "18", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgylJ-4LsoZran_4s7h4AaABAg", "comment": "thanks for the vid :-)", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxHeScWUcsT1Y5KiwZ4AaABAg", "comment": "i was watching the video on times 1.5 and this girl sounds so excited!", "votes": "6", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzo_Jj_pV-f7IvQAW54AaABAg", "comment": "like, like, biology, like", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxPzgHPnht9XZ6A_Ul4AaABAg", "comment": "Somebody should offer bob ross a few more buttons on his shirt", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C8yIu4vgblXn", "comment": "I feel like they both tried to touch on that Sapolsky humor...I liked listening to them both but I sort of felt like Patrick was speaking more to people...Dana was almost speaking more to robots", "votes": "15", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9A3dtZ6GP8Z", "comment": "girls bad Bois good", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9APxplUl8ey", "comment": "I was just about to say the same thing", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9DX9066O_3F", "comment": "Very hard to sound so natural when delivering very complex information and to never say \"um\" in the process.", "votes": "10", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9DssWuWEsBu", "comment": "How does patrick look now? Like sapolsky? I don't think so.. Sapolsky is far more damn-care (his eyes say so) than patrick..", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9XOu6766qlP", "comment": "as does his hair.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9Ykq_zt4Ghd", "comment": " @davidsan9654  That would be the autistic community thank you. We take robot as a compliment.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-mR7W7Ayrz_CLc0h4AaABAg.8l6K9AMXh_C9YkqdhimCqf", "comment": " @temperhollow7716  Cant spell hum-bio without um", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVYw3gOR9eDZm4e4N4AaABAg.8l-tg1MhXe89dq2LQFoTCx", "comment": "Okay i understand the excessive filler words and kneecapping is frustrating, but what was wrong with the subject matter??:/", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugy51-N03oUJMHTV5B94AaABAg.8j65YcuTcDi91U61QjKNne", "comment": "The ceiling. I hear they have a whole Sistine Chapel thing going on up there", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugy51-N03oUJMHTV5B94AaABAg.8j65YcuTcDi9ANaW3v-k7S", "comment": "More slides", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugy51-N03oUJMHTV5B94AaABAg.8j65YcuTcDi9ANadP7uNrd", "comment": " @alwaysdisputin9930  You should look into that Altar pice, Armageddon features some fine \"glutei Maximi\"", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyzQ2WQ1sdQ488T2r54AaABAg.8gMQ2prVS8a8mZLUbSnlqk", "comment": "David Romney hormonally induced response.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyzQ2WQ1sdQ488T2r54AaABAg.8gMQ2prVS8a8rYLEf-v7MN", "comment": " @kerrybrennan7099  lol", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxJzcK8EM0ubjuoFBh4AaABAg.8di02fziQTy8pJQPlMG-ji", "comment": "Well the teaching gig didn't work out for her so she's an MD now. Nice fall back, eh?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxJzcK8EM0ubjuoFBh4AaABAg.8di02fziQTy9R9tCpOEGkX", "comment": "Teaching is part of graduate students.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxHeScWUcsT1Y5KiwZ4AaABAg.8aea97huz3j9ASNbyugzkq", "comment": "Thank you for mentioning the 1.5 playback speed and i can go quickly thru the lecture", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwA5CC6zs8zI4YSlTJ4AaABAg", "comment": "Patrick did a great job, great hair my brother. peace and love my friends", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzV87LRKMfWxt1Iagp4AaABAg", "comment": "17:25 Fuck...If something, anything about homeopathy becomes true I'll kill myself", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugyrmg7nFfic0IorY4V4AaABAg", "comment": "Patrick is really good at explaining and travelling between lower and higher levels of explanation depth. He’s relaxed and confident. Great lecture!", "votes": "328", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwPk5Vcx-QiGs7lrOx4AaABAg", "comment": "Someone please make these professors and student teachers participate in stand up comedy open mics if they insist on inserting jokes into everything. They have so much to learn about not annoying people.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyvAcoZM-tBVbz-abV4AaABAg", "comment": "He keeps looking up there, and you know the camera is never ever EVER gonna let you see what;s up there.  I'm out.", "votes": "15", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxCecx4uss59wQY8RB4AaABAg", "comment": "that girl is cool too y u h8 bruvs", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxXczbFTN8ZrVi7J894AaABAg", "comment": "1:21", "votes": "0", "replies": "5", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggB5XE_tsqEUXgCoAEC", "comment": "can't see the ppt :( is it available elsewhere?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjZT9DTUGi7xngCoAEC", "comment": "Aphantasia.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgiB567Kv-93a3gCoAEC", "comment": "I run from elephants everyday.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjXEbsbzK_OuHgCoAEC", "comment": "The first TA's hairstyle is very nice. I like.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ughd2pTi7zQXbHgCoAEC", "comment": "cave: 12:42   Nitric Oxide (NO) is NOT the same as Nitrous Oxide (N2O). Nitric Oxide is one molecule of nitrogen, one of oxygen. Nitrous Oxide has 2 molecules of nitrogen, and one of oxygen. And that extra molecule of nitrogen changes the gas completely.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjuegP9IV92AXgCoAEC", "comment": "Not a single person in the class seemed to be curious enough to ask the lecturers the obvious question for me, either in this or the previous lecture, about what timeframe these neuronal 'events' take place on, or at what rate per milisecond (whatever the unit is). Everyone seems to be by-passing that little bit of knowledge as if it's understood or irrelevant.", "votes": "3", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugj27hCOxD9O13gCoAEC", "comment": "time to work on the mind palace", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UghWjitOIg5CFngCoAEC", "comment": "How could people not like such informative presentation by the TA's? The TA were taking class where the Prof. Sopolsky is teaching. This is hugely humbling experience, therefore, they were feeling the weight of that class and trying to be more humble. How come students of Sopolsky forget the context and make comments. I think no one questions the content of the lectures of either of the presenters.", "votes": "56", "replies": "4", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgiP1i9_doou7ngCoAEC", "comment": "I think there is an important part of brain function which can be termed 'focus of attention'. The proposal is that this focus of attention operates in the brain by using the ability to focus the wave energy associated with certain neuron pathways to activate or amplify the activity of other specific areas of the neural network. So for example our focus of attention could be in visual inputs, audible inputs, movement, thought processes etc.  The focus of attention then becomes the means by which specific aspects of consciousness are selected. For more detail see:  https://www.academia.edu/30004610/The_Conscious_Brain  Richard", "votes": "3", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugj7VjwGYpNDO3gCoAEC", "comment": "Long term memory  I propose two possible theories on the way human learn. I am not talking about the best way to learn (using book, attending school, etc), but the precise mechanism in the brain that allow to acquire new data and recognize information already recorded.  My formation was as electric engineer, followed by software engineer with real life experience if embedded firmware. I may have tendency to use expressions such as pulse to describe the chemical/electrical wave that is called \"action potential\" by the brain specialists. My comparisons between brain and computers are metaphors that are used in the hope to clarify the explanation. It is not the intent to imply the superiority of any of these tow very different systems.  With the help of language, the information acquired by each individual can be transmitted to the new generation very efficiently. The invention of writing allowed to transmit information across large group, cultures and even thru large gap of generation.  For example of gap between a large number of generation, look at the damage created by the domination of Christianity soon after the fall of the Roman empire. From that time  up to  the renaissance, the Greek philosophy was forbidden. Any information that could threaten the power of religion was vigorously shut down. A curious mind was more likely to be burn as sorcerer than a child molester. This is the dark age, where most people were living in a poor intellectual environment. Since there was only one book to read, the Bible, there was little interest to even learn how to read and write.   During the dark age, the Muslim world was rich with science, math, etc. Look at the words starting by \"al\" in any English dictionary to find scientific subjects that became popular during renaissance. After 1500 years of darkness, Europeans rediscovered to richness of Greek philosophy. From their state of death culturally, the felt like \"born again\", alive, which is the meaning of the french word \"renaissance\".  In the last two decades, Internet web sites, such as Wikipedia and new philosophy such as open source software seems to sparkle a new era with high quality information almost free.  Back to the main subject of this document : Memory  The 2 proposed mechanism are:  1 - connection growing as we learn 2 - synapse reinforcing on already connected neurons  We may find that both are thru, depending on precise location in the brain.  The saying \"Neuron that fire together wire together\" illustrate the net result that must happen physically in the brain for the process of association of information. Brief, two brain areas located millions of cell layers away, should increase significantly their chance of becoming active together if they represent information that has some link with each other.  The type of concept that can be associated together has the be very generic since the brain can perform tasks that were never done by any previous generation. This observation appear to discredit immediately the second mechanism proposed in the introduction. We will explain in more detail these problems and some solutions in this document.  Let's get an example to help clarify what we are talking about.  Example: I am at the beach and I see a few seagull flying around somebody who is holding a plate of french fry. He throws one at a time, as high in the air as he can. One of these bird catch it in mid air most of the time. Sometime, a bird chase another, trying to steal the food before he could swallow it.  The subject discussed here is not an abstract invention, it is not playing with words and creating artificial concepts to make a final exam impossible to pass. The subject is about memory, how it work inside our brain. If anything I propose can be demonstrated to be false, I would get rid of such false ideas. My only goal is to understand how the brain really works.  Memory is the hearth of any thinking system. Understanding memory get us very close to a full understanding of the way humans think and learn.  I recognize however that this text will be meaningless if it is analyzed by an automatic computer software. The neural network used by Google, NSA and others will not have a clue of what is discussed here.  From the example above, I want to focus on the following question:  How the brain can associate a concept from the visual area (seagull) and a concept from the auditive area (bird song). You may say \"seagulls don't really sing\", but I don't judge your weird choice of noise that you call music.  This process is supposed to be bidirectional. That is, a picture of a magnificent bird can remind you it's superb song or it's obnoxious squeaky voice.   And the opposite direction of the association also exist, possibly at the same time. A sound recording of the bird suffice to bring back in your memory the look. Maybe, if, like me (Christian Gingras, from Quebec city but living near San Francisco for the last 16 years and unable to find work for a long time), you can not voluntarily bring any image of anything in your visual system, you still can associate the sound with any picture or real live bird,  I can not start painting something I saw a few years ago. I would not be able to paint something live, just in front of me. I can compare images and describe their content in any level of detail. Note that for sound, things are different. If I did not understand your last phrase, I can recall that short stream of sound, replay it and finally get what you said.  I can replay some fragment of a song that I heard on radio, if it has a distinctive melody. I even succeeded to distinguish one heavy metal song from another, which is as amazing as these 56K modems extracting data from what sound like the white noise from a fast flowing water fall.  For example, each time I see this kind of bird (most of them are that size, that color, etc) I hear that characteristic bird song. After we clarify how the visual system makes statistical processing to conclude that a specific bird belong to that type (call it race, specie, variety, etc). From that point, that single concept that represent the large amount of visual stimuli need  to relate to another brain area which memorize bird song.  The processing of sound from the auditive area is equally complex. The number of operations to convert a stream of raw frequency/harmonic information from the cochlea in the ears, with all the noise always present, to become a unit of information, is as complex as extracting 3d information from the 2d projection on the retina.  Eventually, these two concepts (bird type and bird song) need to get associated. It is impossible to know in advance what we will learn. The association can not exist before we experience it. So, there is a need to physically change the connection to create new association or an alternative way to allow the complex and very large amount of concepts that we accumulate during our entire life.  Red flag:  - growing new synapse takes time (from minutes to hours for short distances, weeks for long distances)  - neuron \"action potential\", is very short duration (less than 1 miili second)  - two neurons that need to create an association would need to travel thru layers of glial cells and neurons/myeline  cells to finally get a physical connection.  This text is exceptionaly long for a youtube comment. Sorry if it annoy some readers and happy if it help others to get insights on this fascinating subject.", "votes": "0", "replies": "5", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggCAAlxRMQeG3gCoAEC", "comment": "I think the hippocampus is like a holographic projector and the neocortex is the film. This would explain the odd structure of the hippocampus and even explain why the amygdalae are pointing straight at the frontal lobes. This would also imply that the brain is using some kind of 'wireless' transmission and I think that's too out there for most people. As an engineer, this explanation fits perfectly. I guess time will tell.", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggzjrNfBo7wNHgCoAEC", "comment": "Love the fro and the mind", "votes": "58", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgiZIgZUvi_GRHgCoAEC", "comment": "disco stu gonna teach some neurobiology to you!", "votes": "82", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugyrmg7nFfic0IorY4V4AaABAg.8YP9hHO2QlE8mRI7dtHVIA", "comment": "Yes!", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyvAcoZM-tBVbz-abV4AaABAg.8WwWA_ifsuf8_GbSzQ1eat", "comment": "a picture of a brain. I assume, since he is describing the brain....", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyvAcoZM-tBVbz-abV4AaABAg.8WwWA_ifsuf8uhy3iJ1uq4", "comment": "They're on the handouts. Sapolsky's going to have to print out a few million of them now.", "votes": "5", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyvAcoZM-tBVbz-abV4AaABAg.8WwWA_ifsuf9R9p6ibc8Ht", "comment": "It’s a spider up there. He is just making sure it’s stays there", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxXczbFTN8ZrVi7J894AaABAg.8VmzMuRG2_18W-OY291I-i", "comment": "22:21", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxXczbFTN8ZrVi7J894AaABAg.8VmzMuRG2_18W6878fg0ry", "comment": "34:25", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxXczbFTN8ZrVi7J894AaABAg.8VmzMuRG2_18WEoVR8KbAy", "comment": "39:39", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxXczbFTN8ZrVi7J894AaABAg.8VmzMuRG2_18WJQIAMC3c7", "comment": "53:30", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxXczbFTN8ZrVi7J894AaABAg.8VmzMuRG2_18WOWAmMFxFa", "comment": "1:06:24", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjuegP9IV92AXgCoAEC.8P-zyGmLS4S8QoGLRAT8v7", "comment": "Stephen Paul neural action potentials are 1-2 milliseconds", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjuegP9IV92AXgCoAEC.8P-zyGmLS4S8pS_NJE6ffF", "comment": "It was mentioned in the beginning of the previous lecture, that's why", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjuegP9IV92AXgCoAEC.8P-zyGmLS4S8pS_qWaA1aH", "comment": "But the way the answer to your question was alluded to seemed to implicate the students might already have been familiar with that information.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghWjitOIg5CFngCoAEC.8OU2tvvGx_Y8rcKaYKjMqh", "comment": "Never, ever question your Indoctrination!!!", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghWjitOIg5CFngCoAEC.8OU2tvvGx_Y9Ykqmaf2mog", "comment": "There cant be many of his student in the comments nowadays,", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghWjitOIg5CFngCoAEC.8OU2tvvGx_Y9Z2s4nutd2a", "comment": "I ditched TA sessions…unless there was an exam that week.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghWjitOIg5CFngCoAEC.8OU2tvvGx_Y9dZq7eNMjmg", "comment": " @dakoderii4221  I'm not sure if this is just trolling, but it really seems like it. Go ahead and do your own neuroscience research bud. If I can when I open up my own lab I'll help you out.", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiP1i9_doou7ngCoAEC.8NYl3aA39dl8nyFGrFRux1", "comment": "Fuck me, this is gold", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj7VjwGYpNDO3gCoAEC.8M2T8WeMH9B8M2TI5Gl92Q", "comment": "One simple model could be called the \"Olympic pool of spaghetti   - two spaghetti noodles need to connect to each other. (only the dendrite of one noodle is growing toward the other, the other just wait in place for a synapse to form somewhere along its axon)  - The bowl of spaghetti is the size of an Olympic pool.  - The starting location of both noodle is random (anywhere on the surface)  - The depth is also random (X, Y and Z are random)  - The texture of the noodle is the same everywhere. (No bone or other hard structure to hold on ; think of wine plant growing on top of each other on the side of a hill)  - The dendrite of the growing noodle act like the root of a tree. It seek the closest path  in this 3d pool, adjusting the grow rate in all direction, keeping the tip with the highest chemical gradient, destroying the other part that were proven to grow in the wrong direction.  - Like the growing root, the noodle zigzag around harder obstacles, like other neuron, then continue to grow in the direction of highest gradient of chemical, attracted by the other neuron. Presumably, in this model the glial cells would be equivalent to the soft soil which can be pushed as the root is growing  - As it progress and it is approaching the other, the dendrite is not distracted by the same chemical that other pair of neuron emit while they also grow their connections.  Beside the root of plants, do we know any example of living cells which make precise and complex 3d connections? Can we compare this memory process, which is modeled as neuron creating new connections in a 3d jello bowl, to the growing of early cells of the nervous system in an embryo?   Starting from the neural tube, we now understand how some guiding cells migrate in precise locations. The first, closest to the starting point, already on guard at the correct position, start generating a gradient of chemical that attract a cluster of early neuron cells. As the group of neurons arrive at destination, the gene of the guide cell turn off,  the chemical gradient vanish, and another guide cell located further has in it's gene the instruction to turn on the generation of that chemical. The cluster of neurons then continue to grow in that direction.  Like in an orchestra with each musician able to play alone, but also synchronizing to the other by watching the gesture of the maestro, the growing embryo assemble the 3d structure by a combination of operation which sometime depend on signal from distant cells which synchronize the work and guide the shape on a scale much larger than any individual cell.  Another possible way that neuron can make arbitrary connection with any other part of the brain is that all possible physical connection are made at the beginning. The memory would actually be made by destroying specific connection.    Below, I propose 3 mechanisms to the formation of memory which are not based on growing new connections between distant neurons.  Physical change memory This physical removal of the synapse and the rest of the thin row of cells that attach it to the dendrite could happen on the second to minute time scale.  Positive memory Alternatively, instead of destroying the connection, the memory could be enforced by the chemical dynamic in the synapse. Each time a pulse appear at the synapse, it could make other pulse easier by speeding up the reuptake or by introducing other neurotransmitter which would decrease the threshold needed to transmit the next pulse. (note: the word \"pulse\"  is used as shorthand to action potential)  Negative memory Yet, another variation could be that a synapse that got exercised many times become \"tired\" and less likely to transmit in the future. Memory would be acquired when a synapse decrease it chance to transmit another pulse.  This was the second part since youtube could not accept this text in one post.  This text is exceptionaly long for a youtube comment. Sorry if it annoy some readers and happy if it help others to get insights on this fascinating subject.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj7VjwGYpNDO3gCoAEC.8M2T8WeMH9B8NavhCLezG5", "comment": "exceptionnaly long for a youtube comment but exceptionnaly short for a theory which is supposed to describe something that tons of scientists have yet to explain.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj7VjwGYpNDO3gCoAEC.8M2T8WeMH9B8O-a8AigpEc", "comment": "We know that we can associate information from different senses such as the name of an object. We can associate more abstract concepts to each other/ Example: a name (pronounced by a friend) with spelling. Any new information get tagged with detail from a multitude of brain area, such as emotion, time and physical location.  It seems that such complex association can not result from a single neuron growing many synapses to every other part of the brain which fire at the same time (neurons which fire together wire together). Based on the Olympic pool spaghetti noodle example, the task appear impossible.  More detailed study of the brain, the neo cortex, show the division in columns made of 5 or 6 layers of neurons, a total of about 70 neurons per columns, a total of 4 millions colums", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj7VjwGYpNDO3gCoAEC.8M2T8WeMH9B8O0FWe_YPCc", "comment": "Why? In the sense how \"how this configuration appear to fill a specific purpose\"? It would avoid the problem of cross linking.  In astronomy, people invent convenient units such as Parsec and solar radius. I presume we have equivalent units in neurobiology such as \"neurometre\", the mean distance between neurons in a human brain.  It is presumed that creating a new association between a visual object (located a few layer deep in the visual area) and a spoken word (located in the Wernicke or Broca area) would require crossing thousands of \"neurometre\". As the neuron is growing a connection, it could easily get distracted by any other neuron that would happen to also \"request\" an association to be learned.  In other words, assuming we can learn many different association in a given unit of time, then the risk of creating wrong association are high.  However, if the cortex is really divided in columns with relatively small number of neuron interacting at the same time, that appear to simplify this problem.  The new problem that need to be explained in that model is : how does millions of column interact\" and we still need to understand how physically distant bran area can learn when they shouls increase the chance to match a pattern.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj7VjwGYpNDO3gCoAEC.8M2T8WeMH9B8O3GSAO0BOt", "comment": "Discussing the brain unit of operation with a friend who is familiiar with electronics, he asked: what is the purpose of each neuron connected is serie, if they just transmit the signal from the previous one.  The answer is that each neuron receive as input the signal from many neurons and it will transmit a signal only if it detect a pulse from a percentage of input within a small time windows. In other words, there is a voting mecanism where a signal continue only if the total number of neuron exceed a threshold.  Contrary to computer, where each bit has a different weight, for the neuron, just the total number of synapse activated is important. So, if a given neuron receive 10 synapse from a given neuron, it's voting power is greater; somewhat like a company with vote rated on number of share.  The integration function of each neuron is equivalent either to \"addition\" or to the logic operator \"OR\" or \"AND\" depending. When the excitation threshold is low, it act like \"OR\" which mean any pulse present on the input trigger an output. A high threshold act as a logic operator \"AND\" where every input has to get a pulse to trigger a pulse on the output.  Depending on chemistry at the synapse, a pulse can be inhibitor. This allow to create the equivalent of \"subtract\" and \"compare\" in some case, or it create a synchronization point, like a set of buffer in a computer which align every address and data with a given \"clock\" signal.  In any electronic device, a comparison is a subtract operation for which only the sign is kept, the numeric result itself is discarded. In the case of neuron which need to compare two items, the pulse is transmitted only if the total number of inhibition pulses is lower then the normal pulses, within a time window. The exact threshold sensitivity will make the operation either act as \"at least\", \"about equal\" or \"most of\".  The major brain wave measured directly on the scalp are easy to detect because they involve a large number of neuron synchronized on a specific clock. For example, the gamma waves at 40 Hz are created by the visual processing. The retina transmit continuously the information about luminance from the rods and the two pairs of complementary colors computed from the 3 cones.   However, the recognition of edges, and the computing of local contrast/local brightness on every part of a 2d image, need a periodic \"erase/repaint\" operation. So, 40 times per second, a pulse is sent which inhibit the entire array of data for both visual fields, Since the clock inhibit millions of neuron at the same time (within a few microsecond), the electric signal is so strong that a small fraction gets coupled capacitively, crossing all layers of the cortex, the meninges, the bones and reach the surface of the scull, and can be picked-up by electrodes.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UggzjrNfBo7wNHgCoAEC.8HLFzv5E4D78leGGDvcDhz", "comment": "Thats not a fro.. its his mind...", "votes": "8", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiZIgZUvi_GRHgCoAEC.8FwDCkOe2eF8mnG0tbrZaI", "comment": "Wow let people be themselves. Damn", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiZIgZUvi_GRHgCoAEC.8FwDCkOe2eF8pbwdvPsPKH", "comment": " @RolferShannon  ironically keeps people from being themselves", "votes": "10", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiZIgZUvi_GRHgCoAEC.8FwDCkOe2eF8uhx1f3myvg", "comment": "The script says I'm supposed to hit you with this pie now.     I wouldn't.       Right on!", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UggC34HObBwIMHgCoAEC", "comment": "I can't take seriously any teacher that uses the word \"like\" like sooooo many times", "votes": "12", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugh5CStCdGh8N3gCoAEC", "comment": "he looks like a white Drake", "votes": "9", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjkLbaMiHM4oXgCoAEC", "comment": "Patrick, say TOPE! Spatiotopic. You in advanced math know what tope means, and TOPE-ic is far different for other students to understand, than, topic. BTW, much in the parietal and other areas is Associational cortex - those areas put things together and send signals on. The oversimplified limbic presentation previously has so far in the series ignored the actual types of memory -  which go from the transient to the LTP.  Memory slowly disappears from the Hippocampus as one lecturer said, into a more distributed form.  That autistic-savant photographic memory is like holding onto the sensory memory through short-term to long-term. I'd suspect that due to the general brain wiring, that some of the normally social context modular spaces in non-handicapped are repurposed for retention in the autistic (remember that this is a spectrum, in which, as an aside, males lean more toward autism than females; we all have some capacity to retask-repurpose, each coming from individual variation in brain wiring)  Memory is divided in more than one dimension, by declarative/explicit vs procedural/implicit(different \"systems\"), and by semantic vs episodic. As you study this (and you will; behavioral science requires it), you might still hear the old saw that \"procedural\" (inaccurately equated with nonconscious, though recent work has changed from that inaccuracy) is cerebellular/basal ganglia (close to and sharing somewhat with limbic, also a distributing network). Well, some cognitive actions in humans are associated with cerebellum, and some of the modular hypotheses are falling fast, including in other animals, big-time.  Sapolsky cautioned from the first that thinking within categories is extremely limited and very often false. Keep exploring and questioning previous dogma - Crick, remember, used the word as a joke, meaning that it may in the end be false. It was just, as Patrick here reiterated about the \"place\" of memory being the newest not-yet-understood area, an architecture for speculation upon. From speculation comes falsifiable ideas called hypotheses, which you will create and test.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugiw46wkbT5aE3gCoAEC", "comment": "more disco than neuroscience ll", "votes": "54", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UghDEK_lHmR0wngCoAEC", "comment": "jayzus if i, like, hear a'udonomic nervous system one more time", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjSQRk2hwXjLHgCoAEC", "comment": "The funk soul brother, check it out now...", "votes": "137", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC", "comment": "Im just curious, wheres her accent from?", "votes": "8", "replies": "11", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgiS7jO7NeQPB3gCoAEC", "comment": "Patrick H is gonna be a great prof.if he isnt already , i guess this was in 2010", "votes": "61", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ughb-x5namJPC3gCoAEC", "comment": "Really great lecture, it would have been really handy to have a look at the board / slides though. Anywhere I can find them?", "votes": "65", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjSavSZNyI0WHgCoAEC", "comment": "Excellent, thankyou!", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ughg0bUTfl30M3gCoAEC", "comment": "Great lecture I learned a bunch", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugj2jJaxs_sELHgCoAEC", "comment": "Is that Drake?", "votes": "18", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UghRnQHhs03W_ngCoAEC", "comment": "okeh!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC", "comment": "PhD students laughing when she says orgasm lol.", "votes": "239", "replies": "7", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugj7Kyt1huM4AXgCoAEC", "comment": "Also see on youtube : Neuroscience - Long-Term Potentiation", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UghCxZyutXQaNXgCoAEC", "comment": "Nothing but net!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC", "comment": "12:40 this is wrong. NO (nitric oxide) is not used in dental medicine! He mistakens it for laughing gas (N2O or nitrous oxide), which was formerly used as an anesthetic.", "votes": "15", "replies": "6", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UghYev89S2QNqngCoAEC", "comment": "SENPAI", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugg3gauZY8Rm1HgCoAEC", "comment": "I can see how is teaching style is influenced by Robert himself, especially in his cadence.", "votes": "10", "replies": "3", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugh1H8UtEREPY3gCoAEC", "comment": "This girl is a professor?? O_o", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggC34HObBwIMHgCoAEC.8FsauM6qXnl8iX2_yGYQvl", "comment": "same for 'kinda', it's kinda irritating.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugiw46wkbT5aE3gCoAEC.8DQ_sh9tj3C8Yp8q0gOItJ", "comment": "Looks like my uncle back in the late 70s.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjSQRk2hwXjLHgCoAEC.8A8q5nSGAws94AirOAdH9A", "comment": "xD", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjSQRk2hwXjLHgCoAEC.8A8q5nSGAws94TqLrAZJI6", "comment": "chilllll ahaha", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjSQRk2hwXjLHgCoAEC.8A8q5nSGAws9HX8DRQ-pL2", "comment": "Right about now?", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8C3iF8Ho9uL", "comment": "I don't notice an accent and I'm from California so maybe that's where she's from.", "votes": "21", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8n5mR6XjUK4", "comment": "What is her country of origin?", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nyEu86Lqok", "comment": " @captainclaw-i5k  US, Cali, look up \"Valley girl accent\"", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nyb9CpK3I1", "comment": " @TheHellogs4444  ,I mean where are her ancestors from? No one in this world,except for Native Americans are true Americans.....All are immigrants,even Trump himself....Historically,America is an illegally occupied land.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nybGOvhrOU", "comment": "So when someone mentions themselves as American,they are not being specific,unless they are the Natives.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nydmk_0MUK", "comment": " @captainclaw-i5k  I don't think it's some EU descended accent, (I'm not american, idk history of california) but I'm reasonably certain a lot of the american accents just evolved post immigration, post 1500 or w.e.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nykMDASUsN", "comment": " @TheHellogs4444  That is true....", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nykUZAlVuo", "comment": "America is a multicultural nation due to immigrants....All these mix up,and  America seems a bit original to some.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK8nyky5sbBSS", "comment": " @captainclaw-i5k  If you think about it, it's true tho. Isolation leads to speciation in biology, same with languages.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK9-0grS51emL", "comment": " @alozano793  I'm used to a different feminine californian accent, this one is ok to listen too ^^", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugi1pc1hVwqQ3XgCoAEC.89u97-GbFhK9R9t0OkpiFi", "comment": "It’s irrelevant to the context of the lecture. That aside, the human race started in Africa, so we are all Africans.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ughb-x5namJPC3gCoAEC.85K4SXfN1hR9avqt-fTKZ4", "comment": "Yes, this is a major weakness of those videos. To me, mystifying, since the goal is to instruct.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ughb-x5namJPC3gCoAEC.85K4SXfN1hR9b93Et4DRZa", "comment": "I don't really understand why some people ask for slides in almost each and every one these lectures' comments. I'd never thought about getting them before reading your comments because they don't feel necessary at all to me. It's quite the contrary in my experience, I find them to be more distracting than anything else.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ughb-x5namJPC3gCoAEC.85K4SXfN1hR9b9hEUPgt_X", "comment": " @nackedgrils9302  Sapolsky explains it very clearly in his course: Individual differences in behaviors. That includes learning behaviors.", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj2jJaxs_sELHgCoAEC.8-amkqiPFgz87YgKdJr__0", "comment": "+Reggie Toussaint i was thinking the same thing hahaha", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG8h4kmszZrSG", "comment": "Yeah looks funny but it not neurology it's psychological evolution. How they have evolved for the word orgasm", "votes": "5", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG8krISBuP50f", "comment": "#Cucked", "votes": "4", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG8zAm99lOWe5", "comment": "Stanford right there", "votes": "6", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG8zL_na4ykF0", "comment": "Pretty sure the laugh is after she says \"Things you don't have control over.\", which is objectively funny when directly said after orgasm.", "votes": "18", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG9-0gVaTqQyr", "comment": " @TheMrVengeance  also the room started laughing (and she can see faces before we hear the noise)", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG99A6qTzV5ro", "comment": "Not matter how smart you are, there is that part in all of us that is 10yo when it hears certain words.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Uggwy_-E-VXGkXgCoAEC.7-H0Z7-3PsG9ACcavcnkpA", "comment": "Evolution is visible there. Little children in school will laugh if you say penis or vagina. Students in the high school will laugh if you say erection etc. And for the last, if you say orgasm in front of university students they will laugh just the same as previously.  Behavioral evolution in practice.", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC.7-H0Z7-BMRu76jaJy74QlM", "comment": "And I have evidence that you're a nerd too because that irritated me to by the way he meant N3O there's three nitrogen atoms in nitric oxide. #happy sciencing", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC.7-H0Z7-BMRu76jjHeWzObR", "comment": "N2O is what I meant bro", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC.7-H0Z7-BMRu8lir9548IGU", "comment": "Nitric Oxide is NO.  Nitrous Oxide is N2O. It’s a sedative, not anesthetic. It is used by dentists today:  https://www.mouthhealthy.org/en/az-topics/n/nitrous-oxide", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC.7-H0Z7-BMRu8oUtuKE7H-h", "comment": " origindirewolf   Hey, I'm not a dentist, you're not a dentist. This is not a pissing contest, I don't care about your opinion. I simply looked up an article. Maybe the dentists are wrong and you're right. But that's a low probability.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC.7-H0Z7-BMRu8ohQtG4OEFd", "comment": "origindirewolf  Use google and do your homework before posting. I think I even gave you a link to an article from a dentistry journal.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgiApr_g3Cvy-3gCoAEC.7-H0Z7-BMRu8pph5Q9ylFB", "comment": "NO is still used", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg3gauZY8Rm1HgCoAEC.7-H0Z7--FTK75abeTX2ikO", "comment": "I guess since this is not an advanced class, you need to have the easy understandable metaphors. I would use the same technique desribing more complex stuff to my younger siblings.  It can get annoying if you are an advanced student. You should hear some other of Roberts statements. Very intellectual and hard to grasp at one session stuff :)", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg3gauZY8Rm1HgCoAEC.7-H0Z7--FTK8dLaehvi45J", "comment": "Robert Ross?", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg3gauZY8Rm1HgCoAEC.7-H0Z7--FTK8gpShJ6H4m_", "comment": "Whooshed over me.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg7OcnJM6gzz3gCoAEC", "comment": "For me, that girl was awfully irritating. Slurred speech, sense of humor of a 10yr old, giggling and squeaking... Since I'm not a mazochist, just skipped the video after a while. \"ah-kay\"", "votes": "22", "replies": "5", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggjmHCsee30mHgCoAEC", "comment": "What's with the Afro?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggRW1iLTmMJkXgCoAEC", "comment": "THE LAST PRESENTER SHOULD JOIN TOASTMASTERS ", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC", "comment": "Good lectures. The TAs need to work on their presentation, especially the last presenter she's very schoolgirlish in her presentation very giggly. The content is good and I'm glad its available for free. Thank goodness for the internet.", "votes": "26", "replies": "7", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggMGRlZaH-7CHgCoAEC", "comment": "right, Boxxy :)", "votes": "5", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugjnd9LR7Jtkm3gCoAEC", "comment": "The girl in the second half makes a big show of it. Quite entertaining. ", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggbTXUcafMv3XgCoAEC", "comment": "Great video. Thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgjNUl6JeQ_963gCoAEC", "comment": "hippocampus definetly looks like a sea horse!!!", "votes": "2", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UghTQVr92Z3vyngCoAEC", "comment": "I can't believe she interrupted her lecture to underline her lame joke on orgasm. Orgasm \"hahaha\" Sex \"hahaha\" - in a biology class, really? Orgasm in this example was relevant, but the way she needed to giggle on it was ridiculous. Maybe it is a cultural difference between the US and the rest of the Western world. Maybe they are so conservative in the US that for them sex is still a taboo and they need to giggle for that - in a university. ", "votes": "14", "replies": "4", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugj2XDOOAZtRl3gCoAEC", "comment": "I have been teaching high school for 25 years and I often hear the absurd quip about - those that can't teach - blah blah, etc.  It is clear that knowing does not qualify one to teach.  But the only way to learn to teach is to do.  So keep on teaching.  I hope all three TA's watch themselves - they will learn a lot.", "votes": "21", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UggEV24YeYybrXgCoAEC", "comment": "I liked the first part and, especially Nathan Woodling part better. Completely agree with sushicartman01 about the pictures, the presenter refers to. Not seeing the pictures makes it harder to understand the whole process", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwo-b_4F76ugWLofBZ4AaABAg", "comment": "I'm learning neuroscience from mauroune fellaini ", "votes": "4", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzBlfuQE4xTaU52eFJ4AaABAg", "comment": "Where's the link to the movie", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw0HZdScFHHyNDBV8B4AaABAg", "comment": "He just had a 70s party last night and didnt make it home", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzRW_f8TULIWKOTBBZ4AaABAg", "comment": "(if you are a ponce)", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwavBhjKW8BqTIPyfF4AaABAg", "comment": "With that hair, I tend to think he CAN have his shirt open. Kudos to him.", "votes": "333", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxTMOB2LJE6HOrlHmB4AaABAg", "comment": "he has a phd on how brain works. its complicated like \"how universe is build\". so either you are a frustrated student or you dont know what phd and neuroscience is! hahaha studip", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxVqYPra9-_MEw-wJV4AaABAg", "comment": "The university should give public speaking classes to students before letting them give lectures. Patrick's English needs grammatical correction. \"There is 100 million neurons.\" should be \"There are... \" The word 'this' is not correctly used for the definite article. Both speakers use the word 'like' gratuitously. Many of Dana's declarative sentences are spoken in the cadence of questions. These and many other errors in their speaking are very distracting. ", "votes": "3", "replies": "5", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyHYvymwuQbwH-NQXp4AaABAg", "comment": "Nitric oxide is the retrograde neurotransmitter, not nitrous oxide.  Great lecture, thanks", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxHlvgGFi6tpmbAfwN4AaABAg", "comment": "Thank you Redfoo ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugg7OcnJM6gzz3gCoAEC.7-H0Z7-07DT72rHbi_6BDA", "comment": "I did not mind. Being PhD candidate, I know how hard it can be to talk in front of so many people. It makes you feel nervous, and you start giggling, or touching your nose, or whatever. They are there to learn. These lectures are extremely technical, so there is no need for R. Sapolsky to teach them by himself. Some of the PhD candidates do better job than the others. Nothing new. I hope that the girl would watch herself and be better next time.", "votes": "22", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg7OcnJM6gzz3gCoAEC.7-H0Z7-07DT8bw7ZvJlNPT", "comment": "hopefully stanford started teaching comprehensible speaking for an audience since then, should otherwise be a waste of talents", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg7OcnJM6gzz3gCoAEC.7-H0Z7-07DT8mZLiiVlDRW", "comment": "I agree. Frequency of ‘like’ and question-intonation was irritating..", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg7OcnJM6gzz3gCoAEC.7-H0Z7-07DT8mZMZBaJtUD", "comment": " @ondrejplachy297  So true.  Public speaking can be very frightening.  I cut her some slack.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugg7OcnJM6gzz3gCoAEC.7-H0Z7-07DT8pph2tDVXu7", "comment": " @ConnorMeinert  \"if she gives you lemon, just make juice out of it\" kinda attitude doesnt justify her irritating and childish behavior. Es ist furchtbar!", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh73citmxE4yF", "comment": "She is precious. Okai?", "votes": "10", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh766N3Jq_-Ca", "comment": "I love her!! ", "votes": "7", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh7C_Abd8MGiX", "comment": "50:07", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh7C_D4fj0240", "comment": "Friesen Eduard Good one.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh8mEobt5XpiQ", "comment": "There is really no problem with it being a bit enthusiastic, but she talks a bit too fast. :).", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh8mRIRc3CqZN", "comment": "I thought the first one was fine.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjHfyTwG7Lk4XgCoAEC.7-H0Z7-QOUh8pUu9_V_TlV", "comment": "She is cute, but somehow that does not seem to make the most engaging teacher.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UggMGRlZaH-7CHgCoAEC.7-H0Z7-00Xc9xhjdEXur-s", "comment": "Boxxy goes neuro :D", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UggMGRlZaH-7CHgCoAEC.7-H0Z7-00Xc9xhkSj-E73M", "comment": "wonder what I was talking about 9 years ago here xDD  @Badass_Brains ", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjNUl6JeQ_963gCoAEC.7-H0Z7-LR5N8WwQE-Bol8b", "comment": "Sea horse scientific name is \"Hippocampus\". Lol", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgjNUl6JeQ_963gCoAEC.7-H0Z7-LR5N9COoWqtJeiQ", "comment": "Sure, after  cooking", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghTQVr92Z3vyngCoAEC.7-H0Z7-GpGl7-VK6ID1_j2", "comment": "shut up an let me enjoy it", "votes": "5", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghTQVr92Z3vyngCoAEC.7-H0Z7-GpGl7-yh_-e3NRt", "comment": "if it's normal to you then why did it make you uncomfortable to the point of responding? ", "votes": "12", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghTQVr92Z3vyngCoAEC.7-H0Z7-GpGl70Nh3DrwGuv", "comment": "Hahahaha. You said sex.", "votes": "10", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UghTQVr92Z3vyngCoAEC.7-H0Z7-GpGl7IDDNLyNlxR", "comment": "I absolutely loved all the teachers and especially the last girl. She jazzed things up. I see no problem with her style, on the contrary, jokes keep everybody very receptive and alert to the material. I wish I could be as relaxed and giggly at will when I teach.", "votes": "8", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugj2XDOOAZtRl3gCoAEC.7-H0Z7-U8T99R9qDbHL79f", "comment": "I just wish those who teach had Masters in their fields, a few years work experience and then become teachers. At least for HS", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugwo-b_4F76ugWLofBZ4AaABAg.8Gbuu8YhTJ-8UUgBeNMu3J", "comment": "I thought this side of youtube would be football-free so I did not make the same joke. Thanks.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwavBhjKW8BqTIPyfF4AaABAg.8GbQa7XxNyOA-bzf-q4n6F", "comment": "what with the newer Yakuza games, it might even be fitting for him to have NO shirt on!", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVqYPra9-_MEw-wJV4AaABAg.8GbyukXFfXh8gpSrGdIRSV", "comment": "Pissant", "votes": "5", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVqYPra9-_MEw-wJV4AaABAg.8GbyukXFfXh8nyFiuAbwiD", "comment": " @joshuapeterson9691  Agreed, I'm an english bilingual who's not distracted from learning information by their own mind. @Equitatum Kudos on the self sabotage", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVqYPra9-_MEw-wJV4AaABAg.8GbyukXFfXh8uH0BZcl1-I", "comment": "See you on the far side of the spectrum, sir.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVqYPra9-_MEw-wJV4AaABAg.8GbyukXFfXh8vS3UBd1YUO", "comment": "Try to focus on the content and not be distracted by trivia. It might take discipline.", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVqYPra9-_MEw-wJV4AaABAg.8GbyukXFfXh8wMsrzxZKev", "comment": "I understood him perfectly.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyhcerJbsNPKC-c5W54AaABAg", "comment": "The Hering grid illusion(40:39)", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx5ASx0xsOmGph5Q8V4AaABAg", "comment": "lol this girl said orgasm ", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzhlqJuU3hlcYIFnK14AaABAg", "comment": "aboslutely ! ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugztf_GFGt8rjlMWavd4AaABAg", "comment": "bro you look like a white Questlove hahhahah props!", "votes": "3", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxEWbvfN5g7wqKkw_h4AaABAg", "comment": "strange because they dont have a problem cutting to the girls power point.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw792mxfRZEI9vR-1x4AaABAg", "comment": "Patrick has great hair. Dana Turker is great. I like the angry Wildebeest ;-) (BTW all you on hating how she speaks can F*$K off I think she makes thing more interesting!", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwT8FXHKxFEhHfPD9J4AaABAg", "comment": "guy really knows his shit..n1", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugy9DgsgllBOQVgeyd94AaABAg", "comment": "that was my first thought about buttoning his shirt. ha ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxr8awAq3G3lWPhtLZ4AaABAg", "comment": "button you're damn shirt dude you're not lenny kravitz ", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz-9GtxRe0RlNW0e9B4AaABAg", "comment": "maybe my rage will help me remember the information. ", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz0pvhnZR53uU_8_z94AaABAg", "comment": "i couldn't finish listening to the second lecturer, but i'm thankful she speaks the way she does. now, i have a stronger motivation to finish school before, like, all my kind of like instructors are totes talking like her and changing pitch at, like, the end of every sentence to where it, um, sounds like a question? holy Jesus. ", "votes": "4", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugysly3-tx7V-H2iOyl4AaABAg", "comment": "hahah, thats probably why he became a doctor :p  ..and i will never forget that hair !", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz1s_E39WYM0FasVLp4AaABAg", "comment": "He refers to a picture above at several points of the lecture, it would be nice if there were two camera and one of them filmed that picture so we could see it as well!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzwuxycnJu2Vrr9aD14AaABAg", "comment": "what an amazing brain, to be able to be so coherent.  What an excellent communicator !   ", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxFoYbaiPjU1M1XvAt4AaABAg", "comment": "Mmm she seemed quite relaxed. Very little stress, what I liked. But who knows. As good as Robert, wow. Thats high praise he knows so much and can string it together so fluently its unbelievable. A prodigy intellectual haha. Lets hope so", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwhpvyumpEfaB57qDd4AaABAg", "comment": "Yes, she was pretty cool as well. A bit nervous - which is entirely understandable. Talking in public is generally rated as the most scary thing - beating dying into second place.  She needs a bit of experience to get used to it - but then I reckon that she'll be a good lecturer.", "votes": "19", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwMCDCaeTEFqxmU2994AaABAg", "comment": "Whoops. I was writing this half way through. Haven't watched her yet.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg", "comment": "I hope that this guy (Patrick) goes on into academia - with a bit more practice and experience, I reckon that he'll be as good a lecturer as Robert Sapolsky. And that's high praise.", "votes": "271", "replies": "6", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzXnkSY-oJsn-qnaOh4AaABAg", "comment": "They go into altruistic behaviour elsewhere. In brief, a combination of kin selection and Prisoner's Dilema type situations explains quite a lot. ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxr35zTOoSlyGuVsqd4AaABAg", "comment": "& the last speaker. You missed her in the description. She was great!", "votes": "7", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz0pvhnZR53uU_8_z94AaABAg.8Gbu3RKurJj8x6NKKk5A2N", "comment": "I couldn't finish listening to the first lecturer, skipped to the second, and was pleasantly surprised. She's a phenomenally good lecturer...", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugz0pvhnZR53uU_8_z94AaABAg.8Gbu3RKurJj8xhdnhRVQ9w", "comment": "She's cute and excited about what she's teaching. Maybe when you finish school you'll be less of a bitch.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwhpvyumpEfaB57qDd4AaABAg.8GcgTGAC9Ah9xhiwB-_0Bb", "comment": "She's Assistant Professor now :)", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg.8GbRsZh5L2l93KIU8atjoA", "comment": "He has Twitter. :)", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg.8GbRsZh5L2l9Y-2oDNWJqj", "comment": "he looks like shaggy 2.0 from scooby doo", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg.8GbRsZh5L2l9YDqrTEgoYe", "comment": " @robertdavis3788  He's honestly very attractive. The smarts is the main feature though.", "votes": "8", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg.8GbRsZh5L2l9YE6LvXk0Xw", "comment": " @AnyaChristinaEmmanuellaJenkins  i hope my commment didnt read to u in a negative flavor cus that would be just about a 180 from my intent when typing that", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg.8GbRsZh5L2l9YWkStPKdnS", "comment": "and working on his voice too. Talking to an audience is an art that has to be learned and practiced.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugw-1G_4q_4ZBkYfdC54AaABAg.8GbRsZh5L2l9xhieBb3a5L", "comment": "I think he's a sci fi writer too!", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgwIIDsQHqxFIsF-yfN4AaABAg", "comment": "Dude, that guy was the shit in Tekken!", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzZmJ0OLGg4l41igM94AaABAg", "comment": "Ehm, hu? ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxZSRqaiOS8CQw_MUV4AaABAg", "comment": "shaft?! (._. )", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyrPTn4mHF3L5KRyFV4AaABAg", "comment": "And please... do not insult my logic. Reason and disscuss, that is the intellegent and pruductive way of getting a reslut. ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxBENlQgXWg5pFAe214AaABAg", "comment": "Altruism doesn't have a survival value, but then again, neither has cancer. Or other diseases. Altruism is a genetic difference, a misstake by nature if you so may call it. But we live in a society isn't about the indivudual, because then we wouldn't have a society. A soceity is reciprocal altruism in it's finest, or even more than that. That is nothing speculative, just look at public healthcare that most of the sencible world has. Don't value others lives more, but society valus everyone.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwW85asP6oyXxfh0S54AaABAg", "comment": "I'm sorry... what? I didn't tell you how to live, Im giving you my point of veiw. Now, let's take one point at a time. Art: art, difined in many ways, can be seen as the most basic for of comunication. It is telling just a bit, maybe a mood or a simple idea. It is also a form of drug, administring dopamine to the brain by tricking (or maybe not) it into making it productive. It is a tool, a tool used well withing our race. (look next comment)", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugykta0ynipwPU9zc3B4AaABAg", "comment": "in what a broad way you speak... We can go into this, and many a book or two does, but what survival value has art? Has altruism? You are plagued with circular logic if you mean to tell me the best way to live, is to value others lives more than your own. \"as a species\" perhaps you will say, one that's hugely speculative, second you have a \"free loader\" hole, and lastly, those who lack the altruistic gene would NECESSARILY out live (even kill off) those with the gene. by definition of the gene!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzuOkgcoZ8yjHLLYHh4AaABAg", "comment": "Hmm... well, ofc, that is one way of thinking about it. But then again, you skip the question: \"What are YOU?\" You, as the person, or the conscious being. If we look from an empiristic veiw, you could define a person as the stratigic result of an evulutionionary step. Ego, another mechanism for survival. YOU can change your biological makeup, through biological means. It would the be a supirior way of sending on onse genes, compared to other means. ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxo24r-P1zFq4HoGuR4AaABAg", "comment": "\"You can think about it and it does the same thing\"... materialism failure. This presupposes that YOU did something which manipulated your physical make up. YOU therefore are an immaterial thing which is somehow connected to the body", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx8H3Gfj3iXu56wmuB4AaABAg", "comment": "haha she is epic . lot of laugh ", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyleUI6kb-hOtgHALN4AaABAg", "comment": "One more thing.  I thought Dana did an excellent job at presenting her materials especially for someone like me who has zero neuroscience knowledge.  I laughed a lot and learned a lot, and those two usually go hand in hand.", "votes": "152", "replies": "4", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzijRSzun0SrwJbcRl4AaABAg", "comment": "Thanks for the tutorial, gang.  I know more about Erectile Dysfunction than I would ever wanted to know.  I think Dr. Sapolsky's beard would beat Patrick's fro, although Patrick's fro is pretty awesome.", "votes": "8", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzlLipPbi8-fMPhSfd4AaABAg", "comment": "Scientia Potentia Est...Maximas Tibe Gratias Ago!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyvhJbPbOjodhmGFk94AaABAg", "comment": "Dana Turkers \"upspeak\" makes it harder to take her seriously.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyOBDhb72Z1CWQ9ITp4AaABAg", "comment": "Did'nt Robert say that co'op is better then fighting ?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx9_wg35rm8QyC4Btd4AaABAg", "comment": "Shoot that they don't show the visuals. I'd rather see that than the fro to be frank : )", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxzXgmcXO7J-U3zWZB4AaABAg", "comment": "Everyone.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz3_JdeQ8P5YBWxn394AaABAg", "comment": "I dream of Neuroscience!! <3 it~ ", "votes": "1", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzaJxgzEwn9aaj4yGd4AaABAg", "comment": "denada way, no manches que bueno que alguien se esta educando. di le alos amigos que tambien se salgan de las cayes i que se pongan a ver estas videos para que dejen de ser putos. especial mente los putos en peralvillo i tepito. ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyJEa-wBT5qbf5xAyd4AaABAg", "comment": "His fro is flippin awesome ", "votes": "10", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyleUI6kb-hOtgHALN4AaABAg.8Gc9KwTo3439BCW77FsQxf", "comment": "She did an excellent talk, I've listened to it closely a hundred times' she knows her field.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyleUI6kb-hOtgHALN4AaABAg.8Gc9KwTo3439CO8NeD_hHn", "comment": "@rando Don't confuse the message with the messenger, she is herself, you are you and I am me.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyleUI6kb-hOtgHALN4AaABAg.8Gc9KwTo3439CPRvNCGDEK", "comment": "@rando Did you learn anything?", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyleUI6kb-hOtgHALN4AaABAg.8Gc9KwTo3439xhiSA86TwG", "comment": "Definitely always helps when a lecturer presents the content in a less dry way. I think even the most fascinating information can be boring if explained by someone who seems bored by the content themselves.", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugz3_JdeQ8P5YBWxn394AaABAg.8GbuOJ5d4pe9xhj5uMCgTI", "comment": "Best subject in the world! :)", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugz-sq4dwEFyuJDnEWJ4AaABAg", "comment": "These people are too eager to please.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxywIenlgP9yggoZ0h4AaABAg", "comment": "All of these people seem like they're standing in front of a class for the first time. I want all the money that I didn't pay, to be returned to me immediately.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyHRIOq5ZWW_MYNkM94AaABAg", "comment": "You must not understand what a lecturecast is.   The lecturecast is to help students understand the material again or simple watch from their home. They are still able to go to class and hear him in person too. Also the prof uploads his lecture notes online so the camera really has no reason to point at diagrams when students are given all the info. ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwtPAAuhhJ-4bIRW054AaABAg", "comment": "Science wins!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzhgiLvTGNXZ4Tl0nV4AaABAg", "comment": "For goodness sake, say errection one more time!", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw3g2UxWNkiXXuxGZ54AaABAg", "comment": "Who's Easy A?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxGMa6pC4RNWeDu2np4AaABAg", "comment": "76.61", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxY65IJSmHgt48PUv54AaABAg", "comment": "In Romania , shepards wear a fur caps like this", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgynIcsSjZY_JuUUgBt4AaABAg", "comment": "when he graduates, he'll be Dr. House...", "votes": "38", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz1iykc0cgmafICCxh4AaABAg", "comment": "Learn from LMU Munchen,they show two windows side by side the lecturer and the lecture notes! or use a kinect to follow the Prof and add the L.Notes on it! Thx", "votes": "0", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugzw9aLgjcWFMzxls2p4AaABAg", "comment": "For some reason her voice reminds me of Boxxy 0_o", "votes": "5", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugwmhd-QA7cAfhpPCPx4AaABAg", "comment": "The last speaker was amazingly. Succinct, interesting, and to the point.", "votes": "6", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwnxUOjrolbkI8tpGR4AaABAg", "comment": "LOVE UR CLASSES!", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugx8khLWlg2mcZQaobJ4AaABAg", "comment": "Damn Dr. House's hair looks more ridiculous than Sapolsky's beard. Smart guy though. ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyzlbIcHQ3Oi4_WB8t4AaABAg", "comment": "i know, right.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg", "comment": "it would be nice if the camera looked at the powerpoint when the speaker was referring to it... as good as the hair looks", "votes": "453", "replies": "6", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwcaruMIMV5Dvc6MER4AaABAg", "comment": "so we don't for sure know where memory is? We just assume it is in the synopses?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwDb628o3dopWS95pZ4AaABAg", "comment": "My Dude, Nitrous oxide is what the dentist is peddling...if the dentist wanted to kill his patient he'd give him nitric oxide; a neurotoxin and poison gas...(and I'm only a UCLA Alum)", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgypC6m8jeoJErMFDbN4AaABAg", "comment": "Had a nice deep sleep due to this lecture...keep it up Stanford ;-)", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyazQixjdCjqaF4vBZ4AaABAg", "comment": "Dat beard, man.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxGMa6pC4RNWeDu2np4AaABAg.8Gbgule0efX97T4LMs3L53", "comment": "SMELL your enemies", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "Ugz1iykc0cgmafICCxh4AaABAg.8GcFfWtJkT99ANb1xCAitS", "comment": "My Professors still can't do that online in 2020 🙃", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg.8GbSSAHtRIN8iX1yhY_1Nd", "comment": "The cameraman is kind of high, it's not only in this lecture but throughout Sapolsky's course.", "votes": "24", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg.8GbSSAHtRIN90EuuH7UOFi", "comment": "It was intended that the images were to be added to this video in edition, like in the class before. So focus your anger in the video editor, not the camera person. :)", "votes": "32", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg.8GbSSAHtRIN9FV9It_kpBj", "comment": " @digocr  or focus your anger on the TAs who didn't turn in the slides to the poor video editor sending out emails with Object \"your materials people!\" in time for the upload (kudos to Dana and Nathan!)", "votes": "10", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg.8GbSSAHtRIN9FXWWxiD1-f", "comment": " @vittorianenna7377  whOoo! :O And I focused my anger on the wrong person for an year! I'm so sorry", "votes": "6", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg.8GbSSAHtRIN9FsmbhjiTeI", "comment": "Relax guys, we get this lecture for free", "votes": "20", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgyiRTV77gFIvYpxa5p4AaABAg.8GbSSAHtRIN9NOXk1ofCPP", "comment": "😄", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg", "comment": "I wonder if Sapolsky's beard had a fight with Patrick's fro, who wins?", "votes": "540", "replies": "21", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxCo_bXVDIHtH5XHx54AaABAg", "comment": "what about animals and fish, cant we look at their simplified brains and in order to better understand the more complex mechanisms of human brain? ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzKkZRD061l9Nj-OnN4AaABAg", "comment": "This is a wonderful lecture!  The TA did a great job.", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzqAFO83fTqK-7_Egl4AaABAg", "comment": "That fro is godly", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxN4dsp1JV5GR2byNt4AaABAg", "comment": "future Dr. House LOL!", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw6rGLKhm9KmobVA5Z4AaABAg", "comment": "oh, Patrick I just love your hair", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwwUiV4LyyEzxpcgep4AaABAg", "comment": "@foreverdakota1 Awesome analogy! lmao", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwSAHiRa_ayofeGcNB4AaABAg", "comment": "this guy's most definitely the best at introduction to neuroscience! he makes it all very understandablee", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugw3IrCT_dbb3YKSnah4AaABAg", "comment": "Great info, horrendous mnemonics!! ", "votes": "8", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxVSputVGWcaOzoVdh4AaABAg", "comment": "I bugs the crap out of me that the camera is trained on the lecturer the whole time, and never shows the diagrams that the lecturer is referring to.  Nevertheless, thanks to Stanford for putting this lecture series online.", "votes": "3", "replies": "1", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyCwSf342wjnfwlb-p4AaABAg", "comment": "I clicked because of the hair :D", "votes": "27", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwdsroQAAiOdCYxa_14AaABAg", "comment": "I felt she communicated clearly and comprehensively. I see your point that deeper more thoughtful people might be ejected but I would say this is more because of a digressive approach to learning and conveying information, which does not keep them fully within the boundaries of their subject, and or, a particularly libertarian mind which causes all kinds of transgressions accross the regulatory boundaries of the educational system. So conforming can be somewhat as important as being interesting?", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxivUqXBJy15CdjMUB4AaABAg", "comment": "afro made me come here", "votes": "2", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz3zigPcmUQkh-VlsZ4AaABAg", "comment": "Let's face it, talking about sex, erections is just plain awkward (I don't care what age you are). That being said, Dana did an absolutely wonderful job communicating the information in the lecture. She was accurate, succinct, and had a charming personality. I don't know what else you could want in a lecturer. ", "votes": "4", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugyul0Y_tEmznnBSV5h4AaABAg", "comment": "@shashu2005 Relax...honestly what is wrong with laughing? It makes it more enjoyable, you have a higher attention span and more than likely you will remember/know what she said..sheesh.", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz4tbpzA8IWPEWpCm54AaABAg", "comment": "My god, and check out the way he wears his shirt. Why is his chest not hairy? That would have been awesome...", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyxsedFKssos9MWZeB4AaABAg", "comment": "okay.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzthhSfvZhsQm4uQl94AaABAg", "comment": "I will never forget this hair.", "votes": "6", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugxrr2blBKjJGIt_3Ud4AaABAg", "comment": "@KenMacMillan the thickness of his hair and beard style makes his head look like a big blob of nothing with a thin concave plank on the front =p ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyWF4jArBNoI04U5tt4AaABAg", "comment": "Oh c'mon - couldn't you put the slides, like in the previous lecture.  Anyways - this is really cool!", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l94Aj7SKp2CV", "comment": "xD", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9C17o6o4bW7", "comment": "The witnesses", "votes": "49", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9CMGV_eHaO8", "comment": "haha good one!", "votes": "5", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9KzMTGLcUib", "comment": "Their amygdala, because its controling some of our aggression behavior", "votes": "10", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9LHQwlHJ74I", "comment": "P", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9QLaLwvBhP2", "comment": "..the patriots would win..", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9QXl0n0vMKx", "comment": "I love that fro, dude I want him❤😋.", "votes": "3", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9R-rmuIKVJf", "comment": "science", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9R0lct724AA", "comment": "Whoever wins will have to fight Bob Ross", "votes": "12", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9RHyo8UZTOq", "comment": "Bruh lololol", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9SiitHB75T8", "comment": "Square pants will win", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9WTP8N4EVpk", "comment": "The fro has youthful vigor on its side.  At least for awhile. I go with the fro for the next 10 years.", "votes": "4", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9XBU6G1sEz2", "comment": "Chess match", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9sI4Q78Cqx8", "comment": "😂😂", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9wXReOoB0zx", "comment": " @nutshell5494 lol😂", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4l9z-Qvb2M4ew", "comment": "Lol", "votes": "1", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4lA-zVa3R4G-k", "comment": "13 years later, that beard is still thriving… 😂", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4lA0fMI48PHK4", "comment": "God wins.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4lA0fMVsOHXDa", "comment": "All the time.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4lA0z8cBZY4BC", "comment": "Dunno, but now i want to paint", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxeZgKulwLq1yyRcyV4AaABAg.8GbgztV0r4lA3FWOYkps4U", "comment": "They're Symbiotic 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxVSputVGWcaOzoVdh4AaABAg.8GbvCpa_3YX90HXdy7scHK", "comment": "The camera is right, the problem was the video editor didn't add the slides for the first part.", "votes": "0", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgytSaTy-2StAB_w6yZ4AaABAg", "comment": "That gave me a headstart with my fellow workers, thanks (:", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxuBuOZ1hfEcfI5f7Z4AaABAg", "comment": "@SPxQR I too am in love :) ", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxgdRX777mrb2Q1OXF4AaABAg", "comment": "Does the drug ecstasy effect memory?", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxuUN_YswqCh_WXGJR4AaABAg", "comment": "This guy is a tool. Cut your hair, button your shirt, your not \"winning.\"", "votes": "0", "replies": "2", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgzKnjXxBD98BAVlALh4AaABAg", "comment": "@drinksupreme - YES!!!!  he should wear a powdered wig and a black robe.", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz7MF5Y0jqU7e1THo54AaABAg", "comment": "she is really having a hard time there....", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwsWdF28RypAcM7G7R4AaABAg", "comment": "In this lecture I have this persistent association with yahoo...", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxGB6WxGwQqbMZCJ8p4AaABAg", "comment": "det som e viktig med det jeg skriver her er at hjernen har ingen ting med menneskelig bevisthet å gjøre,..  og tanken som følger med som lagrer seg i metamorfiske felter utenfor atomet og vibrasjonene i atomkjernen skapt av lyset inne i kvarkenes respons på frekvensen i kvantefeltet av de ytre og indre responsenes ønskede resultat  av den beviste/ubeviste bevisthet og visdom som er lagret i \"bioelektriske\" og \"elektromagnetiske\" kraftfelt.  :) av Stein-Ove Rønning Berg År 1999", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgwoamgTfGFfwa6XgeN4AaABAg", "comment": "he could at least button up his shirt for a lecture, jeez", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "Ugz_f1-z2W8PTzozDf14AaABAg", "comment": "47:20 - so immature :S ", "votes": "1", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgyJSWZaJYckJi8pps54AaABAg", "comment": "Is that Bob Ross? hmm", "votes": "0", "replies": "", "reply": false}, {"vid": "uqU9lmFztOU", "cid": "UgxuUN_YswqCh_WXGJR4AaABAg.8GcYIUeE71J8gpT05u4O96", "comment": "Nah, just you.", "votes": "2", "replies": "", "reply": true}, {"vid": "uqU9lmFztOU", "cid": "UgxuUN_YswqCh_WXGJR4AaABAg.8GcYIUeE71J8xhf2LsjXki", "comment": "He's winning.  *You're not.", "votes": "0", "replies": "", "reply": true}]