[{"vid": "vcbkvYDP5a8", "cid": "Ugyt4HqxEC-DGK5EOVV4AaABAg", "comment": "Hi, can someone help me how to calculate the current carrying of a wire? it says that a current-carrying copper wire has an electric field of 0.560 v/m with a diameter of 0.750 mm. What is the wire's current carrying capacity?", "votes": "0", "replies": "1", "reply": false}, {"vid": "vcbkvYDP5a8", "cid": "Ugxlp0J1rrkgwItWqd54AaABAg", "comment": "I have seen E=dV/dr for some cases and  E=-dV/dr during some(while establishing relationship between potential gradient and electric field) Why is it different?", "votes": "2", "replies": "1", "reply": false}, {"vid": "vcbkvYDP5a8", "cid": "UgzGEZWyQ-qbmE8Jyv54AaABAg", "comment": "If the voltage drops as you travel along the direction of conventional current, then how is this issue handled in power lines ?", "votes": "1", "replies": "1", "reply": false}, {"vid": "vcbkvYDP5a8", "cid": "Ugyt4HqxEC-DGK5EOVV4AaABAg.9YtVDgrAxfY9hdfkTIRKip", "comment": "hi did you find it", "votes": "0", "replies": "", "reply": true}, {"vid": "vcbkvYDP5a8", "cid": "Ugxlp0J1rrkgwItWqd54AaABAg.9PMbrVNuhvKA3TFfnDKSxT", "comment": "It's a perspective thing, rather than anything inherent about the field. If the direction of the electric field is pointing towards your positive x or y, then the electric field is positive. If it's pointing away from positive x or y then it's negative. So, like, if your electric field is pointing upwards, it'll generally be called positive (since we generally call up positive y), but if you decided you wanted down to be negative y for some reason, the electric field would be negative. (Sort of like how velocity isn't literally negative, but we say it's negative if it's pointing away from where we wanna go)", "votes": "0", "replies": "", "reply": true}, {"vid": "vcbkvYDP5a8", "cid": "UgzGEZWyQ-qbmE8Jyv54AaABAg.90b8Yi3bUBt9KvDRQq4BK_", "comment": "Simple answer: They have a very High Voltage over long distances. Longer answer: Since power loss is R*I^2 you want a very low amperage (I) since you cannot change the resistance. In order to deliver the same amount of power (P=I*V) you need a very high voltage to keep amperage low.", "votes": "1", "replies": "", "reply": true}]