[{"vid": "WI2ylWg5qK0", "cid": "UgyDxKjNfoj5o6dPDJN4AaABAg", "comment": "This professor doesn't seem like he wants to be there at all lop no wonder you can hear so many people leaving", "votes": "0", "replies": "", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "UgwEVOOFrTneUQos_s14AaABAg", "comment": "An insanely boring personality. That's what's wrong with modern education. Talks about biology, but has never fought his way through the jungle.", "votes": "1", "replies": "", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "UgwuwWwOXl-OWtVG6_d4AaABAg", "comment": "This guy is amazing!", "votes": "2", "replies": "", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "UgwqAfjO5gfxHIh1nHF4AaABAg", "comment": "Did he post the link to the video he mentioned?", "votes": "1", "replies": "", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "UgyGYhUgroYyjoPYlKl4AaABAg", "comment": "An intro to Ecology without talking about Alexander Von Humboldt?! He was literally the founding father of ecology. Darwin took his trip around the world because of Humboldt, his theories were developed by Darwin writing notes in the margins of Humboldt, an almost conversation between himself and Humboldt. Humboldt is the father of our contemporary conception of nature. It's not a horrible lecture, but really, Humboldt.", "votes": "4", "replies": "2", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "UgxoDYy9IRCJqBKE6T94AaABAg", "comment": "This lecturer is not an engaging person. he should apologize for being boring on an interesting subject, not for being difficult.", "votes": "10", "replies": "", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "Ugy3BmPrE5eCxU_x7PR4AaABAg", "comment": "Thanks", "votes": "2", "replies": "", "reply": false}, {"vid": "WI2ylWg5qK0", "cid": "UgyGYhUgroYyjoPYlKl4AaABAg.9H8N2jnvhIR9PimujEwPHu", "comment": "Thanks for sharing some of your knowledge about von Humboldt. The instructor uses Campbell's Biology 8th Edition which mentions Alexander Von Humbolt only twice: Once in the glossary and once in the main text on pg 1215.  \"In 1807, naturalist and explorer Alexander von Humboldt described one of the first patterns of biodiversity to be recognized, the species-area curve: All other factors being equal, the larger the geographic area of a community, the more the species it has.\" https://archive.org/details/biology0000camp_f6u8/page/1214/mode/1up?q=Humboldt", "votes": "0", "replies": "", "reply": true}, {"vid": "WI2ylWg5qK0", "cid": "UgyGYhUgroYyjoPYlKl4AaABAg.9H8N2jnvhIR9rN40Rv8lk0", "comment": "relax bro", "votes": "3", "replies": "", "reply": true}]