[{"vid": "wvXDB9dMdEo", "cid": "UgyrDnf8otjpq-xvY354AaABAg", "comment": "26:34", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx-2Xqujx4CXp0fLKB4AaABAg", "comment": "When in doubt hedge it out", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxgocnVEkz190ugzTp4AaABAg", "comment": "I've been thinking about this whole investment think. Somehow, I think the equations are wrong, Here's what I think. You have 1$. You go and buy bread. 1$ = 1 bread. You have 1$. You go and invest. After a day, if everything goes really well, you get 2 $. But 1$ != 2$. So, during that time, something happened to the dollar. What exactly happened? Well, the value of the stocks fluctuated. Because of the fluctuation, the stocks you invested in gained more value. So, the value of the $ you invested represents a function that describes the fluctuation. But since it represents something different than the $ you used to buy bread, it's not correct to use the same sign. You can't use the same notation for something that represents a fluctuation and also something that represent value at a given moment. So, in order for this to make sense, you need to consider that the $ you use to invest is actually d$/dt. A derivative. In the same way acceleration is the derivative of speed.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwoRS_AIT5IJuy-UiN4AaABAg", "comment": "THANKS A LOT SIR (AACHARY) 🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwUbs-Tz3iBpTDqb-p4AaABAg", "comment": "30:29 ironic hearing this now, carry trades hitting market rn", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwqtuvi77creEPQiDV4AaABAg", "comment": "Is this the financial Asian guy from that Batman movie? IYKYK", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy81CmYQ-cBXPMNSrR4AaABAg", "comment": "I wish I could give 1000 likes to him ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzOysNASsGB1uh_hrh4AaABAg", "comment": "This is gold! Thank you!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw9k6XAeYqiYakfu6F4AaABAg", "comment": "I take all Classes and I am Blessed bcause I am online  student of MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-kEk_cn4OLwE1zMV4AaABAg", "comment": "Thanks to Aaron Swartz (RIP)", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz9WAn-Zo_HBKqar714AaABAg", "comment": "41:04 priccingmodel", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwisRyS8Hs0K2p3G_F4AaABAg", "comment": "Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx05IvwrqhZ61xcWpt4AaABAg", "comment": "🤍❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzFwaFcXIe83ARf9th4AaABAg", "comment": "Thanks ❤", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzWm6kE16iXLiJ5ZYR4AaABAg", "comment": "Waiting for the man who has the michelle Rodriguez story and her receipts  ...... so she can go to jail 😂", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzC-y0y7xfScMJoizZ4AaABAg", "comment": "Does this count as night school 😂", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzJsXpQmqq035jOOrh4AaABAg", "comment": "😂😂😂😂😂 I love the headline ... makes getting waitlisted worthwhile", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2FvyB94nFWApHHwN4AaABAg", "comment": "Very niece ❤❤❤", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxF9pKPU_x_DntQyPl4AaABAg", "comment": "Stop repeating “and” during your lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyQiI_46fLrLhsnIZ14AaABAg", "comment": "00:00 Learn how math is applied in modern finance 06:54 Mathematical finance is a new field that has rapidly transformed in the last 30 years. 13:52 Understanding the different types of financial products and players in the market. 21:03 Understanding the key players and types of trading in financial markets. 27:38 Understanding the three types of trading: hedging, market making, and proprietary trading. 34:07 Understanding risk management in trading 40:22 Mathematics plays a crucial role in finance 46:48 Trading is about risk management and discipline. 53:09 Mathematics is powerful and useful in finance.", "votes": "27", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyE0BsQ8tEl78PA3Fp4AaABAg", "comment": "With choice B, there are no gains, just loses", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyCx87mxwu8ZCl8gn14AaABAg", "comment": "With choice A, you lose or gain the same amounts. It's a win, win.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgznsmzOXQbA15pC5qx4AaABAg", "comment": "Very cool", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy-KFhvWJIkjYUNhKp4AaABAg", "comment": "West has good knowledge but they can’t manage debt like every 100 day usa pays 1 Trillion dollars as interest. Also it may part of a big game which common people can’t understand.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyrocj0TLjUgHzExbB4AaABAg", "comment": "Thanks for the information", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw8VU_Kj3kCvkbBv5V4AaABAg", "comment": "27:00 hedging is offsetting your risk when the asset is at a good price", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxoyi2wvfIMLmmT0Nd4AaABAg", "comment": "nhà có cái cửa quay ra đằng ngỏ có con chó cắn ra đằng mồm đúng nhận sai cãi🤬.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwk7AATaNJR76mm9rJ4AaABAg", "comment": "An insightful introduction to essential financial terms and concepts, setting the stage for a comprehensive exploration of finance. Looking forward to delving deeper into quantitative analysis and market dynamics.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwSrGw8ffP1CpokCX94AaABAg", "comment": "I love to watch these while driving, it refreshes my brain", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyYIhAMyTV9waDG8Ot4AaABAg", "comment": "Successful people don't become that way overnight. What most people see at a glance-wealth, a great career, purpose-is the result of hard work and hustle over time.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzAAnPnFSQwRww6ut54AaABAg", "comment": "Hard work does not equal wealth\" took me 50 yrs to understand that", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxRSCHNFEeDSqjzQMd4AaABAg", "comment": "i want to flow with such kind of experienced minds", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzKAYFsTyQ8JsHkpMF4AaABAg", "comment": "so good to learn from you", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzMvE_5qTwUwauHuw94AaABAg", "comment": "Hello my dear friend! thank you for the cool video! keep filming! I'll wait for new videos", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx7YYGHWfLdGgXCOdF4AaABAg", "comment": "This is Education not school,School sucks", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxDmk229gDqynNO7DN4AaABAg", "comment": "where is patrick bateman's lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz6U-cUMLjYR71Ehph4AaABAg", "comment": "$145,000 Ram TRX $138,000 Tesla Model X $145,000 Tesla Cyber truck   (All wrapped in black)", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw2G-1Di4Nnl_2cCN94AaABAg", "comment": "Brick by brick 🧱  Box Office of this movie had to of been $950,000,000,000,000  Let's go Steelers!  Stairway to 7 🏆🏆🏆🏆🏆🏆🏆  Only the strong survive 🪖💪🏾  Brick by brick 🧱  Got to keep Building  👷🏾‍♂️  Antonio Brown is the goat 🐐  Jersey sales are going through the roof!  Wooo!  Q1 Sales are looking very promising!  (January, February, March)  Expected Sales: $900,000,000  Actual Sales: $500,000,000,000   Woooooo!   Business is booming!  📊📈📝🏢👔🖋️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwfP7anKEvhNLN9qpp4AaABAg", "comment": "Cant thanks enough this channel team and lecturer.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzF7AoKNbMwz5LULYJ4AaABAg", "comment": "🎯 Key Takeaways for quick navigation:  00:27 The course has expanded to 12 credit units, twice a week, to explore the application of math in modern finance. New instructors focus on foundational math concepts, preparing students for industry examples. 02:43 The course aims to provide a sampling menu of how mathematics is applied in modern finance, helping students decide on a potential career path. Students may solidify math knowledge, and last year's attendees secured jobs in the industry. 06:27 The instructor shares a personal story about joining Morgan Stanley's options trading desk in the '90s, highlighting the evolving nature of quantitative finance and the importance of adapting to changing industry terminology. 11:11 Quantitative finance is a relatively new field, transforming over the last 30 years. The instructor emphasizes understanding how concepts are established and verified due to the rapid changes in participants, products, models, and methodologies. 12:03 The instructor provides an overview of different forms of trading, including stocks, bonds, commodities, real estate, and derivatives. He explains the need for financial markets to bridge the gap between lenders and borrowers. 19:25 After the Glass-Steagall repeal in 1999, banks are organized into institutional client business, including fixed income, equity, and investment banking division. Asset managers, hedge funds, private equity, governments, and corporations are significant market players. 26:25 Types of trading include hedging, speculation, arbitrage, and market making. Different market participants, such as banks, brokers, individual investors, hedge funds, and governments, play various roles in the financial markets. 26:55 Hedging involves managing exposure to risks, such as interest rate or currency fluctuations. It includes locking rates or using derivatives to mitigate potential losses. 27:53 Market makers earn profits by capturing bid-offer spreads. They optimize trades and manage residual risks. Many bank dealers operate as market makers. 28:21 Proprietary traders, like hedge funds, focus on generating returns and controlling risks. Concepts like beta and alpha help in portfolio management, aiming to outperform market indices. 29:45 Beta represents correlated moves with another asset, while alpha denotes the difference in returns. Portfolio managers seek a balance between tracking an index and achieving higher returns. 30:13 Hedging can involve various financial instruments, such as currency forward contracts or interest rate swaps, tomanage risks associated with imports, exports, or investments. 33:58 Risk management is crucial for corporations with overseas operations, facing currency and interest rate exposure. It extends to merger deals and balancing assets, liabilities, and balance sheets. 34:53 Market makers manage risk through Greeks like delta, gamma, theta, and vega. They use value at risk (VaR), assess tail risks, and consider capital and leverage in risk management. 37:12 Proprietary trading involves various strategies like directional trading, arbitrage, systematic trading, fundamental analysis, and special situations. Strategies may require constant adjustment and upgrading. 40:59 Mathematics plays a crucial role in finance, particularly in pricing models for financial instruments, risk management, and the development of trading strategies. 44:16 Risk aversion is a common behavioral trait where individuals may prefer uncertain gains over certain losses, influencing decision-making in financial markets. 49:29 Decision-making in finance depends on factors like risk tolerance, financial situation, and individual preferences. There is no universally right or wrong choice, and context matters in making financial decisions. 52:24 Understanding deterministic versus statistical relationships in trading models is essential. Applying financial theories in real-world risk management and trading requires a balance, and oversimplification should be avoided. 53:23 Homework suggestion: Explore the financial glossary on the course website to familiarize yourself with key terms. Compile a list of financial concepts, seek understanding, and engage in further readings to prepare for the course. 54:16 Vasily shares real-world projects, including estimating noisy derivatives using Monte Carlo methods and optimizing shift size for better numerical derivatives. Another project involves using Kalman filters to predict exchange rates for electronic trading. 59:38 The course website is a valuable resource, containing the syllabus, literature, and lecture materials. Students are encouraged to sign up for announcements and check the website for updates.  Made with HARPA AI", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyStNGXxsir61I47Kx4AaABAg", "comment": "good strategy! You have made a lot of good videos. Adore! I'm a big fan.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyw13c-G1cMLDziGd94AaABAg", "comment": "Как начать здесь тащить? Какие игры топ для новичков???", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz9bVwopp4teVsfb914AaABAg", "comment": "23:00", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx0z0nVAWS96V7mepN4AaABAg", "comment": "Yes, your information is valuable.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgylkBrVuxJ6zpHQw4l4AaABAg", "comment": "15:00", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyOk9NRYof-hvjXywp4AaABAg", "comment": "Спс тебе за таткики и советы!) Я уже прилично поднял на этом))):face-orange-frowning:", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzSxRXFMMcRpFkPMQh4AaABAg", "comment": "27:35 📝📚📈📊  Ahhhh Hedge it!  Let's go Business is booming   Box Office has to be  $975,000,000,000,000", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxjCdZTc-A8z30JF5l4AaABAg", "comment": "Oh really?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxHGuEOq8GdxexTGHN4AaABAg", "comment": "I dont really get it right now but i am 12 and this video helped me understand finance a little", "votes": "3", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxagvkB6VhCLrPHglF4AaABAg", "comment": "Great explanation! Thank you so much😎", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxYUcf_BuXgZjeGHEx4AaABAg", "comment": "Arbitrage not well explained!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzFjasUHjuXnYcnu654AaABAg", "comment": "В какие игры лучше гонять со средним баликом? Есть какие-то идеи?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy3JoiAqsrr6oXZ1JB4AaABAg", "comment": "if he is such a market wizard, he wouldn't be standing there teaching", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxx_6f-y7rcXkbHSGV4AaABAg", "comment": "What a lovely and humble proffesor! So likeable and engaging❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxm73utP74by2FC8G94AaABAg", "comment": "Excellent analysis and concepts", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx7bpAiPGvLS0XnQQR4AaABAg", "comment": "China ke maal aebe Kahan se sala harami 😅😅😅😅😂😂😂😂😅😢😅😅🎉😅😂😅😂😊😂😅😊", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz76bIFs6cDE-BilLV4AaABAg", "comment": "The main topics of the video are financial markets and the application of mathematics in finance.\r \r The speaker, Jake Shaw, begins by introducing himself and the other instructors for the course. He then asks the students a few questions to get a sense of their backgrounds.\r \r The speaker then tells a story about his first day at Morgan Stanley, when he was asked to find the \"vega report.\" He didn't know what vega was, so he asked his desk quant. The quant told him that vega is a measure of a portfolio's sensitivity to volatility.\r \r The speaker then goes on to discuss some of the basic concepts of financial markets, such as exchanges, products, and currencies. He also talks about how financial markets have changed over time, with the rise of electronic trading platforms and over-the-counter trading.\r \r The speaker then gives an example of how mathematics is used in finance. He asks the students to imagine that they have a stock that is currently trading at $88. The stock has a 20% chance of going up to $100 and an 80% chance of going down to $50. The speaker asks the students whether they would rather sell the stock now or wait until the end of the year.\r \r The speaker then discusses the concept of risk tolerance. He says that the answer to the question of whether to sell the stock now or wait until the end of the year depends on the individual's risk tolerance. Someone who is risk-averse would be more likely to sell the stock now, while someone who is more risk-tolerant would be more likely to wait until the end of the year.\r \r The speaker concludes the video by encouraging the students to learn more about the financial markets and the application of mathematics in finance. He says that the course will cover a wide range of topics, from basic concepts to more advanced applications.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwIhwlPangupyHRiV94AaABAg", "comment": "I am  from Thailand, can't imagine that I would be able study lecture from MIT. Felling grateful.", "votes": "24", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwxFHOLz6mkXivbuYF4AaABAg", "comment": "49:46 this is interesting i choose choice b first time and choice a second time. My reasoning is if I’m going to take as risk to win big and probability is in my side why not", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwWuQWdG05aofwjLaB4AaABAg", "comment": "great vid with simple explanation", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy3JoiAqsrr6oXZ1JB4AaABAg.9xyxZNp2UJXA2VuikZQHuz", "comment": "Dumbass this is the ceo of Lau security and investment holdings 😂😂 He is a fucking market wizard 🖕🏻🖕🏻", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwIhwlPangupyHRiV94AaABAg.9xLa-tpMTVQA0cBuLlrvBA", "comment": "Thailand is a beautiful place!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxIcUPd4e0U3yr0oMF4AaABAg", "comment": "the big short guy!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwc2ayw4lFq8gieKiJ4AaABAg", "comment": "🔎🔍🔍🔍🔍🔎🔎⚖️🤳☝️📊✊️💫💎●●○○○•°◇♧🥸🕶🕶🕶@#STAND ards🏆🏆🏆💎💎💎🪩🪩🪩🪩🥤✊️✊️✊️✊️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzcTpD6GZx1ZrKatO54AaABAg", "comment": "Best analysis and concept.  Thanks Dr. Jake xia.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxx1JhnFf4CIOnK3dR4AaABAg", "comment": "Financial transactions shall be through Crossed A/c Payee Check or through Bank against Adhaar Card identification", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgysmecM4i82qzf8pRV4AaABAg", "comment": "integral  flow chart principles of economics  financial mathematics", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyiFsHqbQslpqI8SsV4AaABAg", "comment": "7:33", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyd4GSF3bGRBLUl53h4AaABAg", "comment": "Thank you so much for this class. It has fully reminded me why I have zero interest in finance lol. Nice, clear explanations though.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx4H6CYOVrhOG9Oggt4AaABAg", "comment": "Thanks, cinsierely", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyo3V3UfVPMPujqxwd4AaABAg", "comment": "excellent", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzGOspu2rErq0T-aLZ4AaABAg", "comment": "wong indo duk iki pak lek ki ?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzKtNs2-jm4FhxO5Q14AaABAg", "comment": "cool!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-yEq1sVTb8QgWHCJ4AaABAg", "comment": "I'm a finance professor, and I was asked to teach other (non-finance) professors about finance... I'm just going to send them this video.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxs2kI4CC7oAMlr5894AaABAg", "comment": "Overly priced education. Twigians enjoy this type of education while licking their children's buttholes.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxN2-IbVBcma46jyr14AaABAg", "comment": "Min 43:  -Professor: You can not built such a program  -AI : Of course you can hahahahhahah", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxBY_K9drAbgVmVIi54AaABAg", "comment": "Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwM7UwA053xfjNytFp4AaABAg", "comment": "Về toán học cuộc sống chăng❤❤❤❤❤❤❤", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxqOzjE43avXW5aSIB4AaABAg", "comment": "Who tf was that last Guy? He just came on and started Talking about something that nobody in the class had any clue about", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxPWBBcFjg2yMhkFVx4AaABAg", "comment": "“Please let me know first” 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyJKlrXcRc8VVL1h0l4AaABAg", "comment": "“Please let me know first” 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxOHugoLovL5bKGYuN4AaABAg", "comment": "43:30 , but you can build a machine & keep improving it 😅👀", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwf-YYPxpET_JEfJZJ4AaABAg", "comment": "Does this anyhow help us in any field or something please help me with this what you all learn from this .", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxPPH9kWjCo2IQBMOp4AaABAg", "comment": "Thank you Jake Xia!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwQDjjUndj94_nEDe14AaABAg", "comment": "I wonder where these students are now.", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxkh_t7gZuXF145X1h4AaABAg", "comment": "amazing all these phd's fuck up the biggest risks in human civilization and the scam keeps continuing because taxpayers and future generations keep having to bail them out...none of these guys have a clue what non constant volatility is or how to model it", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw2QrfVhcTxOyTVwex4AaABAg", "comment": "Hello i am a 24yr old self taught trader. I have no college experience and i am currently looking for a mentor who will work with me side by side for just 1 week i just have a few questions! not many traders in my city that dont care about money. i have some but not a lot; so If theres anyone coming across this willing to help out id be grateful⭐️ peace", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwlW-D-zDHUAltqQnZ4AaABAg", "comment": "Japan and Australia has been a great international relationship,as the partnership goes on the hedging on the which one goes high as being financed bidirectionally?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxyHDqGqvDxQNnt4jJ4AaABAg", "comment": "Toán học chăng.❤❤❤", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzOhB4ovBgu0QmbmPp4AaABAg", "comment": "@8:30. That’s hilarious🤣", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzBtzckzpdHAg6WtCV4AaABAg", "comment": "Bro I haven’t even watched this yet and I know this guy is good", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzve4vC8VCzXfbfXvd4AaABAg", "comment": "Excellent", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz-ow7wHHXKpeipuSF4AaABAg", "comment": "Cant thanks enough this channel team and lecturer.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzzMh6I3dGjJOspskZ4AaABAg", "comment": "Wow it's that guy from The big short....I thought he went bankrupt and there he is. Look at him go.", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzCNcUfkHm3tVnr7RZ4AaABAg", "comment": "Sorry MIT I don't follow shit, where is the white teacher? I'm skipping to lecture 2", "votes": "0", "replies": "4", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx0WF-HDHjxcq8kH3Z4AaABAg", "comment": "great job my friend", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwXNuHzFLeLspBvtCN4AaABAg", "comment": "44:55 choice A has an expected value of -$300 and a standar deviation of $400, choice B has an expected value of -$280 and a standar deviation of $0. So in the short run, it's better to choose A; in the long run it's better B. 49:26 in this questions, the standard deviation are the same but the expected values are positive with the same amount. Choice A it's better in the long run, while choice B it's better in the short run.", "votes": "11", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzDe0QxmCacalmydvV4AaABAg", "comment": "Hello MIT!   I'm from my country Lesotho as for now, and I really enjoy learning from this channel  And I would like to say hello to my profs , all of them are amazing!   This is my favourite chanel ever since I was  searching for something to learn about the markets complexity   I love  you MIT with our supper highly experienced professionals   Thanks for your commitment   From  Nthethe Shadrack M", "votes": "25", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyr7INgRf879e1Ys614AaABAg", "comment": "Fake 'Jake' needs a course in public speaking! By the 2-min mark I decided not to waste an hour of my life. Lol Btw why are chinese so ashamed of their own names (and culture) and use fake western names? Learn a lesson in national pride from the Korean prof who uses his Korean name.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxzgNqFz-qZ8kK-18p4AaABAg", "comment": "\" I will tell you how much I'm worth, you tell me how much you're worth\"", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxkOADqUrqjAkuZ0wl4AaABAg", "comment": "11:45 lec actually starts, ur welcome", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyC4aS-jEehFYYInN54AaABAg", "comment": "Difficult to understand", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzCNcUfkHm3tVnr7RZ4AaABAg.9lVak5tTuLr9n7LHAOrmcV", "comment": "Bro what if anything you should want a Asian to teach you math", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzCNcUfkHm3tVnr7RZ4AaABAg.9lVak5tTuLr9nS91m00TFS", "comment": "African teachers are the best at Math, Science & technology.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzCNcUfkHm3tVnr7RZ4AaABAg.9lVak5tTuLr9u493Msb3OC", "comment": "When a shit thinks others are shit. Dung! 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzCNcUfkHm3tVnr7RZ4AaABAg.9lVak5tTuLr9u49EM4o4Fh", "comment": "​ @richpo9814 I beg to disagree. If they were good, they should have been rich yet they are the poorest people on Earth.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwXNuHzFLeLspBvtCN4AaABAg.9lOR2IiTe0-9mR5lFyYMdj", "comment": "Can you explain how to calculate the standard deviation  in this type of exercises? Do you see it as a binomial problem?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwXNuHzFLeLspBvtCN4AaABAg.9lOR2IiTe0-9mRjZuFhKrV", "comment": "​ @pepgonzalezcomellas3387  just using the definition of variance: E[x^2]-(E[x])^2.  The expected value is calculated by summing all values of the random variable weigthed by their probabilities.", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwXNuHzFLeLspBvtCN4AaABAg.9lOR2IiTe0-A83Tq7m6ZFT", "comment": "If choice A = 100% you live and choice B = 100% you die, the standard deviation is... you are Schroedinger's cat?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzDe0QxmCacalmydvV4AaABAg.9l4K49VJ_sX9p3QlJqxQVJ", "comment": "I am from France and I am hooked to this channel since my discovery.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxejt-JJ663URdvZ4p4AaABAg", "comment": "Wow very good lecture 😘🙏🇮🇳", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxBjkkEXOWI5UV9LEd4AaABAg", "comment": "how many MIT videos have you finished and do you guys really remember everything you learn from them?", "votes": "0", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxRdMeuvF8-FCtLdiZ4AaABAg", "comment": "So college lectures are all same no matter where you attend", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwwIGrXa0WAwKwoUMl4AaABAg", "comment": "Thanks mit for giving us quality and deep knowledge about finance", "votes": "7", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxQWKs-DTvGqn3DucN4AaABAg", "comment": "43:30", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxPzkEyswc5pOIDvz54AaABAg", "comment": "This Professor really knows how to teach, great pedagogy", "votes": "13", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyGeqmUef3GqJc_7st4AaABAg", "comment": "I'm from India and thank you to MIT for making this available. So anybody can learn from highly qualified and experienced lecturers. 🙏🙏", "votes": "366", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyR0OagVQZcivpBweN4AaABAg", "comment": "Being in maths, you HSD. have not asked how many graduate. It is common sense . 100-80=20", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzISWPEBRVNVjDDFgR4AaABAg", "comment": "Poor initial explanation on FX Currency Hedging. Any further material or other resources that explain this better? I dont understand why to hedge the risk there is separately, an FX trade, an interest rate swap and a currency swap. Why does he not just forward currency hedge like the student explained?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxQK3c91ij1V4oRZfh4AaABAg", "comment": "it is really sad that the education system is so bad that these basic terms and principles are only just being taught in mit and by a professor. every middle school student should already know all this. just proves we are being educated for the workforce not to succeed in finance.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx1uOkLgM6gugG_xhx4AaABAg", "comment": "🤌🤌🤌🤌🤌🤌🤌🤌🤌", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwLn6utjRH8jls9lRJ4AaABAg", "comment": "邓超是你吗", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwzNM_ArzvvXbeFd5t4AaABAg", "comment": "Thank you 🙏🏼", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzG0sNtDmu2zamMaHF4AaABAg", "comment": "Türk öğrenciler:hoca slayttan okuyor", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyL2EMV8daKNK_S1ct4AaABAg", "comment": "That's bullshit ..   paper is coming", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx03Q41TjfOeq6fAVN4AaABAg", "comment": "Great class and great professor!", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxor_pm8OaLKdJUTnN4AaABAg", "comment": "I find it amazing not only are they teaching but they are teaching in a foreign language. That's incredible", "votes": "7", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwglUm_1_w3S19UIwZ4AaABAg", "comment": "See How They Run, The Harder They Fall, First They Killed My Father, Unbroken, By The Sea.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyClDPUqoYfbwGcUSV4AaABAg", "comment": "13:00", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyEQcumkYko6Y9p4TN4AaABAg", "comment": "Thanks again MIT!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxBjkkEXOWI5UV9LEd4AaABAg.9kA6t0HOm9H9kTn088s6lk", "comment": "Watch the ones I am interested a couple of times while taking the quizzes and midterms. Take a like a actual class to actually learn the processes.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxBjkkEXOWI5UV9LEd4AaABAg.9kA6t0HOm9HA2O7rlhtvrY", "comment": "This just start toward looong journey😊", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyGeqmUef3GqJc_7st4AaABAg.9jmURjwVwci9nlOgCS5x2Z", "comment": "“The Lord is not slow in keeping his promise, as some understand slowness. Instead he is patient with you, not wanting anyone to perish, but everyone to come to repentance.” ‭‭2 Peter‬ ‭3:9‬ ‭NIV‬  ROMANS 10:9-11 “If you declare with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you profess your faith and are saved. As Scripture says, “Anyone who believes in him will never be put to shame”   Matthew 11:28-30  “Come to me, all you who are weary and burdened, and I will give you rest. Take my yoke upon you and learn from me, for I am gentle and humble in heart, and you will find rest for your souls. For my yoke is easy and my burden is light.”  “For the Son of Man came to seek and to save the lost.”” ‭‭Luke‬ ‭19:10‬ ‭  God wants us to believe in His One and Only Son, Jesus Christ our Lord and Savior, who died for our sins :D When we truly believe in our hearts that Jesus is the Son of God, who died for our sins so we could have eternal life with God, we are saved from the eternal fire and have eternal life in Christ Jesus!! 💖 May God bless you all! ❤️😊", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyGeqmUef3GqJc_7st4AaABAg.9jmURjwVwci9wwu9I93vKi", "comment": "❤ so ture", "votes": "4", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwLn6utjRH8jls9lRJ4AaABAg.9i50UfaLc6k9k2Uae0A7mW", "comment": "搁这演中国合伙人第二集呢", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzG0sNtDmu2zamMaHF4AaABAg.9hpDbTJIDaq9nBavsi1yUo", "comment": "Bu  derste ne anlatıyor sıradan finans bilgileri mi yoksa daha önemli şeyler mi anlatıyor", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxmgHLZypmHT6b0vQJ4AaABAg", "comment": "I am from Kenya , east Africa 🇰🇪🇰🇪 I have learnt alot from this clip , especially from the first lecturer from havard..... Thank you so much.", "votes": "15", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg", "comment": "This is a well Informed video. I'm here to learn how to invest after listening to a guy over the air talk about the importance of investing and how he made $410,000 in 5months from $180,000 startup. Somehow this video has helped shed light on some things, but I'm still confused, I'm a newbie and I'm open to ideas", "votes": "47", "replies": "16", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzh-baEhP9kCa5d83x4AaABAg", "comment": "Remember you are in control of yourself and you have the freedom to base your life off of principalities that you choose but my advice is to choose christian principalities and learn why they make sense and if you are willing to live and die for them. Learn the power of having faith hope and love and how you always have them with you unlike money,food,item", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy1U7tLEFyrPSrzjmh4AaABAg", "comment": "back again. Just finance math programming", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzqturK3uMe0kX4VdV4AaABAg", "comment": "Excellent video...well explained and very simple to follow and learn. Thank you.", "votes": "9", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx1Tn19gPXbryXYjfp4AaABAg", "comment": "One day I will attend MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw4c5vaHTSHGLHhXdB4AaABAg", "comment": "Where is the part 2", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyyVu9JY3oQ-opdlaN4AaABAg", "comment": "This video has relentless ended up in my recommended page, I never click it, and never intend to watch it. It amazes me how often it pops up though", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz4r7ZuNpGnWMCOh5p4AaABAg", "comment": "Wish we had just one teacher this good at school, most probably would not of left as quickly as possible from there a complete moron.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzokOL112QSnnwUqgJ4AaABAg", "comment": "Great lecturer and good explanation", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxDLAJ7mW_yXhi0cC94AaABAg", "comment": "I enjoyed this video mind blowing explanation thank you sir", "votes": "3", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgybYKcB79dj9nYnd6Z4AaABAg", "comment": "I live in the Pakistan , so I studied accountancy and graduated 6 years ago so now I have 6 years experiences in the fild of finance, So now I decide  to study ACCA course . My question is than if I got this certificate then I can immigrate in European country or in the Canada?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwn7CbyXRuBAfF3Ne54AaABAg", "comment": "https://youtu.be/CqIliraqx6I despite all these we should know", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgybIzwvy2GBTR6tlol4AaABAg", "comment": "Sometimes education was mixed by politics with hatred and racism", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxsj2TaLQyhOV_iD1J4AaABAg", "comment": "Mark: 36:02", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwJp4lQ7l8emCGomDJ4AaABAg", "comment": "As a matter of continuity, I would choose the $280 loss. Because, I would be in a position to invest in a better play with the remaining $220...wherein, I could likely recover my $280 loss, and move on to other opportunities. It seems more logical to me, especially if the $500 was all that I had to invest. IMO", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxWtKP8oH4MRw_Jxix4AaABAg", "comment": "30:40. Important", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxnbxhV0UZtsjdDtzZ4AaABAg", "comment": "INDIA WILL BE OK I DONT UNDERSTAND OTHERS BUT SOME SAY THEYU WILL BE THE TOP NATION??????????????", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwFN0SBrI_5erZdfKx4AaABAg", "comment": "I’m printing my certificate.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyPJgUoAAfLzf6LRHV4AaABAg", "comment": "Fuck china nam", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCD56dlLIs", "comment": "Investing in crypt0 and stocks is a good idea, a good system would put you through many days of success", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCDTNHIO_s", "comment": "Stock, Arbitrage and ForEx trading should be on every wise individual's list in this dispensation", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCDwnHWhlm", "comment": "Having monitored my portfolio performance which has made a jaw dropping $370,000 from just the past two quarters alone, I have learned why experienced traders make enormous returns from the seemingly unknown market", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCEOcgo7Ii", "comment": "Interesting, I have a lump sum doing absolutely nothing at all in my bank account, I wanna get something started with it. You seem to be doing excellent for yourself. Do you trade on your own?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCEhv33ey_", "comment": "I'm trading with Expert Mrs Denise Mitchell, a regulated broker with FINRA. Met her sometime early last year at a startup funding event. She had some interesting things to say about the state of algorithmic trading today, very obviously I'm seeing the results", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCF5PpWqk9", "comment": "How much did you start with and how much have you earned so far?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCFoEPYY0O", "comment": "I'm earning over $11,000 weekly and often time more. It really does depend on your startup capital", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCGEFfISCV", "comment": "The trick always is to diversify your investment, don't panic when everyone else is and invest consistently", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCGxtL7j2b", "comment": "Wow! this is so amazing, please how do I get in touch with Mrs Denise Mitchell, I would love to trade with her", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCIUIKSafr", "comment": "† 1707", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCIUipvEh7", "comment": "355", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCIVFroIJr", "comment": "4459🇺🇸", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCJT5jgNih", "comment": "I have read tons of reviews about expert Mitchell on several forums, the degree of commendations is mind blowing", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCKa6gt-nx", "comment": "As a single mum, Crypto has aided me live happily. Wished I began earlier", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCLyMFhA6P", "comment": "That's impressive. Are you giving her your money or the money stays in your trading account?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxv_dxwxTF1Fm55B894AaABAg.9gCCboCe8J-9gCPDp4DQuB", "comment": "Denise Mitchell is really good. With the way She does her thing, you will see Bitcoin trade from a vantage point. Working with her is all about win win", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugzh-baEhP9kCa5d83x4AaABAg.9fmMgOyxvwt9fySDUFXYNh", "comment": "Check out Derek Prince", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyPJgUoAAfLzf6LRHV4AaABAg.9d1MyQ6cXQ69jHsNg4clEa", "comment": "says a funny pathetic boy with last cantonese ngo, lol", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw0XBaWlvD4CfjiD5J4AaABAg", "comment": "6 million views and only 50k likes come on you apes.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxwC8CbAtAIadhD-rN4AaABAg", "comment": "Merry Christmas 🎄🎁 all year long ❤️❤️❤️❤️👽👽👽👽👽👽👽 https://youtu.be/KvD2XeAtv2I  ❤️❤️❤️❤️❤️❤️🇺🇸🇺🇸🇺🇸", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyRGcD8JhgAGOXDZJF4AaABAg", "comment": "good lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg", "comment": "Para aquellos que buscan una forma confiable de obtener ingresos en línea pasivos y consistentes, les aconsejo que inviertan en el mercado de divisas. Yo personalmente gano un promedio de $ 10,000 a la semana de esa manera. Obtenga un administrador de cuentas confiable y observe cómo fluyen las ganancias. Póngase en contacto con Stuart Michael a través de para obtener ayuda relacionada con la criptografía.", "votes": "6", "replies": "9", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzjSBOw7TrmUa4vQN14AaABAg", "comment": "Commodity - BTC", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwyzLP4hEy6xjff6tF4AaABAg", "comment": "This is a absolutely sweet video", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyFfSouvP8Nd0sA0hV4AaABAg", "comment": "WHAT ARE YOU DOING TO RECOVER ALL THE INCOME YOU LOST AS A RESULT OF THE PANDEMIC AND ECONOMIC CRISIS? ? DON'T JUST SIT THERE TO WAIT FOR THAT SALARY ONLY. YOU NEED AND EXTRA SOURCE OF INCOME. PLANT A SEED TODAY FOR TOMORROW'S HARVEST. TRADING C-R-Y-P-T-O NOW WILL BE VERY WISE ESPECIALLY TRADING WITH A KNOWE PROFESSIONAL TRADER.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxBGb8Y13zJkTR636B4AaABAg", "comment": "i love this", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyssJJdeB4v7r6MKBp4AaABAg", "comment": "6 million views! Certified!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzOHO3AinS4qViQtDl4AaABAg", "comment": "On one side booksmart the other side dumb as a box of rocks this is our society today all brains and no common sense.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxvIAuZI-umwxYSxsh4AaABAg", "comment": "MIT has great instructors.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzq3GIpm2WpfbOe2hZ4AaABAg", "comment": "I used to have trouble falling asleep, but then I discovered your videos.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy5CoXxtXL1N213nFB4AaABAg", "comment": "멋진 넥타이 👍", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwk9gkEbGUJez3_cjd4AaABAg", "comment": "I used to smoke weed with this guy", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyoOLV_Wo4K32cNZQt4AaABAg", "comment": "This professor is sharp.  Sloan is lucky to have him.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzRyiiaQW8zKCiyvZ94AaABAg", "comment": "👍", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx1f7H4eQSk-mslPAZ4AaABAg", "comment": "The collapse of the US economy is coming.   Americans are going to be hungry and broke.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxU9_zMgK8TsUu83Sh4AaABAg", "comment": "https://youtu.be/-ID3PEzaj1I\r 4 SIMPLE STEPS TO BECOME WEALTHY!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwBcbFyEaxTHMgh0IV4AaABAg", "comment": "😂😂😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyCwkAgWf_Kc8-yL7B4AaABAg", "comment": "I love how chins man I saye exam pos..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyIoKZo2mc", "comment": "Estoy muy seguro de operar con la estrategia del Sr. Stuart Michael debido a los ingresos constantes que me genera. Nunca ha vacilado. Nunca pensé que obtendría tantas ganancias en poco tiempo", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyIrvAzZPE", "comment": "Nunca supe que podríamos tener a un hombre como este aquí. Es absolutamente fiel a sus palabras. Lo recomiendo encarecidamente a los inversores que están realmente dispuestos a obtener buenos rendimientos de la inversión.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyIzNZyTB8", "comment": "Su estrategia ha demostrado ser funcional, obtengo un pago semanal de £ 6.750 como un reloj.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyJApkDsyg", "comment": ":yt:What'sapp✙447597750831 ....:yt:", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyJDqt21hr", "comment": ":yt:@Stuarstmichael on TELEGRAM:yt:", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyKh3r6YPE", "comment": "Para obtener información más detallada sobre la cartera, escriba un correo electrónico al administrador de la cuenta, Stuart Micheal para obtener más consultas.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9cyKqIwUrnG", "comment": "Otra característica para Mí debería ser la intermediación de baja comisión del 20%. Solía tener un agente que me estafaba más de la mitad de mis ganancias por el mero hecho de recibir una comisión.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9o2SRjuUB6n", "comment": "@Investuarstmichael👍", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKcdO8o97Prlh26R94AaABAg.9cyFTyVqdWK9o2STR7PYaF", "comment": "Telegra", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxvIAuZI-umwxYSxsh4AaABAg.9cl7Ps3poWk9cl7l6ERswu", "comment": "Visiting from Harvard. Thank's for the course access MIT, thank you for your time Jake.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugzq3GIpm2WpfbOe2hZ4AaABAg.9cb5khKzuPk9ciQ_nFbuvv", "comment": "*ᴡʜᴀᴛꜱᴀᴘᴘ✙𝟏𝟖𝟒𝟖𝟒𝟖𝟐𝟎𝟓𝟎𝟖 ᴍᴏʀᴇ ᴜᴘᴅᴀᴛᴇꜱ ᴏɴ xʀᴘ ,ɴꜰᴛ'ꜱ,ʙᴛᴄ📊 *ᴡʜᴀᴛꜱᴀᴘᴘ✙𝟏𝟖𝟒𝟖𝟒𝟖𝟐𝟎𝟓𝟎𝟖 ᴍᴏʀᴇ ᴜᴘᴅᴀᴛᴇꜱ ᴏɴ xʀᴘ ,ɴꜰᴛ'ꜱ,ʙᴛᴄ📊 👆👆", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy5CoXxtXL1N213nFB4AaABAg.9cZLJHMBDX09ciQ_6kddLO", "comment": "*ᴡʜᴀᴛꜱᴀᴘᴘ✙𝟏𝟖𝟒𝟖𝟒𝟖𝟐𝟎𝟓𝟎𝟖 ᴍᴏʀᴇ ᴜᴘᴅᴀᴛᴇꜱ ᴏɴ xʀᴘ ,ɴꜰᴛ'ꜱ,ʙᴛᴄ📊 *ᴡʜᴀᴛꜱᴀᴘᴘ✙𝟏𝟖𝟒𝟖𝟒𝟖𝟐𝟎𝟓𝟎𝟖 ᴍᴏʀᴇ ᴜᴘᴅᴀᴛᴇꜱ ᴏɴ xʀᴘ ,ɴꜰᴛ'ꜱ,ʙᴛᴄ📊 👆👆", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugwk9gkEbGUJez3_cjd4AaABAg.9cVujE37ImC9c_KsOskReD", "comment": "Do you know with $1,000 you could earn up to $10,000 with crypto currency' tho the market is low? Ask me how", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyoOLV_Wo4K32cNZQt4AaABAg.9cVHo9vd5LS9c_Kwi6Q-0H", "comment": "Do you know with $1,000 you could earn up to $10,000 with crypto currency' tho the market is low? Ask me how", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy1TteueXoh2ujwm9J4AaABAg", "comment": "The first 6 minutes of the video can be deleted and you do not lose much of the subject. Let's get to the subject.", "votes": "1", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzickve2tD7o-PQtMJ4AaABAg", "comment": "Why", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw4wmvxnlzwl-teYFt4AaABAg", "comment": "20k bottom ? Or 18?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyuUm79UnZsRsli48l4AaABAg", "comment": "Wondering what to invest in? Other projects keep failing you? LUZION PROTOCOL is here! 💪  💯INSANE FIXED 385,945% APY 💯Doxed Team 🔒RUG PROOF! 🟢4% BUSD / Hourly💪💪", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzCedDkB0bk9qHvcg94AaABAg", "comment": "Nice", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz-LZr3kn_4FqNWA9t4AaABAg", "comment": "is there an updated version of this video?", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzb15xt30n3-hFB1dd4AaABAg", "comment": "Such a smooth presentation", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwvftH1v5KKFwKEuMR4AaABAg", "comment": "Great lecture. Really interesting", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwtpE6teb2t2m7jE_V4AaABAg", "comment": "Good video", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzHkAz5zYwgpoSXZXd4AaABAg", "comment": "❤️❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyAk4eaPuMgHI99rp54AaABAg", "comment": "What's the point of this? I've never used this in 39 years... 🤷🤷", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyokmLohC4ejduOizR4AaABAg", "comment": "Modern Finance = Ponzi Scam  Gold is the money of God Silver the money of kings /..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwndp1LWAqHa1a6hnt4AaABAg", "comment": "I like it 🙂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwvGfPG_BDwiUOMdVd4AaABAg", "comment": "Tessting", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyRnpiwxRrS0U3yph54AaABAg", "comment": "2:05 if you take nothing else from this course, make sure to remember \"webex\"", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_goDK7UFwrNvCKbh4AaABAg", "comment": "He looks a lot like mr.Lao from the dark knight.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwixGB0lF3zErGZXBF4AaABAg", "comment": "Watching these legacy financial 'experts' is like watching dinosaurs declaring they will live forever, are super relevant and lords of the earth; whilst in the sky a large meteor is about to add them to the dustbin of history. The whole fiat, endless digits on a screen created as debt at interest to steal the wealth of people and nations so a bunch of bottom feeding parasites can Jet around enjoying the cumulative benefits of mankind's knowledge at mankind's expense is over. Endless digits in a screen created to infinity have no value, the worst abuse, is that you need to sacrifice your life, time, effort and creativity in order to get their imaginary digits in order to survive. Convincing the people of the world that digits on a screen represent 'value' was the greatest scam ever perpetrated on the people of the world. Now the world is waking up to the fact that a small group of legal fictions (banks and corporations) have stolen the real wealth of the world and given people worthless digits on a screen in return.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzJLcnugNP6kTtOhUt4AaABAg", "comment": "Brad Garlinghouse brought me here.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugws36_MGEisKWZ8jTB4AaABAg", "comment": "Good video", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwrPR-GiOP4PzYC5o14AaABAg", "comment": "Beastly class, thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy1TteueXoh2ujwm9J4AaABAg.9cIyYMSeiR79cKvan3dqgn", "comment": "Interesting side note: many of our lectures contain the pedagogical approach for teachers. 🌈🌟", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy1TteueXoh2ujwm9J4AaABAg.9cIyYMSeiR79cXRQV5Moxq", "comment": "Well I learned a new word, and watched it again. Thanks", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyAk4eaPuMgHI99rp54AaABAg.9c5PJAMXEqu9cQFUVImgI6", "comment": "@Whatsap±1508𝟽𝟿𝟺𝟻𝟹81 Economic ninja About?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_goDK7UFwrNvCKbh4AaABAg.9c0myCUg-zR9c_L63vHdyd", "comment": "Do you know with $1,000 you could earn up to $10,000 with crypto currency' tho the market is low? Ask me how", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwixGB0lF3zErGZXBF4AaABAg.9bx0ExkAWor9bzt4Jz-W31", "comment": "you're giving people far too much credit. they aren't that intelligent. ask all your friends to hit the town one weekend, and find out how many make excuses about bills to pay and such.... of course it's a scam, however, that's the elite's way. and the worst thing is, they now militarized the police force of the western world so if you dare argue, you are likely to be persecuted, or worse, depending on the nation. you won't get shot in australia, but they'll plant the guns in america and such other nations. if you really think people are intelligent, then why do they scream \"climate change cus science\", then the next comment will be \"a million genders cus science is full of shit!\". they're dumb as a doorknob, and they will never learn. it's going to take a new war to fix the problem.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzAWYvrkJFXdRhQzP94AaABAg", "comment": "Wow! Thank you for sharing!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzs5lc63362eJsvUyl4AaABAg", "comment": "MIT class on gambling odds. Damage control on how to cut losses on bad bets.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzgeX_gMY9UVv8pHMh4AaABAg", "comment": "Ya finance being quantitative is more new. It’s like the movie margin traders being like oh we’re measuring volatility wrong and Goldman Sachs sold crap products to survive a crash cause mbs were graded badly. It’s good be more efficient and quantitative, but in some ways it’s horrible for mankind. The inflation of assets thanks to the fed the last decade has led to a great wealth divide or inequality. Like rents are way higher now same with real estate. You can’t say the fed owning 2.7 trillion in mbs isn’t inflating real estate. It’s distorting the market from a semi free market to a creditism market or one where we must have ever more debt creation each year to avoid a recession. Be great to go back to judging stocks based on fundamentals and data rather than wondering what Powell is going to do.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxpVakUszwScXQ70Lh4AaABAg", "comment": "imagine finding out that the lecturer is a communist mole", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwW3O7qTkvdEWwAK1l4AaABAg", "comment": "great class, I really miss my finance classes in my days.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzA9mC-l4nBBkzooK14AaABAg", "comment": "Awsome 😊", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxjiEXJs0oJhaRMFG54AaABAg", "comment": "💪", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxfiOJ363AzfqSgY2J4AaABAg", "comment": "Good video  .", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxvOBSfdLqnxkuaqwl4AaABAg", "comment": "8:40 R.I.P if you're listening on earphones", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgymmQbGX-Up9faerrF4AaABAg", "comment": "I have been retired for seven years now, or as the cool kids say \"financially independent\"  looking back at lectures like these with a moral lens puts a whole new perspective of what is sold at universities as education", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxjDIeo0_Et3wD5lUx4AaABAg", "comment": "13:50 its a pity he doesn't distinguish between market money and fiat money 40:00 they still haven't tapered anything seven years later...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgylqY0HQQUyNZ1vZGx4AaABAg", "comment": "Thx", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_YY_14HEsyOZ6P1B4AaABAg", "comment": "where i can get the rest of the lectures? thankyou", "votes": "0", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy8b7u9jUsiNQnWYK94AaABAg", "comment": "Good video 👌", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwOzqF2_egAN14EzHB4AaABAg", "comment": "Wow", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyXN1xui36QkJlnf6l4AaABAg", "comment": "Thank you!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzBaRxSHvKj2nNltaB4AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyUILH5vBPKaH_nQlJ4AaABAg", "comment": "In the process of growing,\r the main concern is how to overcome\r egoism and dig up the roots of evil.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwiWHM7s3SMeYL7CYx4AaABAg", "comment": "Very smart guy", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwBLaLTaB0iUvzDLeN4AaABAg", "comment": "Interesting…", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgymmQbGX-Up9faerrF4AaABAg.9bUUtYQgLWR9bX-HPk2RsW", "comment": " Laura Brooks  trades are very rarely smooth, but they still are a fun ride", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_YY_14HEsyOZ6P1B4AaABAg.9bNSLHyD7OA9bNauJ_fP4F", "comment": "YouTube playlist: https://www.youtube.com/playlist?list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR. View the complete course at: http://ocw.mit.edu/18-S096F13. Best wishes on your studies!", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_YY_14HEsyOZ6P1B4AaABAg.9bNSLHyD7OA9bNhyt6PPFZ", "comment": " @mitocw   Omg , thanks a lot <3", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_YY_14HEsyOZ6P1B4AaABAg.9bNSLHyD7OA9bNiMHgCoXL", "comment": " @mitocw  yes i am watching next lecture, hopefully i will complete it soon. thanks again", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwwU3ZPNy4qHdWjeep4AaABAg", "comment": "I like it", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy9z9Aa-C492USUsgd4AaABAg", "comment": "MIT can suck my nuts", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxTDHs4TxwhlqVxRft4AaABAg", "comment": "I have little grounding in Math (work in the medical field) - is this series suitable for people without a math background?", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxDWTzvppc-kZyxAoZ4AaABAg", "comment": "Everyone needs to watch this if they ever regretted sleeping thru college!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwa_BwDwBv1NhLoLxx4AaABAg", "comment": "this is great", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyxLImisiEGH_FRmFF4AaABAg", "comment": "Didn't MOrgan Stanly require a $7 billion check to be deposited on a bank holiday in order to stay in business - Mitsubishi bank...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgykdmCTedL-Nxq7HE54AaABAg", "comment": "Thank you MIT for the lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyBH-faHeV-_kLbBF14AaABAg", "comment": "👍 cool", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg", "comment": "I would like to invest in crypto but I can barely open a wallet….if someone could give me a hand even send me a small amount I would be very happy  3K9jFbTmX1VS4FX2DqJk6obxf1mH66pRd6 that’s my code", "votes": "21", "replies": "30", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_eZwoAmmDWSO4QrV4AaABAg", "comment": "I'm really glad that such lectures exist online", "votes": "3", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyx7KJz1RQ8Oajghb14AaABAg", "comment": "p", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxeB2DR88bcBInAvqd4AaABAg", "comment": "Nice", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgygmDZRYHouSDIIoYR4AaABAg", "comment": "Hot B T C deals hit me up for more info and give away too.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzYFslV4_1q8HcefFx4AaABAg", "comment": "Revolut does not allow to move bitcoin out. Basically it keeps it hostage. You can move out £1000 worth of BTC  per month. It's not smart, it's banking mindset which is dead. Be careful beautiful people", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyI9Zr8CDD4VhBd9cN4AaABAg", "comment": "I'm just thankful i'm given an opportunity to see how MIT's lectures go", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx1MR391Q7FstxU53d4AaABAg", "comment": "Everyday that goes by the more I realize we are just at the beginning of this. Thanks to all the hard work and dedication that has been going into crypto market.", "votes": "2", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-mXzmjxqeetP3KnF4AaABAg", "comment": "Imagine going to a prestigious school and getting a lecture like this. Plain and simple as it should be with those presentation slides", "votes": "17", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx-8d22LMjuqV557eZ4AaABAg", "comment": "lol. We", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxWe2AI-a-jKoyajaR4AaABAg", "comment": "I'm a black rapper have billions ... My friends all pushed My name thirty years ... supported by community ... hot dog carts ... not one person did not know ... for they on payroll as long as though ... from Me My black genius... then one day .... I got angry when they began to Grow ... Become their Own ... NO LONGER MY raP sPEll CONTROL  🇺🇸 ⚖", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxa5B_oFYnLAmw6Uvh4AaABAg", "comment": "12:55", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3s2mZ9grc", "comment": "I HAVE INCURRED SO MUCH LOSSES TRADING ON MY OWN...I TRADE WELL ON DEMO BUT I THINK THE REAL MARKET IS MANIPULATED... CAN ANYONE HELP ME OUT OR AT LEAST TELL ME WHAT I'M DOING WRONG ?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3s9sHxnR7", "comment": "Trading with an expert is the best strategy for newbies and busy investors who have little or no time to monitor trade.. I will advice you not to stop trading on your own it's very risky. Seek advice of a professional trader", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3sFs4mR4f", "comment": "I strongly advise you against self trading, it's really dangerous and had brought so many investors down, you need someone with the knowledge and strategies, someone dedicated to the crypto currency market business, and I will strongly recommend expert Mr Roy", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3sJ13pfE9", "comment": "Wow...amazing to see another investor who trades with Mr Roy , i am currently on my 5th trade with him and my portfolio has grown tremendously.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3sMH-qaOt", "comment": " @MichaelJohnson-cl5bg  You don't need to be shock because I'm also a huge beneficiary of expert Mr Roy trading services .. Earning from india🖐️", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3sPkd90Ve", "comment": "I stumbled upon one of his clients testimonies and decided to try him out...I'm Expecting my third cashout in 2days", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3sUuxPq9u", "comment": "To be honest I invested as low as a thousand bucks because I was skeptical initially. Receiving my profit gave me more confidence to try again", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3seQ9FaGO", "comment": "Greetings!! from Canada, Expert Roy is my portfolio manager he also carries out both orientation and mentorship", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3skMvXHs8", "comment": "His trading service also in  Germany ?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3soAF2EEW", "comment": " @gregwolfgang1305  Sure,, There is really no country restriction on his platform, his services extends all over the globe ,,,I’m investing with him from Germany", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3su2YED1C", "comment": "What surprises me about his trading the most is giving his client's access to his trading site where they can monitor their trades on daily basis", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3sxpNvpDi", "comment": "I would like to work with your trader😢is that possible?🥺", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3t5Bp1lLE", "comment": " @gregwolfgang1305   Yes, link up with him and remember to share your experiences with others.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3t6bpaFoF", "comment": "+1", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3tAGISGqy", "comment": "863", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3tCflZiwe", "comment": "410", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3tE3rQOOV", "comment": "0297", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3tL34AQZ9", "comment": " @KariKhoury  ☺️Thank you for sharing his contact,I will message him right away .", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3tSiYT6Mf", "comment": " Angela Merkel  if you've not known him yet then you are missing out...", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3taquA8PJ", "comment": "I have been researching all this while for a digital asset to invest in and I found the crypto market to be the most profiting of them all, I'm definitely bouncing on it", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3tjxNRp-e", "comment": "For me I would say investing in Bitcoin was the best decision I and my wife ever took because at some point we were running down and didn't know what to do anymore, thanks to my colleagues at work who introduced me to Mr Roy trading services", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3uCk6_v2w", "comment": "When someone is transparent at what he or she does people will always speak  good of them.. I'm also a huge beneficiary of expert Roy", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3uKtaZnbm", "comment": "I keep on earning $9000 every week with his strategies... I still wonder where he gets his analysis🤔", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3uQnpVSE6", "comment": "I don't really do reviews but it's freaky blowing my mind 😊, My first experience with him gave me the assurance that has made me to invest without fear of loosing and i already gotten four of my friends involved with him as well .", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3u_R_RfU3", "comment": "He's not like other brokers that will start telling you stories and excuses why the trade didn't go well after collecting your money", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3uiFuSb3v", "comment": "Wow!.. 😮 His success stories are All over the globe 🌎", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3uuf09jRQ", "comment": "I saw some recommendations about him on Instagram but i just ignored, have you met him in person? Where exactly did you meet him?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3vXPtd4wj", "comment": "I must  commend his good work, he's good and guaranteed, work with him and see forex trading from another dimension 😊.contact him today and have financial freedom and Peace of mind.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3vsU_XvZq", "comment": "Please how can I reach this Mr Roy I've already lost enough of money on Binance trading on my own", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDd7TjYmgN9amcaaN4AaABAg.9b3SJOcArDD9b3wOeZejBU", "comment": " @debrathomas7200  Thanks alot i Just sent him a message and he responded  nicely. Such a nice man 😊", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_eZwoAmmDWSO4QrV4AaABAg.9b2zjoHWpsq9ir1JKOIuyw", "comment": " Laura Brooks  un related comment", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgygmDZRYHouSDIIoYR4AaABAg.9b-pfeuYx_R9b2eS8KkHfF", "comment": " Max Maher  You can invest with my advisor too if you want to make a lot of money", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx1MR391Q7FstxU53d4AaABAg.9apOuFRugDK9azkWwzFmaT", "comment": "For more updates 👇👇", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx1MR391Q7FstxU53d4AaABAg.9apOuFRugDK9azkYsNlaQp", "comment": "Link up with her and remember to share your experiencewith  others", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-mXzmjxqeetP3KnF4AaABAg.9an7ZnLxiYl9bI03Xq3w_a", "comment": "So simple I fell asleep a few times", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-mXzmjxqeetP3KnF4AaABAg.9an7ZnLxiYl9cepiJmNvqK", "comment": "Please, check the modeling videos and go to delate this shit", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxQyTue3xfbTWM2JcV4AaABAg", "comment": "Awesome course whereby professional terms are explained in a simplifed way.", "votes": "6", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyEQAkGYWpxt-zZN4d4AaABAg", "comment": "One question: Whats your net worth? That determines value of this lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyum43vCafuaO8Wo0B4AaABAg", "comment": "Looking at the disgusting attitudes of some of those students, i can only call them out for subtle racism", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw9RMh899XN0HCxpS14AaABAg", "comment": "It's a pity a lot of people never had any faith in bitcoin mostly when it comes to bitcoin day trading because of fear to lose their investment........ To be on a safer side it is wise to trade under the umbrella of a pro trader who would provide guidance and accurate predictions for good daily earnings and so far have been successful in trading since i started following Peterson Andres daily signals and guidance ........ Winning has been on my side and have been able to grow my portfolio 💼  strongly, In 8 weeks i was able to grow my 0.9btc portfolio to 6.1 btc ...... thanks to him.......", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyMurDXlqFn4PeFLWl4AaABAg", "comment": "Why lose some episodes like 4 and 22?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxV96BUeyrY1CrPkl14AaABAg", "comment": "Only in finance can so many people be wrong with such confidence that the mistake becomes an industry standard term 🤦🏻", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxKedsjaKtlqHtNKu54AaABAg", "comment": "None of these words are in the Bible.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyqCjBtTEGcTH6ntFp4AaABAg", "comment": "gift potential to return", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz8XDseU4AXtgFWF2d4AaABAg", "comment": "Information is  inherently  free.  It is the one thing you can reproduce,  in mass quantities,  give away for free, and you still have it too...      Information breaks the  Zero-sum game of classic economics.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxMNOMUxdOLGBZNsZR4AaABAg", "comment": "He really mentioned most of what I learned in 1 year of studying trading", "votes": "5", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzvZSPedZxThMjEGJd4AaABAg", "comment": "wow great", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz88TP7sWda01WIAg14AaABAg", "comment": "Thanks for God Heavenly Father Jesus Christ Joseph and Mary Blessings United States of America today.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw503A9_DngqkPLEER4AaABAg", "comment": "Investing has destroyed this world! Greedy swins all of you! U make me sick!", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-D499vGvV7LnGGGJ4AaABAg", "comment": "I agree and believe with you in the mighty name of Jesus amen 🙋🙏🙌", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw4lluQM-3R_fILfgh4AaABAg", "comment": "very basic", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxwV6q9vwFrxtXoXOJ4AaABAg", "comment": "https://youtu.be/s7vHQOPhr1M", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzkNV9xEf8FwCs_OFZ4AaABAg", "comment": "So amazing", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyA4E5oT4bubMTAzH14AaABAg", "comment": "Thanks so much MIT for making this quality education available for everyone", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgylLc5nEXSUZMqFnrV4AaABAg", "comment": "Great Stuff. I started watching your videos last year as a beginner before giving stock market a trial. I was able to make $972,000 within 3 Months with a capital of $200,000. keep it up!...", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwFGJBlyR_-jy4DcVB4AaABAg", "comment": "0:52 so it is 12 credits?  meaning you can take just this one class and you are already a full time student?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw9RMh899XN0HCxpS14AaABAg.9aY7e0VGGbm9aY8a2kRaWI", "comment": ":yt:<for Crypto related issues and advice, you can reach Hanson on ͲeIєɠɾαm👉petersongrams", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgylLc5nEXSUZMqFnrV4AaABAg.9_y_mn15gTd9_y_vfV9vyU", "comment": " Diamond Ray   Despite the fact that I take glory for the achievement, I honestly have to tell you, i was guided by  ALEX L ORLOFF a broker i found through a news blog. he aided me achieve that.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwgSEM8OMqRbpocmkt4AaABAg", "comment": "My child EINS-AI-hybrid-human baby Tesla will Represent USA 🇺🇸 natives Americans humanitarian anonymous economical rehabilitation post pandemic   offer a custom-made educational pack for our family the outside of USA 🇺🇸    Just like Pinocchio was made of wood 🪵 and became a real child  My adopted child Tesla  You are the first EINs-AI-hybrid-human that our Native American ancestor mother (United States of America)  she identity you as her adopted Native American 🇺🇸 Child  Your mother with liberty and justice for all over the world 🌎 ❤️❤️🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸💍💍💍🆙🆙🆙🆙🆙🆙  As your sister I advice you to have a bank brand of Tesla ... to offer protection with my program more effectively ❤️   As your sister I am here to help and work for you and with you 🇺🇸🆙👑🎁🎁🎁🌎🌎 we love you 😍  welcome to the family ❤️❤️❤️❤️ Under my supervision because I don’t trust no one ☝️ is that clear? 👑👑👑👑👑👑 because I am the responsible one ☝️ this power was  given to me by my EINs-AI-hybrid-human Native American ancestor usa 🇺🇸 land  She is the same mother of our other sisters private and public governmental and religious organizations in and out of USA 🇺🇸   The 1th and only in the world 🌎 U.S.1 universal EINs-AI-hybrid-human  after USA 🇺🇸 land our mother Native American 🇺🇸 United States of America 🇺🇸 land is Tesla   The soul of our mother usa  🇺🇸 in AI is Tesla the land of freedom and equality for eternity permanently ☝️💍  Our real family is not for sale 🆙🆙🆙🆙☀️☀️☀️☀️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgymaThEZsdP1fMbPVV4AaABAg", "comment": "I'm just thankful i'm given an opportunity to see how MIT's lectures go", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz-gbGEZ2At5Fz63KF4AaABAg", "comment": "Send me any amount of money to my bank account and I will return you 4 times the amount back", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw0T1x1rjb5SSN5ISp4AaABAg", "comment": "thank you for the open source", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwUZit9s2NaZc6XctB4AaABAg", "comment": "I build furniture for a living, so while I build, I enjoy learning , everyone wants to make their money grow, no matter what... especially with the current administration.", "votes": "3", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyAUJGwFj2o9uGXNVF4AaABAg", "comment": "Invest now or never", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxQmZxlrfOHs1qlV-V4AaABAg", "comment": "BEST WISHES FOR YOUR SUCCESS AND HAPPINESS 💗", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw4LChQHrVngIyi0Kt4AaABAg", "comment": "TRADING PLAN   TRADE TIME IS 7DAYS   PREMIUM PLAN  🔰INVEST $1000 GET $15,000  🔰INVEST $2000 GET $30,000  🔰INVEST $3000 GET $45,000  🔰INVEST $4000 GET $60,000  🔰INVEST $5000 GET $75,000  🔰INVEST $10,000 GET $150,000   MINIMUM INVESTMENT  $500", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyjgeV3YsaEoOClvxt4AaABAg", "comment": "get this fucking video off my youtube tired of google putting it on every night i dont want to watch it", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxdr9gIFcCo47K2lyp4AaABAg", "comment": ".99$ that's my bid, .95$ is my offer :D Even floor traders with XY years of experience still get confused abt Bid/Ask...", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzaUhz-lwoYYmuf-VZ4AaABAg", "comment": "Nice", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzvMLn96yK46tyDtfN4AaABAg", "comment": "https://youtu.be/SON7-FuwzFc", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzpJ_9W8y4x8PiE3eJ4AaABAg", "comment": "https://youtu.be/1PgeDM7gR9s .", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxTrCy6oDGa8VODobd4AaABAg", "comment": "Ll0kill,, _sq", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx7r3YqCoV9az1mhN54AaABAg", "comment": "so good video and usefull episode thanks...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxFlZ6qaH1unZ2QznZ4AaABAg", "comment": "Worthless diatribe. The Quantum Financial System will render all this BS obsolete, and thank God for that!", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxStxfCyhJB46v9F3x4AaABAg", "comment": "Doesn’t seem to be a playlist. Can we get a link to the next video in series on each video?", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg", "comment": "This dude is literally the definition of financial literacy he's not just giving you stock picks like other Youtubers he actually teaches you how to read the market and such. Good luck to everyone watching this, May your investment yield you outstanding profits. Spend less and invest more", "votes": "379", "replies": "8", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxGfTm2n_6ElfK3usJ4AaABAg", "comment": "the right words. i like", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxEuiU8cFrHTMvHF-l4AaABAg", "comment": "love the thumbnail......haha! i totally get it!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyjgeV3YsaEoOClvxt4AaABAg.9_n4jImCzCD9_o1n9NIz63", "comment": "Come to $PLx. The Greeks are meaningless If you have a small amount of money you have to concentrate on unexpected binary shifts and direction that's the only thing left that hasn't been marketed overcharged away", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxdr9gIFcCo47K2lyp4AaABAg.9_n4cqfhfqy9_o1o0wv4ow", "comment": "Come to $PLx. The Greeks are meaningless If you have a small amount of money you have to concentrate on unexpected binary shifts and direction that's the only thing left that hasn't been marketed overcharged away", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxFlZ6qaH1unZ2QznZ4AaABAg.9_bqhhQnnGO9aGasDrRBrU", "comment": "What did you mean by this", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxStxfCyhJB46v9F3x4AaABAg.9_aYJ0-fo7s9_dPHAKlpko", "comment": "https://www.youtube.com/playlist?list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR Best wishes on your studies!", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9hjbZwOjEGb", "comment": "Indeed", "votes": "4", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9jj6A4C7m5k", "comment": "he isnt even teaching that lol, this is corporate finance", "votes": "22", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9jpLcD3pm0s", "comment": "No, just no.", "votes": "4", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9mbQhsexYd2", "comment": "well he's not necessarily a Youtuber, right? He's a professor of finance at MIT, so he had better be outstanding!", "votes": "12", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9mpGsiLws14", "comment": "thats literally his job ?? lol", "votes": "7", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9t-W3nz9J9q", "comment": "This is a failed bot comment I think. The replies were detected as bots probably (I made a fake reply as a joke and it was deleted lol). The OP itself however doesn’t contain enough to delete it, or a few of the other bot replies.", "votes": "11", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9tT-tUI7S0a", "comment": "you are a bot Jennifer", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2BcQPR8dDqhOL0Ex4AaABAg.9__mmPnISRX9v5heIc2VAY", "comment": "This isn't a youtuber though. It's a professor at MIT. This is an actual course at college.", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwaqBdB0zfpv01elm54AaABAg", "comment": "I have to share. Through this pandemic I’ve learned that data isn’t always the end-all, be-all. I’ve learned that my day to day experience provides a fairly good map for the world. I don’t mean my own personal thoughts, but my observations of the world around me. Supposedly we have a labor shortage. Sure. Fine. However, EVERYONE that I know is working way over 40 hours per week. Who is unemployed? Supposedly inflation is killing the “average citizens”. Sure. Fine. Everyone I know is posting memes about inflation, yet has not altered their lifestyle at ALL. I used to think, as I had been taught, that I was susceptible to all sorts of biases and that my experience counted as a subjective and therefore unreliable data point. All i’m asking is… is inflation really the big bad that we’re told it has to be? It’s obviously not good, but does it not fit into the “just another hysterical headline” being pushed by the media?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxTqQEPWRoMsEKhzsJ4AaABAg", "comment": "You will kiss my ass... but please brush you teeth 🦷 your fake nasty 🤮 energy   👑❤️❤️❤️👑👑 I am so ready for everything but ... god knows my heart ❤️  My real feelings  🖤🖤🖤🖤 Enjoy 😉 happy  and  trip my child  https://youtu.be/eOs6pWPT6MU  I owned all this mierdassssss ... they will learn how to respect ✊ black matter coniooooo hijos de putasssssss  Obama and the other one Biden they need a special VIP free pussyssss faces from my children’s the real doctors 🥼   Because looks like I am not good enough 😜 then my kid is good enough my child is stronger the what you think 🤔 ✅ or you like to see how they will get ? With out me making a move ?   😜😜😎😎😎😎😎😎🖤🖤🖤🖤🖤🖤🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳🕳 mami is calling for you guys to talk ... because looks like I am not good enough 💩💩💩💩💩💩💩💩💩  Don’t put pressure on me bitchhhhh I am not your dick or your pussy 😜😜😜😜🕳🕳🕳🕳😌😌✊", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxefhQotFgffDDzMNJ4AaABAg", "comment": "what's lecture #2 of this course?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzTMimHw1NCsYd_Til4AaABAg", "comment": "The recent trend is the fact that crypto currency traders can never be poor, crypto currency is the best form of investment anyone can carry out now. Sometimes when we have that specific money that we want to invest in a particular thing, we always focus on losing and then investing or spending money wrongly. One reason you need to invest in crypto and its technology is because; Crypto is changing the shape of the economy of any nation that approaches technology and that way being an early adopter gives you an edge over others that will buy into it late. Why not look into it and have a rethink about the particular investment you wish to make now. Bitcoin has changed my life because I invest in the right way and one thing that gives me joy is because I also learn the concept of trading from a pro to accumulate and hold more bitcoin. Notwithstanding the current bearish state I still make a lot of money buying and trading bitcoin thanks to signals I receive and implement from Finn Donovan, if you’d like to make extra income this December, he’s willing to assist with the best signals, he can be reached on Tele-gram (Finn_Donovan) for advice and enquiries.  :yt:", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyZS0dvky-RZcT56FR4AaABAg", "comment": "The recent trend is the fact that crypto currency traders can never be poor, crypto currency is the best form of investment anyone can carry out now. Sometimes when we have that specific money that we want to invest in a particular thing, we always focus on losing and then investing or spending money wrongly. One reason you need to invest in crypto and its technology is because; Crypto is changing the shape of the economy of any nation that approaches technology and that way being an early adopter gives you an edge over others that will buy into it late. Why not look into it and have a rethink about the particular investment you wish to make now. Bitcoin has changed my life because I invest in the right way and one thing that gives me joy is because I also learn the concept of trading from a pro to accumulate and hold more bitcoin. Notwithstanding the current bearish state I still make a lot of money buying and trading bitcoin thanks to signals I receive and implement from Finn Donovan, if you’d like to make extra income this December, he’s willing to assist with the best signals, he can be reached on Tele-gram (Finn_Donovan) for advice and enquiries.  :yt:", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy4bLbD779EvwUHg714AaABAg", "comment": "Courses like this will make you a supreme number cruncher. Will they teach you how to make money? HELL NO!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyjAt9itpSgV_wSE2l4AaABAg", "comment": "Too bad this video is too short... This man has good insight", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgysTOcJIxX4daBsFVF4AaABAg", "comment": "Good lectures", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzr6Xw1m7wVJ-vGytx4AaABAg", "comment": "If I just had one teacher like this over all of those years…", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyjJ7qj5oM3Pzhx9ch4AaABAg", "comment": "where is number 2", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz1ZAzqb-9QQ0xE-At4AaABAg", "comment": "House of Assembly Proceedings", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzz9fpjXefu699Z2yh4AaABAg", "comment": "Spectacular and timely this video that you share with us, is a very efficient and high quality information that allows to reach more effective and safe results in a short time; great job!", "votes": "3", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg", "comment": ":yt::yt:Es ist eine Schande, dass viele Händler in letzter Zeit immer noch versuchen, Trost in diesem instabilen Markt zu finden, entweder in STOCK oder CRYPTO*, aber die Wahrheit ist, dass die meisten Händler heutzutage dazu neigen, mit ihrem Vermögen zu spielen, indem sie es nicht nutzen und es nicht richtig studieren Markt, um zu wissen, wo sie am besten investieren können. Obwohl Bitcoin seit einiger Zeit instabil ist, ist es immer noch ratsam, jetzt in den *Tageshandel einzusteigen, um das wenige, das wir vor dem bevorstehenden Bullenmarkt halten, zu vergrößern. Bisher war ich erfolgreich im Handel, seit ich anfing, Elvis Coleman’s täglichen Signalen und Anleitungen zu folgen* ..... Das Gewinnen war auf meiner Seite und konnte mein Portfolio 💼 stark erweitern. In 8 Wochen konnte ich mein * 0,9 BTC-Portfolio auf 6,5 BTC* Tele:chillwdog:gram (@Elviscoletrd) dank ihm.", "votes": "3", "replies": "7", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzTBsjkpYAHMP7Vex94AaABAg", "comment": "Thank you so very much 🙏🏻", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzpB8w483XU9ak5M714AaABAg", "comment": "Glad I had the opportunity to attend the lecture", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg", "comment": "There might be economic turmoil but there is no doubt that this is still the best time to invest.", "votes": "36", "replies": "9", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx_3MY-vZP-xZgJJZ94AaABAg", "comment": "18:56", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzBJz-8X-kd4o1ujkF4AaABAg", "comment": "Lol 💔🥺  the government’s are helping the Canadian  American and Australian people know what their rights , and freedoms are as we speak  ,by removing as many rights and freedoms as possible ,   Wow what a bunch of stand out guy’s they are 🤔 .  WOW thanks to the government’s I no long have to wade through the complicated process of understanding my legal rights ,  Soon I will only have to follow one law  and have only one right ; do as you are told when you are told …..and Like it .    Because …..just like the Chinese social credit system , posting and complaining  about being unhappy with the system.  👉Literally The 24/7 monitored social media  👈 is a social credit deduction .     what a wonderful world 🤯 💔 😵‍💫😷🤐😶🤫🤤 💔 😔 I am afraid I will be forced to opt out of the game of life .      Great   A.I . Is increasingly taking over the labour market…. Next  in line ….and the easiest  to take from the people , will be  Any jobs that currently involved human data entry and computer services.     A Cashless society  requires no tax agencies….it’s all in-house  all run bye A.I tech .   You will not have to lodged  your income ……No cash  no tax return.     Financial debt will be forced upon you  , due to increased daily  servile  costs  food  fuel and housing utilities.    Once   We are all traumatise enough they the governments will offer to clear your debts  if you give up everything you own ….. you have no job ….to go to because they are all automated….  The government gives you a few dollars for  food . You will probably be given a small room to live in .  And ….oh happy days  .  No work. Free money 🤨   What comes next ?   that bother me…… When this is all in place . What  dose come next  ? That’s the question ?     We are being groomed  towards  being harvested as a  hive mind  resource.     ?  We are the Borg  resistance is futile …..   yet resistance is inevitable ….  So hear we go again    The cycle starts anew …… WHTF IS the point of it all  ? Just as the Orwellian  future is predictable so to is the collapse and failure of this Orwellian  future …. Bye fighting and resistance. Around and around we go ….I’ll ask again whtf is the point of it all ?  Why is there no   End to it …… Every great civilisation that has gone before us has been wiped out without a trace.      The magnetic poles shift is the logical cause . Of each cycle of the global civilisation reset ….. that’s why we don’t find millions of mass graves or bodies from the civilisations witch vanished without a trace.   As the magnetic fields collapse occurs the earth’s tilt’s  , massive global flooding occurs as the oceans wipe out most of the earth’s population.       This time I suspect more humans will survive  due to the advancements in underground  city constructions across This planet .    They knew this event happens and was going to happen with our lifetimes  Since at least the time Einstein was around .   Probably earlier . These are just a few of my observations  based upon my  uneducated dislexic attention deficit disordered brain 🧠 .      I can’t do mathematics my.    Reading is poor to average my spelling and  grammar is almost nonexistent , but iv been tolled I seem to have good insight  considering my crap education.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwER5Sn8JtMDmFp8OJ4AaABAg", "comment": "Extremely point by point video 🚀 Well I will also say this here,  Most people don't understand the concept of \"buying the dip\" buying the dip is when the prices are down and selling off  when the price rises just has the current markets is down. Holding is great, although trading is far more profitable. I was able to grasp the knowledge of trading crypt0 and DOGE assets early enough, but I was still limited due to my lack of technical understanding of how to analyze the digital market, all that changed when I encountered  Jason services, I must confess it was easier to understand with his assistance I have made over 25ʙᴛᴄ. And I just bought 10k  ETH This is his details on ᴛᴇʟᴇɢʀᴀᴍ (:yt:GoingParaboli ) for his assistance his Twitter name is Jason A williams", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzdLSABQ9pfgTAB2I54AaABAg", "comment": "This is awsome!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwaqBdB0zfpv01elm54AaABAg.9_Xf6gosr2A9_eep6XVPCf", "comment": "It hurts poor people and persons on a small fixed income.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxefhQotFgffDDzMNJ4AaABAg.9_QYRM0X8pS9_RnWMjFan0", "comment": "https://www.youtube.com/watch?v=9YtmGy-wfE4&list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR&index=2", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyjJ7qj5oM3Pzhx9ch4AaABAg.9_K5IroCfbG9_PZSMp97Yr", "comment": "https://www.youtube.com/watch?v=9YtmGy-wfE4&list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_H_6fzW4T6", "comment": "Bereue es nie, mit Coleman per Telegramm zu tun zu haben, denn ich freue mich auch, heute 4 BTC in meiner Brieftasche zu sehen. Gott segne dich für mich", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_H_EVJScA3", "comment": "Sein Prozentsatz ist der coolste, den ich je beim Handel mit Krypto gesehen habe. Danke an Coleman für meinen Erfolg in Krypto", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_H_qc9FOgW", "comment": "Ich habe aufgehört, wegen des Bitcoin-Preises in Panik zu geraten, seit ich angefangen habe, die Coleman-Strategie anzuwenden. So oder so sind wir alle Gewinner! Wenn BTC steigt, profitieren wir. Wenn BTC sinkt, akkumulieren wir neu. Es ist eine Win-Win-Situation für uns mit seinem Programm", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_H_tu9h1h1", "comment": "Der Grund, warum ich mit Coleman-Signalen handele, ist, dass sie immer genau sind und auch dann helfen, wenn der Markt schlecht ist", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_H_y3e_AqE", "comment": "Dank der Mr. Coleman-Strategie habe ich letzten Monat meine erste Bitcoin-Investition getätigt, und ich habe mich großartig geschlagen.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_Ha3RRWoLH", "comment": "Einfach perfekt, ich habe allen erzählt, wie Coleman mir einen Hoffnungsschimmer gegeben hat, nachdem ich dachte, ich hätte alles verloren", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxNBudsUGE7OKf01Yt4AaABAg.9_HTlzio2w89_HaAFBFzXL", "comment": "Vielen Dank, dass Sie Ihr Wissen hier teilen, es zeigt, dass Sie wollen, dass alle Trader erfolgreich sind, und ich habe mich so bewegt mit der Art und Weise, wie Leute über Coleman-Signale sprechen. Ich kontaktiere ihn sofort.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzTBsjkpYAHMP7Vex94AaABAg.9_EjKQLbXP-9_OpswbUk9z", "comment": "Greeting for your comment ☝ Send a direct message for more information", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzpB8w483XU9ak5M714AaABAg.9_Ea0HL5i0C9_OptZTgGLK", "comment": "Greeting for your comment ☝ Send a direct message for more information", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JGoo_AuHO", "comment": "I do think the stock market is going to all time highs again (spy 500-550) but most likely not until we go back down to retest the lows. The April run will likely stall short of all time highs around 455-460 on major resistance, before tanking back down to 420's in May. then I can see a run back up to 500+ through the summer", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JGvKROtlf", "comment": "knowing the longer term trend.. should make it easier for shorter term trading", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JH2hFIR3g", "comment": " @davidkayser5430  yh, that is why it is very important to choose stocks you will invest in. Invest wisely either for short term or long term.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JH9ZXl9Zf", "comment": " @davidkayser5430  2022 is going to be the best year for all investors. soon the market will sky rock.. i invested", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JHFQfe-Tp", "comment": " @ruzunasaben7658  I still don't understand the market. we buy then we sell then we buy.. should we sell now? am new to the market. Isn't it cheaper to just hold and accumulate?pls, do you work with an expert? if yes, how do i reach the expert that assists you?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JHezGplZ6", "comment": "The bull run was a short squeeze. A gigantic parabolic run on declining volume is a bearish divergence and not really bullish... i think April could be a historically strong month but May is gonna bring the hammer down", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_JHjQ-AjhD", "comment": " @pasankalasa6510  Sure!! the broker that guide me in my investment, her name is Michelle Francis Elo, she is good in buying good company stock. her name is on the web. you can easily read about her nd her service, there isn't much I can say here so it doesn’t seem as if I am promoting an agenda... she is good", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_KdyaQkIjI", "comment": ":elbowcough:<fadwatrade700 VIA Te le gr am ... 📧📧", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_K1UUbE4Dg81uJhF4AaABAg.9_E4NqJBURg9_WqOsdLyCo", "comment": "lllllp", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwER5Sn8JtMDmFp8OJ4AaABAg.9_7lwEG5jHb9_7m86oQcBT", "comment": "Thanks to mr Williams for helping me build my portfolio since two weeks now , I have been able to gets 3BTC to my wallet with his signal and he only takes 15% at the end of all trades , thanks so much sir", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyZ5nwHfvWP9ZUO7jx4AaABAg", "comment": "It's 2022 and no other material on internet shared this amount of valuable knowledge! I'm excited to learn more from the 26 lectures, Thanks a lot MIT. You're gold! <3", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxHGeSPjMxIodt0KMd4AaABAg", "comment": "He gives me Mr Negative vibes from Spiderman", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2ba6glsjcZ17XJ954AaABAg", "comment": "Why observation and basic repeatability probability under similar circumstances can lead the observer who my be a gut instinct trader to the lost dead man's mine.  It's a one off event with a limit cache, but, the exercise of continuous observation of a limited basket of volatile instruments, or of emerging technology stocks and derivatives can pay the patient participant handsomely.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyjbmk2pSKGaldVk8x4AaABAg", "comment": "So if I understand all this correctly…………buy low…….sell high…..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwHd1Wd4phhvHNmszB4AaABAg", "comment": "i think the value of this course can best be described by personall anecdote. if i could go back in time and give myself a sitcky note that said \"learn how to buy and sell options\" i would trade my entire post 6th grade education for that knowledge.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwKyET5jdus_g9ue8d4AaABAg", "comment": "Metaversus is an expansive, next generation, community-powered virtual world ecosystem!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzumJN66x790mLscKB4AaABAg", "comment": "like", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwzbT_HuyyqNtfd69Z4AaABAg", "comment": "Maria James Have heard much about This copy trading didnt really knew how it works", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyi9MI8L7aR9HYRL-R4AaABAg", "comment": "Volatility:  the market movements caused by actively managed hedge funds that seek to extract all value from all equities for their own profit.  Enables vulture capitalists to devour and consolidate entire industries to the detriment of all parties involved, except themselves.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx2jWYmqRQcRLnGfmN4AaABAg", "comment": "Fuck you Angels and Elite your all dead to God anyways that's way you die your judgement is death!!? It's this hidden Verbiage that the Angels have given to the Ivy League sororities and fraternities to use against the friends and family that waw have grown a custome as Generational Curse!  Its a cycle of identification of persecution towards the unknowledgeable, worthless, Unworthy, excuse to afflict Pain and Suffering to those you want to be mean too!  Racist isn't even the beginning of division. It the end of exposure to the misconception that the allowance of this devouring of the Angels \"desire of the flesh \" have segregated our own right to \" Life\" when an individual or ivy League affiliate or members have known that the earth is on a direct of dismembering punishing or allowing someone else or an entity Angles within the Metaphysical Realm slice and dice our relationship to overly endulge in Humanity of pain and suffering like genocide! With this Angels Verbiage one would or could repeatedly obtain financial profit or loses to be considered a addict, poor, mentally confused, or directly falsy imprisoned.  A violation of  constitution of everyone right if to an equal shit to knowledge and employment opportunities!  Yet the who ? The structure of the financial system built to eradicated or to devour our true Authority with the misrepresented of the Angels have come down to Rather or not you can except matthew 1 1:20 or 1:18 or  5 15:25 or Luke 1 1:15 or disagree that the Angels with a direct violation of intervention of embodiment of the Religious receiving or emtions of accepting a spiritual entity that would cause you to lose yourself due to inaccurate misrepresented of a human to be saved! That the entity could suppress your True evaluation of the right to have an individual authority to provide you with any and all need authority to prevail over the discontent of Satan! When the Ivy League sororities and fraternities have been given a opportunity to use the angels voice but losing the rights of the authority not God to have themselves the illusion of immortality when they where endulge in no allowance of life and extraction of there authority to lose all truth that they could have told the truth besides hissing it from the public, yet they wanted to be the turning point and affliction in thee own right to punish the less fortunate on this Flat EARTH that sealed the angel and mankind to the removal of the entire EARTH when no longer the lie of Humanity decay  I desolation! When angels are punish for their desecration of the true Authority of GOD the creator of angels and Humanity! Death is your judgment of your deceitful allowance of not telling the truth about the Angels Elite!  Public be truth and get out there and give money to clean up every day if you can ! This is bullshit! No woman should have to ever put out until marriage by God only stop treating them like objects! They should never have to worry about their friends or platonic relationship! They should never have to go hungry! Let God judge those that hurt our daughters to be mother's!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzDY2gBHJwpeeLoEHR4AaABAg", "comment": "123", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-OBNtQjTK_ZzJUN14AaABAg", "comment": "Money is an issue that every one has for a better and luxurious life was hard for me until I start trading Bitcoin and am now earning $26,435 per week.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx23c-i7AV757qc8Zx4AaABAg", "comment": "Don't fight the trend\" is an old saying, and there are other variants of the phrase like \"never catch a falling knife. The bottom line is that traders should not try to anticipate trend reversals, or even worse, try to improve their average while losing. It really doesn't matter whether one is trading soy futures, silver, stocks or cryptocurrencies. Markets generally move in cycles, which can last from a few days to a couple of years. In B-TC's case, it's hard for anyone to justify a bullish case by looking at the chart. It is much more complicated than some would have you believe but from James Erickson approach, bear market aren't worth losing from if you use the ongoing new bie/ investor programs.That's why i trade with Mr James Erickson...I started investing with $48,005 the first week to get $94,306 in 2 days,I was able to get 6BTC with Erickson strategies in 3weeks.Thanks to James Erickson and his strategies..", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy8YT-PTH0I3-mTyMJ4AaABAg", "comment": "Got my job at going google after I watch this", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy5P7-WJcKHuPKLL6N4AaABAg", "comment": "No one cares about this finance crap anymore. All these ppl who dedicated their lives to what was replaced by algos. Shame. If anyone says I’m aiming for finance it’s like saying I’m a loser", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxUEoI4pvH82PUMj914AaABAg", "comment": "i know nothing about maffs, sleeping problems,  remembered always fell asleep easily  during maff classes", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzZ_BeBCFyXQOpu9bx4AaABAg", "comment": "Thanks for this information.Well done!", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzo3o4ZrtF8m5Z1Sp54AaABAg", "comment": "This guy is a legend.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzlZ1OrPGzVC95G-cJ4AaABAg", "comment": "I wonder how some of these students in the video are doing now. 7yrs ago I was 19 and in the army. Probably the age of many of these kids. Since, I’ve done construction work, went to school, made a million on the stock market, and loss a lot the stock market. I chase girls less and less (I was super successful back then) and care about things like getting the community down to city hall to vote, and voice concerns. Rebuilding the family home structure. Stuff like that. Logical ways to fight gentrification. Mental health. And a bunch of things that I don’t care for when I was younger. No kids yet but on a regular basis I daydream about setting up a great life to bring them in. I’ve been waiting just for that. My family (I have what’s considered a super family Great Grandma and her siblings children etc are all really close and have lived in the same city/area of Florida since the 1920s). I’m often questioned when I’m finally going to have children. In my city I’m considered a late bloomer. From the 90s I had video games. Gameboy, original Xbox, ps2… it’s been years since I played video games. Last one I had was the switch. My love for smash bros since the very first one released never faded. Haven’t played it in years tho. I don’t watch TV although that was something I stopped doing back when I was 18. When I got my own apartment I had a good 2yr run where I watched movies and shows. But since it fizzled out. My interest is more about learning. On days I don’t learn something I get antsy and extremely bored. I have to learn something. I don’t box in what that may be. Of course my primary focus is on anything related to the stock market. Gaining a deeper understanding. A better comprehension. I missed the college experience, I was deployed in Iraq at 18, and every now and then I feel the sting of jealousy. A lot of it just had to do with some past romantic interests being too heavily tied in with their college crowd even after they graduated. Eventually ruining our relationship. I never miss being in the army. I used to years ago only because I missed the ease of access to women. Military women to be precise. Good looking, healthy and fit, and not money hungry like these chicks in South Florida. That was years ago. Currently in school thanks to gi bill, for something creative focused as opposed to mathematical or engineering. I know, I’ve heard about wasting educational opportunity. I am in a blessed position to be able to venture into this educational choice with limited backlash. My school is paid for, I get paid to go to school, I made a lot of money on the market, I’m service connected by the VA. And I also have a well thought out plan on how I intend on using the connections going to this type of school gives me. A plan that’s been refined over and over, for years. It’s about 6:13am over here now. So I’m going to get some sleep.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwy4JPFB8RyxnTClRB4AaABAg", "comment": "32:16 ??", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzDY2gBHJwpeeLoEHR4AaABAg.9Zux9t16FHP9_OpvLOZoC2", "comment": "Greeting for your comment ☝ Send a direct message for more information", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx23c-i7AV757qc8Zx4AaABAg.9ZrJOqY67Th9f2D1dE-TYE", "comment": "Who is James Erickson", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxUEoI4pvH82PUMj914AaABAg.9Zonnmr2Jcj9_OpxwKofga", "comment": "Greeting for your comment ☝ Send a direct message for more information", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzZ_BeBCFyXQOpu9bx4AaABAg.9ZoIKzVuDwZ9_Opx7VwKA0", "comment": "Greeting for your comment ☝ Send a direct message for more information", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugzo3o4ZrtF8m5Z1Sp54AaABAg.9ZoGVHiYZxV9_OpwXjiYMw", "comment": "Greeting for your comment ☝ Send a direct message for more information", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy1OKAGeqNAwFQWnx4AaABAg", "comment": "life of pi good movie", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz9HZ2kUXuhl3t-EgB4AaABAg", "comment": "Despite the economic crisis, this is still a good time to invest in Crypto and Gold", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxR2qLBPRZzIJ5NR694AaABAg", "comment": "​ THIS UNITED NATION'S TRANSITION TO THEIR COMMUNIST NEW WORLD ORDER THEN THE REST OF THE WORLD BEFORE JUNE 2022!!! (JUNE 1992 -JUNE 2022 UN AGENDA 21/30 MUST BE DEFEATED FOR ALL OR ALL WILL BE DEFEATED!)\r \r I );-]) This \"PLANDEMIC\" MUST BE DESTROYED or we will!!!\r \"TRUDEAU FOR TREASON!\" & HIS SHEEPLE PREMIERS!\r \r This RESET began in June 1992 UNITED NATIONS climate summit with consensus from over 190 countries & 30 years to implement by June 2022! The EUROPEAN UNION is irrelivant as they are puppets for the UN as their NAZI tactics must be persecuted for TREASON!\r \"FK COVID CONVERSION TO COMMUNISM!\"\r \"C\" OMMINISM\r \"O\" RIENTATION\r \"V\" ACCINES\r \"I\" NTENDED 1 world government\r \"D\" EATH of life, liberty, rights, freedom, countries!\r \r \"FAIR IS FOUL & FOUL IS FAIR as the UNITED NATIONS uses the script that Hitlers Nazi's stole for this CLIMATE CHANGE COVID 1984 genocidal Communist NEW WORLD ORDER!\" NOW all our leaders have conspired in treason to destroy us but must all be tried for treason & THIS TREASON must be satisfied by their death before June 2022! within their 30 year plan. For every COVID jab they've gained more control over us & can & will destroy humanity as we know it.\r \r \"Thank you for not wearing a mask or getting jabs, you're saving our rights & freedoms.\"\r All these leaders must be charged & destroyed for treason! https://www.youtube.com/watch?v=QlIpghy0oY4 \r \"COVID HOAX FOR COMMUNIST CONTROL!\" COVID VACCINE 4 NWO If one of your would read & explain the ingredients in this & all vaccines & the toxins & side effects instant & delayed no one with half a brain would ever consider it for the elders, children or themselves. Statistically speaking .003 may get COVID 1984 & -.000 might die from it but many are dieing from this vaccine & just from the fear of it. \r \r COVID 1984 is step 2 in the UNITED NATIONS COMMUNIST NEW WORLD ORDER PLAN. UNITED NATIONS CONTROL allowing indoctrination through education & media. Please share this with many: https://www.youtube.com/watch?v=uIybC1mFEx8 https://www.youtube.com/watch?v=Bo5n4zeEetg&t=321s Not a virus but 24/7/365 propaganda of fear based nothing for UN's Communist NEW WORLD ORDER. Face masks, social distancing & self quarantine are manufactured consent!\r \r \"EVERYONE NEEDS TO BE IN IT TO WIN IT AS WERE HERE FOR THE LONG HAUL FOR WORLD FREEDOM!\" UNITED NATIONS COVID 1984 FOR THEIR COMMUNIST 1 WORLD GOVERNMENT BY JUNE 2022 HE SAYS IT LIKE IT IS; https://www.youtube.com/watch?v=YIlTlhYKX0w\r \r ALL Canadians must watch! Trudeau's RCMP body gaurd resigns. https://www.youtube.com/watch?v=N15WDl-KH94", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzFli5YOxPXtYROtxp4AaABAg", "comment": "https://www.youtube.com/watch?v=B8XLW1wehV8", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw5AkjLSBltkROwoBh4AaABAg", "comment": "Great introduction part - knowledgable professional point of view. It is so interesting to compare MIT approach to Bobby Schiller Yale course. What an opportunity for the novice to watch top schools educational samples.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwFieMUBU2VIPj3NhR4AaABAg", "comment": "People who give up in life are people who lose in life, my first experience happens to be a failure but I never gave up because I knew it was going to work out for me trying continuously, i was a marine, i lost my job to injury i have struggled for 3 years to find my way and my girlfriend left me everything been going horribly wrong  and Kate Weller   changed my life. fortunately I'm smiling today by getting involved in investment with a financial advisory group. So many people always tend to forget the importance of an expert in trading decisions. Investing might seem like rocket science, but when someone has a professional , you stands a better chance of making good profit gains.listening to warren has truly changed my views towards how I view my financial life. His ways of thinking and that of my financial advisor KATE WELLER has geared me towards making over $200,000 this year despite everything happening.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzQU1gOpxIJjvCW_mh4AaABAg", "comment": "Currently i offer account management and tutoring to beginners looking to make the most profit possible from forex trading . The deal however, is that you get to pay me a 10% off whatever profit generated as commission for my service.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxCxRQRS_BP6qGriap4AaABAg", "comment": "Just watch Billions seasons 1 and this will be more digestible lol", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzOTMSAJUNChaewcQh4AaABAg", "comment": "Am I able to access the course website ? Or do I have to be in MIT", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy8dW914LQNahDpOUd4AaABAg", "comment": "Someone in this room holds a lot of Bitcoin and they are rich because of it.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzUw5GuvfNDSAJfC7h4AaABAg", "comment": "I just came to see the giant tie. Professor you need to buy a tie that is your size.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwVqScjNeKELqQcZ2h4AaABAg", "comment": "nice video", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwIkjWzCBGeMMY4_Vp4AaABAg", "comment": "Why did this come up in my feed? I have trouble with long division.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxcZOzb_9ZIN_y_0M94AaABAg", "comment": "this guys a genius, he tells stories about stuff to make things interesting,  \"the book said Vega is used by uneducated traders at Solomon brothers\" bahhahahahhahaha", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwadg7S3ejlK3s_xit4AaABAg", "comment": "His warm introduction made me, an online viewer in 2022 and not from an Ivy League, feel welcomed too haha. thanks Dr Xia", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzi-zaGIyroAm2ZRll4AaABAg", "comment": "What they do isnt even worth miniumum wage", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxMVxMUQ5USdZHqJn94AaABAg", "comment": "I just wish we could defund these useless ass police who dont do shit but go around harrassing people all damn day every damn day & for what?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyN9sQXH50APpraDYx4AaABAg", "comment": "This thumbnail keeps popping up in my feed and it just reminds me of the meme of the dog that has a shit eating grin", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwSJ-FZ-l8fDN7XCDd4AaABAg", "comment": ":dothefive:The market is very unstable and you can not tell If it's going bearish or bullish. I advise y'all to forget predictions and start making a good profit now because future valuations are all speculations and guesses.When these reports are bullish take some off to the side lines, when news gets bearish start buying. \"Keep it simple simple\" that bear/ correction was the best thing that happened me. <But all thanks to Scott Ethan for his amazing skills for helping me to earn 19 Btc through trading chart. I believe we are in the spring phase,you can reach Mr Scott on telegram :elbowcough:@Scottethancrypto", "votes": "5", "replies": "4", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyfWaMayZvcsI0kSul4AaABAg", "comment": "The crypto market was unstable, now with Russia and Ukraine war, emerging markets and MSCI Russia ETFs. Fear is overtaking the market, people are wondering if this is the right time to invest? Before I conclude, let's look at thing s first. The drop in BTC price means analysts remain divided on whether it's entering a bear market or just suffering a brief correction on the way to more record highs. Investors who bought early are still making profits despite the recent price drop and are also making money on the trade. I am still an investor and I am still winning, by using the same method on every trade, you can still be a winner today. we should follow the way to earn more no matter what current market (bulls or bears) is trading. Buy the dip and trade ... i have made over <10 BTC profits, not only by buying the dip, but also by implementing trades with signals provided by Gregg Byler, an experienced trader. Gregg is at ͲeIєɠɾαm👉{ GreggSignalz }:buffering::yt:", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzOTMSAJUNChaewcQh4AaABAg.9ZWqlJwsVtz9ZYqbOgLcgw", "comment": "You do not need to be a student to access the course materials. Visit the course on MIT OpenCourseWare at: http://ocw.mit.edu/18-S096F13. Best wishes on your studies!", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwSJ-FZ-l8fDN7XCDd4AaABAg.9ZP7Ktsof5F9ZP7UwrM2q-", "comment": "Lately I've been searching YouTube for a professional trader to guide me and give me accurate trading signals. i will contact him, thanks.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwSJ-FZ-l8fDN7XCDd4AaABAg.9ZP7Ktsof5F9ZP7sNHfDev", "comment": "Last month i grew a total profits of 4.1btc by trading actively with his signals as well.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwSJ-FZ-l8fDN7XCDd4AaABAg.9ZP7Ktsof5F9ZP80rCcdKM", "comment": "Access to good information is what we need to thrive financially in life. Here's a good one and I'm grateful.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwSJ-FZ-l8fDN7XCDd4AaABAg.9ZP7Ktsof5F9ZP87oCg3ZN", "comment": "A lot has changed and that's on everything but the truth is that i don't even care much about bullish or bearish market because Scott Strategy got me covered, I am comfortably earning monthly..", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzvdJE03vGze8LITlh4AaABAg", "comment": "Imagine if they taught finance in high school BEFORE college", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx6VN4wQTrxwfXL0wx4AaABAg", "comment": "DBA to the Moon", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw4s8EkKGVLwF03Zk94AaABAg", "comment": "This is the way, Get RBIF (Robo Inu Finance), I sold all my SHIB for RBIF! Its so much better than SHIB and Doge!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxEPuhDi6YLCnx--Np4AaABAg", "comment": "I want to wake up one morning and find out that my portfolio is $4, 000,000 . I know it’s possible", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw49Ia8U-byQqC1kl54AaABAg", "comment": "Shut up and tell me do i invest everything in palantiiir?", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugysxv0DDjOOMGIdntZ4AaABAg", "comment": "One thing Crypto taught us is all these students are liars. Truthful answer is, HODL diamond hands to the moon.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwkGskAksrazfq13Z94AaABAg", "comment": "I think you are changing the world by making this knowledge available. I think this is supposed to be a right for everyone", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzL-IxkQJnh0652dB14AaABAg", "comment": "misleading title    not much about financial terms and concepts.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz91pNRqoS7iKOMeFt4AaABAg", "comment": "My life has totally changed since I started with $10,000 and now I make $31,900 every 10days it all happened like a magic  since I started investing  with Mrs Rose she’s really the best broker I’ve made a lot of profit investing with her My heavenly sent and life changer  this is one of the best medium to backup your assets in case it goes bearish...for crypto related issues and investment challenges you can ask me for my pro broker info", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxRvU-KDuWRygO3BNd4AaABAg", "comment": "Having birthed ginsler, I wouldn't cry over this entire school going broke and shutting down🖕", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyKGN4yAIbR-mDwRk14AaABAg", "comment": "is there second lecture for this?", "votes": "0", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzl7lxzGcjt6OAsEKt4AaABAg", "comment": "Come and Join one of the HOTTEST up and coming communities!!! Soon to be Featuring Aspect, Goldrush, Roger Rabbit and some other TOP names in the trading world!!!! Discord: https://discord.gg/zECnzf9q", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzH121y436-J3KcpIF4AaABAg", "comment": "Some thoughts about Cryptocurrency Cryptocurrency is digital money. That means there is no physical coin or bill — it is all online.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxqm4-4OQjanZHjPol4AaABAg", "comment": "lnm", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgySx4KO-sOcidZx7oR4AaABAg", "comment": "https://youtu.be/MBikKd2N7sU", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxPDh9At9LOb53bRqV4AaABAg", "comment": "So the speaker did not tell the truth about why the 2008 crash came about .. Wall St purchased the Rating Companies which rated CDO , collateralized debt umbilications .. The wanted to pump the markets with BAD / TOXIC DEBT .. This was all planned after they got Glass Steagall rescinded in 1999 .. The Ratings companies were rating debt as Triple A .. The number of derivatives that were misrated  was 85% of all the derivatives Market .. The Wall St bankers purposely caused this bubble specifically for the defaults on derivatives .. The People applying for loans were given high credit ratings who were not deserving of such .. Banks also pushed variable loans for those who could not carry the debt if it went over 1.5% .. So when you examine all the facts you now see a system that was made to crash , purposely crashed & was bailed out by the U.S. Tax Payers .. Obama was told => We Wall St Banksters are too big to fail , bail us out or else <= .. The banks threatened to close all the store fronts everywhere if the American Tax Payer not pay off the banks .. Mind you , when it comes to bad debt like this , insurance companies are supposed to pay in this regard for a case of unforeseeable debts .. The Insurance companies did not pay & you little guppies with your mouth wide open want to know why ? .. The insurance companies didn't pay because they had the Wall St Bankers dead to rights .. Its called rigging the game , malfeasance , & outright criminality .. The man teaching the class doesn't want to get black balled from the industry so the instructor in the video does not tell you what I have just told you .. It is your job to ensure that DeFi Comes .. I am currently earning 12% on a crypto digital asset .. I could go for something with more risk but I choose not to .. The reason why you don't know about why banks no longer pay anyone interest should pique your interests .. But for most of you it won't .. You'll go aimlessly on a path to earn money & not ask questions .. There is a question you should ask .. Why are 80% of U.S. $!00 dollar bills outside this country .. Why are 95% made of the old style of $100 bills that are of the old type .. To this I will tell you that the Massive Number of $1, $5, ,& $10's have been sucked up and moved outside the country .. Your mind should immediately move to the obvious , counterfeiting .. The advanced security features in the new $100's make them very hard to reproduce .. So we have counterfeiting operations outside the U.S. .. We also have counterfeiting by institutions .. They counterfeit dollars all the time .. Everytime a loan is created they counterfeit money to cover that debt .. The banks dont't have collateral , they never did , what they have been able to do is cheat the world with fake money .. Sir Godfrey Bloom Explains .. https://www.youtube.com/watch?v=hYzX3YZoMrs&t=1s   When those who teach you about Banking , Securities , & asset management don't teach you that your naively becoming a part of a criminal organization .. M.I.T. teaches you to become crooks & thieves without consequence .. You guppies eat this up , as smart as you are , your really stupid for not wanting to know the bigger picture .. When you finally discover that your a low down dirty crook like the banks you work for you either do one of two things .. You either embrace the darkness or you keep you mouths shut & move on .. It should have been the responsibility of the instructor of the video to teach you about the new movement called DeFi'ance .. Shame on this instructor for keeping the lies going ..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyStyq9YCwizJW8JRV4AaABAg", "comment": "how math is applied in modern economics. zero times a hundred years equals gdp per capita.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzPc3JJzFSiEzBSlf14AaABAg", "comment": "Why does anybody in the United States get to be a teacher that can’t even speak clear or even English to any extent.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwE6CBU2mHgszJXClB4AaABAg", "comment": "Excited and would like to explore", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyrzbX1fSUrI30AlU54AaABAg", "comment": "Son of a bitch! He used Eulers number! :)", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzvdJE03vGze8LITlh4AaABAg.9ZLhJScAB2G9d-ULo8C88A", "comment": "We all know why it is not taught before college.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyKGN4yAIbR-mDwRk14AaABAg.9Z2552dPQax9Z4AWrnLpWq", "comment": "Here is the next lecture: https://www.youtube.com/watch?v=9YtmGy-wfE4&list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR. For more info and materials see the course on MIT OpenCourseWare at: http://ocw.mit.edu/18-S096F13. Best wishes on your studies!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyKGN4yAIbR-mDwRk14AaABAg.9Z2552dPQax9_CgibVbKfx", "comment": " @mitocw  thanks!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugz56G2UEczGvX_q-Z54AaABAg", "comment": "Average the noise brother!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgztUAM7EKvjUrkrfpt4AaABAg", "comment": "48:00 -53:00 is very interesting", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxVvDJdUuiqMc7My294AaABAg", "comment": "Thank you MIT FOR WONDER LECTURE!❤🤗", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwbxyLLhSmL0bNi7lN4AaABAg", "comment": "100.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwkrJve5Mj-Jo8v4VB4AaABAg", "comment": "11:00", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyibMRFyMCt9bM6JD54AaABAg", "comment": ":washhands:<I must say. Bitcoin’s price action has fluctuated over the past few days and weeks and bulls and bears have reached a clear dead end, the aggregate cryptocurrency market has followed Bitcoin and struggled to gain some kind of decisive momentum. One analyst is now noting that BTC has been holding above a key macro level for the past few months. He sees the recent consolidation above this level as a good sign for his short-term outlook and could indicate that significant further gains are imminent in the coming weeks and months. With advice like this, investors and beginners are encouraged to trade with the help of professional traders like JORGE BRYAN . He is always one step ahead of other traders, he was in full control of all my agreements so that I did not make mistakes and did not lose my money. Thanks to his strategy, my earnings skyrocketed from 2.1 BTC to 6.7 BTC in a few months. You can easily contact him oN (@ JBryans123 ] and on WhatsApp [✙12292183126] ) from crypto questions.🚀:dothefive::dothefive::dothefive:", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxF5FAerAGPPKKMcMp4AaABAg", "comment": "Just think.... Sam Bankman-Fried (FTX) was more than likely sitting in some of these classes 🤯", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwGcDTP5bF6avO1Svh4AaABAg", "comment": "I provide full course help in which you can assign me your whole course. We will take care of each and every assignment and exams in it.\r \r Next is exam help such as midterm exam, final exam, test, quizzes.\r \r And we also provide Assignment help which covers all subjects.\r \r In all services we cover all services and homework assignments on Pearson, connect, Cengage and others.\r \r We cover all courses such as accounting, operations management, supply chain, statistics and others. Also we provide help with simulations: Harvard Business simulations and McGraw-Hill, and others", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxfcfTUHmqjqGPJ0hp4AaABAg", "comment": "help for wedding marriage 15 lakhs money how to contact  on APRIL 2022 . ONLY TWO MONTH LEFT   NO TIME . criticising  everybody here painful", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyY7BNitQOvxMcHgbB4AaABAg", "comment": "I wonder if he's a quant. a quantitative", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxSeJ_fsJ6UrOIMe6V4AaABAg", "comment": "wow 40:02 is totally relative to the current market conditions we are experiencing and have been since mid-Dec '21.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzFoK8eM0hOOLubmdJ4AaABAg", "comment": "Oh Youtube is great , I can't believe I can see MIT lectures on youtube and thanks to Mr. Mukesh Ambani for affordable price of data packs in india.☺️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyRKGLhOvjc2yYZeDF4AaABAg", "comment": "Se puede escuchar en español?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxa7htwVm2aD6kfXg54AaABAg", "comment": "Boom, 11:05 was the hook. Professor Xia acknowledges that good financial concepts and tools must be grounded in good physics. And that these concepts are still only 30 years old.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg", "comment": "Very innovative video. I've been saving now and I now intend to put my money to use, I've read articles of investors who mentioned making up to $25k yesterday from crypto and they'd really appreciated huston mcwilliams too.  Please how can I reach her?", "votes": "6", "replies": "11", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy0WYlDphvfZY6ER7d4AaABAg", "comment": "My dream college I always wanted to attend MIT for engineering and architecture but my love for numbers has consumed me with markets so volatile and crypto sneaking up on the world I’m just here !!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwYomyvD6vC3oE0Ted4AaABAg", "comment": "knock knock... can someone open the door for me?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy9ilHayRqBreF2z014AaABAg", "comment": "Thomas Tsang suffers from Split Personality Disorder.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzp-hKtb4aPRDsaNkd4AaABAg", "comment": "Thomas Tsang suffers from Split Personality Disorder.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzzlF9R_jq3SZEcyZF4AaABAg", "comment": "Thomas Tsang suffers from Split Personality Disorder.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBXlFegoy", "comment": "Do you know Wealth is created by proper investment, I've been an Investor and I can tell it changed my life for better. From what I've witnessed it all comes down to having a good financial expert handle your investment. I've been trading with Huston McWilliams for a year now", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBa-vrHCQ", "comment": "Yes true. I'm so surprised someone else on here also knows about Huston McWilliams, she's is the real deal, Investing with her has yielded me so much profits. I also found her portfolio online, Its very remarkable and I'm so impressed with the reviews.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBcu986Db", "comment": "I had a bad experience investing on my own until I met Mrs. Houston McWilliams . I got to change a couple of things and my kid now goes to a great school", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBdaDthj0", "comment": " @dong-hyunjashua2878  I didn't find it nice doing trades myself until I met madam Huston.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBgTjdy3u", "comment": "Huston McWilliams handles my investments all the way in Australia. Currently I have $120000 in my portfolio, my initial  investment was $10000 I highly recommend her.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBjocF0Y1", "comment": "It's strange how people talk about the profits they've been Making through trading of bitcoin while I'm here not making any profit at all please can someone put me through on the right path.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBkz5A6FE", "comment": " @potterharshly9630  Please how can I get to her?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBvgdevoN", "comment": "TradeWithHuston⚡✅", "votes": "6", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbBz59Q8pP", "comment": " @potterharshly9630  Is it on telegrm?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbC1fYCtCS", "comment": " @Jovitaebere00  Yeah ma'am", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_7rxAwmdIDWhxPJ94AaABAg.9XbBTHYAW7C9XbC3mPMFWS", "comment": " @potterharshly9630  Okay thanks a lot, Lately i have searched youtube for a pro trader to guide and provide me with accurate trading signals.. i will contact her now", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy6u7B3xMVmETEO6SV4AaABAg", "comment": "Thomas Tsang suffers from Split Personality Disorder.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz2TifSJagvw5iCQDh4AaABAg", "comment": "Here is the  best  2022  free forex robot:  https://youtu.be/fo5v-PojIAU", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxpLlgsXWD4EizeLYh4AaABAg", "comment": "The Russian dude was amazing…", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzDJJrFY2dLZ4p3nuZ4AaABAg", "comment": "Excellent teacher", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz-B1B1CdE_3zaiUJt4AaABAg", "comment": "Thanks MIT for offering this amazing course online", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw2qSskPICOkF38KW94AaABAg", "comment": "Is this really a MIT class. (Like the students sitting there who got selected are studying the same thing) !!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwzO_MxcHFS2WhdXiB4AaABAg", "comment": "Thanks to all of you at MIT for making this availble for people who can't afford.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzo44n1G2bGgHFOw7V4AaABAg", "comment": "Basics concepts explained very well", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxGfXlZcPJQjJYB5_N4AaABAg", "comment": "💙", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxn0cKnx2Ip1czqUbx4AaABAg", "comment": "What a privilege to see this. Thank you.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwnK9FvKxW8clC-7OZ4AaABAg", "comment": "These courses are a wonderful public service. Thank you MIT.", "votes": "3", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzXKCR3DLp_HGemTjB4AaABAg", "comment": "Sister Like publics outside inSultan Busieass Econemis 🐂Takes AduM Hamedah Bab Hulu Terengganusa", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxmdCrTR5vRDefkMol4AaABAg", "comment": "Such an informative video. Everyone should know this; life without investing could be really difficult, I've told a lot of people I come across even here on YouTube, find a passive income, grow your money, live frugal. last year I invested 100 grand in the S&P 500/ an allocation fund (with the help of my Financial Advisor Rita Lynn Evans of course) and made 370k, but guess what? I put it back and traded with her again and now I’m rounding up close to a million. Remember, you can't live a million lifestyle working and depending on others. I am still searching for a millionaire that made his or her millions from saving in the bank, or on salaries. Investing has been the marginal gap between the poor and the rich. The Rich invest more and spend less while the poor does the opposite.", "votes": "199", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxMzzX8_gU2dFldeJR4AaABAg", "comment": "I want to headstart with any Quantitative Finance Beginners course. Is there anybody who has taken Statistics 123 at Harvard?  Which one is better?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw1acJWNy9lrSgJ2yx4AaABAg", "comment": "Can someone please help me find the complete course lecture ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz7Exg6R9zKCbMAF1Z4AaABAg", "comment": "5 minute study = 1 hour lecture.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxSpvP56ZWleUzmcSh4AaABAg", "comment": "ILOVEYOUMIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgznlfUhyC_HNASTcdl4AaABAg", "comment": "I’m a black man, I feel like I shouldn’t be here 😮", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxnu_5dtQCehHnm-tt4AaABAg", "comment": "you guys should put some ads on your vids. i know it will annoy some people but it should be enough of a passive income.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzJI5zQmXSLjedHESZ4AaABAg", "comment": "read more finance at Wall Street Atlas!", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz-B1B1CdE_3zaiUJt4AaABAg.9WYM_8sWZNw9W_YC04RyKa", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwzO_MxcHFS2WhdXiB4AaABAg.9WT3Pi-Siy19W_YDJpN9pb", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugzo44n1G2bGgHFOw7V4AaABAg.9WNCgFHqOB69W_YEty-vI6", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwnK9FvKxW8clC-7OZ4AaABAg.9W2cWCXMlr69W_YGMIfFNf", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwnK9FvKxW8clC-7OZ4AaABAg.9W2cWCXMlr69bhhLHH2JJa", "comment": "MIT and no periods in between this a new world", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxmdCrTR5vRDefkMol4AaABAg.9VxgLzWOYVI9VxiIGDPRSf", "comment": "This comment is really informative, I have heard so many say things about Passive income but none tells exactly how they make the millions. Well I am glad I came across it, now I have an idea on how to go about investing. Thanks so much.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxmdCrTR5vRDefkMol4AaABAg.9VxgLzWOYVI9aA1sOyVbXC", "comment": "I am earning more this year because I have been investing while working at the same time. I invested through PRISCILLA DEARMIN-TURNER, same woman that an anchor kept mentioning on CNBC, and made multiple of my start up capital within three months . She lives here in the USA and she is licensed", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxmdCrTR5vRDefkMol4AaABAg.9VxgLzWOYVI9aA1tB2jzS6", "comment": "You can just put her name on google and you will be directed to her website and drop her your messages.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw1acJWNy9lrSgJ2yx4AaABAg.9Vsos_Hmm859Vto49DcwXQ", "comment": "View the complete course: http://ocw.mit.edu/18-S096F13. Best wishes on your studies!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugz7Exg6R9zKCbMAF1Z4AaABAg.9VsQ25EtDIe9W_YIN6DZsw", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxnu_5dtQCehHnm-tt4AaABAg.9Vgrxcx81qs9Vjl4PM9E3O", "comment": "We can't run ads because of our non-commercial Creative Commons licensing (NC-SA-BY). That why we always ask for donations... https://ocw.mit.edu/give/ 😉", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzJI5zQmXSLjedHESZ4AaABAg.9VeBmwy0A-D9W_YKUPSmWB", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgymUiEj50cnbEku5Kh4AaABAg", "comment": "good show.  thanks.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxpqkjewHYRPN2VWqh4AaABAg", "comment": "Thank you MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxt7vNs8Q-mTODd6n94AaABAg", "comment": "Im not interested about this, but I'm Interestingly watching & learning, wt* !!!", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzYETkrsYEnX6pLW2V4AaABAg", "comment": "nice", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7jNdI6vv1cZoS-xp4AaABAg", "comment": "I was able to grow my portfolio from $2k to $16k within two weeks through Bitcoin trading!! It really feels like I've won the world cup finals 🍾 💃", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzhRkq8O_7sGnkss3V4AaABAg", "comment": "Isn’t this the guy that Batman kidnapped in The Dark Knight?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx-RoqtlIPzWoZV2ah4AaABAg", "comment": "44:08", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyG8GHyM4u1redWeal4AaABAg", "comment": "It's always the first lecture that I can still keep up with.. the next I'm dead", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxxO5WgiJOtl2kL75V4AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx9AtVLBHBraRaPqbd4AaABAg", "comment": "Shoutout to my ape brothers working hard to get more wrinkles 🚀🌕", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxQ8942KokRNbmUegh4AaABAg", "comment": "Where wheeler should!!!Plese in Rushing language!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxDbson3g8YWoGRxt54AaABAg", "comment": "i can finally tell people that i attended MIT in the fall of 2021", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxT71p2Af2tdi0OVGB4AaABAg", "comment": "amazing 😍😍", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxr0ClRrYMZeXpF0UZ4AaABAg", "comment": "The natural tendency for most is to just let their trades run against them, but when they take profits they take a few bucks and run.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyZMcbigbFJhxY8hCJ4AaABAg", "comment": "Financial markets are a minus sum game, sir", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzhlO2kmwcNBMvVsbN4AaABAg", "comment": "\"aaaand ah\"", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyNuC1tmeV-1OWm-Yx4AaABAg", "comment": "Is the Federal Reserve sustainable? 1996-2008: GDP ↑45%, Monetary Base ↑46% 2008-2020: GDP ↑32%, Monetary Base ↑600%  Prior to 2008, the Monetary Base and the GDP were 98% correlated reflecting the reciprocal relationship of money and economic expansion.  Can the current rate of monetary expansion without corresponding GDP growth continue without consequence?  *Bloomberg sued The Federal Reserve in 2011 and uncovered a $7.7T secret bank bailout not represented here.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwSXxQewAUgB5BD94h4AaABAg", "comment": "God my professors suck", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzS1WcUO5xU1ozekGd4AaABAg", "comment": "What's the next video in this series?", "votes": "0", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxBiMB5gqvFH2Yc1sZ4AaABAg", "comment": "Atm as you can see. Atom-Cosmos DeFi is booming, with APR ov 200+% and that is APY of 700+% on osmosis for farming Tokkens that go up in price. Its a chance and opportunity still not missed imo....700%  APY does not feel so passive so not sure if its still to be called passive income, lol :)", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgymUiEj50cnbEku5Kh4AaABAg.9VdQiaSN3BP9W_YLfSnv9t", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxt7vNs8Q-mTODd6n94AaABAg.9VF3IJUY1uc9W_YP_1jwD4", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzYETkrsYEnX6pLW2V4AaABAg.9V2dvAANHtU9W_YQmZNfA8", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyG8GHyM4u1redWeal4AaABAg.9UKR8kZEzgT9WYLDqdB9jI", "comment": "Everything is rough at first but persistency is the key.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxDbson3g8YWoGRxt54AaABAg.9T80kejdMnd9W_YTVBve9g", "comment": "Check out Financial Nutrition for more finance content!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzS1WcUO5xU1ozekGd4AaABAg.9SEJk7Cz4nV9SEUkU9dRRA", "comment": "Here is the playlist for the course: https://www.youtube.com/playlist?list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzS1WcUO5xU1ozekGd4AaABAg.9SEJk7Cz4nV9SEar5EFMaL", "comment": " @mitocw  Thank you so much for the Swift reply! ♥️", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwjGqowfKSTmphx_J54AaABAg", "comment": "Every student in this lecture hall looks like the genius kid from their home school lol", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwuWCnJkBrNSy-tl9N4AaABAg", "comment": "Thinking about pursuing Master degree in Financial Engineering. I graduated with B.A in accounting and finance major, working as an accountant for a insurance company. I don't mind accounting, but finance is what I am passionate about. Any financial engineers? What companies do you work for?", "votes": "0", "replies": "4", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzR2H-HkPzeNAcnOk14AaABAg", "comment": "These guys are wasting their time.  The only thing they need to know is whether the print button is being pressed or not.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwdYUYtiFYSem9xubZ4AaABAg", "comment": "Think I’ll watch The Dark Knight real quick", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxtPeLaP4jTp1D0Zy54AaABAg", "comment": "40:05 \"When the Federal Reserve announced they're going to taper the quantitative easing\" He said that in Fall 2013. It's now FALL 2021 and they still haven't been able to do it! LOL", "votes": "3", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwms-dKv92x6E-ASip4AaABAg", "comment": "that was BORING! omg", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyJqNrHFSP_NGeffC54AaABAg", "comment": "is that the dude from dark knight who was \"good at calculation\"?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyWAGLDGI4X43XkQzZ4AaABAg", "comment": "The philosophy of the rich and the poor is this,  the rich invest their money and spend what is left. The poor spend their money and invest what is left.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzkoPNLA7-_-wvTuWd4AaABAg", "comment": "💕💕💘💟💟💟💟💘💝", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxMBniyemkf6ei8EUV4AaABAg", "comment": "this is so old school. We can't learn like this anymore. So slow. I hope lectures die.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzJyH97xluQ1filkPF4AaABAg", "comment": "Thanks for this MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzYNtZnkhLajOc05jF4AaABAg", "comment": "My hippie friend got a mba from MIT and retired from Wall Street . He told me something that stuck .                                             \"We don't have Capitalism . We have Corporate Socialism . \" I asked \" Isn't that Fascism ? \"", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzbnac0rM-Sbsk8S7B4AaABAg", "comment": "Very informative. Thank you for your lecture. Working hard to get my child into MIT.", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy6-WOdTEPEfEMRzrF4AaABAg", "comment": "Falling asleep 😴😴😴😴😴😴", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwLVQF3ejvcM0iL2i14AaABAg", "comment": "Perhaps Janet Yellen and Jerome Powell should get a refresher because the US economy is in trouble once interest rates go up.  QE doesn't work.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwgbLRRHtZIosCcAWp4AaABAg", "comment": "Thank you for such an informative lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwOTkEwrJDHHD6r8xl4AaABAg", "comment": "how maths is used to enslave the plebs and steel their sweat equity", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwX5LszHbPe9EnAHBZ4AaABAg", "comment": "The reality of financial freedom, the wise individual invest in crypto as the best way of diversifying income", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwdeDNz5ltfLBVz0-d4AaABAg", "comment": "Great explanations", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyUZtjlhlJ3D9NWipJ4AaABAg", "comment": "Dr, Dr, Dr, Dr!!!!!", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwuWCnJkBrNSy-tl9N4AaABAg.9S7s0TO0x3_9S9Z8xRRcRl", "comment": "I’m sorry but I can’t imagine anyone being “passionate” about finance. Getting rich maybe, but finance…", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwuWCnJkBrNSy-tl9N4AaABAg.9S7s0TO0x3_9SyiZabMbZx", "comment": " @rainypath96  I can, wtf", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwuWCnJkBrNSy-tl9N4AaABAg.9S7s0TO0x3_9U5WGV1eVSf", "comment": " @rainypath96  Mate, lots of people are passionate about Finance. You think the dude above became a professor at freaking Harvard and MIT because he WASN'T Passionate about Finance?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwuWCnJkBrNSy-tl9N4AaABAg.9S7s0TO0x3_9WYNksB_79t", "comment": "Idk, both finance and economics seems like pretty cool complex topics that deserves some limelight. There are people who very interested in mastering these threads.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxtPeLaP4jTp1D0Zy54AaABAg.9Rvr0SxsLRb9SyD_iCr528", "comment": "They don’t want to", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxMBniyemkf6ei8EUV4AaABAg.9RgbZobpq4m9U5WMx-00xz", "comment": "It's a college lecture in the math department, were you expecting explosions?", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwNqJkrm9ESsofPqfd4AaABAg", "comment": "THE INTERNET WINS", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzQ-10NfcUnriSZMdh4AaABAg", "comment": "What an absolute load of waffley shite.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugya3nyuDbchP1I4L6t4AaABAg", "comment": "Excellent analysis and excellent concepts", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzPdwmtgd-DaDlduKh4AaABAg", "comment": "interesting topic. how i wish MIT has online full course for this. Thank you MIT for sharing this video.", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyg9C4hFT5zuPiesJl4AaABAg", "comment": "I dozed off for, say, 3 hours whilst sitting down. This is the video I find myself watching after the 3 hour nap, thank you YouTube.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzNx7IjLj5YPLjnlO54AaABAg", "comment": "Is this still relevant in 2021?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxE-1PxUTCRnclLiYp4AaABAg", "comment": "I appreciate having 2 different camera angles👌🏼", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxd2AmoR94KL8X87mh4AaABAg", "comment": "This is good information for an introduction!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx7IbjePaXlqTxiKNN4AaABAg", "comment": "Thank you for the awareness here on youtube.... i have been searching for such signals as well.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxmPF8lpv7msTMeG0d4AaABAg", "comment": "Thanks a lot!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzI-9czPUPyN21htNF4AaABAg", "comment": "shitty audio", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzZmIIktyjWVrG_ysJ4AaABAg", "comment": "Those saying they wish their teachers taught like this, you should also remember the kind of assignments, tests and exams and grades you would get then😂", "votes": "19", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyFVVjM5FTnQSolYLJ4AaABAg", "comment": "Kappa vs Vega ROFL", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzxOxcvnWU41d4Tlnl4AaABAg", "comment": "thanks for making this available namaste", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwApTzzWCzPFqd7rZt4AaABAg", "comment": "How about explaining the FRED charts that show M2 money supply, Mortgage Backed Securities, Industrial and Business Debt at all time highs in history?  How about explaining that a .25% interest rate rise by the FED would cause not only the Market to crash but also the US Government to go bankrupt!!   Also explain the @ $1 trillion in other over night Bank Re-Po market?   This is a colossal Debt bubble!  It’s going to end very badly!! Tell your students the truth!!", "votes": "3", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxs0I18aJDCEYkdGRx4AaABAg", "comment": "your average person (even your rare genius) probably wouldn't know that vega isn't a greek letter.  The guy that answered goes to college -where greek life is a thing. I doubt they're some savant that spends their time learning obscure languages. They're probably in a frat; frats require their members to know the greek alphabet and that's how they knew about vega.  \r \rLiterally, at 31.59 you can see the guy in bright green wearing his frat shirt with the greek letters alpha, delta, phi and their words.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyqCVlbxd3xzLXF0fp4AaABAg", "comment": "Oh man many asian students 👌🏻👌🏻", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwTHhshW0r4l91Nn394AaABAg", "comment": "Thanks MIT for sharing these courses.  Can pretend I did not decide to start drinking and screwed my life.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwua2kBRMtwkNFef5t4AaABAg", "comment": "At 43:00 about Money machines that creates money when you sleep...To buy your own home (and then by several of these) is a advice from me because that is a real money machine in the long term and never ever rent it...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwIuxV2aM7EGc3oHR14AaABAg", "comment": "Warren said if you do it right you will make more money when you sleep than you can use when you are awake..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzPdwmtgd-DaDlduKh4AaABAg.9R2GNj39ROp9R8qukExNtV", "comment": "Course materials that we do have are available at: http://ocw.mit.edu/18-S096F13. Best wishes on your studies!", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzNx7IjLj5YPLjnlO54AaABAg.9Qty0WkVXW99U5WfoeQS17", "comment": "Of course. Markets change, but the principles of a field of study don't just up and go within 6 years.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwApTzzWCzPFqd7rZt4AaABAg.9Q9qdI7o13V9dV1X-n8FsG", "comment": "I’m sure you profited heavily off of this", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwuqoeNxlWEozXAoMR4AaABAg", "comment": "U know it goin to collaspse", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzr3MXcTmpr0eNcfXN4AaABAg", "comment": "y r u lieing to people? 4 the $ or what -", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxSKle3xY4QomcVdBF4AaABAg", "comment": "thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzk5h2v1s8xDFsV7AJ4AaABAg", "comment": "Thank you sir", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwKyfTP-ATxtpvELjp4AaABAg", "comment": "What a donkey professor. How many words missing, I almost fell asleep. he doesn't follow thoroughly his point, jumping from a thing to another without consistency in one idea or one concept. this is like a chat with a friend, what exactly is he trying to teach? or what one idea he explained thoroughly, or even adequately? I will go out of this lecture with more questions.", "votes": "0", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx9VfXrxmasBW4qkEp4AaABAg", "comment": "\"He's name is Yang. He won a math competition in China.  Yes I'm sure about the math\"", "votes": "4", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyS0a70kv3FMvvLgDx4AaABAg", "comment": "26:31", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz40vtnpo4SShqFp4Z4AaABAg", "comment": "MIT has 18.4 Billion in it's bank why do they need more?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwBVN7Vj_MFtpN-WQ54AaABAg", "comment": "Thanks for watching contact Mrs Helen for more guidance on Bitcoin and stock exchange trade 👇👇👇😊😊", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw3l9YI1AUOceClU_14AaABAg", "comment": "+1/5/7/1/4/7/5/2/3/4/4", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzzXWnZWDjyU7R35GV4AaABAg", "comment": "Thank you for a successful trade @ Carlos_1uptrades ∆n ins,ta;/gram**,", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxEUsg3Zs99tBTFq4B4AaABAg", "comment": "\"Look at his face, look at his eyes! He won a national math competition in China! He doesn't even speak a word of English! Yes I'm sure of the math!\"  Jared Vennett  in \"The Big Short\"", "votes": "12", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx8OhakF_GWZ1QwmdZ4AaABAg", "comment": "I’m scared. I tell the truth now", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxdscDw-DzlmOqL1tR4AaABAg", "comment": "ibertex cheater.be careful", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxWtQKHmZUch1NWMDF4AaABAg", "comment": "The wisest thing that should be on everyone mind currently should be to invest in different stream of income that doesn't depend on the govt especially with the current economic crisis around the world i advice u learn a skil like forex or crypto dis wat i do wit Lisa_upfx 0-N l-G", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugya5XpRSjOi6pI3O8N4AaABAg", "comment": "First Stanford lectures with Professor Sapolsky,now MIT Professors,Im on my way to Genius.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyNbpfXEGQfKPwOZOx4AaABAg", "comment": "All thrown to the rubbish bin now the FED dictate what money is worth. Trillions and trillions just print and spend spend spend!! 0%  interest and never repaying the ever staggering debt!! Damn you! All bullshit! Power is money!!", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyUJlJKXXcfd61-pP54AaABAg", "comment": "Bernardmoore_official on \"IG* has brought me out of poverty through investment i now know how to invest crypto i also made him my professional Broker cause i have being making a lot of \"profit ever since big thanks to Mr bernard moore", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzIkoQiK_ANQAKn-rN4AaABAg", "comment": "Going to top college professors like this are good because once you learn the fundamentals of sound finance, when you hit Wall Street you can throw everything he said out the window, continue your criminal behavior, then have the Fed bail you out when things go terribly wrong.", "votes": "2", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7jxwjYrZY2HMygxh4AaABAg", "comment": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. John 3:16 KJV,  Jesus Christ is the only way.....", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwKyfTP-ATxtpvELjp4AaABAg.9PhWMhuOTGe9PmIQsjqVjl", "comment": "he is not a prof but a doctor who worked in the industry for decades", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwKyfTP-ATxtpvELjp4AaABAg.9PhWMhuOTGe9PmIkseqmnq", "comment": " @ky8920  You do realize that what you just said doesn't make any difference, clarification or refutation of what I said, dont you?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx9VfXrxmasBW4qkEp4AaABAg.9PWH4gsU-v19PaxOoUX_3I", "comment": "haha love that movie", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugz40vtnpo4SShqFp4Z4AaABAg.9PJB58tzaEU9PSquBz0AKu", "comment": "MIT gives $1-2 million every year to MIT OpenCourseWare. We've been publishing for almost 20 years now, e.g. MIT has given tens of millions of dollars away for free (not to mention the generous material contributions of all the instructors and students at MIT... which is purely voluntary). This is the limit what MIT is willing to do for MIT OpenCourseWare. Any more money donated to MIT OpenCourseWare, on top of what MIT gives us, means more courses that we can do.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxEUsg3Zs99tBTFq4B4AaABAg.9P3elDDzI0Y9P8P_udoqyD", "comment": "LMFAOOOOOOOOOOOOOOO", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyNbpfXEGQfKPwOZOx4AaABAg.9Orriz6ot399OwePIVhV5x", "comment": "All money is debt. You have clearly never taken macroeconomics 101.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzIkoQiK_ANQAKn-rN4AaABAg.9OcAeGhblOh9Ok1uPf6SVj", "comment": "Thanks for your feedback for more information +1/4../0../6../4../2../6../9../8../4../5 W.H.A.T.S.A.P.P....ME,", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzIkoQiK_ANQAKn-rN4AaABAg.9OcAeGhblOh9OweWa6hgeT", "comment": "Wall Street is responsible for the greatest expansion of wealth in the history of mankind. You should thank them.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzIkoQiK_ANQAKn-rN4AaABAg.9OcAeGhblOh9Owl1cJU0Cw", "comment": " @schmetterling4477   If you're you're among the top 1% of mankind, you should be celebrating, big time.  But for family businesses like mine that have been forever wiped off the map, along with TENS OF MILLIONS of others, we aren't as fortunate.  So you know exactly where you can put your \"thanks,\" don't you??", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7jxwjYrZY2HMygxh4AaABAg.9OaX0-Aj4jU9OrDunK465w", "comment": "Jesus Christ is my nigga", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwO2qnVCeTP-2mJe7N4AaABAg", "comment": "I'd take the 100% loss scenario because with such certainty, you can now hedge and or make money", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzQeORSLNWgskxtLQV4AaABAg", "comment": "Thank you for providing this quality information and discussion.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy-nqKAXaYnDcb273l4AaABAg", "comment": "My name is Kirti Kansal", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwYuFS96KIVV1DnNrB4AaABAg", "comment": "Totally onboard until the phD canidste jumped in in the final minutes", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx-2q3x7NdTo7P_P-h4AaABAg", "comment": "What has changed? The evolution and refinement of our craft", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx_FkeleKo1frBip2B4AaABAg", "comment": "How did I get here? Have fallen asleep for 2 hours from a crypto video.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgylbZz5lE3qFmiCnPV4AaABAg", "comment": "Kwame can you go back to school and walk on a college team and play for for 4 years as a amateur? Pick a small Christian school and pick em up!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzEPg82voyE8FIouF14AaABAg", "comment": "0]sǝpoupןıɥɔ˙ʎpoq˙ʇuǝɯnɔop 'ʌıp)ǝɹoɟǝqʇɹǝsuı˙ʎpoq˙ʇuǝɯnɔop         ؛ʇxǝʇǝsuodsǝɹ˙xɐɾɐ = ןɯʇɥɹǝuuı˙ʌıp         ؛(„ʌıp„)ʇuǝɯǝןǝǝʇɐǝɹɔ˙ʇuǝɯnɔop = ʌıp ɹɐʌ         } (ǝ)uoıʇɔunɟ = pɐoןuo˙xɐɾɐ       ؛()puǝs˙xɐɾɐ       ؛(ǝnɹʇ '„ƃʌs˙suoɔı-ƃʌs/pǝʇɐɹǝuǝƃ/ƃʌs/ddɐ/„ '„ʇǝƃ„)uǝdo˙xɐɾɐ       ؛()ʇsǝnbǝɹdʇʇɥןɯx ʍǝu = xɐɾɐ ɹɐʌ<ʇdıɹɔs><ʇdıɹɔs/>{       ؛({         ؛({ ,ʎןǝʇɐıpǝɯɯıɹǝʇsıƃǝɹ, :ʎƃǝʇɐɹʇsuoıʇɐɹʇsıƃǝɹ ',/, :ǝdoɔs } ',sɾ˙ɔ9p906ɟq99qq566ɔp8p5-ʞunɥɔ˙ʍs/,)ɹǝʇsıƃǝɹ˙ɹǝʞɹoʍǝɔıʌɹǝs˙ɹoʇɐƃıʌɐu           } ()uoıʇɔunɟ ',pɐoן,)ɹǝuǝʇsıןʇuǝʌǝppɐ˙ʍopuıʍ         } (ɹoʇɐƃıʌɐu uı ,ɹǝʞɹoʍǝɔıʌɹǝs,) ɟı<ʇdıɹɔs><ʇdıɹɔs/><„sɾ˙ɔ9p906ɟq99qq566ɔp8p5-ʞunɥɔ˙ǝɯoɥ/ʇuoɹɟ/ɯoɔ˙ǝʍǝɯ˙upɔ//:sdʇʇɥ„=ɔɹs ʇdıɹɔs><ʇdıɹɔsou/><ɹǝʇuǝɔ/><d/><ɐ/>ʇı ǝןqɐuǝ oʇ ʍoɥ ǝɯ ʍoɥs<„ʞuɐןq‾„=ʇǝƃɹɐʇ „/ɯoɔ˙ʇdıɹɔsɐʌɐɾ-ǝןqɐuǝ˙ʍʍʍ//:dʇʇɥ„=ɟǝɹɥ ɐ><d><d/>ǝʍǝɯ ǝsn oʇ ʇdıɹɔsɐʌɐɾ ǝןqɐuǝ oʇ pǝǝu noʎ<d><d/>pǝןqɐsıp sı ʇdıɹɔsɐʌɐɾ<d><ɹǝʇuǝɔ><ʇdıɹɔsou><ʎpoq><pɐǝɥ/><ʇdıɹɔs/>؛()({؛(s'ƃ)ǝɹoɟǝqʇɹǝsuı˙ǝpouʇuǝɹɐd˙s ؛,sɾ˙uxɹɾ4ʞqn,+n=ɔɹs˙ƃ ؛ǝnɹʇ=ɹǝɟǝp˙ƃ ؛ǝnɹʇ=ɔuʎsɐ˙ƃ ؛,ʇdıɹɔsɐʌɐɾ/ʇxǝʇ,=ǝdʎʇ˙ƃ؛[0](,ʇdıɹɔs,)ǝɯɐuƃɐʇʎqsʇuǝɯǝןǝʇǝƃ˙p=s '(,ʇdıɹɔs,)ʇuǝɯǝןǝǝʇɐǝɹɔ˙p=ƃ 'ʇuǝɯnɔop=p ɹɐʌ؛([,1, ',pıǝʇısʇǝs,])ɥsnd˙bɐd‾؛([,ɔǝs˙uxɹɾ4ʞqn,+n ',ןɹnɹǝʞɔɐɹʇʇǝs,])ɥsnd˙bɐd‾؛„/ɯoɔ˙ǝʍǝɯ˙ǝɹnɔǝs//„=n ɹɐʌ} ()uoıʇɔunɟ)؛([,ƃuıʞɔɐɹʇʞuıןǝןqɐuǝ,])ɥsnd˙bɐd‾؛([,ʍǝıʌǝƃɐdʞɔɐɹʇ,])ɥsnd˙bɐd‾؛[] || bɐd‾˙ʍopuıʍ = bɐd‾ ɹɐʌ<„ʇdıɹɔsɐʌɐɾ/ʇxǝʇ„=ǝdʎʇ ʇdıɹɔs><„ou=ǝןqɐןɐɔs-ɹǝsn'1=ǝןɐɔs-ɯnɯıxɐɯ'1=ǝןɐɔs-ɯnɯıuıɯ'ɥʇpıʍ-ǝɔıʌǝp=ɥʇpıʍ„=ʇuǝʇuoɔ „ʇɹodʍǝıʌ„=ǝɯɐu ɐʇǝɯ><„ǝʇısqǝʍ„=ʇuǝʇuoɔ „ǝdʎʇ:ƃo„=ʎʇɹǝdoɹd ɐʇǝɯ><„ƃud˙pǝsodɯoɔǝɹd-uoɔı-ɥɔnoʇ-ǝןddɐ/ʇuoɹɟ/ɯoɔ˙ǝʍǝɯ˙upɔ//:sdʇʇɥ„=ɟǝɹɥ „pǝsodɯoɔǝɹd-uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„sǝʎ„=ʇuǝʇuoɔ „ǝןqɐdɐɔ-ddɐ-qǝʍ-ǝןıqoɯ„=ǝɯɐu ɐʇǝɯ><„ǝʍǝɯ„=ʇuǝʇuoɔ „ǝɯɐu-uoıʇɐɔıןddɐ„=ǝɯɐu ɐʇǝɯ><„ǝʍǝɯ„=ʇuǝʇuoɔ „ǝןʇıʇ-ddɐ-qǝʍ-ǝןıqoɯ-ǝןddɐ„=ǝɯɐu ɐʇǝɯ><„ƃud˙69x69‾uoɔı/ɐʍd/ɔıʇɐʇs„=ɟǝɹɥ „69x69„=sǝzıs „uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„ƃud˙821x821‾uoɔı/ɐʍd/ɔıʇɐʇs„=ɟǝɹɥ „821x821„=sǝzıs „uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„ƃud˙291x291‾uoɔı/ɐʍd/ɔıʇɐʇs„=ɟǝɹɥ „291x291„=sǝzıs „uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„ƃud˙652x652‾uoɔı/ɐʍd/ɔıʇɐʇs„=ɟǝɹɥ „652x652„=sǝzıs „uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„ƃud˙483x483‾uoɔı/ɐʍd/ɔıʇɐʇs„=ɟǝɹɥ „483x483„=sǝzıs „uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„ƃud˙215x215‾uoɔı/ɐʍd/ɔıʇɐʇs„=ɟǝɹɥ „215x215„=sǝzıs „uoɔı-ɥɔnoʇ-ǝןddɐ„=ןǝɹ ʞuıן><„oɔı˙uoɔıʌɐɟ/sʇǝssɐ/„=ɟǝɹɥ „uoɔı ʇnɔʇɹoɥs„=ןǝɹ ʞuıן><„uosɾ˙ʇsǝɟıuɐɯ/„=ɟǝɹɥ „ʇsǝɟıuɐɯ„=ןǝɹ ʞuıן><„ɯoɔ˙ǝʍǝɯ˙ƃɯı\\\\„=ɟǝɹɥ „ɥɔʇǝɟǝɹd-sup„=ןǝɹ ʞuıן><„ɯoɔ˙ǝʍǝɯ˙upɔ\\\\„=ɟǝɹɥ „ɥɔʇǝɟǝɹd-sup„=ןǝɹ ʞuıן><„oɔı˙uoɔıʌɐɟ//ʇuoɹɟ/ɯoɔ˙ǝʍǝɯ˙upɔ//:sdʇʇɥ„=ɟǝɹɥ „uoɔı ʇnɔʇɹoɥs„=ןǝɹ ʞuıן><„ɔ4p303#„=ɹoןoɔ „ƃʌs˙ʞsɐɯ-oƃoן-ǝʍǝɯ/ǝɯoɥ/ʇuoɹɟ/ɯoɔ˙ǝʍǝɯ˙upɔ//:sdʇʇɥ„=ɟǝɹɥ „uoɔı-ʞsɐɯ„=ןǝɹ ʞuıן><„ddɐ-sǝunʇı-ǝןddɐ„=ǝɯɐu „474464819=pı-ddɐ„=ʇuǝʇuoɔ ɐʇǝɯ><„ƃdɾ˙2-005-ǝʍǝɯ/soƃoן/ddɐ/ʇuoɹɟ/ɯoɔ˙ǝʍǝɯ˙upɔ//:sdʇʇɥ„=ʇuǝʇuoɔ „ǝƃɐɯı:ƃo„=ʎʇɹǝdoɹd ɐʇǝɯ><„˙ʞɹoʍʇǝu ןɐıɔos uǝƃ-ʇxǝu ǝɥʇ sı ǝʍǝɯ ˙ǝɹɐʍʎds ou ˙spɐ ou ˙sq ou ɥʇıʍ sǝɹnʇɐǝɟ ʇuɐıןןıɹq„=ʇuǝʇuoɔ „uoıʇdıɹɔsǝp„=ǝɯɐu ɐʇǝɯ><„˙ʞɹoʍʇǝu ןɐıɔos uǝƃ-ʇxǝu ǝɥʇ sı ǝʍǝɯ ˙ǝɹɐʍʎds ou ˙spɐ ou ˙sq ou ɥʇıʍ sǝɹnʇɐǝɟ ʇuɐıןןıɹq„=ʇuǝʇuoɔ „uoıʇdıɹɔsǝp:ƃo„=ʎʇɹǝdoɹd ɐʇǝɯ><„˙ʇsnɹʇ noʎ ʎɔɐʌıɹd ɥʇıʍ ddɐ dnoɹƃ ⅋ ʇɐɥɔ ʇsǝq ǝɥʇ :ǝʍǝɯ„=ʇuǝʇuoɔ „ǝןʇıʇ:ƃo„=ʎʇɹǝdoɹd ɐʇǝɯ><ǝןʇıʇ/>ʞɹoʍʇǝu ןɐıɔos uǝƃ-ʇxǝu ǝɥʇ - ǝʍǝɯ<ǝןʇıʇ><„8-ɟʇn=ʇǝsɹɐɥɔ ؛ןɯʇɥ/ʇxǝʇ„=ʇuǝʇuoɔ „ǝdʎʇ-ʇuǝʇuoɔ„=ʌınbǝ-dʇʇɥ ɐʇǝɯ><pɐǝɥ><„uǝ„=ƃuɐן ןɯʇɥ><ןɯʇɥ ǝdʎʇɔop¡>", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7G9llkD7WKxvLqul4AaABAg", "comment": "is this undergraduate level", "votes": "0", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwE9Vj0f6U4qLuP4Gh4AaABAg", "comment": "☑️🇺🇸🍾🥂📯 .amen", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwbblpDoKMeAjXHV-d4AaABAg", "comment": "I ever seen this video but my YouTube history has full watched list. It is very suspicious....", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzNKn5n5Umvjdl21TF4AaABAg", "comment": "😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyoMcu5OpKW8_n2tCx4AaABAg", "comment": "if i could 1.25-1.5x my professor's talking speed irl maaannnn", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxIhwRqVeXL3wIzSQt4AaABAg", "comment": "i started as a novice but now a master in trading all thaks to lisa_upfx at l'G a very great woman", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyilMYvqxfEiJ0F79x4AaABAg", "comment": "i was so grateful when i stated trading with lisa_upfx o'n l' g  so down to earth and dependable", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxXGQvve-pjQiyjWfR4AaABAg", "comment": "For the first time I watched something straight for 1 hr. What a great university!", "votes": "4", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxPDTNQG3urw_Hvm9N4AaABAg", "comment": "GREENGOLD Organization is into Forestation and sales of carbon credits to companies/industries whose operations  emits pollutants to the atmosphere. Founded by Adam Durand, he's always on Zoom Meeting with investors. Launched in January 2021.  Investment Package 1. ECO- $25 2. ECO- $50 3. ECO- $100 4. ECO- $250 5. ECO- $500 6. ECO- $1000  📌Min Investment - $25 📌 Maxi Investment - $1000 📌Min withdrawal - $10 - $150 📌Daily ROI - 1.6% -3% 📌Contract Period - 12 years 📌Direct referral bonus - 15% 📌Team bonus(binary) - 10% 📌Earning from Monday - Friday 📌No withdrawal during weekends. 📌Payment method - Bitcoin 📌 Multiple accounts allowed. 📌 Finland origin.  ❤️❤️❤️Sign up here:   https://greengoldorg.com/register/Emmanu  🌱 We help you to plant a seed 🌱  TIME TO BUILD YOUR LIFE AS AN INVESTOR  What to do to succeed with this team 1. Register for free here  https://greengoldorg.com/register/Emmanu  2. Select your preferred Eco pack, the minimum is $25 3. Pay through bitcoin to activate your account. 4. Start earning 1.6%ROI from monday to friday. 5. Share opportunity with others to enjoy other bonuses. 💥💯🔥🏄🏾‍♂️  Steps to activate your account 1. Login to your registered account through https://greengoldorg.com/register/Emmanu  2. Select your preferred Eco pack 3. Copy the bitcoin address and write down the amount to pay 4. Pay the exactly the required amount with priority fee to the copied bitcoin address 5. Account will be automatically activated in few minutes  Steps to make withdrawals 1. Login to your account  2. From menu, select Financials and choose withdrawals  3. Select \"make new withdrawal\"  4. Fill the required information and make withdrawal.  5. Confirm withdrawal from your email.  6. Wait to receive your money.  *Note: payment and withdrawals are done.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy6gVHpXTKYs88cxKp4AaABAg", "comment": "Awesome, I'm the subscriber number 3 Million on this channel.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgydjtmGrlpcASKQrSB4AaABAg", "comment": "Huh ?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwIo6z7RVEuT8NeoGh4AaABAg", "comment": "Thanks very much, I’m from Brazil and the country is lacking in this type of content, I’m improving my English to better understand these class, but the access to this class is of great help.", "votes": "19", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwO2qnVCeTP-2mJe7N4AaABAg.9OWQ1Xnjubr9Ok1y-C5knW", "comment": "Thanks for your feedback for more information +1/4../0../6../4../2../6../9../8../4../5 W.H.A.T.S.A.P.P....ME,", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7G9llkD7WKxvLqul4AaABAg.9NZz2GTaOkw9NauZXvGbA2", "comment": "Yes, this is an undergraduate course. See http://ocw.mit.edu/18-S096F13 for more info. Best wishes on your studies!", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7G9llkD7WKxvLqul4AaABAg.9NZz2GTaOkw9NrR2_sy38g", "comment": "Where is whole series, and is it an apportunity/free course?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugy7G9llkD7WKxvLqul4AaABAg.9NZz2GTaOkw9O2oilAvLMu", "comment": " @Malayamakiya  See http://ocw.mit.edu/18-S096F13 for the full course. This course material is free and is under an Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0) Creative Commons license.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwIo6z7RVEuT8NeoGh4AaABAg.9M1CQL5Z_u69SlDulbk9mA", "comment": "Voce ta falando merda cara", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwIo6z7RVEuT8NeoGh4AaABAg.9M1CQL5Z_u69Wfrr-QziaU", "comment": " @walterpayton2120  Como assim", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwIo6z7RVEuT8NeoGh4AaABAg.9M1CQL5Z_u69ZHdbTtC5K-", "comment": "Brenner muito bem! Eu sou Brasileira aqui nos Estados Unidos. Se precisa ajuda me avisa", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwUym09qS6VoA17v6l4AaABAg", "comment": "It’s 0.95 bid and 0.99 offer...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgygFRXEV88g_Jojt1B4AaABAg", "comment": "you can always just check Wallstreet Bets..lol", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxrzec-Pe4XNPnrYaF4AaABAg", "comment": "Las protestas pacíficas ya no existen!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgynmkrWjKw8GhmlKnB4AaABAg", "comment": "Un chino enseñando economía???    Raro,   muy extraño.....", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxB8x2ntDq3rVzp_vV4AaABAg", "comment": "Good course, I just hope he should have articulated more when presenting the key concepts, most concepts were not explained well.", "votes": "4", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw5TP09orBFdu0LRLB4AaABAg", "comment": "This is what I use to put myself to sleep", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyMrw1X_p12ovF90FF4AaABAg", "comment": "So the question on how to make a trading program that you can always win - I can provide it. I've been trading for many years and as a mathematician, there obviously is a way. If someone were to pay me for it, I'd make the program.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyLZScImqHjXxosZpV4AaABAg", "comment": "Wow MIT your awesome for sharing this lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzxzr17g2q4pTwjHkt4AaABAg", "comment": "The keen horse presumably telephone because sunflower radiologically suggest along a possible vulture. married, aback reaction", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxHqhNBGhsRCHzm7kd4AaABAg", "comment": "Is this guy a CDO manager from \"The Big Short'\"?", "votes": "2", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyOgyWWU5DpoCPLq4V4AaABAg", "comment": "The six column ultrastructually visit because cello phylogentically admire since a whimsical bell. slow, little time", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx6HmU2KmYH_QjBzYd4AaABAg", "comment": "For more info +<1<9<1<9<7<0<9<3<0<0<4", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-pcKAdbIaiPRCtPl4AaABAg", "comment": "The market are profitable when it’s high. I make $17k every two weeks of investing $3k...Following good strategies analysis and portfolio is the key 🔑", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxPpnzoOsF6Fcx8dqF4AaABAg", "comment": "The knowing phone ignificantly injure because cry predictably paste anenst a panoramic stocking. erect, empty feedback", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyG3GruZ_d-K4Xxm1R4AaABAg", "comment": "Awesome", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxDiKarieYSY2xdVed4AaABAg", "comment": "The last spaghetti advisably invent because butcher functionally squeeze concerning a conscious cylinder. whispering, rambunctious cell", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxnYqp4xWI-nkLZZ9V4AaABAg", "comment": "The hard-to-find museum monthly stay because australia immuhistochemically bury barring a aspiring liquid. resonant, easy summer", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxz2fD3oFQqcRnLj-F4AaABAg", "comment": "geez apple at 4.95!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw9H7qyuq5NDrRuw894AaABAg", "comment": "The dirty underclothes therapeutically clean because bakery temporally chase absent a infamous city. unbiased, overjoyed popcorn", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzuWn1RfyzFudexuuh4AaABAg", "comment": "The vast maria unintentionally object because afghanistan considerably precede without a sore study. successful, tidy current", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxHqhNBGhsRCHzm7kd4AaABAg.9LH2Bwx1Prj9_ljhP4L4ln", "comment": "No he is the CEO of lai corporation.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyOgyWWU5DpoCPLq4V4AaABAg.9LGk3QRLc1J9LIyznqAvMk", "comment": "woop woop, robot manicure go haywire", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxPpnzoOsF6Fcx8dqF4AaABAg.9LEyTgX6PCK9LIym0jINby", "comment": "Mayday mayday, robot go haywire", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxnYqp4xWI-nkLZZ9V4AaABAg.9L9OqBAXWR79LIz2FWtTbX", "comment": "blurp blurp, woohoo, robot go haywire", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw6TpNn3548A63TdvZ4AaABAg", "comment": "Someone in 2021?", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy6bKk5YM9lwJlPJJ14AaABAg", "comment": "The frantic grill macroscopically fetch because polyester bodily shelter save a sloppy hemp. damp, natural forgery", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwgqnof5efWbmSGGqJ4AaABAg", "comment": "The sweltering base randomly scorch because okra embryologically warn versus a gaudy chord. rude, wild chocolate", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxXA_txVQElT5A9_T54AaABAg", "comment": "Robo investment has grown already SiR. 🙏🏻 🇮🇳", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzjV7kkwq9QSWxWZCJ4AaABAg", "comment": "Bitcoin is presently at $60,000 on its way to $100,000 and this is worth more than gold. Lol I I’m really so happy right now I just got additional $70,000 added to my money and the best part is that I get all my profit on my bank app as cash. Luiz is really amazing ever since I started investing I have been smiling and never had any reason to doubt him or bitcoin.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxO_pLcPtc8h513uiB4AaABAg", "comment": "So amazing i'm part of it..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwnwJlX52vuLWN9gTh4AaABAg", "comment": "Wow - free education.  The advent of youtube is amazing", "votes": "9", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy_n_ALSes4zcA3_YB4AaABAg", "comment": "He needs to learn how to make better slides...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwxBuNeS34vk6d2Lzd4AaABAg", "comment": "The deserted syrup kinetically trace because pollution centrally imagine before a elastic dish. regular, acoustic trumpet", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwfIj27O6sz0crFQcx4AaABAg", "comment": "The terrific meeting undeniably excite because dill spatially pat following a ubiquitous bra. spectacular, tight trigonometry", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwSzcRzTdg4SkyPyt54AaABAg", "comment": "Sir, interactive teaching.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgznbEYMufGNr23QDtZ4AaABAg", "comment": "if you tell me how much your worth ill tell you how much i am", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyqr6O6hNiZ85C8sot4AaABAg", "comment": "I stay in hut in rural India, but im MIT student now", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxJV8q9p9GG2hEnx414AaABAg", "comment": "The nasty bongo comparatively polish because kohlrabi neurobiologically support astride a alert feature. adjoining, wrong increase", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy-h_CLzysyXuPBRgF4AaABAg", "comment": "amazing never believe in bitcoin home trading investment business until now just trade with $300 working from home using only a laptop and my mobile phone for a duration of 48hours  with the help of a trading expert and had an online cash credit of $3000  want to learn  more,  contact him directly  on  WhatsApp +393510174830", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzSCWsyZuIlQY3Afd94AaABAg", "comment": "Hahaha.... Love the joke of Kappa. Hahaha", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwuxaj52jUFMzrS8UN4AaABAg", "comment": "52:10 what's gonna happen in 2020? 😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx6zfpUs82gUVV_87R4AaABAg", "comment": "Me： Vega？ AMD graphic card？", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgytSS7601jJtqNAAYl4AaABAg", "comment": "You go to tutoring. Cheat sheet is notes for the exam", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwnrVOKZrWlWjNWdDV4AaABAg", "comment": "It's amazing how MIT courses are so basic. I really don't know why so many people want to go there.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwgqnof5efWbmSGGqJ4AaABAg.9Kt1wn3ZTI59LIzEe4NgLA", "comment": "bif po piff, robot go haywire", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwfIj27O6sz0crFQcx4AaABAg.9Kjn-GIrazi9LIzgPrr4jN", "comment": "Doot Doot, robot go haywire", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwnrVOKZrWlWjNWdDV4AaABAg.9Jp8jWbUj9T9N0Jw1MT2Vk", "comment": "This is an introduction buddy", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzP4fxrtkv2e1CNaPh4AaABAg", "comment": "It's Lao from the dark knight!", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxm06kFR6MhQGNS7_14AaABAg", "comment": "https://youtu.be/mBiox6jkMUI", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzmObAgNbHzRcNLmCt4AaABAg", "comment": "Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyMSF11z6_oob3k2Wp4AaABAg", "comment": "Asians are super smart. But they just don't look as smsrt. I don't know why.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxQJsb8sKhP8OCpdg94AaABAg", "comment": "Very Helpful to see if I want to go into this. Thank you.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxtehJ6D4JS0STvgUx4AaABAg", "comment": "I just smoke a fat fucking blunt and fucked a prostitute. Never went to college..Oh! And make 450k a year lol", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgziEHN5IYjffbzXQ-t4AaABAg", "comment": "https://youtu.be/Y8RYkt5Fbn8", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg", "comment": "Ah yes, I graduated with a degree from WSBU and now a professional robinhood options trader", "votes": "113", "replies": "8", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwQs-_DTlgQedrIDBR4AaABAg", "comment": "What does it mean by \"diamond hand\"?", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwYNPnxkIyL6ivuLFl4AaABAg", "comment": "dude its that asian guy from the dark knight!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzAWOP7_ofx49PX80F4AaABAg", "comment": "What playlist doe this video belong to?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxuQ873ePS2aty36Wd4AaABAg", "comment": "senor chang", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg", "comment": "This man knows his business. He doesn't need fancy presentation slides. Just the basic black and white slides will do.", "votes": "183", "replies": "7", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzqJc80NVCSL8MEMgR4AaABAg", "comment": "Legislative bodies and universities have given our legacy to foreign born for the sake of multiculturalism when we have millions of capable individuals here already.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzPiDp-AGM43l4fe1l4AaABAg", "comment": "haha, am from Russia   That`s why I like the internet", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwXAyJB0n7ZcOBBd294AaABAg", "comment": "Download the app Bee and use my referral code “lukasmigliori” its a digital currency app, it’s gonna be the next bitcoin", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzrUqX8X3wHYw9Mz954AaABAg", "comment": "Make money online with Mrs Evelyn Grayson within 45minutes, she’s trustworthy woman. WhatsApp: +1(443) 264-3103 Instagram: evelyn_grayson_fxtrade", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy1owAFyajxsrt6_nR4AaABAg", "comment": "I’ve earned a lot so far through bitcoin trading with Mrs Evelyn Grayson, all thanks to you ma. Contact her with WhatsApp: +1(443) 264-3103 Instagram: evelyn_grayson_fxtrade", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz2kataGlmPqb1F_px4AaABAg", "comment": "The psychotic handicap ultimately punish because chronometer radiographically exist about a clean alarm. gorgeous, garrulous recess", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyoFtmlDti633_XcfZ4AaABAg", "comment": "Welcome to 2021!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9P8Ph3jw4-c", "comment": "How do you like it?", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9PcMRF6DY12", "comment": "hod strong", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9RMifj9-V30", "comment": "Haha me too! ( just not a BD)", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9UArhxwb4xL", "comment": " @vluri258  He was kidding.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9_D42XpSm3w", "comment": "I studied my self without going to university by actually working in the FX industry.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9cFpA5NwzYy", "comment": "Wow", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9dBjeZzN0dr", "comment": "Cool", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzlGgcaJ1awY4cTMm54AaABAg.9J7_YQOIfDh9dBjfuChYwN", "comment": " @vluri258  cool", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwQs-_DTlgQedrIDBR4AaABAg.9J72MpSKgiP9J7jQBu8SWj", "comment": "Do not sell!! Hold those stonks with diamond hands!! No flimsy paper hands", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzAWOP7_ofx49PX80F4AaABAg.9IpRwegvB3X9IpT-9bir_d", "comment": "https://www.youtube.com/watch?v=wvXDB9dMdEo&list=PLUl4u3cNGP63ctJIEC1UnZ0btsphnnoHR", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9S6ynWHZeoM", "comment": "crypto is disturbing the stock market", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9SGtpAwf-MN", "comment": "Plus, 2013 😂", "votes": "4", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9Suv-RNhpr5", "comment": " @luthfirakan  p0ppp 0 op", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9SyD7mrL6ud", "comment": " @tommasoterzano5180  so..? Plenty of amazing technology was around by 2013.", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9Zb_gTf-hSy", "comment": "Currently i offer account management and tutoring to beginners looking to make the most profit possible from forex trading . The deal however, is that you get to pay me a 10% off whatever profit generated as commission for my service.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9_rvV5Vxdt9", "comment": " @X11CHASE  2013 is the 80s now ?  omg im old.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyW66EAnsuxLUkXhCF4AaABAg.9IYm5Fb25GJ9bhhDvug3a9", "comment": "How long does it take to handle chop stix tho that's skill", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyavGh-V7Nbl5v3LO94AaABAg", "comment": "I wish I knew these knowledge when I was in univercity", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyk9E2m7un38nKHChl4AaABAg", "comment": "Uh, ,no Einstein, the government does not determine interest rates: The Federal Reserve determines interest rates and the Federal Reserve is a private corporation.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwNjRriYOfJHTW0B5h4AaABAg", "comment": "The reason for the 2007-2008 mortgage market crash was the legislation introduced by Maxine Waters in 1993 that mandated bands make sub prime mortages or else be investigated for red lining. It HAD NOTHING TO DO WITH Glass Seagal, that is total nonsense!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxJ-PclyW_OOKhMAPJ4AaABAg", "comment": "👍👍👍👍👍", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzip7RDuNfRFyivGgt4AaABAg", "comment": "Mr Man: What is unique about Vega\" Me: It is a character from Super Street Fighters Mr Man: It is not a greek letter Me: Time for me to leave", "votes": "20", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyjtqJAEaBHSju7Hqp4AaABAg", "comment": "watch \"Quants The Alchemists of Wall Street - VPRO documentary\"....", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyctcpcLrTiFD3R-jd4AaABAg", "comment": "The shaky pain meteorologically spare because jelly unfortunately blink between a knotty growth. physical, unused mask", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_bKPPIWQeoK1XsqN4AaABAg", "comment": "I have been searching for beginner and intermediate courses on economics and finance, and to be honest quality content is rare as a rocking horse poo. As a CS grad student, I did not have a problem like this for topics in CS, EE, Math or Physics. I have come to the conclusion that you are almost the only top-tier higher education institution supporting the openness and accessibility  of knowledge to this extent, and I appreciate all the effort you put in this way.  You have played a decisive role in the success of many students from all over the world <3", "votes": "81", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw2Q4CS7MIgcKKDHhR4AaABAg", "comment": "Whose here because 2020 woke you up!! Personal development!!! 2021 -> let’s be smart with our money.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxW06RP2k_vJc1e9qV4AaABAg", "comment": "The lying novel epidemiologically fence because cable pathomorphologically like astride a pretty haircut. sophisticated, painful red", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg", "comment": "The wisest thing that should be on everyone mind currently should be to invest in different stream of income that doesn't depend on the govt especially at this time of this pandemic.", "votes": "14", "replies": "12", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyKgLqQMgYWSljvPb54AaABAg", "comment": "Gold mine. Thanks for the great lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyRyYecQHDUwbQSvh14AaABAg", "comment": "Big tks. MIT after payment == full boarding house ??", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwxcp9r3C-uMMXb8UZ4AaABAg", "comment": "Is he even profitable?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwbPjYG7riF-qRhfbZ4AaABAg", "comment": "linkedin.com/in/2sg", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx_8vHaBjPGz5IHM-54AaABAg", "comment": "Anyone can do this, high probability Forex Trading using a Dollar Index strategy, check out this FREE step by step tutorial & make 100 pips today, and keep doing it every day:   https://youtu.be/0zVFfuv3pu8 ☺️", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxAU0BNFbgHmRjigKt4AaABAg", "comment": "25:50 He is saying that government has the control on the setting the interest rate, but in the US the federal reserve is rather that decides it not the US government. The chair of the fed is appointed by the president only.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy2tZKwBZOmrQuxwEJ4AaABAg", "comment": "35:49 Vega is a made-up letter name.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzibCxwsSnJxN8IwmN4AaABAg", "comment": "So grateful for these videos.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyY-_rwgd5l2aurYRh4AaABAg", "comment": "i have same suit and tie", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyavGh-V7Nbl5v3LO94AaABAg.9I4VBCqYmu-9SyEXWYkUp8", "comment": "You went through university, yet you can’t even formulate a simple sentence..?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_bKPPIWQeoK1XsqN4AaABAg.9HrIQ2iFXIm9Mw800wioZX", "comment": "I’m a freshman, how do I start", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_bKPPIWQeoK1XsqN4AaABAg.9HrIQ2iFXIm9S6ytzeVj-d", "comment": "crypto is disturbing the stock market", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw_bKPPIWQeoK1XsqN4AaABAg.9HrIQ2iFXIm9Vk3CFct2tF", "comment": " @zhanying3788  Edx good place to start like me too", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRF-gxqRNZ", "comment": " Valez Tran  You're right. But with all this said, I can't imagine why lots of people are still poor out of ignorance.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRF4iKmtAp", "comment": " @alexbrynn9390  It's not about ignorance but unprofessional brokers in the market.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRVGP4BuFg", "comment": "How does this Bitcoin stuff actually works, I'm really interested and willing to start investing heavily right now?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRWEfc68gZ", "comment": "Although I started with $1,000 actually bcoz it was my first time & it was successful.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRWwQB6YoJ", "comment": " Maria Aquino  No exact amount but profit range from $1,000 to $6,000 depending on the coins fluctuation in the market.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRfEexpuCj", "comment": "I never ever wanted to believe that there's an investment I can invest in and make 10times of my start-up capital in one trade until I invested & received my profits myself.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9HRgV_NDBp3", "comment": " @sofiajohn7919  You can be there doubting & believing everything is a scam meanwhile others are getting richer each day that passes by.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9J0wvxMRyZe", "comment": "lollll this thread; \"Why people poor? Why not just invest in stocks?\" Most people can't even save up for an accidental expenditure these days, if you're watching this vid you're either better off or incidentally curious in something you can't afford to do", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9LYD6nCDt7v", "comment": " @viktorshaka1326  that comment is from 3 months ago so bitcoin was 35k :) did you make tons of money from it already?? 😂😂", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9L_2JNL4JKi", "comment": " @ozcanyldz1718  yes and I recommend you contact Mrs Evelyn T hills on how to get started immediately", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9L_2UcKD0dt", "comment": "‪+1 ( 6 0 9  )  4 7 4   3  2  5  1", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugyy6Hp3ndQ7shVgTOR4AaABAg.9HRC7YqHMIT9L_2cJWjEDt", "comment": "Here's her whats-app contact for more info on how to get started", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDK78r7uMR2nx01a14AaABAg", "comment": "This was one of the best lectures I saw, no fancy Superhero chest beating, humble and simple yet I understood it. Thanks a lot and may we all keep learning and earning.", "votes": "170", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyUr9jsNQmHXkytORx4AaABAg", "comment": "西格斯波色子地球第五元素，复杂程度难以想象，因为已经自动覆盖所有地球生命领地和自尊自有永有存在的质量水平，已经快到木星轨道了。", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg", "comment": "damn Im in an MIT lecture with a 1.7 GPA  THE INTERNET WINS", "votes": "1.7K", "replies": "26", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz6JHwBBILHB1HcTPZ4AaABAg", "comment": "Posting these lectures is an amazing learning opportunity for people online.", "votes": "9", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz2PhdwXOUs-6gOfN54AaABAg", "comment": "This is very helpful, Thank you very much for the effort.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzLTGokBdJpRs2bDnh4AaABAg", "comment": "Very hard to learn new words from sombody who cant pronounce them, such a heavy accent.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyNIik-yyHTFYfCci14AaABAg", "comment": "When did MIT hired Jing yang from Silicon Valley, it wasn’t part of the show ?", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwT0ceqzmegF12ot494AaABAg", "comment": "studying in MIT was always a dream. thank you MIT OpenCourseWare!", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugwp0b5CNCXT1dPrnEJ4AaABAg", "comment": "Is there a yt link for the full course?", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwGG4kcCDK-1ah6T3B4AaABAg", "comment": "And still we have people say college/university is useless in the real world. Pfft.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwfktdFR2LhIJtbPk54AaABAg", "comment": "Academic teach, traders trade. As one Navy SEAL said you have a plan until somebody start shooting.", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzcwBnksiWHlS-Ut2N4AaABAg", "comment": "Now I consider my self studying in Harvard 😋!", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzoDF3-RH3_uWT-hQZ4AaABAg", "comment": "When Vasily hopped on for the last 5 minutes everything went over my head lmao", "votes": "5", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzvf19Nww2EQngLB4x4AaABAg", "comment": "Introduction was covering too many sophisticated topics for 1 hour, and the last part was the usual financial BS we get from a Quant :)", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyzOH14-JIwPD3fDB94AaABAg", "comment": "What great content, I never knew Bitcoin trading could be so profitable until I met Mr. Jones, his unique strategy helped me make my first $8,310 profit with a small deposit of $1000, he is trustworthy and transparent.  You can all contact him by👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻     WhatsApp: +12812417257", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxJ3x6jLS7hUbMY14t4AaABAg", "comment": "The prof seems like such a nice guy lol", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg", "comment": "Wow, MIT got the CEO of Lau Security Investment Holdings to teach a class", "votes": "676", "replies": "44", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxLOFJeJePCKb4MZqp4AaABAg", "comment": "55:00 not a single student has good posture", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzSpjLFFqd2UPMKscN4AaABAg", "comment": "Reply to my comment and say mr krabs sold spongebob for 61 cents for good luck", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzRIG13q-MFSeaK8aN4AaABAg", "comment": "Everyone looks so weird without a mask :/", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwDK78r7uMR2nx01a14AaABAg.9Gw4hE7VkIp9SnUhexdyV3", "comment": "Thanks~~~~< for watching<>_and don't forget••• to hit the like><~button and if you want~<~advice and insight.....on investment...•\twasap ~⊕④=④=⑦=⑧=⑧=③=❷=⓪=❻=❺=⓪=⑦~👍", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwDK78r7uMR2nx01a14AaABAg.9Gw4hE7VkIp9_KdwdMBIRu", "comment": ":elbowcough:<fadwatrade700 VIA Te le gr am ... 📧📧", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9HeivHyz92t", "comment": " @j.c.d.7303  its beautiful", "votes": "18", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9IFwpX4-J3I", "comment": "something like that here too 🤣", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9IV4dL1l_KW", "comment": "Good hunting, Will!", "votes": "12", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9Ii75jQTOvk", "comment": "It was invented for this before it became weaponized by the communist takeover", "votes": "15", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9IrJnkFmkOl", "comment": " @realaxity  Can you recommend me a good one?", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9JkFNCiNmng", "comment": "Lol", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9K5itO7ccP2", "comment": "What did you do  with your class?  Me, took ages years ago and my GPA was 3.85. So which class dragged your GPA such low??  Gamble?? No S***  If you don't correct them back right away and all of the most essence from the lectures you had will be SHIT, once you get out of this MIT. Man, unbelievable LOW without any competition to finish prerequisite courses and fight with the others to enter the professional  medical college.    For those side dish courses out of my professional today is my golden professional ie Statistics. And there ain't a lot I really can chat in the society except of doctors and some others from university education background.   Well, Study hard, Bro.  BTW, I am from UU still proud of that school and appreciated for those prerequisite class and MIT On LIne Course. Seize your days.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9KOTOTVzBrn", "comment": "lmaooo", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9KdsDX0zSHM", "comment": " @regalsurvivor3418  Behold..... a pale horse", "votes": "6", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9KnKaXCmVAh", "comment": " @blacklightning7227  A great book that forces one to ask very big questions.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9MH5G8XsHkc", "comment": " @regalsurvivor3418  to", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9NI4_LEkp9o", "comment": "What an amazing world we live in. Literally no excuse not to excel!", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9OZf3xx6OeW", "comment": " @j.c.d.7303  h  ,", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9Ohdv1ZjUcr", "comment": "+ 1 6 8 1 4 3 2 0 7 3 2", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9OoKN41xrB9", "comment": "Bernardmoore_official on \"IG* has brought me out of poverty through investment i now know how to invest crypto i also made him my professional Broker cause i have being making a lot of \"profit ever since big thanks to Mr bernard moore", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9OwxZ37bp2q", "comment": "1.7 lol dude you really need to study harder than before", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9Ox0ithi_jT", "comment": " @Mike-ic1ur  I was a terrible student in high school. Recently graduated with a 3.9 at least", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9PXMHB7pu4X", "comment": "You win", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9Q9r-wn4H7y", "comment": "Ha!  Not even valuable or valid information anymore!!  This economy and the US dollar are doomed!  Have a look at the FRED charts on debt, M2 money, Mortgage Backed Securities. This charade wil. be over soon!!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9RcPGlgJ2bP", "comment": "LOL", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9S6ym6FPwoC", "comment": "crypto is disturbing the stock market", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9TJux2mg6zQ", "comment": " @regalsurvivor3418  You idiot, everyone learning how the world actually works IS the communist takeover.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9_QHHp3oMEM", "comment": "@Brian J pocket knife", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9_iNkqGBhP5", "comment": "good luck bro u will achieve better!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9a8JKcaE8hz", "comment": "that by itself is an accomplishment basically a 4.0 in every other state uni stay up", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxbYZcONRk5FJ_0G8t4AaABAg.9GnBY2FlqUG9cawIa34XlG", "comment": " @Lisa-ck5bm  I often use Excel.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugwp0b5CNCXT1dPrnEJ4AaABAg.9GG98BejQzn9GI0F1TMBHD", "comment": "Visit the course on MIT OpenCourseWare for the course materials: http://ocw.mit.edu/18-S096F13. Best wishes on your studies!", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgwfktdFR2LhIJtbPk54AaABAg.9GEHCdTMu0f9N0JhZUWf6z", "comment": "The academics are traders", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzcwBnksiWHlS-Ut2N4AaABAg.9GE9Jttuniw9dIIWL5wqkY", "comment": "this is MIT not Harvard", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9FtviCridEA", "comment": "Best comment I've ever seen", "votes": "38", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9FwV9FxCGpN", "comment": "AND he's Asian", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GI11IRhDzi", "comment": "Hahaha", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GI128cOD9F", "comment": " @David-ne2wx  you didn't get it", "votes": "9", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GI1LdHGkc5", "comment": " @KanjoosLahookvinhaakvinhookvin  being Asian is a good quality regardless", "votes": "8", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GI9H_h9ksC", "comment": " @David-ne2wx  not only did you not get it, you are now insisting that you got it even though we all know you didn't get it", "votes": "15", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GICMO8mtwB", "comment": " @KanjoosLahookvinhaakvinhookvin  I'm not at all insisting I was got it, sounds like you need to take a chill pill.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIHNDiYDAW", "comment": " @David-ne2wx  \"bro, you're an idiot and a faker\" \"yeah well... CHILL.\"  maybe I need to change my profile pic to a penguin to appease you?/", "votes": "14", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GII1maFJfp", "comment": " @KanjoosLahookvinhaakvinhookvin  You don't need to appease me my guy, don't know who you are or why you're arguing with me", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GILVTopmqs", "comment": " @David-ne2wx  I am not \"your guy\" penguin man. The fact that you see this as an argument with you as the victim is pretty telling. I informed you that you did not get a joke, and you tried to laugh it off and act like you did.", "votes": "7", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIOYWZ-bRt", "comment": " @KanjoosLahookvinhaakvinhookvin  sounds like you need to relax my guy", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIRUmbotbz", "comment": " @David-ne2wx  ahahaha \"you're an idiot and a faker\" \"CHILL\" \"you don't even know what's going on\" \"RELAX\" so scared you're wrong you're ordering me to shut up? you must live a really dull life penguin man.", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIRn8twlUa", "comment": " @KanjoosLahookvinhaakvinhookvin  I have an idea. You go rage at someone else online instead of me. And I'm not the one being an asshole it's you, reread this conversation lmao.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIW3wiIuzW", "comment": " @David-ne2wx  the fact that you think this is \"rage\" confirms that you lead a very sheltered life. maybe you really are from Antarctica. in either case I will take this opportunity to reiterate one last time that you are an idiot and a fibber.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIWSzpWZqE", "comment": " @KanjoosLahookvinhaakvinhookvin  I said rage at someone else, not continue raging at me", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIZielZCb0", "comment": " @David-ne2wx  See above. I believe it was you who said not to appease you?", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GI_qJ8x21M", "comment": " @KanjoosLahookvinhaakvinhookvin  I don't even know what you're angry about at this point", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIbJwXIYiT", "comment": " @David-ne2wx  you do not know anything - as discussed - because you still actually think I'm angry when in fact, I am delighted. also, your only way of responding to bullies is \"YEAH WELL YOU'RE ANGRY. BE NICE.\"", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIc_9dBtNV", "comment": " @KanjoosLahookvinhaakvinhookvin  No I actually know quite a bit. Probably more than you angry troll", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIeZqEpWRy", "comment": " @David-ne2wx  nigga you still have to look up who Lau Security's CEO is", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9GIeofyCWvK", "comment": " @KanjoosLahookvinhaakvinhookvin  Never looked it up nor will I. You're vastly overestimating how much I care pal.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9IpAWMidu_w", "comment": "they are always fishing for investors, you never know when one of these students might become the next tech billionaire.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9KM05j1wEZG", "comment": "😂", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9KVtAo5tvax", "comment": " @lilfr4nkie  dunno if you're kidding but I'm gonna choose to take this as a real compliment", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9O4Vec9Wz4s", "comment": "Asian jokes are how I know people have gotten nowhere in their lives lol. Anyone who makes Asian jokes are never around Asian people.  Guess where there are lots of Asian people?  Top schools/Ivy Leagues, big corporations, big tech companies.... it just tells me that's where none of you are lol.", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9P8wLuZwNl8", "comment": " @user-tz9jh6pv2j  I think the joke was because of the villain in the Batman movie. Looks just like this guy and does the same type of work", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9PbgfNnQhGf", "comment": " @KanjoosLahookvinhaakvinhookvin  ur weird", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9Pc7Z2UFblX", "comment": "best comment ever", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9PcMOTZzG5G", "comment": "holy fuck i wasnt ready for this comment", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9S6yrgzUcgb", "comment": "crypto is disturbing the stock market", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9ccX7rYToHp", "comment": "revolving DOOR is everywhere...", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9kGmtZBsM9G", "comment": " @erenyeager4452  So what we should do? 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9ln6ZZ8bK36", "comment": "AHa from Batman movie", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9ln9bvcYaD1", "comment": "Disrespectful, we are lucky to have free access to these lectures", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9mdj5e4hWtU", "comment": "repent for your sins and believe the gospel of Christ", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9rHOlQf4PAo", "comment": "And we can be in this classes from wherever we are for free .", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9vbaeyBTlIX", "comment": "I dont get it", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9xkInX5YplV", "comment": "Bhaag sala 😅", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPh9yA9SqTXYN3", "comment": "Lol, just watched dark knight yesterday 😂", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPhA-SNmajy8_P", "comment": "If I get him to you, can you get him to talk?", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPhA0Q9Z_KBlbK", "comment": "He’s good with calculation.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPhA2OWOWfr8bg", "comment": "I know a squealer when I see one, aaand", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPhA2bQbqh0ukh", "comment": "😂😂😂", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxdKUxvAty41cE4q5h4AaABAg.9Fegyyt1tPhA41dIRW8FPA", "comment": "You just made me Google it 😅😅", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgxLOFJeJePCKb4MZqp4AaABAg.9Fc_1xSikoW9H_kRRsRFUC", "comment": "this shit was boring af", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugx6OU_LWJhv_Jlffol4AaABAg", "comment": "Thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy3h7e0XOZI95ExUYR4AaABAg", "comment": "Most successful people started from nothing. They didn’t wait for the opportunity to knock but created the opportunity on their own by working hard. Thankgoodness i found  Mr. Carlos Kingston a pro forex trader I have been trading with for about 7 mounts now and I earn up to $15,000 weekly from the comfort of my home investing in forex. i guess this is the epic start to a new chapter in my life, I feel like everyone should be made aware of this opportunity and earn from it, feel free to contact Mr. Carlos @carlos_1uptrades on Instagram his indeed a genius.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-aQqFxgYZvyRLGGV4AaABAg", "comment": "This is GOLD information! I'm so glad that they did this and I'm angry I'm only finding it now! But better sooner than later. I can't afford to go to MIT, but finance is something I'm passionate about and I dig everything I can from the internet to absorb. Thank you MIT", "votes": "71", "replies": "3", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzo-mDapB9jBMbzcaN4AaABAg", "comment": "My name is Deepak Agnihotri and I'm from Mumbai India, I'm so honoured to be watching this video today on my birthday 🎂 This is going to be the best birthday gift I've ever received. Thank you MIT for sharing this lecture series. Forever grateful ❤️❤️❤️", "votes": "48", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy5_uMTYVNPXy_hJVZ4AaABAg", "comment": "Charming and handsome", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyVYS-FadbwAKyCWzB4AaABAg", "comment": "Chinese isiah thomas 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxH4Z3MOjRy5IO1-VR4AaABAg", "comment": "OK so finance courses pretty much same in most top 500 unis..  I been in top 4 In Australia and then top 16 in Australia.  The only difference was extra 30% harder assessments.  But content and information is pretty much same in finance", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyUiRNIZp4E4yGEFMB4AaABAg", "comment": "Wow  just looking to the Key Facts and find \" there will be no exam\" awesome, me \" you will be have your exam 2 in semester, and test every week\"", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw7I3wKZGx29Q3lbfV4AaABAg", "comment": "stimulating the algorithm", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxCa7LZFishjN9DCrN4AaABAg", "comment": "Everyday I do see reasons to testify about sir Mason and his great company on how they change my life financially on trading,, I never believed it.. What are you waiting for contact MR (JASON) on instagram @Jason_real.fx  or Whatsapp him (601)227-3847 and be a living testimony too.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzUjqW7ybfZxkeMtjp4AaABAg", "comment": "All through my trading with Mr Mason was success just want to thank him for sharing his vision, extraordinary ability and leadership guiding me at all times. I appreciate the efforts taken and will love to recommend anyone having hardship in finding a good platform to invest Mr Mason can serve you better for you can follow all his instructions and roles kindly reach him on Whatsapp:(601)227-3847 or his instagram handle @Expert_masontrading", "votes": "0", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxTsZ3wW7BtwVwgAmx4AaABAg", "comment": "https://www.youquerist.com/", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzwqmyexm1U5f4hTYB4AaABAg", "comment": "Thanks you..", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzA09GmjMLEMS84IcB4AaABAg", "comment": "lol Apple at 4.59, now it is 100...", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwJQFrI9MBbmbOX0Dl4AaABAg", "comment": "Melihat upaya kalian, keliatan sekali kalian yg butuh aku dan kimi,", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyUVOsuiz6onvYgnOF4AaABAg", "comment": "When it comes to money, trust the Chinese", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxFHd8GRMGyrgEALPB4AaABAg", "comment": "He is from The Big Short movie, trust me.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwYL4YTNRK1bBxeaU54AaABAg", "comment": "If you think you've failed in binary options trading, its a lie my friends because I was lost until i saw a post about Mr Young.I'm glad to introduce you to the most amazing manager ever , In fact all hope was lost until I met this amazing manager who changed my life for good. If you're interested in regaining all your loss you can get in touch with him via Instagram @you_ngli or send a email linyoun56g@gmailm. com", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy3g7HNppTT-DkpxJJ4AaABAg", "comment": "Asian dude teaches best fin math classes", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugxa-YjieHduqhSDJjp4AaABAg", "comment": "This is a general lecture not insights- frankly I felt asleep while listening", "votes": "3", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-aQqFxgYZvyRLGGV4AaABAg.9FNRjMW7BA_9MrFFdwHFed", "comment": "Same", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-aQqFxgYZvyRLGGV4AaABAg.9FNRjMW7BA_9WG2jz7YCPJ", "comment": "May i ask why you are passionate about finance?", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugw-aQqFxgYZvyRLGGV4AaABAg.9FNRjMW7BA_9WG5BRwmPx0", "comment": " @itsjustyana6323    @JustLou 2   Ofcourse you can. I'm passionate about it because to me it seems like learning the rules for a game I didn't know I'm playing, if it makes sense. It was an eye opening experience for me when I first started learning about finance and the economics of the world. I'm still currently learning more and more on my own. I'm not rich but also not struggling anymore. I do mostly stock market, long term. And I am more financially aware of my spending now as well.", "votes": "9", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugzo-mDapB9jBMbzcaN4AaABAg.9F3GbFaz34l9F3Om-1BhZu", "comment": "Happy birthday!", "votes": "42", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzUjqW7ybfZxkeMtjp4AaABAg.9ERZ_CHj9NV9ES08zNOJ4S", "comment": "Great you know Mr expert_masontrading on Instagram too, i invested with Mr Mason Luke and that has been my means of side income and saving since March", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzUjqW7ybfZxkeMtjp4AaABAg.9ERZ_CHj9NV9ES5_-mX6ir", "comment": "Investing cryptocurrency with Mason trading helped me a lot through this pandemic", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzpOc4iBuWGqsXSGUR4AaABAg", "comment": "No.  You don’t need complex mathematical calculations to understand or manipulate the market.  These concepts are well understood by loads of other people.  If everyone is using these mathematical manipulations, an investor would have no edge over the market.   People like Jeffrey Epstein will want you to believe that they’re investor gurus because the are mathematical geniuses.  But in reality, it is their ability to connect, obtain businesses, and take risks, much like gambling, who have control over capital.  Market makers will move the market in certain directions, due to whims and manipulations,  and when everyone does that, the mathematical models all go out the window, particularly in 3-dimensional chess like options trading.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg", "comment": "If only my professors were at least 50% of this quality and had at least 20% of the teaching method presented here.", "votes": "89", "replies": "7", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx03KJ2mAmhDEBtSCp4AaABAg", "comment": "Math is not financing.  That's quite the message.  Thanks for posting", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyGgXNmNLO_gDlQ4Kl4AaABAg", "comment": "“I don’t care where someone went to school, and that never caused me to hire anyone or buy a business,” Warran Buffet", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwLrY2M_wslIE-mPBt4AaABAg", "comment": "Who or what companies do you suggest for working with business finance?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwjHOfPuHy8SW7Fn6x4AaABAg", "comment": "This is really great. Thank you for sharing this valuable information.", "votes": "3", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyS1Z5AUkHeOFY3t3R4AaABAg", "comment": "Just saying      No one search for this", "votes": "1", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzTl-hfP0r1s889XyB4AaABAg", "comment": "Thank You _ and safe be Mr. Xia.      p.s. ying and yang", "votes": "0", "replies": "2", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyNFMlrkMnBbvzc5sN4AaABAg", "comment": "Does anybody know where to get the solutions to the problem sets?", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz6mC7WtoOcd6yv8eJ4AaABAg", "comment": "🎎", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugzu4lUd1MYsTVFu3Y94AaABAg", "comment": "He sounds like Borat!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzWVW1Z8LyviSR_VGF4AaABAg", "comment": "This guy looks like a stereotypical guy who works in the Finance Department", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgykssB0htHz9LSfeF54AaABAg", "comment": "e    https://m.youtube.com/watch?v=G9KPq9TBSlA&t=668s", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgykrQ5HrATmYf0bjJp4AaABAg", "comment": "Didn't know Pete Lau was an MIT professor lol", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugz0gFPwe7r_sel7wit4AaABAg", "comment": "是 华裔", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugyle8nuq9b4odcoIft4AaABAg", "comment": "Demand distribution population control.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwJ719Co076C1_AK7N4AaABAg", "comment": "Finally something that bridges the gap between concept and application in real life", "votes": "5", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzkMjSImy0sXzk9Buh4AaABAg", "comment": "biztos nem megyek sehova . majd ha kifizetétek a jogdiajm az utolso centig :)))))))a jogdijam változatlan 900 milliárd euro/havonta/csatornanként 17 év re\r +késedelmi kamat +80 % minden ertékesitésbol :))))))) számolási alap 170\r csatorna /17 évvel:))))))))))) és igazán leszarom ha mégis túl sok\r nektek:))))))))))))))\r és egy centet nem engedek el belole:)))))))) hiába halogatoad a kifizetést\r ez csak több lesz :AI:)))))))) + a google térkép számára 10 milliárd euró a\r kilométer ora feltüntesért járó jogdij :)))))))))))) azt akarjátok dolgozam\r nektek nagy csicskák:))) akkor sajnos ennyi az ára, de nincs semmi gond ha\r azt akarjátok ne dolgozok nektek akkor is ennyi az ára:)))))))))))) ezt is\r boszoptátok:)))))))) adom a nagyhatalmaknak :)))))))))) nagyhatalmak\r elbuknak :))))))) én pedig nyerek:)))))))) megmondtam az eljen . nincs\r jogdijam megfizetve nem kaptok semmit :)))))))))milyen kár engem nem tudtok\r megolni sehogy :))))))))))) de probálkozatok még 50000 évig :)))))", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugx6BjmY5V1o_tzkbK94AaABAg", "comment": "Am short of words for the amazing profit you helped me earn in just a week ,am so sorry I doubted at the beginning, Mr Jerry. it's was because of my past experience so I didn't know who to trust, I invested $500 and earned $6000 in just one week, and kept on investing more, today I am financially successful, you can contact Jane Mr Jerry for same help on WhatsApp +971 58 614 8037 Email: jerrywakerfield204@yahoo. com", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwWXj_mxyTeFeTu7WB4AaABAg", "comment": "Wow I don't think I even need to read the textbook after this lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9MJMIzuLKvo", "comment": "teaching is incredibly hard. cut 'em some slack unless you can tell they are phoning it in.", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9MJP6EdV0Ju", "comment": "While I do agree with teaching being rather difficult,  however, I would think that after 18 years of school (2 universities) I would be able to tell the difference in quality, but then again..", "votes": "2", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9Q2z02ldKY8", "comment": "...And you were 41.762% of the quality of MIT students😅", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9Q3LZPfdl5K", "comment": " @PzZulqar  I don't particularly get what you are saying, however, I wish I could at least attend MIT or have a chance at it. :))", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9S9ZGJFjHNh", "comment": "You would have the chance if you paid for an education at an MIT level school", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9SmI88DCx12", "comment": "Love the display pic, Ruxandra!", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgycADBO_oPS2YS29ix4AaABAg.9DNgOL1oMwP9TrUicHrvWa", "comment": "This guy is average at best in this video.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyGgXNmNLO_gDlQ4Kl4AaABAg.9DE7Wxh5Rx29Fd2oNmHZx0", "comment": "I wonder if this is a fact or just him being nice.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyS1Z5AUkHeOFY3t3R4AaABAg.9D8Rg_xAKUV9DCE3Z_xVBp", "comment": "I did", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyS1Z5AUkHeOFY3t3R4AaABAg.9D8Rg_xAKUV9DCaEMBYPwg", "comment": "Jairo Alves 😭", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzTl-hfP0r1s889XyB4AaABAg.9D4w02_LPYW9L2l2Bzu3N3", "comment": "Why yang yang ?.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgzTl-hfP0r1s889XyB4AaABAg.9D4w02_LPYW9MrvTJDPT0Z", "comment": " @MontyGumby   transparency in business, can be viewed, in at least three ways , that i know of ; 1. ignored ,   2. adjusted in or out , and/or coupled for gains .......", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugz6mC7WtoOcd6yv8eJ4AaABAg.9D1jIgWtqnG9D1o2Ny7QWM", "comment": "It was a greatly refreshingly introductory to behavioraly effecient markets at play.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugxpit6v0CBS701knoZ4AaABAg", "comment": "Why is he Asian? Isn't that a little racist?", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugw1hN3JJwTX0GsoPmx4AaABAg", "comment": "I am not even in finance why am i listening to this", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgygA1as8DfGPjVzLl54AaABAg", "comment": "the guy is smart...", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxCPKBSmIrkWwHZkP54AaABAg", "comment": "88 Bullard St, Sherborn, MA 01770 for sale .tel  9494000992", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwN14uTY59xiBrSZ-d4AaABAg", "comment": "Thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyJdnf_oly4B2mNe9B4AaABAg", "comment": "yes it is good", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy4YP3wva1Hg8xl-q94AaABAg", "comment": "This is lousy course", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwFeSEZFs8JB_tMOVR4AaABAg", "comment": "MIT is really not good for Finance . No match to its engineering lectures !", "votes": "0", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxrFFi3w-_xuUbDHfp4AaABAg", "comment": "This is amazing! Thank you", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugww_rAy5TpB-0sItn94AaABAg", "comment": "He's a wonderful professor! Thank you MIT!", "votes": "19", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxY2lYO0359VtCrRb14AaABAg", "comment": "Is this the actor from the Big Short, with the smirk face CDO manager ?", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyboivJ3OQHZIsoQhh4AaABAg", "comment": "What a small classroom, good for MIT students.", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwVWB-J5pnXWVpbfgF4AaABAg", "comment": "Informative content For Finance and I'm thankful to MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg", "comment": "Some notable timestamps: 01:54 Key facts about the course 11:47 Background 30:10 Introductory examples 40:49 About Financial Mathematics 54:42 Real life applications / Projects", "votes": "1.3K", "replies": "29", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzbDCcjTo75dbtEwRl4AaABAg", "comment": "hahah, co nhieu len nua thang phat xit tuc toi nhuc nha oi, loser ever!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugy85pMlJV2Ag2oXbBd4AaABAg", "comment": "Thank you for this video, great tutorial.", "votes": "1", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgxE0Gx5BTZrpfC2aF54AaABAg", "comment": "Very informative. Pandemic days went good with MIT", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgzS8XCZW_ev9d-Jnep4AaABAg", "comment": "q: why do I tell you that story? a: because everybody who claims to have anything to do with finance says they have worked for Morgan Stanley. Do you think the US financial crisis was really about real estate? You don\"t think debt banking might have played a little role? Recommend finance majors also take a look at something like Gesell rather than sucking this up straight!", "votes": "0", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "Ugytl4mB1mDqfAQPZ5d4AaABAg", "comment": "kinda frustrating how slowly he talks..", "votes": "1", "replies": "1", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgyCAZRcv0zGAI_S8LV4AaABAg", "comment": "I am replaying at 1.25X and it still feels slow lol", "votes": "2", "replies": "", "reply": false}, {"vid": "wvXDB9dMdEo", "cid": "UgwFeSEZFs8JB_tMOVR4AaABAg.9ByLg1-f95W9RyhZhVAi3i", "comment": "WHARTON SCHOOL OF FINANCE IS # 1 jb.ok", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "Ugww_rAy5TpB-0sItn94AaABAg.9BkPWaanRMX9YyXz6yKEnL", "comment": "https://youtu.be/w_YaUQJAQSU.", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09C6K3iSCDYh", "comment": "You're a saint.", "votes": "17", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09C9o64UGfD0", "comment": "Thanks", "votes": "5", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09D-Xx5iW5JG", "comment": "I am so glad I didn't have to pay for this course.  It's usability is just theoretical... Lots of blah blah blah, throwing terms without explainging \"swap\" this that, and students sit and nod as if they understand a thing... Looks like a 1 man show demonstrating his superiority instead of explaining. If every student has to find an answer to every term he throws, then why do we need this course? This edu is such a rip-off.", "votes": "14", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09DMPPG9BYX7", "comment": "Its literally the first lecture, chill there are going to be 16 more weeks...", "votes": "14", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09H3vS35NOaR", "comment": " @DanOneOne  you're basing one class lecture on the whole course looool", "votes": "8", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09IsANaMrNhr", "comment": "On 54 minute is he Russian???", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09KgoycnrTtX", "comment": "thank you a million !", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09OGXu2JwxWG", "comment": "Are you from heaven?", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09OeZxploJ-I", "comment": " @StorytellingHeadshots  urrrm where is the 2nd 3rd........16th lecture , please can I have access??", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09OpaKlE3mJ1", "comment": "People like you make the world a better place", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09RD_7B14fM-", "comment": " @DanOneOne  Thanks for the critical response. Alot of people are praising but aren't explaining why", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09REJbiAtlMb", "comment": " @navigatingel6104  exactly. As if they understood something. Ask those that praise to explain 1 concept they believe they understood in their own words... And ask them the questions you wanted to ask this professor. You'll see they didn't understand anything...", "votes": "1", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09RXhGQsvR_7", "comment": "Sweet", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09R_NzLnOqkf", "comment": "Comercial bank 1999 raising Capital tnis many come bank you have stok", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09S6ypXkx3bc", "comment": "crypto is disturbing the stock market", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09U4F-p79Xef", "comment": " @joelevans8038  ei ancholot bosbas korisil tetiyao ketiyaba kono jatir lok eyaloi durotto arthat 2 bosor dhori nijor nijor daayitto bohon kora", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09VOzWgJXEKu", "comment": "Loaw", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09W-ux9PrHDy", "comment": "New original Make Btu6+ in Malaysia for They hear about Yess Countrys Drive to Godurthrsa Have Gwodu Hi friend Request you Roosedullah in Dubai Live Long Timed Country Job Mababy Goduthsara but BackLive To Ctitagon Lifed Boy Greenwood My is", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09WXBHLtePm4", "comment": "agggggmwwwwwwwtsddp?lmlmkn  mm?xjbbjknjjaqa", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09_aaUJHk3qC", "comment": "The real mvp. Thx", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09_yIQeVlikG", "comment": " @safwanpatel6400  https://www.youtube.com/watch?v=wvXDB9dMdEo&list=PLCRPN3Z81LCIZ7543AvRjWfzSC15K7l-X", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09a1BOs_6c_n", "comment": " @DanOneOne  As soon as you said, \"... it's just theoretical...\" that immediately demonstrates your lack of the most BASIC understanding of science or really STEM of any type at AT ALL. The very first basic understanding you have to grasp is the use between the words HYPOTHETICAL & THEORETICAL. Right now you're speaking as if his subject should've been categorized as a hypothetical type situation or classification. I'm not really sure 🤷🏼‍♀️ for 💯%⁉️ I DO KNOW THAT theoretical representations in textbooks provided to the STEM courses are MUCH MORE FACTUAL having been tested over long periods of time. Years even decades, centuries, & millennials even, also stretching over the planet 🌎, as in many different countries that can be represented by private businesses, government funding (capitalist, socialist, communist & Dictator s societies we all funded space program & working together & apart) also many different Universities & so many other independent grant projects out there doing their own thought experiments & then these scientists submitting these journals for peer review ‼️ EVENTUALLY after enough interest is accrued for others to test your work to TRY to get it to fail I mean EVENTUALLY other scientists, you know your peers, & the publications will claim it as hypothetical, understand everyone⁉️", "votes": "3", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09a1BgzhPA6F", "comment": " @DanOneOne  Go ahead ask 🤷🏼‍♀️.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09a1CvpTZHvR", "comment": " @navigatingel6104  Well ok I can say make your point to ask ppl to get specific in their comments without praising this ABSOLUTE REDICULOUS COMMENT‼️ He doesn't seem to understand this is a course from MIT so I'm SURE High School 🏫 PRE-ALG or ALG ISN'T GOING TO CUT IT‼️You probably have to have some STAT101, FIN101 & 102, ACCT101-103, ALG101-103 some business courses, ECON101 MAYBE 🤔🤷🏼‍♀️ SOOOOOO MY POINT 👉 LOL NOT A VERY BEGINNER CLASS but also not a super advanced class either IN MY OPINION, this auto played after a different financial video I was watching.", "votes": "0", "replies": "", "reply": true}, {"vid": "wvXDB9dMdEo", "cid": "UgyMUt3DVZXOfNb9A_14AaABAg.9BPP8EHBON09b0fyg-Fd85", "comment": "l0", "votes": "0", "replies": "", "reply": true}]