[{"vid": "xrf6I_5vX64", "cid": "Ugxx3b-I7OCBtMo39cx4AaABAg", "comment": "goat", "votes": "0", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "Ugzux4SUC6UGRycDP5l4AaABAg", "comment": "4:32 how to increase the voltage/current?", "votes": "0", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgyEzvZhnX8EIJ2DgD14AaABAg", "comment": "I was always confused by the description of current, I always thought of it as simply the flow of electrons, and never considered the counter forces  acting upon protons. I did not know that current motion was opposite to electron flow. This caused me no small amount of confusion  when watching videos from people who understood this concept. Thank you for an excellent explanation..", "votes": "6", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgwLnGKEP_eDShml3eR4AaABAg", "comment": "hmmm but wait, according to Ohm's law voltage is directly proportional to current though, so isn't current supposed to increase anyway if we increase the voltage by combining two batteries in series?", "votes": "3", "replies": "3", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "Ugwh-kr13sRoUcmRPX14AaABAg", "comment": "how does a battery generate electric field pls tell me", "votes": "1", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgyS_5abZkieqPMXQRJ4AaABAg", "comment": "Suppose we have a 5V battery connected to a wire.. and how do battery give 5j of energy to electrons that are present in a conductor", "votes": "3", "replies": "3", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgxKdkWpPaNbjS7SyMt4AaABAg", "comment": "Speak up!!!!!", "votes": "3", "replies": "1", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgzfuD8gDGJpDr6EIn94AaABAg", "comment": "isn't putting the batteries in series going to also double the current in your example? If resistance is held constant through the circuit, then doubling voltage means you would have to double the current?", "votes": "6", "replies": "1", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgzvdBS0KqUVZMlvH2h4AaABAg", "comment": "thank you", "votes": "3", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgxAD6T9O36jGsOJxpB4AaABAg", "comment": "This is one of the very few videos on YouTube that discusses the electric field that is established in the conductor (starting at 2:00). It is this electric field that causes the electrons in the conductor to move as so well described! This cannot be stressed enough, and is something most other creators on YouTube have ignored. The source of the electric field is in fact the battery. A battery does not provide or consume electrons to the circuit per se, in the manner as most people think, but it provides the electric field which provides the force to the electrons that causes the electrons to move. Then a chemical reaction in the battery \"absorbs\" the excess electrons that happen to collect at the positive terminal (technically \"reduction\"), while a complementary reaction (technically \"oxidation\") provides extra electrons needed in the circuit at the negative terminal, but which are really created to balance the reduction reaction. They just happen to be available for the circuit which makes the whole thing work. Again, thanks for discussing the electric field!", "votes": "20", "replies": "5", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgzTuuC1CCWD4sfEZZh4AaABAg", "comment": "I LOVE U SO MUCH :)", "votes": "10", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "Ugw-UwNX9cyPZS1TTSx4AaABAg", "comment": "I love you", "votes": "2", "replies": "", "reply": false}, {"vid": "xrf6I_5vX64", "cid": "UgwLnGKEP_eDShml3eR4AaABAg.9J3RMShhfX69RM3fqDnhBZ", "comment": "Batteries have internal resistance, so you are still adding Rb1+ Rb2 +RL to obtain your current.", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgwLnGKEP_eDShml3eR4AaABAg.9J3RMShhfX69am8OmqHG2s", "comment": "I think he means to increase the amp-hour capacities of the batteries, maybe? Connecting two batteries in series increases the voltage but not the amp-hour capacity.  Connecting two in parallel increases the amp-hour capacity but not the voltage.", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgwLnGKEP_eDShml3eR4AaABAg.9J3RMShhfX6A6fG8GaJMAA", "comment": "V=IR 1.5v=10A×R__________(1) 3v=I × 2R ____________(2) (2R since internal resistance is also doubled when connecting another battery of the same resistance)   Simplifying the two will give I = 10A", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgyS_5abZkieqPMXQRJ4AaABAg.99zp-KIFQ_D9KcSm3a_Fih", "comment": "Did you find out the answer?", "votes": "1", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgyS_5abZkieqPMXQRJ4AaABAg.99zp-KIFQ_D9KcTA2J2MVy", "comment": " @tanaka7391  no........ brother", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgyS_5abZkieqPMXQRJ4AaABAg.99zp-KIFQ_D9am6w5JFRrT", "comment": "@lalremruata this is pretty late, but if you're still wondering how to get 5 J from a 5V battery here you go.  If you know how many volts you have and you want to know how many joules of energy your circuit is using it also requires knowing the resistance of the circuit and the time.    Let's simplify your question by saying you have a 1 V battery and want to know what conditions would supply 1 J of energy.  1 Joule of energy (E) is dissipated by using 1 watt of power (P) for 1 second (t); E=P×t  1 Watt is the amount of electrical work performed when 1 ampere of current (I) flows across a potential difference of 1 volt (V). P=I×V  1 Ampere is equal to 1 volt over a resistance (R) of 1 ohm; I=V/R.  By substituting you can combine these formulas into one: I=V/R and P=I×V therefore P= V^2/R. P= V^2/R and E=P×t therefore E=V^2×t/R.  So, in order for a 1V battery to supply 1J of energy, it has to be connected to a circuit drawing 1 amp of current across a 1 ohm resistor for 1 second.    If you want a 5 volt battery to supply 5 joules,  you have to change the values of the resistance and/or time so that the math in the formula E=V^2×t/R comes out to be 5 joules. For example, 5 volts across 5 ohms for 1 second, 5 volts across 10 ohms for 2 seconds, etc.  Does that answer your question?", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgxKdkWpPaNbjS7SyMt4AaABAg.98Mo2kPmMMC98v0PQc5ygu", "comment": "Fuck sake I’m trying to learn how to buy this makes completely no sense", "votes": "2", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgzfuD8gDGJpDr6EIn94AaABAg.98J9GteONZ79MPA8SZQgR-", "comment": "No because batteries have internal resistance. Use ohms law.", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgxAD6T9O36jGsOJxpB4AaABAg.8wTXUReUDez8ypGnnEpytZ", "comment": "@SorenSolveig Thank you for making me understand more about the battery.", "votes": "4", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgxAD6T9O36jGsOJxpB4AaABAg.8wTXUReUDez9DR7G2qNjN7", "comment": "Can you tell @soren solveig how battery generate electric field ?", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgxAD6T9O36jGsOJxpB4AaABAg.8wTXUReUDez9RMBECj-IMu", "comment": " @shubhamkiranbadgujar1443  Batteries are your source of electrical energy.  For a typical alkaline battery, electrical energy comes from a oxidation reduction reaction between  the chemicals in a battery. Durring the reaction electrons are liberated and collected on the annode.   Once there is more electircal charge on one surface than another, you have a potential difference.  In fields - I am not sure why he even brings this up - the electric field is perpendiculat to the conductor and is a function of distance from the conductor.", "votes": "1", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgxAD6T9O36jGsOJxpB4AaABAg.8wTXUReUDez9TdE56bCGQ7", "comment": "Ikr man there so many people who think batter provides the charges battery does not provide charges it just creates a potential difference for the already present electrons in the wire", "votes": "0", "replies": "", "reply": true}, {"vid": "xrf6I_5vX64", "cid": "UgxAD6T9O36jGsOJxpB4AaABAg.8wTXUReUDez9xk6fMs6YHZ", "comment": "i'm no expert but i'm not sure what you mean. Batteries even in what you say, are providing electrons and consuming electrons. Maybe you mean the battery doesn't push the electrons through the circuit, it provides an electric field that pushes them? You've said batteries don't provide electrons the way people think, but then you've stated that they do provide electrons. So maybe you should state what you think people think?!", "votes": "0", "replies": "", "reply": true}]