[{"vid": "XxvD0Yh9qCM", "cid": "Ugy41DIHxPx6nnIILIh4AaABAg", "comment": "THanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgwF7X7ugEqF9iDvLwp4AaABAg", "comment": "36:30", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "Ugxzki5VcvKp80db3pF4AaABAg", "comment": "14:38", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgxiOUTn9PJ5ZzGKAFJ4AaABAg", "comment": ":face-red-heart-shape:", "votes": "1", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgwdMecbLLVDRILRIAp4AaABAg", "comment": "Absolutely well done and definitely keep it up!!! 👍👍👍👍👍", "votes": "2", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgwZzvfdGOTrEVtI8rV4AaABAg", "comment": "Freeze the slide-image @ 3:45  They are so close to making several good points I've found from other Intro-to-chem professors. Ammonia (N-H3) + \"Strong Acid\"   is just a step away from the synthesis of Urea & how to manufacture fertilizer. Replace the words \"Strong Acid\" with Cyanic Acid (H-N-C-O). In this reaction (N-H3) + cyanic acid (HNCO) will stabilize as Urea, which is a C=O with two (N-H2)'s attached at the carbon. Urea is important as fertilizer because it's stable, you can buy it, take home, put on plants and water it. Once you're home & add water, that releases the ammonia, splitting the Urea making (two) ammonia & CO2 (one). Furthermore, I recall this Urea being the first synthesized organic molecule. It was first created by a German chemist (Kolbe, who then had to invent the word \"synthesize\" to describe what he had done) which completely disproved the early chemical doctrine of Vitalism that teaches \"only living things can create the organic compounds needed for living things.\" [Kolbe is most remembered to history though for his vicious dismissal of the direction being taken in chemistry research by people like Van't Hoff (<--Who eventually received the first Nobel prize)]", "votes": "2", "replies": "1", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "Ugj7acs2CUGORngCoAEC", "comment": "Did no one in the class notice the typo in the clicker question?? 0.184 is supposed to be 0.0184. I'm sure that threw some people off.", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UggT2r_-VxJgC3gCoAEC", "comment": "I hope all who watch this know about the titration thief greatest trick ever!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "Ugh3-jUB1d6J6HgCoAEC", "comment": "I'm doing a little more intense, related matter in high school.", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgzQjQAop_gkW8tGzRB4AaABAg", "comment": "Wow MIT Chem is intense! At my University we didn't encounter we saved this material for the second semester", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgyqFJR6cT4sq1RKoId4AaABAg", "comment": "excellent lectures,pls make such more lectures for phytochemistry", "votes": "0", "replies": "", "reply": false}, {"vid": "XxvD0Yh9qCM", "cid": "UgwZzvfdGOTrEVtI8rV4AaABAg.8hRaU09V1Ce8hRbwvTFuGh", "comment": "Also, Ammonia accepts protons from the cyanic acid molecules before stabilizing as Urea, thus explaining why fertilizer plants in Texas sometimes blow up. (Reference sources: Yale's Organic Chem intro courses, Stanford's Intro to Chemical Engineering, Georgetown's Ron Davis in the BioChem lecture series he created for T.T.C;  & finally Kolbe's Wikipedia page)", "votes": "1", "replies": "", "reply": true}]