[{"vid": "ywl3pq6yc54", "cid": "Ugy6KDVYXLzKtv_xBGV4AaABAg", "comment": "55:00 Utilityfunction", "votes": "1", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwrYOK4pk_xKdjHYLN4AaABAg", "comment": "I can't believe how great this is! I recently read a similar book, and it was absolutely incredible. \"Game Theory and the Pursuit of Algorithmic Fairness\" by Jack Frostwell", "votes": "1", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwHWwzB3PC1xM8MZYh4AaABAg", "comment": "11:31 What's really remarkable is we get a reduction in volatility while improving the return 12:06 Not only does the return go up, the volatility goes down 16:11 Trade-off on return and volatility (when deciding how to allocate) (higher return, higher volatility) 17:53 What if we have a -1 correlation?  The variability is 0 (your only gain would be from risk-free rate) 28:51 Let's maximize the return subject to a constraint on volatility 32:08 What if we want to have some money in cash (risk-free assets) ? 35:20 We're able to improve over the efficient frontier, have a higher return and lower variance  than the previous minimum variance portfolio that had no risk-free assets 41:56 Tobin's Separation Theorem: every optimal portfolio invests in a combination of the risk-free asset and Market Portfolio 47:00 How much risk are we willing to take? Extra risk, extra return 48:27 Read these papers (shows list of articles) 52:22 As you get more wealthy, the marginal benefit of additional wealth isn't as much 58:10 Holding constraints: don't want to hold more shares than the usual trading volume 1:01:19 You can limit your exposure to certain factors  1:02:32 Sometimes you want to neutralize your portfolio to the market-risk factors 1:06:36 (What would've been optimal allocation amongst 9 sectors?) 1:08:01 Don't invest more than 30% in a single ETF (in scenario) 1:10:54 If we want higher return, it takes higher risk 1:12:14 What if we reduce capital constraint from 30% to 15%? 1:14:40 The efficient frontier is lowered. For higher returns, DON'T allocate too much to higher risk ETFs", "votes": "19", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgyXO-BnwvdKqFpgvMF4AaABAg", "comment": "In addition to having a return equal to the risk-free rate, wouldn't a zero-volatility portfolio's growth also have to resemble a perfectly straight line?", "votes": "1", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwVJZ90GE9dmihRwah4AaABAg", "comment": "It would seem that the special case of -1 correlation using derivative investments would result in a return of zero minus fees, no?", "votes": "2", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgxBo1V1_teT71ouN5Z4AaABAg", "comment": "I always wonder if these professors are rich; and if not, why?", "votes": "2", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwfD3hC12IWnGeayTR4AaABAg", "comment": "Good", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugxeq6fIZWVcZHoKiSh4AaABAg", "comment": "thanks for the content", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg", "comment": "😇😇Great video< and some excellent tips! This is a scary time for new investors but the best thing you can do is not to make decisions based on emotions. This could actually be a good time to buy more of your high conviction stocks or crypto on a discount. Wealth is created during bear markets, not bull markets. If your portfolio is really effecting your mental health then delete the app and go for a walk. Let the market do its thing and have a long time horizon. I buy and just trade long term more than ever, I have made over 16` btc from day trading with Bruce Cartwright in few weeks this is one of the best medium to backup your assets incase it goes bearish", "votes": "32", "replies": "8", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugz54Bg3VLsdtA3S8gl4AaABAg", "comment": "Why doesn't the capital market line model address the 4th quadrant in the Cartesian plane? Depending on your time horizon, the expected return on the market portfolio could be negative...seems like the model is incomplete or overly optimistic.", "votes": "1", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg", "comment": "19:13 \"0 variance means that it's value is a constant\" ... my PhD is in probability and this is the typical interpretation but not exactly true. If a random variable has 0 variance, then it's constant almost surely. The difference is in this and what the lecturer said is a matter of measure. For example, if we flip a coin infinitely many times and count how many are heads, tails, and how many lands on it's side, we'll find that out of the infinitely many flips, only finitely many (a set of measure 0 according to the counting measure) land on their side. It is not true that a coin won't land on its side, only that the measure of relative frequency is 0, i.e. it won't land on it's side almost surely.", "votes": "2", "replies": "6", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugwu5oo1yy7Pz2R7qfB4AaABAg", "comment": "Will definitely take notes on this later today. Seems of great quality. Thanks for the upload.", "votes": "5", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugz4pfuofOY0mlOV2A14AaABAg", "comment": "Lost…", "votes": "2", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzsfZQBrcvaLjdeHAV4AaABAg", "comment": "This is awesome!", "votes": "1", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgygwIuUgxvwDDwYMqN4AaABAg", "comment": "What 😂", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgxJKKbaLX78C_gVYv94AaABAg", "comment": "This is just \"theory\" and rules for the working class. The rich have special rules for themselves.  That's why the rich hate crypto. 🤑", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzyXm7Muo7kl5iyLnF4AaABAg", "comment": "Life is a wonderful opportunity and journey and it must be Appreciated And Celebrated Happily Hopefully And Abundantly.", "votes": "3", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzZb2bTeZdDs0FoMBV4AaABAg", "comment": "Ty", "votes": "1", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg", "comment": "It’s actually much simpler than this. You buy the dip and you diamond hand it. Then you buy the dip and diamond hand it.", "votes": "48", "replies": "10", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwveMZ4PK4oZlMw8oR4AaABAg", "comment": "the man should speak mathematics, but seems that mathematics is speaking the man.", "votes": "1", "replies": "2", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgyXO-BnwvdKqFpgvMF4AaABAg.9lMdobRA7Gv9wk-E1jROsS", "comment": "I'm no expert, but my guess is that if you factor in dividends (or whatever the risk-free return is), the portfolio would actually grow and therefore it wouldn't be a straight line and instead would be a slightly up-trending line.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwVJZ90GE9dmihRwah4AaABAg.9lMd6-Xm2Fm9wk-SCl_de_", "comment": "I'm no expert, but I think you're right.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bRzRo5P79q", "comment": "I made $123K on ADA/USDT from signals dropped on the group.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bRzTheaBxo", "comment": "I trade BTC long and made a killing. He mentioned it on the group for everyone to buy BTC on Long.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bRzatYERYL", "comment": "The volatility of the market has become a blessing for me all thanks to Bruce Strategy I am now a whole.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bRzsAKltK0", "comment": "How can I join his program ?", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bRzweM2WDb", "comment": " @ping6447  He's on Telegram   :yt:", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bRzywVerQm", "comment": " @ping6447   @Brucecart               :yt:", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bS-4tzHO2O", "comment": "I started trading 6 months back when  Bruce taught me how to do it. This Strategy has a good entry point and exit point.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugw0qeHCp7EnSE92fex4AaABAg.9bRzOf8Ltcg9bS-7Zl9PwH", "comment": "I recommend Bruce to all traders and investors worldwide.🌍🌐", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg.9ayQNQ9_qDG9g7goXl29bI", "comment": "Bro if you are going to criticize at least take the time to write a decent counter example. In your example the set of outcomes is countable set hence every event in your sigma algebra is countable and therefore has measure zero. Does it mean that if you flip a coin nothing happens? No, obviously not. From the beginning in the study of probability we divide the set of outcomes into two cases discrete or continuous. As you pointed out the counting measure which is just the cardinality of the event has a value 0 only when it is the empty set and by the axioms of probability it must be 0. You are applying a the measure for a continuous or aleph 1 set to a countable set. Mr PhD.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg.9ayQNQ9_qDG9g8SYKCg3qT", "comment": " @aravartomian1  Oh goodness, where do I begin.... \"Bro if you are going to criticize at least take the time to write a decent counter example\" I think my example is somewhat lost on you because the generalization isn't clear -- that almost surely does not mean always.  Yes, you are correct, the counting measure typically just 'counts' how many things are in a set, but remember we're in the context of probability here where total measure is 1. It does not make sense to only be able to count up to 1 thing. Thus the measure must be scaled in such a way as to preserve total probability. This is not so well defined at infinity, but it's clear for a finite # of outcomes n that we can simply divide the counting measure by n. Take n to infinity, and it's clear that finite sets have measure 0. This is what I was referring to.  Another more classical way to think about this is that for finitely many flips, the counting measure can be used to approximate the probability of a usual coin flip (1/2 heads, 1/2 tails, 0 for the side) by simply recording relative frequency and there you get the theoretical probabilities in the limit (including the 0 for the side) but this 0 for a coin landing on its side neednot have a recorded 0 occurrences out of infinitely many flips to have probability 0, it just needs to be finite. That was the idea I was trying to get across, that almost surely doesn't mean always. My apologies if my wording was otherwise rude or improper.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg.9ayQNQ9_qDG9g8WV_856yv", "comment": " @deadduck8307  all I can tell you is that you need to go back to the foundations of probability theory and understand the difference between continuous random variables and discrete random variables. Your example is clearly discrete random variable and the measure you define on your sigma algebra is not clear what it is. All I am saying is that you can not apply the same measure from a continuous set to a discrete set and expect to have the same properties.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg.9ayQNQ9_qDG9g8Y4K8RTnP", "comment": "​ @aravartomian1  Dirac Delta may be the counter example for that -- though it occurs to me that in the discrete case, the dirac delta function wouldn't be necessary, though the random variable would behave identically (in distribution) with a continuous or discrete support if the dirac delta function were used in the continuous case and the discrete support contained the one point of non-zero mass.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg.9ayQNQ9_qDG9kfxw1YYOfa", "comment": "It's a valid criticism but it feels like you're splitting hairs - if you're managing a portfolio in real life you don't really care about this.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwPgT08Vv4Q-aGY95Z4AaABAg.9ayQNQ9_qDG9ykWbo-D-R3", "comment": "​ @aravartomian1  flipping a coin infinitely many times yields a sample space which is uncountably infinite.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9ZiedDT9D8d", "comment": "Shit thank. I m milliondollaire now diamond Hand", "votes": "12", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9a44qkNvfcc", "comment": "Buy low sell high - I'm now a trillionaire", "votes": "5", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9aBGWJ9JkcK", "comment": "Exactly!", "votes": "1", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9aTyO15GLtC", "comment": "Actually for Retial… yea..", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9aTyWE0-sCv", "comment": " @thalberg-  how ab now? Little less millionaire or lot less millionaire or liquidated millionaire?", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9atmmzIF7e-", "comment": "I’m a quadrillionaire now for going heavy energy", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9bH9S6iMBY8", "comment": "I’ve done this 3 times so far in real estate", "votes": "1", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9bQMF3Qkc-2", "comment": " @TheCryptocurrencyPortal  Ip", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9bYGnKDgNsS", "comment": "AMC and GME only? GOT IT.", "votes": "1", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugwh9KB-YmngaATJWX14AaABAg.9YVPwiM1MBI9xaGHqoR028", "comment": "Buy low sell high is the most expensive advice ever given in the history of trading.   Bottom and top pickers soon become cotton pickers.   As for buying pullbacks, if all criteria are met for odds of continuation, it is a viable strategy.   As for “diamond handing” - this is extremely important, however, not so simple in reality… this can be said differently - “predefine and fully accept your risk (how much you’re willing to spend to find out whether you’re correct), enter the trade, set your stop-loss, then hold the trade regardless of what happens until it either reaches its maximum profit potential and begins to turn around, or until it hits stop-loss”. Most (95%) of traders fail to reach consistent profitability not because they buy or sell the wrong opportunities and not because of anything outside of their inner selves. The point is, the #1 best thing one can do to be profitable is to create a mental preparation process and rigorously follow it so as to control one’s emotions and psyche before and after a trade is entered. Most people never succeed in trading simply because they cannot control their impulses when watching a trade in the negative or in the profit… they trade their psyche, PnL, and emotions rather than the market.  Good luck!   - professional futures day trader", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwveMZ4PK4oZlMw8oR4AaABAg.9QsOHqOAbqG9RmXyjVI8jy", "comment": "If you don't understand the maths, you shouldn't be watching this video.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwveMZ4PK4oZlMw8oR4AaABAg.9QsOHqOAbqG9Rmr17xKNo_", "comment": " @The_Original_Hybrid   Hi friend. Actually I know them very well. In fact I’m a mathematician. It’s probably because of it that I can see easily through what is just monkey calculations and few insight.", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgyMbzirT5wZoBDI52t4AaABAg", "comment": "God bless you MIT", "votes": "9", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugzk4kieLcJcTdn_zEB4AaABAg", "comment": "Tb to when Ford was ~$50 and Google was ~300$...", "votes": "3", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzzYR5G1y4DAUy_QEx4AaABAg", "comment": "Will definitely take notes on this later today. Seems of great quality. Thanks for the upload.", "votes": "2", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwcYrSi56Elh4TZt414AaABAg", "comment": "This is MIT stuff ? We had way more detailled and better lectures about the portfolio theory  !  Department of public administration at Panteion university rules !", "votes": "5", "replies": "2", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwVdemJBnA7D7BRGu94AaABAg", "comment": "It is much better to do it with R:\r https://www.youtube.com/watch?v=aYi-mCsNC08&t=549s", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgxuWrZsBTmS3PElg5B4AaABAg", "comment": "At 14:30 I got something different:  w= sigma_1^2/(sigma_1^2+sigma_2^2) Am I doing something wrong here?", "votes": "3", "replies": "2", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgyjYH4n93Won9GN-uh4AaABAg", "comment": "Its not theory when u invest in bitcon", "votes": "2", "replies": "4", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgxIJBg1qM20gJ53Cqd4AaABAg", "comment": "Charlie Munger has left the chat", "votes": "9", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgxLYVOHn7IxPM0i0_F4AaABAg", "comment": "https://beijingtrt.janeapp.com/#/staff_member/3/treatment/9 Google topdoctor Yola", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzRbhSfhpOJ4xkVOa94AaABAg", "comment": "Coming from the stream and glad that I have ANOTHER Prof to brush up my financial lesson. Admire this Prof instructing in MY pace. Will scrape this webinar into my YT as my all time audio book.  BTW, what is our Prof's name?..........STF................", "votes": "5", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzmRmyL528v9o1y1l94AaABAg", "comment": "88 Bullard St, Sherborn, MA 01770 for sale .tel  9494000992", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzJqMmgxKVAnUltFbx4AaABAg", "comment": "i have a quetion... at the portolio(which has two assets with zero correlation), is the two assets stand for the risk asset?????? plz answer", "votes": "0", "replies": "2", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgydILmRW6S3ZvYywK94AaABAg", "comment": "The phenomenon of Portfolio theory is quite a complex thing for me to understand. This course has provided me with a great step by step guide to understand the concepts. https://skillscourses.org/Portfolio-Theory-and-Performance-Analysis.html", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgxOsjpcB1REJS7GZBN4AaABAg", "comment": "People: we want free college! MIT/youtube: here you go People: boooooring  What a bunch of morons.", "votes": "75", "replies": "3", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwaPT2elQLFb3JuN0V4AaABAg", "comment": "Great lecture from University of Toronto (Canada)", "votes": "2", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugz2zK3ALu57xFI9q894AaABAg", "comment": "Fantastic lecture. Greetings from the Royal Institute of Technology.", "votes": "11", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzRirehAKqvvnALf9V4AaABAg", "comment": "And they still can't outperform $SPY.", "votes": "6", "replies": "2", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugxpx11BKbLiRo5mU_94AaABAg", "comment": "I appreciate free, but the ums and ahs make this impossible to listen to.", "votes": "5", "replies": "4", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugz-_vyvDY7MFwQj2JZ4AaABAg", "comment": "Merrr my pocket protector!", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzTRNlLah5fjn6CvhF4AaABAg", "comment": "thank you so much", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgwcYrSi56Elh4TZt414AaABAg.9MKe1JVxoIt9aInSCItI5a", "comment": "And who cares about your self indulgence?", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgwcYrSi56Elh4TZt414AaABAg.9MKe1JVxoIt9g4qYJeQjkf", "comment": "Portfolio theory isn't covered in 1 lecture  Thus is an overview lecture", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgxuWrZsBTmS3PElg5B4AaABAg.9JYae2inpiF9MFH0uvlW8b", "comment": "its the same", "votes": "3", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgxuWrZsBTmS3PElg5B4AaABAg.9JYae2inpiF9MFWekS96N1", "comment": " @kaoutarsoulali2142  ok thanks 🙂", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgyjYH4n93Won9GN-uh4AaABAg.9G8AbvJigXG9_v6aWIzkjD", "comment": "That's called gambling. But nice try. lol", "votes": "1", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgyjYH4n93Won9GN-uh4AaABAg.9G8AbvJigXG9a-iK_nFt2f", "comment": " @MrSupernova111  it's not gambling. Gambling is \"investing\" into the rigged \"market\".", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgyjYH4n93Won9GN-uh4AaABAg.9G8AbvJigXG9a-ifxUbMsV", "comment": " @ada-boy  . Clueless!", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgyjYH4n93Won9GN-uh4AaABAg.9G8AbvJigXG9a-jQLUkO67", "comment": " @MrSupernova111  \"clueless!\" - 🤓", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzRbhSfhpOJ4xkVOa94AaABAg.9CTvt1GXC4v9CVeDRMju4b", "comment": "The instructor is Peter Kempthorne. See the course on MIT OpenCourseWare for more info at:  https://ocw.mit.edu/18-S096F13.", "votes": "5", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzJqMmgxKVAnUltFbx4AaABAg.9C09oShUjC89aTyt5AdefS", "comment": "It’s a deep discussion, short answer not any two negative, even cash totally r taking on hit cuz inflation… unless u r holding hmmmm… idw", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzJqMmgxKVAnUltFbx4AaABAg.9C09oShUjC8A6UAz8gATR9", "comment": "Having two assets defeats the purpose and benefits of diversification", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgxOsjpcB1REJS7GZBN4AaABAg.96f3wHGDdUp9I5tKATggXd", "comment": "The majority of people who demand free college are the ones struggling in debt due to their own poor decision", "votes": "4", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgxOsjpcB1REJS7GZBN4AaABAg.96f3wHGDdUp9M2fQXZ9SHP", "comment": "I hate that expression ‘people’. Meaningless!!", "votes": "2", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgxOsjpcB1REJS7GZBN4AaABAg.96f3wHGDdUp9RpAZgkqGgJ", "comment": "so true", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugz2zK3ALu57xFI9q894AaABAg.951WIf4Sd_X9aTygOE3JqW", "comment": "Fantastic lecture. Greetings from net worth 10MM plus ….", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzRirehAKqvvnALf9V4AaABAg.937rPeow9jD99clLVCQZuF", "comment": "It's really not that hard..", "votes": "1", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzRirehAKqvvnALf9V4AaABAg.937rPeow9jDA6UB7fCysPK", "comment": "Not true, with this if you make quarterly updates and reallocate, your portfolio should outperform SPY", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugxpx11BKbLiRo5mU_94AaABAg.936No0ECcM093D7DTjs0X9", "comment": "ok, go pay for something that does not have the ums and ahs and save everyone the complaint.", "votes": "16", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugxpx11BKbLiRo5mU_94AaABAg.936No0ECcM09IaZ-zff1sv", "comment": "This is the most boring individual on the ait", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugxpx11BKbLiRo5mU_94AaABAg.936No0ECcM09Vt-Sqagjim", "comment": "Yeah pretty pathetic to have all that school and not take one public speaking class. Lmao", "votes": "3", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugxpx11BKbLiRo5mU_94AaABAg.936No0ECcM09_v6c6-Srki", "comment": "umm... lol", "votes": "1", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzWju3VvEPf6zGSl6N4AaABAg", "comment": "thanks", "votes": "0", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugy_KHJLjDpterNFo_l4AaABAg", "comment": "Eggheads", "votes": "1", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugw3dKH4BTcS4RUQXLJ4AaABAg", "comment": "boring", "votes": "5", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UgzpZ_t40QNKjGziywJ4AaABAg", "comment": "This guy looks like the Goldman Sachs guy", "votes": "14", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugx__Z4pw-ZKY7tg-Lt4AaABAg", "comment": "Why the finance people are too much boring ?", "votes": "6", "replies": "4", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UghvW2Cjhs5XOHgCoAEC", "comment": "1:1:18 - I'm hungry !!!", "votes": "20", "replies": "", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "UggbI9lbJ7gVE3gCoAEC", "comment": "first derivative positive not increasing", "votes": "2", "replies": "1", "reply": false}, {"vid": "ywl3pq6yc54", "cid": "Ugy_KHJLjDpterNFo_l4AaABAg.8tLLKQL_lGk8zXOLflgEsL", "comment": "he makes more money in a year than you and your entire family combined", "votes": "4", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UgzpZ_t40QNKjGziywJ4AaABAg.8e5R6BH_3S88zXOF3p5UPw", "comment": "LOL hank paulson?", "votes": "3", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugx__Z4pw-ZKY7tg-Lt4AaABAg.8dDSSLHUAg28tiSOPbtYoo", "comment": "because they are there only for the money", "votes": "3", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugx__Z4pw-ZKY7tg-Lt4AaABAg.8dDSSLHUAg296f4-oqDJs0", "comment": " @tuirfghfhg1787  why are you here, for the arts?", "votes": "17", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugx__Z4pw-ZKY7tg-Lt4AaABAg.8dDSSLHUAg29TTRcPQ1iZQ", "comment": "The way to the knowledge is boring… until you reach the end!", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "Ugx__Z4pw-ZKY7tg-Lt4AaABAg.8dDSSLHUAg29a44zgYklek", "comment": "This video turned me gay", "votes": "0", "replies": "", "reply": true}, {"vid": "ywl3pq6yc54", "cid": "UggbI9lbJ7gVE3gCoAEC.8FE7Aidn72H8JpDd1ENQdX", "comment": "52:44", "votes": "1", "replies": "", "reply": true}]