[{"vid": "yYjGUXLoZWM", "cid": "UgzQPgHPte3of2TSIJx4AaABAg", "comment": "I am so thankful that I found your videos in time, I think you honestly saved me from my exam, your explanation is easy and straight forward to the topic related, whereas I see my professor tends to explain the topic in wayy to much details, and it becomes really redundant information that I don't need. Thank you so much :)", "votes": "0", "replies": "", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "Ugw3UqkiNRfKYx5phCl4AaABAg", "comment": "The second I saw those pictures, I screamed \"HES USING THE BOOK\" referring to the book right in front of me", "votes": "2", "replies": "", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "UgyNbsMnp6oxP7Y1j-x4AaABAg", "comment": "I SWEAR I UNDERSTAND PHYSICS MORE NOW! THANK YOU!!", "votes": "2", "replies": "", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "Ugwt_hFYkgm8axLjjj14AaABAg", "comment": "aloha I’ve been watching these for better understanding do you have a way I can print you lecture so I can follow along with you?", "votes": "0", "replies": "", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "UgzbGqBcr5Ph3bjJlId4AaABAg", "comment": "Wait for question one if there was no force acting on the ball in the direction of its movement wouldn’t it just stop, is inertia not considered a force?", "votes": "1", "replies": "2", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "Ugxzsye051YX0Dqc0LR4AaABAg", "comment": "Man these videos are great, I have no idea why so many people don't explain it in minute details like you do. Kinematics for instance, you broke down rearranging them and which ones to use perfectly, while most people I watched just ran through the problems without explaining why they did anything.   Kudos to you sir, your work is appreciated.", "votes": "9", "replies": "1", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "UgyVr-o1RAgQiXOElZh4AaABAg", "comment": "HES BACK", "votes": "5", "replies": "", "reply": false}, {"vid": "yYjGUXLoZWM", "cid": "UgzbGqBcr5Ph3bjJlId4AaABAg.9crYLECS2vB9ct6emkluRv", "comment": "You are correct that there are no horizontal forces acting on the ball, but we still need to consider Newton's laws. Think of the common phrase \"an object in motion remains in motion.\" With no forces acting horizontally to push on or slow down the ball, it will simply continue its forward motion at a constant speed.", "votes": "0", "replies": "", "reply": true}, {"vid": "yYjGUXLoZWM", "cid": "UgzbGqBcr5Ph3bjJlId4AaABAg.9crYLECS2vB9cxvp5vOaYi", "comment": " @SpahnsScienceLectures  thank you", "votes": "0", "replies": "", "reply": true}, {"vid": "yYjGUXLoZWM", "cid": "Ugxzsye051YX0Dqc0LR4AaABAg.9TLZg-_0M2r9sE3i7jw5C_", "comment": "I second all of this! Teaching (and learning) is breaking the subject down into its core components, and teaching/learning these in a logical order. The worst part for me when learning something is when the teacher skips a step, which might be obvious to him/her (as he/she has had so much practice the step is automatic to them), but it isn't obvious or clear to the learner, and often I have no idea how the teacher got from a to c, because step b is missing.", "votes": "1", "replies": "", "reply": true}]