[{"vid": "z8HKWUWS-lA", "cid": "UgwRU6IyKAEoYAt_T214AaABAg", "comment": "For those who are confused with the tile problem, I think the center square means that Bill must be inside a square which is in the center. Like imagine a smaller square for n = 2 which is inside the original square. Then you can cover the 4 corners with the L-shaped tiles and it'll leave a square in the center and bill will lie somewhere in that square. For more details check out the readings of the chapter-3 induction of the same problem", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx1ks3kZDxp023viUt4AaABAg", "comment": "22:26", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy5PphE1YGcZoCLuXd4AaABAg", "comment": "regarding the horse question (I havent seen the solution):\r p(1) itself cant be used as the base case because p(1) recursively proves itself True. since there is only 1 horse, if we define these  variables: p == \"H1 is Black\" and q == \"all horses in any set is Black\", we conclude that p => q == 1 (always), because if H1 is in fact Black then: p == 1, and if we check q we see that \"all horses\" consists of only H1 thus q should be 1 too. now if H1 is NOT Black, then p == 0 and q should be 0 too because, again, there is only H1 so \"all horses\" means that we're just checking H1\r let's see if I got if right!  I didnt :(", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz6uW5tRa8uHGGlupF4AaABAg", "comment": "This Greek and Geometry story sounds suspect, when you consider that the Egyptians had Pyramids were up thousands of years by the time a European conquered \"Greece\".  Question, how would they publish the result, if reading, writing and mathematics was a secret ?  Also, why would Europe think the world was flat until 1492AD ?  If the Greek discovered science and mathematics 2,000 years before ?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwIfmMH3STKwDjDPQZ4AaABAg", "comment": "i never knew mobius use to teach mathematics before going to TVA", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzuygBOLgm3WFzYTJV4AaABAg", "comment": "Wow, the horse problem stole some time from me. For some reason I thought the professor concluded that the proof is valid for all n >= 2 (think they say that in the newer playlist version of this course).  Maybe someone can either correct me here or be helped by it: If I got this all correct, it basically sums down to:  For n = 1 the base case is True, (trivial), however the inductive step breaks down since when you add a horse (n+1), your assumption (n horses) still only tells you that the first horse by itself is the same as it's own color and the second horse added also the same color as itself (they can still be different from each other). They need atleast one horse in common which is not possible for n = 1.  For n >= 2 the inductive step is True since the added horse (n+1) can be said to be the same color as the other horses in the set minus the first horse (still n horses, true from assumption). Therefore first horse and last (horse_n+1) is the same color.  Same logic as saying: if I have the same name as your friend Elliot, and you have the same name as Elliot, then you and I have the same name also. The friend here being the horses in the middle and you and I being first and last horse.  In the case of n = 1 there is no friend (horses in the middle) therefore I can't know if we have the same name.  However the base case for n >= 2 can not be shown to be true since you can't just say (as in the trivial case n=1) that the horses are the same color as itself. If you have n=2 for example, one horse can then be black and the other white.  Therefore the proof by induction is incorrect regardless of base case.  Maybe this explanation got weird, sorry if that's the case.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwmgZWzqj5odbyMxMV4AaABAg", "comment": "23:43", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzJhv6DIacHjFogizJ4AaABAg", "comment": "why no one ask question ? :D", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzYtxAJ_Ieo_-41QO14AaABAg", "comment": "heard oxford was the best place for math, now I kind of agree.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxWb0HNSnUcipdZ16x4AaABAg", "comment": "🎯 Key Takeaways for quick navigation:  00:26 🧠 The course emphasizes the importance of proof components: propositions, axioms, and logical deductions. Reasonable use of axioms is accepted, with a focus on consistency. 01:49 🔄 Introduction to proof by contradiction; assuming the opposite of the proposition, deriving a contradiction, and concluding that the proposition is true. 03:01 🤔 Steps for a proof by contradiction: Assume proposition P is false, use the assumption to derive a falsehood, leading to the conclusion that P is true. 04:45 ➗ Proof by contradiction example: Demonstrating that the square root of 2 is irrational using indirect reasoning. 09:55 📚 Historical context: The proof that the square root of 2 is irrational was discovered by the Pythagoreans, leading to challenges to their axioms and the suppression of the result. 13:42 🚫 Introduction to false proofs: Highlighting the pitfalls of relying on visual representations and assumptions in proofs. 20:44 🔄 Induction as a powerful proof technique: The course emphasizes the importance of understanding and applying proofs by induction in computer science. 23:33 🎯 Mathematical induction is like a series of dominoes, where proving a base case and the induction step ensures that a property holds for all values. 24:30 🧮 Induction proof example: Proving the sum of natural numbers from 1 to n equals n times n plus 1 over 2, using base case and inductive step. 28:46 🔄 In a proof by induction, you establish a predicate (p) representing the property you want to prove, check the base case, and show the inductive step. 34:41 🛑 Proof by induction doesn't necessarily provide an intuitive understanding of why a theorem is true; it's more about establishing the truth of a statement. 36:35 ➗ Induction example: Proving that for all natural numbers n, 3 divides n cubed minus n, using base case and inductive step. 43:25 ❌ False proof by induction: Attempting to prove that all horses are the same color, revealing the importance of correctly formulating the induction hypothesis. 51:20 🐴 Inductive proof using \"pn\" to show all horses in a set of n are the same color, addressing a mistake in the proof for n=1. 55:35 🤔 Careful use of the \"dot, dot, dot\" notation in mathematical proofs, highlighting a flaw in the case n=1 of the horse color proof. 56:30 🧩 Importance of proving all steps in an inductive proof, emphasizing the missing link in the proof chain (p1 implies p2) for horse color. 59:21 🧠 Application of mathematical induction to prove the existence of a solution and find the solution for a courtyard tiling problem. 01:03:07 🧩 Definition of the induction hypothesis (\"pn\") in the context of proving the tiling of a courtyard with a center square missing. 01:08:06 🔄 Iterative refinement of the induction hypothesis to successfully prove the tiling of a 2^n by 2^n region with a corner square missing. 01:13:18 🔄 Iterative refinement of the induction hypothesis by considering proving the problem with Bill in the corner first and then using it as a lemma for the center. 01:14:09 🤔 Discussion on alternative approaches, including dividing the courtyard into 2 by 2 squares, highlighting potential challenges. 01:15:37 🛠️ Stronger induction hypothesis (pn) can simplify the proof, emphasizing the advantage of assuming more inductive power for a more complex problem. 01:16:34 🔄 Application of a stronger pn (any square missing) to prove pn implies pn+1 more easily, showcasing the power of a robust induction hypothesis. 01:18:28 🧠 General rule: If you struggle with induction, try assuming something stronger as your induction hypothesis; a more powerful pn can make proving complex problems easier.  Made with HARPA AI", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzKQMDXXlrgPyhaKoV4AaABAg", "comment": "13:16 Huh not something I expected to hear during a MIT lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyQvuxzOaftbHIa9WN4AaABAg", "comment": "I find it kind of sad that Lec 1 Has 2.3 Million Views, Lec 2 has 640k Views, Lec 3 Has 346k views and by the last couple of lectures its down to ~60k views", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwQ26N_yhC4j0rHB754AaABAg", "comment": "56:25", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugyez3wjLhNk2rn_gqt4AaABAg", "comment": "How does induction work?  This is what i understood :  Let's take the example of this formula  S(n) = 1 + 2 + 3 + 4 + -------- + n = n(n + 1) / 2  Now suppose I asked you the value of S(100) and you solved it for me   S(100) = 1 + 2 + 3 + -------- + 100  = 5050  Similarly , You also solved for me f(100) = 100(100 +1) / 2                     = 5050  Now, assuming you weren't lying to me about S(100) and I'm required to find S(101), I can do that as follows :  S(101) = [1 + 2 + -------100] + 101 = [5050] + 101  = 5151  f(101) = 101(101 + 1) / 2 = 5151  Similarly If i have to find S(102) and assuming you did'nt lie to me about S(100), I can do   S(102) = [1 + 2 + 3 +--------- + 101] + 102 = [5151] + 102 = 5253  f(102) = 102(102 + 1) / 2 = 5253  | | | |  Similarly I can keep on calculating it for values greater than 100 (means 100 is the base case here)  based upon the answer you told me...  So here, I'm not verifying the hypothesis, but assuming you verified it for me and using that I proved a conditional statement that  If p(n) holds true then p(n+1) also holds true.  i.e. p(n) => p(n + 1)  And when you check base case you are giving yourself that initial start...(just like you told me that S(100) is true.)..but here solving for the basecase you know its true cuz you verified it yourself...   Sorry for my English. I'm not a native speaker", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxZSKBSxbbBVfQCYcd4AaABAg", "comment": "This is my third lecture I've watched with him and I kept thinking that this MIT room looks like a 70 year old community college in the middle of downtown Detroit, but then Tom drops a bomb saying that building is new, and furnished, was supposed to be under $100 million but skyrocketed to over $300 million.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyTCtF5Ld0TwFhy-Jp4AaABAg", "comment": "Please lectures teachers in the world, give if you know, the good example. It's the social learning theory that counts in teaching, education; 1. Observation of the (good) example 2. Good followship 3. Change of experience. I wonder why the social learning theory is not teached on scholarships for  education. Or perhaps it is but some don't know. To my consideration I know that social learning theory but I never had a scholarship for education and. Somehow I like to teach young people especially about computertechnologie Especialy by giving the good example as good as possible. Kind regards, Saskia van Houtert, engineer/office-manager.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyBsVKR-Sqn9pb_73B4AaABAg", "comment": "I like how when he says: I guarantee you that you'll make a mistake if you use/do X, and then actually makes all the student fall for the trick", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz5ZjpC2427qO6XsTd4AaABAg", "comment": "Best professor ever", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugwqqt73yn_1oSAt_K94AaABAg", "comment": "Proof by induction is most suited for a computer. I think a computer is poor in derivation or deduction. Am I wrong?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxItbcEJcNDT5qL53x4AaABAg", "comment": "In 2^n + 1 square why prof. Has put the bill in the center in the upper left square...Bill wants to be in the center and the center of the square 2^n+1 is where bill earlier was... Could anyone explain?", "votes": "1", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxItbcEJcNDT5qL53x4AaABAg.9pqe8pWVYF89qyX0U2KzVj", "comment": "The centre was not fixed meaning Bill just didn't want his statue in the corners.  And that is why the Professor has changed his theorem from a centre to any centre because we now have more room to play around and figure out the answer.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyrJSIMHETYdxuI_Jl4AaABAg", "comment": "12:01 they didn't develop the theorem, just took it from Ancient Egypt", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxXuaELhkTuoi-8t554AaABAg", "comment": "14:26 ~ 18:53", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugyrbkg6WrChmNjdx7p4AaABAg", "comment": "❤️💜❤️", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx7YmyM40q9FF6r0jJ4AaABAg", "comment": "In equation 2b^2=a^2; prof said, a is multiply of 4. How?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwTqPogmU48wfsrJCJ4AaABAg", "comment": "In the Horse Problem, does it then mean if we take the predicate to be: P(n): In any set of n>=2 horses, all horses in that set are the same color, then we can establish the truth of the theorem (that all horses are the same color), because then depending on the truth of the base case, we can always establish that P(2)->P(3), P(3)->P(4), ..., P(n)->P(n+1) are true. So that is a bit circumventing around what we actually sought to prove, given that we're assuming that in the base case. Really good problem.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy6_hkIOFCz0UZ_Fwp4AaABAg", "comment": "6 divides [(2^2n)-4] for n>1 Is a more elegant proof for the last question.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxaAr0Cgt8R_iDoLVN4AaABAg", "comment": "the donor could actually have been a Bill🤔", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzFvpVZs7JB_R5E03p4AaABAg", "comment": "For the statue proof, how would one define in mathematical terms the L shape figure of squares used? I proved this is possible using modulo of 3 but it doesn’t specify the shape. Matrice notations maybe?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw9apaMDFCtAQUVkzZ4AaABAg", "comment": "I am going through this and I understand why its useful when your some scientist plugging in random numbers to try and account for values you're seeing/finding but god dam this shit scores worse than hell on earth on the fun scale.  which on another note, who the fuck spends their life plugging in random numbers into formulas from 1-1 billion lmao...but thank god they did.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugyd4ToeTwYg3U6zbwp4AaABAg", "comment": "13:18 ayo", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugxoyo1p5lH9Ef4b7Zd4AaABAg", "comment": "in minute 40:37 , how does adding a -n result in that equation? n^3 + 3n^2 + 2n goes on to be n^3-n+3n^2+3n... after adding -n?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwN3JHdB8BJtgadgAd4AaABAg", "comment": "hypothesis: any region of \" ((2 power n x 2 power n ) - 1) / 3 \" is true. Bill will never end up in the center. number of tiles extending away from bill towards opposite ends of any region will always be different ! to center bill and prove L shaped tiles will fit you have to use the hypothesis \"((2 power n x 2 power n)-4)/3\" is true, base greater than or equal to 1.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy8Ki5f5c1DAbNkgkN4AaABAg", "comment": "well done, thanks for mit offer me such high quality lesson.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxruXiKPmlk5M1dri14AaABAg", "comment": "bill problem can be done this way- well we have a area thats 2^n+1 by 2^n+1 so if we break that up we have 4X (2^n  by 2^n) thats the total area since bill had a nice center tile in each of those 4   2^n by 2^n areas hence bill has a center tile in the bigger area made up of 2^n+1 by 2^n+1 and now lets say in case n is 2 this center area is like 2X2 space but we put in another L shaped tile and we have 1 sq left for bill in the center", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwrA6YaQFocEU1XsUh4AaABAg", "comment": "Did this in school when I was 16 or 17 years old. Did a ton of math in my engineering degree. Worked as a software engineer for many years and worked in IT for 30 years. Never used this topic in math once in all that time.   Some math is helpful for computer scientists, but not this.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxKzBDjRSqsS2-NAGB4AaABAg", "comment": "Is enough to prove that P(n) implies just one piece of the statament P(n+1)? I'm asking because of the second example. I mean, P(n) is not exactly to p(n+1). Thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyKs45aYMQOVZbBu7B4AaABAg", "comment": "proof by contradiction 2:30 i.e. root(2) is irrational   false proof 13:42 i.e. 90>92  induction 21:00   28:30 prove sum of 1st n natural number = n(n+1)/2  induction q: 37:00  41:45 STEPS OF induction  57:24 ....", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyF-zbvlonwVRXmVHx4AaABAg", "comment": "In Hinduism ,Infinity stands for LORD SHIVA ,My goodness There is so much Contradiction ‽", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyKAHaFgx3KLtmxNRt4AaABAg", "comment": "at 56:16, how is that we have proved that proposition for all n>=2?, the equality bridge broke a few minutes earlier....", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzLqz81CWLx78xloBt4AaABAg", "comment": "By the way, the set of natural numbers does not include zero!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugxoyo1p5lH9Ef4b7Zd4AaABAg.9i1DKgZ2WK3A5GzbDCsZ-F", "comment": "He skipped a few steps but, rearrange it so that its in the form.  n^3 +3n^2 + 2n = (n^3 + 2n) + 3n^2 .  then consider that  (-n is just (2n - 3n). add zero, +(3n -3n) to the equation. which helps us rewrite it as  (n^3 + (2n-3n) + 3n^2 + 3n. = (n^3 -n) + 3n^2 + 3n", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzYm1mDD1_B6XEodZN4AaABAg", "comment": "Horse Problem Clarification: The inductive step doesn’t work when n=1  So P(n) = H1, H2, …, Hn And P(n+1) = H1, H2, …, Hn, Hn+1  1. We assume P(n) is true by induction 2. In P(n+1), we know that the first n horses are the same color because we assumed P(n) is true 3. Now, remove H1 from P(n+1), you’re left with the set {H2, …, Hn, Hn+1}, which now has P(n) horses 4. So now we know that {H2, …, Hn, Hn+1} are all the same color because again P(n) is true  5.(Now here’s the error) The next step WOULD be to say that H1 = {H2, …, Hn} because of step 1 and {H2, …, Hn} = Hn+1 because of step 4, thus implying that P(n+1) are all the same color,  BUT look closely at case n = 1:  P(1)= H1 P(2) = H1, H2  Remember step 5: H1 = {H2, …, Hn} = Hn+1 But wait, look at the middle set, {H2, …, Hn}. It’s P(n) without H1. Now what is P(1) without H1?  NOTHING, IT’S EMPTY!   Thus saying that H1 is the same color as no horses at all is false, which means step 5 in our induction is false.", "votes": "4", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxuMjBf78kPKMi5dlh4AaABAg", "comment": ".", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwhGLXMBZ1moQ6NENV4AaABAg", "comment": "You would think a professor at MIT would know this and the examples without looking at his paper word for word and looking at his examples.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxSvzT4Wq7xPlm84s94AaABAg", "comment": "I didn't watch the video, but I wanted to point out that there is a really nice proof for 3|(n^3 - n) that involves modular arithmetic. Simply note that n^3 - n = n(n+1)(n-1) which is clearly 0 mod 3.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugywu3DWsWxgfykhqJN4AaABAg", "comment": "Al correr al elemento superior de guerra entra en acción citan al comandante anomalia", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyXgh4NxW1_3xJNKn94AaABAg", "comment": "wow he needed notes for that", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzWPCiBUA_0IoebgMp4AaABAg", "comment": "This guy is sloppy.  I just started at some \"random\" spot and within a few seconds, I spotted 2 errors by him.  Junk.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugwk0wn0g0H0psPFo8d4AaABAg", "comment": "Whenever i cant sleep, i watch this video so i can go asleep, thanks math video", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw7CjWjEcICsFmhzyF4AaABAg", "comment": "Best forever", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzVmTXD48oucJjxa9d4AaABAg", "comment": "second induction example, for n=1 is still valid?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzohli7HcTxLz9mIQx4AaABAg", "comment": "Hey guys, can't we just nest a square of size 2^n x 2^n on which the inductive hypothesis has been applied in the centre of a square of size 2^(n+1) x 2^(n+1)? In that case, p(n) => p(n+1) right? Meaning every subsequent block up to n+1 will have a bill in the centre.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxybnPxWDf8d4Tjcdd4AaABAg", "comment": "I have a doubt. When using the induction axiom, should the predicate evaluate to true ∀n∈N, or is it ok if it works only on a subset of N?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxnmhsMbHZhfMTlr5V4AaABAg", "comment": "Great Video! Love it!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy83e8VeVYrObAhr1V4AaABAg", "comment": "Hello,   I am a little confused by the first example regarding proving that sqrt(2) is irrational by induction.   In particular, my confusion comes from the transition from:  2b^2 = a^2  If a^2 is even then a is even   (2 | a)  Wouldn't a counter example to this claim by that, when b =1, a^2 = 2, and then a is not even?   If we are unable to hold that statement, does the proof fall apart or am I confused in my logic?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwzVCs_QZb9W_UbZ0x4AaABAg", "comment": "In the horse problem, the bug is not in the dot, dot, dot. It is in the assumption itself. The assumption is False. Since the assumption  is false, you can prove anything. F->T or F->F both implications are True. So, what was proven in the classroom was True either way.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz6pgrF6Vruz-bMDpl4AaABAg", "comment": "Wait….ya’ll understand this?", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzp1lJH8PRE8hV6Kep4AaABAg", "comment": "👍👏👍", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzukR84GprZdwf5jpp4AaABAg", "comment": "54:00", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzgyHtoQYXFtBSbck54AaABAg", "comment": "I hate induction sm 😭", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgysirCDx2hhJHL8VFR4AaABAg", "comment": "Thank you.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzYm1mDD1_B6XEodZN4AaABAg.9ce0kphq1fQ9s7-YehPQie", "comment": "but then for n>2 suddenly all horses are the same colour?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy83e8VeVYrObAhr1V4AaABAg.9a7FG8n1zwT9tSQW4zOcPY", "comment": "By setting b = 1, you are contradicting the statement that a and b have no common divisors.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugwc0meiwPF137mkxPd4AaABAg", "comment": "Ultimate irony: It was irrational to kill the person who discovered sqrt(2) is irrational!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxebMRpmTh6AwSF9rx4AaABAg", "comment": "34:45 OMG!! Stunning! Magic!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxbADxebkO9lJgVcKJ4AaABAg", "comment": "At https://youtu.be/z8HKWUWS-lA?t=2280 why isn’t the base case P(1) is n is a natural number?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxCq1a6Uw8qD0r2hit4AaABAg", "comment": "I really admit that I am having an interesting experience with these lessons you offer", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwZmkY6y5kwfGgyoR94AaABAg", "comment": "I’m watching first time this lecture. What’s his name?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxqWNbGrMFAdinVcqV4AaABAg", "comment": "This series actually isn’t very good", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx2QBiCKSNWBvIVtgN4AaABAg", "comment": "I like watch this it's so very good for my studies", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwLtLCvd6_-CZS9eRJ4AaABAg", "comment": "This really helps me fall asleep thx", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxvcL-598de-MBh3Fh4AaABAg", "comment": "Proof by induction", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyW-Y18m8g6InvDqRN4AaABAg", "comment": "time span proof by contradiction 2:30\r prove √2 is irrational by contradiction\r 4:31 False proof example 13:42\r induction proofs 20:03\r example 1 on induction proof 24:30\r example 2 on induction proof 36:37\r example on false induction proof 43:34\r Example 3 on induction proof 59:00", "votes": "139", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugxc4cvcoUlpCZfA_-d4AaABAg", "comment": "I thought I lost hope with mathematics. I was kinda slow in my thinking ability. Now I am working towards understanding maths for computer science so that I can go on studying master and eventually PhD. Hope you all enjoy this series of lectures.", "votes": "12", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxBkAFUDSAy4tPNbrN4AaABAg", "comment": "I am confused is 0 a natural no. ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgykHyK4ttAuaeCAdMt4AaABAg", "comment": "Awesome", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx1eyR-zsfu79L93_F4AaABAg", "comment": "The \"all horses are the same color\" proof fails because the variable of interest is \"color\" which is not represented numerically in the proof. The proof presented refers only to the number of horses, there is no mathematical predicate for the color.", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxuPZbVX1DKLqvfdOR4AaABAg", "comment": "It's really an amazing course! I'm going to study in university next year and i'm coming to look for some inspires for the courses i will take.  This outstanding professor do solve a lot of questions for me in advance.", "votes": "12", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxdZPbRDl1Evpxn7pt4AaABAg", "comment": "This man made induction understandable in the space of 5 mins, where my own prof took 2 hours and left only a classroom full of blank stares.  Strong knowledge base != Good teaching!!!", "votes": "12", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwsZp1mgOCXA15aSrZ4AaABAg", "comment": "43:22", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzIQ2GdErkqYu_dfiV4AaABAg", "comment": "I'm glad I didn't opt for Computer Science.", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzxE-QPKhHSLN7MrJd4AaABAg", "comment": "material magnet iron", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzM9oheyfwhwesYopt4AaABAg", "comment": "material iron", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyW-Y18m8g6InvDqRN4AaABAg.9WJrbBS3GTq9_Qq5hs_G3N", "comment": "thank u !", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugxc4cvcoUlpCZfA_-d4AaABAg.9Vsv_x4nYls9sYzEdlYKFP", "comment": "You got this bro", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxBkAFUDSAy4tPNbrN4AaABAg.9Vorj1cvgly9VzlDDZuH7O", "comment": "N = {1, 2, 3 ...}. Zero is not included. Natural numbers with 0 are called whole numbers.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzIQ2GdErkqYu_dfiV4AaABAg.9UApWnjTKi_9YzLbvMO8XW", "comment": "why, cause maths is hard for you ?? actually you don't need alot of maths in CS but yeah you need to know just the heading, like all the proofs he is doing you just need the statement and not the actual proof itself and in last two lectures only useful proof was n*(n+1)/2 for Computer science", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzUBbWuyDrm6XqX1XR4AaABAg", "comment": "receptacle", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwoRwl7aWyErPyMKQh4AaABAg", "comment": "atom", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy4GTI9WXrDpx7yYh4AaABAg", "comment": "bulb ,plug ,d.c. off,fire drill", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyvMibrhzIuxqvooQp4AaABAg", "comment": "Newton nucleuz", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqe1P8QBULSx6KV94AaABAg", "comment": "Very disappointing. This course is supposed to be for computer scientists and the induction is restricted to natural numbers. There are so many inductive structures in Computer Science! Also, not a word about well-founded induction, functional induction, induction on inductive relations, etc. In short, this course is really reserved for people who have never done an induction proof in their lives.", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy8IsKOw2ikHVYcQS14AaABAg", "comment": "Is it just me or the teacher just took a great name for someone who is not wealthy I don't know any Bill who is wealthy 🙃", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxquQMcgwqdP-Q6jmN4AaABAg", "comment": "awesome class but why induction applies L shape in Bill case I think that is not a silly question.? I really want to have the class in person ! Thx", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzOrcU483vIxfg2aSN4AaABAg", "comment": "you can proof some great stuff if don't check the base case,,, :D", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzZadj-__BEvqSiDkR4AaABAg", "comment": "Day2: Done", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyykH5QRFIysCnpHQV4AaABAg", "comment": "The horse's name is friday.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgybFUyzRwjA6WxtMwx4AaABAg", "comment": "Professor Leighton, thank you for a solid introduction to proof by induction. In the early 1990's , I took Advanced Calculus at the University of Maryland College Park and  proof by induction was introduced in a slightly different way.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzRYsjLyB3Gfd3pGSB4AaABAg", "comment": "38:08 Why is the base 0? shouldn't it be 1?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugxid-yVDUHHsLOmS2h4AaABAg", "comment": "6:40 I'd done that proof when I was in 9th std and in India, we are called Jee aspirants.", "votes": "2", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwnzWxb8lpLEoGQe654AaABAg", "comment": "Can someone help me here :   In the last problem (bill's), we wanted to prove p(n) but weren't able to do so,  so we changed the p(n) and then we proved it . Right?   But then we didn't prove it for the original p(n) still?!! So didn't the very proposition we set out to prove still remained unproved?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgygxhtUTxGPlgwyufd4AaABAg", "comment": "Thought the problem was the base case since if one compares the color of the horses, there must be 2 or more horses. It turned out to be the implication from P(1) to P(2)!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyR0s-mfzF-9WgRtBF4AaABAg", "comment": "Motivation : read the comment before watching lecture  This will engage you till end of the courses", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwvcLv9zgw9__qXDMB4AaABAg", "comment": "For the tile problem, If you have any square missing, the shape of the tiles will not be L  For the corner piece missing in 2^n * 2^n, try finding the last piece to be L in shape while leaving a corner empty.", "votes": "3", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugwkbcgzjm2HWx1Rs4d4AaABAg", "comment": "I'm gonna be honest here. I've never really liked giving my time and my efforts to Mathematics. But damn, the way this professor teaches, it's very engaging and very very interesting. Thank you for these materials! These are really helpful.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxtEc6_a9x4HPCy5yJ4AaABAg", "comment": "I thought that the bug was in the predicate itself as color is not a function of numbers so how can we make a predicate that you enter a number and it conclude something about colors.  I do not know whether this is right or wrong but I guess it makes sense.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyWKRzkBQSK3J9BOKJ4AaABAg", "comment": "Teaching is art ! Great lecture By Tom Leighton .", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqe1P8QBULSx6KV94AaABAg.9U0vsQfxwlk9VzlfZdXrKo", "comment": "you're right, what are you disappointed about though? it's like going to kindergarden and being mad they don't read Nietzsche over there", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy8IsKOw2ikHVYcQS14AaABAg.9TJDwMcmUR99VzlmBRYkc6", "comment": "Bill Gates is literally like third richest person on Earth", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy8IsKOw2ikHVYcQS14AaABAg.9TJDwMcmUR99VzlqDEB5vK", "comment": "and i generally assumed Gates was implied by the lecturer", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugxid-yVDUHHsLOmS2h4AaABAg.9N-L4BV8sCQ9_sLB0Cv9TR", "comment": "Bro i am also jee aspirants but the main difference mit students have is ki unhe practical me isse use Krna sikhate he not like us ki question kra ke chhutti krva di... This is why toppers like Mohit Hulse, Anushka Aggarwal, Chirag Falor are going to MIT instead of IIT. PS: I have total respect for all educational institutions.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxTnViJVDmQbqn63j54AaABAg", "comment": "The sound of that chalk pen hitting the blackboard came as pure music to my ears... One who has a love for computers will find this lecture to be a melody.  Loved the horse proof...and the tiling problem.", "votes": "17", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy3XuV-yBqC1ZvtSHR4AaABAg", "comment": "Bir iki ilə ordayam gözdüyün məni.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz0R7KRoafoRFnVuoZ4AaABAg", "comment": "Horses are not numbers or centimeters. They don't have any standarts about colors. That is why h(1) can be a set of itself with one specific color. Then h(2) can be a set of itself again with a different specific color. These two set can represent the \"n=1\"set alone. and These two cases are separately true.   Then for a \"n+1\" set of (h(1), h(2)) you can not imply either of these base case scenarios because they have different results. This breaks the implication from p1 to p2, which breaks all significance of the proof.", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzl_US8HmiJQrXRJd54AaABAg", "comment": "how did he know that a was even and a multiple of 4?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz6837whR2QC0c03EF4AaABAg", "comment": "38:14", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz-QyNJ9_BBMi7jGhx4AaABAg", "comment": "Nice Lecture. :)", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzpLVHCcJwzWauxiTh4AaABAg", "comment": "Actually I am still confused with Bill's problem can someone explain me ??", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxPwxXix9_H5svw8rl4AaABAg", "comment": "I just realized that the last tile problem was a nicer way of asking to prove that (2^(2*n))-1  is divisible by 3. Love this more verbose way and as well as the story behind it :) Kudos to MIT", "votes": "12", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy_TkyrZwzBckJXB094AaABAg", "comment": "Guess somebody does put Bill in the corner", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzaMlxgacrvRnkFf114AaABAg", "comment": "Why do these nerds don't respond?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgywvwMLkqzo_xKqNHV4AaABAg", "comment": "it's not 2+, but 2-", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwqpMr3fJcw2PfUOFd4AaABAg", "comment": "Ershad was here!👋", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy-mUUnFlJVCayL_qF4AaABAg", "comment": "why did we assume p(n) is true when we proved that its true ? we proved that p(0) is true when  we tested the base case, no ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwmmEj4YwURLveWJJ14AaABAg", "comment": "how can a collection of identical horses be called a set ? im kinda new to all of this but isnt a set supposed to be a collection of non-identical values ?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy0tBzi_i5zBZr6qZp4AaABAg", "comment": "GREAT WORK", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwMT_B7UWnnr-3Vufx4AaABAg", "comment": "I didn't understand the \"tile\" part. Can someone please help me? It would be of great help!", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw4z6uNkPeAP2FJYex4AaABAg", "comment": "In the last problem, when we changed our predicate from center tiles to any tiles, the number of constraints on the predicate has been decreased. How come Professor is calling it a stronger predicate? What exactly does he mean by a stronger predicate?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwU33PnP0iwhXo051x4AaABAg", "comment": "The Egyptian were the first mathematician not the Greeks. The Greek took the knowledge from the ancient Egyptia. Hence the triangular structure of the pyramids.", "votes": "5", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz2xy1DNPj6iZ4P4_B4AaABAg", "comment": "Could someone please explain to me how he got the (-n) into the equation at 40:35? I was following the reasoning until that point.", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxOLqpfCxk5HdByIt54AaABAg", "comment": "Why is he including 0 when he defines that n belongs to naltural number set", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxPwxXix9_H5svw8rl4AaABAg.9Ejuvsdw5t29bArH_6HTv9", "comment": "Damn i just had the realization too", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy-mUUnFlJVCayL_qF4AaABAg.9CGKenoN5UZ9HKoodLsU-f", "comment": "We're trying to prove the statement: \"If P(n) is true, that guarantees that P(n + 1) is true\". This statement is different to the statement \"P(n) is true\", and it's different to the statement \"P(n + 1) is true\". Instead, it's a relationship between P(n) and P(n + 1).  It's not okay to assume P(n) is true when proving P(n). But it IS okay to assume P(n) is true when proving the statement \"If P(n) is true, then P(n + 1) is true\". This is because the whole point of an \"if-then\" style statement is to say that if we assumed the first thing to be true, then the second thing would be true.  Another way of thinking about it is that we're assuming P(n) when n=0, which we've proven anyway using the base case. This then proves P(1). Then we're assuming P(n) when n=1, which we've just proven using the inductive step, and this then proves P(2). So at each step we're always assuming something true.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwmmEj4YwURLveWJJ14AaABAg.9CGKH6I6nTO9Eme0EIkFZA", "comment": "A set is a collection of distinct objects. By virtue of the fact that they are different existential beings that may be the same color, it qualifies the definition of a set.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwMT_B7UWnnr-3Vufx4AaABAg.9CE0rOCZOIG9CFGtNFwbqJ", "comment": "This is how I understood it:   1. (The failed proof i.e. our P(n) is not helpful.) The induction hypothesis P(n) is that there is an L-tiling possible for a 2^n by 2^n courtyard with Bill in the center. Now, for the inductive step, we assume P(n) is true, and we want to show P(n+1) is true, so we grow the courtyard to 2^(n+1) by 2^(n+1), section it into four quadrants (each 2^n by 2^n) and place an L shape tile (ie. 3 regular tiles in an L shape) dead center in the bigger courtyard such that the L shape tile does not land on the 2^n by 2^n section containing Bill. Now those three Bill-less sections contain 1 piece of the L-shape tile. We know that P(n) is true (because we assumed it), but we P(n) is useless for the three quadrants in question. Why? Well, for each of the 3 sections containing a piece of the L-tile, we place a \"Bill\" in the L-tile it contains. But now \"Bill\" is not in the center of those sections, it is in the corner of those sections. So we can't say anything about tiling them \"with Bill in the center\" because \"Bill\" is not in the center. Our P(n) is not helpful here.  2. (The incomplete proof i.e. our P(n) only gets us so far.) Change P(n) to say that an L-tiling of 2^n by 2^n is possible with B in the corner. Okay, again, we start with a 2^n by 2^n, but now place Bill in the corner, then we look at a 2^(n+1) by 2^(n+1), section it into four 2^n by 2^n, and place the L-tile dead center like before, such that now we have a \"Bill\" in the corner of each 2^n by 2^n section contain the L-tile, and now by our new P(n) we say that each section is L-tile-able. Therefore the whole courtyard is tile-able, so P(n+1) true. By induction, then, P(n) is true (tiling with Bill in the corner). Okay that's nice, but that's not what we want to know in our original problem. We want to know can we tile the courtyard with Bill in the center. We found a way to show that tiling is possible with Bill in the corner, but now we somehow have to use that to prove that a tiling is possible with Bill in the center. The professor says this is possible but it is just more work, and it is more simple to instead make P(n) stronger.   3. (The successful proof i.e. stronger P(n).) Stronger P(n): A tiling is possible with Bill in any square. This is similar to 2 above, but in the end we are happy because we will have showed/proved that \"a tiling is possible with B in any square\", and \"any square\" includes \"a center square\", which is what we really cared about.    This is just my understanding, I'm definitely not super confident about it lol.", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugw4z6uNkPeAP2FJYex4AaABAg.9CBVt6-t5pM9CFJMDuFOOo", "comment": "Maybe it's strong in the sense that it is more \"powerful\"? It allows you to prove what you need to know (tileable + Bill in center) but also tells you more than what you need (tileable + Bill anywhere) so now, practically speaking, you have more options.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwU33PnP0iwhXo051x4AaABAg.9Bol_gG9j-H9It_ild2eUB", "comment": "Exactly", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz2xy1DNPj6iZ4P4_B4AaABAg.9BTYP-HxrSK9BVm5s02aFU", "comment": "He added n and subtracted n at the same time, so: (n^3 + 3n^2+2n) = (n^3 + 3n^2+2n) - n + n = (n^3 -n + 3n^2+2n+n) = (n^3 -n + 3n^2+3n) =( n^3 -n) + (3n^2+3n)", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz2xy1DNPj6iZ4P4_B4AaABAg.9BTYP-HxrSK9BVuNCNyoWp", "comment": " @darbrzoz  Thank you!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxOLqpfCxk5HdByIt54AaABAg.9AsD7Frw_pz9CFIHjsohOB", "comment": "As he defined it, natural numbers includes 0 and positive natural numbers does not.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwjO9dMHgkdHAbq75B4AaABAg", "comment": "is proof by inuduction the fancy way of doing recursion?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyRQKWWYPm4r3YB6kx4AaABAg", "comment": "Is by any chance Bill’s last name is... Gates? 😎", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg", "comment": "Although its been 3 years since I studied induction in high school, only today I understood why it is true. All thanks to the Indian education system for teaching induction without teaching mathematical logic.", "votes": "179", "replies": "21", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyVbwdT1t5cP2Dx9654AaABAg", "comment": "Is there anyone solving the course problem sets who wants to compare answers with me? Thanks!", "votes": "1", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxxmHVOYlblfdeGdJR4AaABAg", "comment": "but how did BIll get in the center in the last proof?!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxN3P2FcgsxY-3kbJV4AaABAg", "comment": "Thanks to MIT for these wonderful courses😊💙🕊️💞 Also I have a doubt... Professor took n=0 in the base cases for proof by induction even though it stated n€N. It seems to work every time but could we go wrong if we take basis n=0 instead of n=1? It's a stupid question 😅I guess 😅😳😧", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyxoVcQ4IezrXvKxaV4AaABAg", "comment": "7:43 how did he know \"a squared\" was a multiple of 4 ?", "votes": "2", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyZ8aBXj8pQ2wo3y9h4AaABAg", "comment": "a name of a wealthy guy does not suppose to reveal his name ....but I'm gonna call him \"BILL\" :'D", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg", "comment": "IDK about you, but this is better than Netflix", "votes": "168", "replies": "17", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwmGBxUspfNwfn_jAd4AaABAg", "comment": "That 90 > 92 thing is kinda sounds like when you divide a 6 by 4 (24 chunks) chocolate and generates 1 more chocolate chunk and rearrange the chocolate back to 6 by 4 and you get 1 extra chunk.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzmep96XNeoxtw38lJ4AaABAg", "comment": "i still don't understand how the area is not 92 😖😭😭😭", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxghsK2WlybCZhs14h4AaABAg", "comment": "@58:30 you can prove some great stuff if you don't check the base case.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzuDsmdJCFhSrcmPZN4AaABAg", "comment": "name that wealthy man whose first name is Bill", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwzH8_uOvXwZsvGBO14AaABAg", "comment": "F in the comments for the legend", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugwuo7ojLnxnDn8un354AaABAg", "comment": "I have a deep questions iff I use 3 as a base case in horse problem then is base case fail as not all pair of horses can be of same colour when we deduce p(1) implies p(2)", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxN4cIHMhKz1gY0PQd4AaABAg", "comment": "Amazing professor most people just learn math and know nothing of the history definitely added to my rewatch list", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw46aYE2KCM7dFWJop4AaABAg", "comment": "Hot", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxN1E5aj1UMPAhhjvt4AaABAg", "comment": "I love it when the professor writes on the blackboard. It’s like they’re learning it with you. Almost all of my professors are using PowerPoint. :-/", "votes": "103", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzKMe1767KCoXrR1514AaABAg", "comment": "Especially with the last theorem, something just always feels fishy when using 0 as the base case, especially since 0 is HIGHLY debated to be a natural number in the first place - when you want to get philosophical, quantum fluctuation proves that there is no such thing as \"nothing\" in the universe and thus 0 or \"nothing\" is nothing natural :)", "votes": "1", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwqFe_tYX5UNcnOaaZ4AaABAg", "comment": "can anyone explain me how quarter of 2^n+1 square =  2n square?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9D-S8VubBom", "comment": "Yes Bro sams thing happened with me Teacher aya induction ko use kar k math kar dia 2 homework ko de dia kaam khatam 😟😟😟", "votes": "13", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9PrjiAkcIR8", "comment": "yeaaa ritt", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9QIursBCAD-", "comment": "IFKR", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9ScJtKOnVJa", "comment": "69th like", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9Sh82fZ1d4s", "comment": "We solve problems without even knowing why the hell we are solving it", "votes": "14", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9StByG_M2t7", "comment": " @sidd6803  so true", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9TaaOC3jp7E", "comment": " @sidd6803  hahaha, same here", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9dqn100ZgFu", "comment": "Haha so true. We prioritize rote learning over true understanding", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9e0Ep7Kdn9s", "comment": "Schools have not told us about \"NUMBER THEORY \" too which is a Concept Builder in Entire Mathematics ......Reason is Simple they love Mechanically Inclined Mathematics and not \"Abstract One\" where Abstractness plays a very important role in Imagination building and Critical Thinking , without assumption and abstraction , reality is Meaningless I feel In PHYSICS we are  assumed to know a lot of advanced Maths and they make us do Easier Introduction to the Chapters but when they start asking question they go to a more advanced level .....There is no step by step Learning in India", "votes": "3", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9fWb-o2xYeN", "comment": " @aberattedaniketdatta4126  schools can not give personalized courses to everyone they are to teach how to learn and give an exposure to every subject sub-subject and  not to make anyone expert in a particular field like university or college as they have to balance every student so if you want to learn a particular subject just do it. And if you look at ncert and read it it can be the best book and you can learn a lot from it alone.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9fhk_YAaaD3", "comment": "The great Indian education system and mindset in a nutshell.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9fph1SaH--L", "comment": " @metabolic_jam  Everything you do is by rote. We had our call centres in India, we gave you jobs, and because all you could do is follow a script and you could not use your own initiative to help a customer calling you, we had to bring the call centres back to our own country.  I have even seen software where GUI contained obvious spelling mistakes, the engineers know it is wrong, but are too frightened to just do it right and take the initiative to correct it.  The result is, it makes your engineers and society look stupid.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9hciKH7EiQB", "comment": "Not sure about germany now but i plus 1", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9nZ_ncl1KH8", "comment": "We Brazilians: Wait, are you guys studying induction in high school?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9s6iMqOQrst", "comment": "bruh I didn't get proof of induction and failed intro test", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9v6G8cO0AqE", "comment": "I am a mathematucs teacher in a govt school in New Delhi, I have prior experience of teaching UG and PG students in private universities. When I explain logic, conjuctures and application of Algebra like RSA cryptography to my 10th standard students they complained to the principal that I am teaching them university maths😂", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9wYrxUk_fA_", "comment": "samee!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9yO7HwwWrvH", "comment": "​ @anuraagrath8876 same for me bruh", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9zrjs1lZXxf", "comment": "​ @deang5622  I think you should write this in your personal journal or share it with your therapist. Not in public", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9zrmG9U_uCx", "comment": " @KartikayKaul  Your comment is not even relevant. It's nonsense.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzy8fnmXiRPiBBZ5AN4AaABAg.9A3wf-8QeUE9zrmMebNlPr", "comment": " @KartikayKaul  You write nonsense. Do you write a lot of nonsense?  Do you do it often?  Why do you do it?  You can't handle the truth can you?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyVbwdT1t5cP2Dx9654AaABAg.99n5-6oR3Z-9A3xDeiMUFm", "comment": "Here are the solutions of the problem sets:  https://drive.google.com/drive/folders/0B4G5KBKimr07WXRlT0VKb0E0TGc", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyVbwdT1t5cP2Dx9654AaABAg.99n5-6oR3Z-9A42zR9EMyt", "comment": " @zombiesalad2722  thank you very much!!!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyxoVcQ4IezrXvKxaV4AaABAg.99D2dviECkB99K1vo8HlaT", "comment": "You can think of 2|a (2 divides a) as an equation: 2q=a, where q is an integer. Squaring both sides: 4q^2=a^2. Now q^2 is just any integer, so you might as well write 4q=a^2. Convert back to other notation: 4|a^2.", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9Jas2_YKwzW", "comment": "Can you prove that", "votes": "25", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9jHiUhvJG58", "comment": " @codegirl2069  h", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9jHiZ05J972", "comment": "Hgh", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9jHiZ17AQ97", "comment": "Hgh", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9jHiZtyxUPu", "comment": "Th h", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9niOxSr2rqy", "comment": "​ @advitiayanand5974 'i dont see why not'", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9qDVyHQZqsf", "comment": "Why do people leave cringe like this all over the web? Are they trying to cause a scoliosis epidemic?", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9v9tvnB-9B1", "comment": "Your Netflix is broken", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9w4nev2q9qP", "comment": "​ @advitiayanand5974 if you assume that there is gay shit on netflix and there isn't gay shit in math because math is not concerned with that and if you assume that gay shit is bad then math is better than netflix", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklS9wJhsqzdD9U", "comment": "You got me", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA-otWdnhRVp", "comment": "I feel u", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA0HVT51TkUm", "comment": " @advitiayanand5974  it's axiom", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA1uWqcKnj_o", "comment": " @advitiayanand5974  Yes.  The legend of Pythagorean Deep Throat.  QED.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA3VhWMtrEn2", "comment": "Well, your some einstein stuff cuz I don't get a single thing", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA3VhrheV0Cb", "comment": "​ @joshbarghest7058 what's cringe about enjoying something 99.9% DON'T?", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA3Vhy-v1en8", "comment": "Well your one of those ppl who are gonna propel the world forward, keep It up", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxcJO1xHBfTtICP6QZ4AaABAg.97Ye5pyGklSA3Vln_rhn5g", "comment": " @AdityaDixit-g2f  nah just watch it multiply times, if don't know some thing and teacher don't explain google it, trust me math is for everyone it's just group of easy things, it's builded upon couple of easiest axilm so d", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxN1E5aj1UMPAhhjvt4AaABAg.95A98Ds9Pjp9X32pskchK0", "comment": "Lies again? MRT MIT", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxN1E5aj1UMPAhhjvt4AaABAg.95A98Ds9Pjp9XJAUIapwKe", "comment": "Always be vary of the powerpoint", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxN1E5aj1UMPAhhjvt4AaABAg.95A98Ds9Pjp9fphj0NzJV7", "comment": "Power Point is the lazy man's choice", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzKMe1767KCoXrR1514AaABAg.951uOZHBNIN95oAqLEnZ64", "comment": "In always understood the natural numbers i.e. counting  numbers began with 1 Not zero.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzKMe1767KCoXrR1514AaABAg.951uOZHBNIN9Fi61mJSW6a", "comment": "it still checks out with n = 1", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwqFe_tYX5UNcnOaaZ4AaABAg.94NubQEjm3_99-BF6cS3XL", "comment": "(2^n+2^n) = 2(2^n) = 2^1(2^n) = 2^(n+1). Since each side of the 2^(n+1) square is two 2^n pieces, the square is composed of four 2^n squares.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxeIYyQiP-uIfpX-nV4AaABAg", "comment": "shouldn't the mathematical induction be the knowledge in high school, haha?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugxk90FYBngut3_FtCt4AaABAg", "comment": "who needs drugs if you have such proofs.. great job.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx4-NkTwdaKVRdz4494AaABAg", "comment": "there anyone thinking of studying this course at the end of 2019?", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzU3zCHjPagXAkoz-54AaABAg", "comment": "How does the horse proof hold for the case where n>=2? The text says \"You should think about how to explain to such a student why this claim would get no credit on a Math for Computer Science exam.\"   Just to be sure, can someone articulate the explanation?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzwbo1GG0c84oEMLyp4AaABAg", "comment": "For the proof of root 2 is irrational, if a and b occurs to be even, they could be divided by two and be reduced to lowest fraction right?😮", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzCYwGnbpliXE5q07d4AaABAg", "comment": "tq mit ocw", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx8IIpT1uLCRw3F-m94AaABAg", "comment": "wait so if we assume that any pair of horses are the same color or P(2) is true, then we can say that all n horses in a set are the same color given n>=2??????????", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyzQs-b4pmsllNfBrp4AaABAg", "comment": "basis: 2x2 can be tile with a single tile that leaves the NE corner empty. Assume this holds for P(n) now show P(n+1). Split the corresponding 2^nx2^n into 2 regions of size 2^n, apply the induction hypothesis, it gives you that all of these 4 regions can be tiled leaving the NE corner empty. Now simply rotate the NW and SE 2^nx2^n regions 90 and -90 , respectively and you get a L-shaped tile missing in the middle - put a tile here. QED. Now to finish it off, when you have the required size you simply rotate the NE sub square by 180 to get its NE corner to the middle.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwC2xvWFrL8-Dj13Np4AaABAg", "comment": "On the horse problem my understanding is this: We cant prove p(2) i.e 2 horses are of same colour using the base case p(1). A set of 1 horse is of same colour but that doesnt prove that in set of 2 horses both of them are same colour. We cant use p(1) to prove p(2)", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgymTmMXn2YowVoorml4AaABAg", "comment": "okay i have a doubt in the tile question if we are changing the cases for eg from center to corner and corner to any tile then the base case must be change as well and in the base case there will be 16 cases in which we have to proove the question for each case now thats make our life harder but in the last teacher said that this is easy how man how can one totally forget about the base case", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxuOIoVdk8-E692Fzt4AaABAg", "comment": "\"beat me, it doesn't look like a multiple of 3\"", "votes": "12", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxRkOwlo5GBfxXBON94AaABAg", "comment": "I wish, i were studying in this institution.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwRuRYQK_pL7WRb8et4AaABAg", "comment": "holy shit! why I didnt discover this video when I was in school, it is so intersting and intriguing!", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwSTnYLyv0GaZsCfwl4AaABAg", "comment": "L tile problem gone above my head .....!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz1oQRUPwk3eK6kiRB4AaABAg", "comment": "This is why I find discrete math is more challenging to grasp than any other branch of math.", "votes": "1", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwkUAaAA1BK8MycCIR4AaABAg", "comment": "Bill, take your money away!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzwKzeD61e-iB6RHpR4AaABAg", "comment": "So, i'm learning from MIT...Thank you ❤", "votes": "20", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwLO1rFdfu0NhVAiPh4AaABAg", "comment": "oh math is a real art", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxP_pf47Pz0CKWicxZ4AaABAg", "comment": "Very informative. Teachers in my school never explained why we take p(n) => p(n+1) at inductive step.", "votes": "5", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugyee9ARlW2pFwhWqMB4AaABAg", "comment": "the decimal place value system developed in 5th century by aryabhatta but yeah greek knew about it altough we have no proof about it . i totally belive this story", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx4-NkTwdaKVRdz4494AaABAg.934clfyAzlw9375lnLUSU_", "comment": "Aye - doing it right now!", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugx4-NkTwdaKVRdz4494AaABAg.934clfyAzlw96kuVlRpPpk", "comment": "no", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzwbo1GG0c84oEMLyp4AaABAg.91KBN8ib1fE9K8b08L9SmY", "comment": "That’s the point of it, when you need to reduce the fraction, it’s not yet a lowest fraction. Even though the fractions before and after reduction are quantitatively the same, they have different truth value as to whether the fraction can be reduced or not.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugx8IIpT1uLCRw3F-m94AaABAg.90iGQkAFei590t2Tz07kt1", "comment": "Yes, but you can never prove that P(2) is true ;), so you can never start to domino your way to infinity.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwC2xvWFrL8-Dj13Np4AaABAg.9-hy228woZm90iG7y6c8Cy", "comment": "Yes thats true because if we assume p(1) to be true, then p(2) has to be false since so the implication is false. Because of this, the inductive \"Domino\" is not started since the base case itself fails.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxuOIoVdk8-E692Fzt4AaABAg.9-ITQn5yql_9-oJtnf2Q67", "comment": "Ali Abdul-Kareem loves his response to that as well haha", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz1oQRUPwk3eK6kiRB4AaABAg.8vA5YN7rSXz8wIWWoPWTE7", "comment": "Really? I prefer discrete math over lets say calculus", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz1oQRUPwk3eK6kiRB4AaABAg.8vA5YN7rSXz9H0qQI7iQ57", "comment": "Nah man calculus is fun", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzwKzeD61e-iB6RHpR4AaABAg.8tGeRDzxWqU8wu_Y01OrFR", "comment": "this proves to me, it would not have been a good idea for me to go to MIT : (", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzwKzeD61e-iB6RHpR4AaABAg.8tGeRDzxWqU97PZP4FcXgu", "comment": " @donsurlylyte  why not?", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxP_pf47Pz0CKWicxZ4AaABAg.8snEd4y7x1u8tYWPA01O71", "comment": "Which school! I'm Indiab Too", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz0A4ataeifAncjm7B4AaABAg", "comment": "That is the most absurd explanation of why Pythagoras was killed.  He was killed because of his philosophical convictions about the soul of man.  Nothing to do with his math skills.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzISGSBEco2PfhvShx4AaABAg", "comment": "Is there anyone who has solutions of \"Mathematics for computer Science\"?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzl59vk9yNmhFQqFEN4AaABAg", "comment": "We students in China learn induction when we are 15...", "votes": "1", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwgVBIWIgJ6SLaBf3J4AaABAg", "comment": "What a great lecture. Thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugx2NivX7-X5NYRrIgR4AaABAg", "comment": "can someone explain why he said\"even when there's a square missing, we're in trouble. say this 64........\" at 01:07:45?", "votes": "1", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwNbqr4tUzKXZcYLp14AaABAg", "comment": "Do we have recitation playlist as well?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwOupQDySozjggwEJp4AaABAg", "comment": "I teach maths+logic to computer science students. But I could not do these broken/repairable inductive proofs with my undergraduate students, I'd just get a wall of blank stares back. You need to have some super-bright students to have them spot that the Bill-in-the-corner proposition can be used as a lemma to prove the main theorem. That the broken horse-proof flummoxed an earlier cohort in their homework just goes to show that even at MIT you can push the boat out too far...", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw0rnGQPD3bH8iAxqR4AaABAg", "comment": "Very very bad math level for university students, I started by set theory and topology in my first year at university.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgybsJynU8-r6IKe7Yp4AaABAg", "comment": "feeling blessed after joining MIT open courses ;-)", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgynbmP5sCooIzW-pkV4AaABAg", "comment": "For the set which contains all sets of length n, where all sets of length n+1 has only horses of the same colour, it was not shown that the set of length 1 is a member.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqKlnhnTjLX2wKk14AaABAg", "comment": "22:16 is the best explanation of induction in my life.", "votes": "1", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugy7N_Jyoie7hAjD18d4AaABAg", "comment": "Is it okay if I didn't understand proof by induction?     I mean am I dumb or it's a complex math. Or does it require a previous knowledge of math.", "votes": "5", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxlSGpK2P7LRcHWRa54AaABAg", "comment": "The number is one and two in line.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyirZy20Cyl0b4h5LN4AaABAg", "comment": "Wow that is a great lecture :)))) I love Discrete Math now", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz6Iyk6agTAPEHQPr94AaABAg", "comment": "Why is this in my suggested", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw5PToBoSXEvkLc1uh4AaABAg", "comment": "10:53 The Greeks didn't have decimal notation.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzVNCwOGmozqOVHzfp4AaABAg", "comment": "Indeed, fabulous. Learned all the induction from here. Thank you so much!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugwj7iprVXSRaKwESNR4AaABAg", "comment": "I think it is the consensus among all CS students around the world, that this is the class that's kills us all.", "votes": "10", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxgIa8zoga18aYtpVZ4AaABAg", "comment": "Are there any lecture notes available?", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwX0Lv7sMfXb_H9MTh4AaABAg", "comment": "k j m   E.g take b2 we will have k,j,j,m etc the same will have k,m,j,m then c will have k,k,j,m etc       j  m k  take c2(b) we will have  kjjm the same will have k,m,j,m then c will have kkjm etc       j  k m  one letter k generates 3 options, the second the same when we get to row 2 the same       m k j  bearing in mind the letters the options generated by the column from 1 to 4 must differ       j  k m  even if I what to go up to 100. which branch of maths is this?        k m j from k alone in my example I will get three more columns, j the same getting these results, e.g        m j k    k again the same k to produce        b2 k b2 k b2 k after k I will start with j,m ,j,m ,j,k,m     b3 j c3 m  d3 k the j k j m j k m.     b4 j b4 j b4 j      b5 m  b5 m  b5 m      b6 j b6 j b6 j      b7 k b7 k b7 k      b8 m  b8 m  b8 m", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzISGSBEco2PfhvShx4AaABAg.8rkK5W6DQRu8rpfDKVM1Hg", "comment": "Yeah, you can find them pretty easily", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzl59vk9yNmhFQqFEN4AaABAg.8qlBZZzBmWM8t5NlsSfR60", "comment": "Yeah, but i still learn a lot in the lecture", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugzl59vk9yNmhFQqFEN4AaABAg.8qlBZZzBmWM8tYWUEirtna", "comment": "Same here in india also  We learn integration at 16", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugx2NivX7-X5NYRrIgR4AaABAg.8pkfwptZQj39BPfakXLc8V", "comment": "by 64x4 he actually meant 4x4 (as he corrects later). In a 4x4 square we have 16 square tiles capacity. Even when there is no square missing(in the 4x4 square), and you try filling it with L shaped tiles (which have size 3), its not possible because there are 16 squares and you cant fill it completely with 3 tile sized squares. It is because 16 is not divisible by 3.   The whole bigger square has 64 square tiles and on dividing it into 4 parts we have four 16 tiled(4x4) squares. Hope this helps", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwNbqr4tUzKXZcYLp14AaABAg.8pIfqHnG1yB8pKQVsfAOPg", "comment": "Sorry, there are no video recitations. There are recitation problems and notes, which include solutions. See the course on MIT OpenCourseWare for the free materials at: http://ocw.mit.edu/6-042JF10. Best wishes on your studies!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqKlnhnTjLX2wKk14AaABAg.8n7ZS2Iytag9C-M9TpRbJp", "comment": "Indeed!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy7N_Jyoie7hAjD18d4AaABAg.8mMLnScvrvT8mZyM6MN8KB", "comment": "Even I didnt understand that much , all I did was that, if you can assume p(n) and show that p(n+1) is also true, then you have proved it", "votes": "5", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy7N_Jyoie7hAjD18d4AaABAg.8mMLnScvrvT8oS_P3d-Hpr", "comment": "Induction can be pretty hard to understand at first. I didn't really understand it for a few years after first studying it. Many people struggle with induction, but with some persistence you can understand it.  My advice is to watch some more videos about it until you understsnd how to use it. If it still doesn't make sense to you after watching one video, come back the next day and watch another one. Sleeping on something is really helpful.   Once you have learned how to use induction, do some practice problems. Finally, after doing practice problems, watch this video again. Your practical experience will make it much easier to understand the theory behind induction proofs.  You can't always learn a difficult concept like induction all at once. But, by chipping away at it over time, you can come to truly understand it.", "votes": "3", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugy7N_Jyoie7hAjD18d4AaABAg.8mMLnScvrvT9K8cON_7SQf", "comment": "You need the base case to prove everything. The base is, literally, the base. You build from the ground up. When you’ve proved that the ground floor is perfectly done, and you have got the fact that a solid floor would enable you to build a floor on top of it, then you can theoretically construct a building with infinitely many floors.  The physical world says such building is not possible, but such thinking is reasonable in the realm of the induction axiom. That’s why the method of induction is an axiom, because it doesn’t apply to everything in the universe, and is chosen according to our purpose.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxgIa8zoga18aYtpVZ4AaABAg.8ikpBbH2u2d8ilT5XdGOYx", "comment": "Sorry, it doesn't look like it. The materials we do have are here:  http://ocw.mit.edu/6-042JF10. You might want to also check out the Spring 2015 version, it has lecture notes: http://ocw.mit.edu/6-042JS15. Best wishes on your studies!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxgIa8zoga18aYtpVZ4AaABAg.8ikpBbH2u2d8jjAuHqXkmK", "comment": "https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-fall-2010/readings/", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxvIcV25IQmkNf2u2d4AaABAg", "comment": "Proof by induction is great.. I didn't fully grasp the tile problem, but I guess it will come to me by some time..", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyRKP_Wdnf4GLpCN1J4AaABAg", "comment": "in the problem All horses are the same color . the prof first applied p(n) to 1 to n horses then applied p(n)  to 2 to n+1 horses. isnt that wrong?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxJ7vRi0QT5GNBXHGl4AaABAg", "comment": "do u guys know that this prof is a multimillinoire?", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugyo2HPZ-ua4GIG90PR4AaABAg", "comment": "At 45:01, why can't we take the predicate - P(n) : n horses are of same color?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwRl66XUQ8QUFVi_k94AaABAg", "comment": "I'm a bit lost with \"Bill's\" problem... Do I need to study matrices properties with powers of 2 ?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyUnDaPV2PK6kDejK14AaABAg", "comment": "Can anybody tell me how a is even from 2*(b^2) = a^2    ??", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxreXVQNNN8TpsFmWV4AaABAg", "comment": "lol, if you can proof bill can be in the corner, you just need to rotate the quarter that bill is in to put him in the middle. is it wrong?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugz8Xp_LTFpOMzdajld4AaABAg", "comment": "58:20 \"So always check the base case. You could prove some great stuff if you don't check the base case.\" I love this sentence XDDD", "votes": "97", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqtfWy5DuJSzT2n14AaABAg", "comment": "i am understanding something with the horse thing wrong so please correct me if you think i am wrong and why?... ok so, why i think the horse was wrong is that when we assume that p(n) is true we also defined p(n) to be the set from h1,h2,...,hn but when we examined p(n+1) we also assumed that p(n) is {h2,h3,..,hn+1} is true but that means that p(n) has two different sets which is against  the math logic that p(n) (a function) has only one answer..... so thats why i think it is wrong not that we didn't test it for p(1)=>p(2) .... so if you think i am wrong please tell me why ,thank you.", "votes": "0", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzPT4WkOQz-Z42lFFd4AaABAg", "comment": "here   a 2018 learner pleaseeee keep these videos alive!!! excellent job thank!!!! so", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg", "comment": "Providing more clarity on the Horse Problem. For the Induction Axiom to work, there are two requirements.  1. Base case must be true  - P(1) is trivially true, because the 1 horse will always be the same color as itself.  2. P(n) => P(n+1) - So, when we write n horses, we typically write h(1), h(2), h(3) ....h(n) & for n+1 horses h(1), h(2), h(3) ....h(n), h(n+1)  In the above statements, we sub-consciously assume that n is a bigger number greater than 1. Here lies the mistake. Since n can be any number, n can also be 1. So, the list can be:  h(n) -----> for n horses h(n), h(n+1) -----> for n+1 horses  More specifically: h(1) -----> for n horses, where n being 1 h(1), h(2) -----> for n+1 horses, where n being 1  Now, as per inductive step, predicate is assumed to be true.  Assumption: Set of any n horses is of the same color. => h(1) is the same color as itself, say color c1 The assumption also implies that h(2) is the same color of itself, say color c2 Now does h(1) => h(2)? i.e. does c1 = c2? We can't determine that, can we? There is no way we say c1 is always same as c2. So, the inductive step breaks.  The takeaway from this problem is to remember the \"...\" bug that we sub-consciously tend to make. Hope it helps someone :)", "votes": "326", "replies": "15", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwaPQu6XXKYizBHyXd4AaABAg", "comment": "prove that proof by induction works.", "votes": "4", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzjZ27d1bbZ-89Fltx4AaABAg", "comment": "15:30 why this dotted line bigger than two? 2/10 = x/9 => x < 2 that's the truth", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugxjm8jXZxs2SphzWp14AaABAg", "comment": "Question for the horse problem: Why didn't his base case prove/imply that H2 was true? From what I see, it looks the same as his other base cases, he proved that P(1) is true, and then went on to the the inductive step. What am I missing that makes it wrong?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwOhRgVSzXT7yPJgup4AaABAg", "comment": "If you want to save a lot of time, play this video 2x faster along with subtitles.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugzx_Yl76hxpvUBx5Tt4AaABAg", "comment": "Nobody puts Billy in a corner!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxwobrE2XBBj6IPLmh4AaABAg", "comment": "The proof for Horses was wrong for a different reason.  For his proof, n is 'any' set...  which means any arbitrary set you can choose.  But in his induction step he treated n as a variable which is using the proposition to prove itself.  False by circular reasoning.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyhGRbpMsrMIpJObq94AaABAg", "comment": "@1:01:05  \"I'm not supposed to reveal his name so let's call him Bill\"  LOL", "votes": "18", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw733Bkx7YH-LONfqV4AaABAg", "comment": "What a great teacher", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghVAKDCeDbucXgCoAEC", "comment": "@7:45 How is 'a', a multiple of 4? How did he arrive at that?", "votes": "3", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyRKP_Wdnf4GLpCN1J4AaABAg.8i-SXxrZoLk8pHwDTsG6kl", "comment": "What I understand from the base case is that he proved if there is a single horse in a set it is going to be same color. But when you add another horse in the set. The set may be of same color. So here the test fails itself.  This is what I got from the base case.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugyo2HPZ-ua4GIG90PR4AaABAg.8hrqOgED0958pHwFMbfFcg", "comment": "you can.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyUnDaPV2PK6kDejK14AaABAg.8gjZ3PGYVEx8lGu-E0P2er", "comment": "Regardless of the value of b^2,  2*(b^2), will equal to even number because of 2. If a^2 is even, a must be even because any odd number given to a will turn out the result odd as well (if a=3 then a^2 = 9,  if a is 5, then a^2 is 25, ....)", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyUnDaPV2PK6kDejK14AaABAg.8gjZ3PGYVEx95q9qke6nd2", "comment": " @seydiahmetozkaya1768  thanks", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz8Xp_LTFpOMzdajld4AaABAg.8fexbMfVvVQ90eBverTvXj", "comment": "This is Awesome!!!", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugz8Xp_LTFpOMzdajld4AaABAg.8fexbMfVvVQA3Vhc2oQt9M", "comment": "Louis Stuck till the end", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqtfWy5DuJSzT2n14AaABAg.8ciJitdMY-98ciKQSo3XaO", "comment": "and FYI this is just so i can understand it completely since i am unable to understand it other way... and it is in no way attacking or trying to insult the instructor .. he i am taking induction in my college but he is a way better instructor and i understand everything before the horse thing.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqtfWy5DuJSzT2n14AaABAg.8ciJitdMY-98dBbvy7ERrN", "comment": "The assumption was for 'any set of N horses'. So there is no problem if {h1,h2,...,hn} and {h2,h3...,hn+1} are different.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgxNqtfWy5DuJSzT2n14AaABAg.8ciJitdMY-98dR-fdFi4HH", "comment": "ohhh now i get it i am measuring this using numbers so thats why it didn't make sense ok thanks for explaining it", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzPT4WkOQz-Z42lFFd4AaABAg.8cLVX1Hgb_g9YzL6CYw_ns", "comment": "learning in 2022 and yes it's still alive and very useful to me", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i8yCgH77VvIj", "comment": "thank you !!", "votes": "5", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i8yloWyaL4cP", "comment": "Thank you so much!", "votes": "5", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i95n1TBnSPjk", "comment": "thanks :)", "votes": "3", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9Ajl6w2nXrt", "comment": "No bruh I think this is incorrect", "votes": "9", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9BQS5coDEna", "comment": "The implication is false when true implies false.  Since h(1) is true, and h(2) is true, the implication h(1) => h(2) is true.", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9H_vEP3IdSG", "comment": "can we do proof by google images?", "votes": "6", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9JcaxzrgSud", "comment": "But also u cannot determine that P(2) => P(3) are same colour right?", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9LGzgLAIdBI", "comment": "Wow! Such a clear explanation. Not that it wasn't clear from the video, but this comment gave me more clarity on the horse problem. Thank you!", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9OCBgkY7SaY", "comment": " @tuanchu8022  nah! I don't think so......  Say proposition p1 is  P1: Taj Mahal is in India  And  P2: Jupiter is the largest planet in the solar system  Both are true doesn't imply P1=>P2. Say I attack Taj Mahal and declare it an autonomous region, P1 becomes false, but P2 is unaffected, Jupiter wont shrink seeing me do so........", "votes": "6", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9ObneKya4ie", "comment": "Ok bhai jan", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9PElkSxIie3", "comment": "Great clarity provided by writing \"we \"subconsciously\" assume n is bigger than 1\".", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9Q2HOXFA3gT", "comment": " @akankshasharma7498  But if the Taj Mahal no longer counts as being in India and Jupiter is still the biggest, P1 becomes false and P2 is still true. That ends up as false implies true, which still works quite nicely :p", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9VAmmiAq5n4", "comment": " @akankshasharma7498  but even when P1 is false, P2 is true. So, even if you make the Taj mahal an autonomous region, Jupiter will still be the largest planet in the solar system.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9aw_4_3MzhQ", "comment": "Yes the key point is that the inductive step needs to work for all n. It doesn't work going from n=1 to n=2 because there is no overlap", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgysgYL_IYqL8dBqqRJ4AaABAg.8ZGHnPyuy6i9faz4wdhuqB", "comment": "@Xiaofeng Qiu Yeah that’s the only problem even if we take h(2) as the base case,then the base case is already false so the basic axiom of Principle of Mathematical Induction wouldn’t be satisfied.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgwaPQu6XXKYizBHyXd4AaABAg.8YkabNsWMAH8b_O751BfC6", "comment": "That's the whole point of the axiom. If we could prove it, we wouldn't need an axiom. :)", "votes": "5", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgzjZ27d1bbZ-89Fltx4AaABAg.8Y9Idqijyoj8hrqin00bAl", "comment": "Yes, you are correct and that is what professor implies while deriving falsehood of proof. We should not always depend upon graphs on paper for deriving proofs.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugxjm8jXZxs2SphzWp14AaABAg.8XhvfIdTwTC8sYn7Uwj0ec", "comment": "In short, the trick he used to prove that p(n) => p(n+1) only works if n > 1 (example, if I had three horses and I assume that for any set of two horses, they are all the same color, I can group the first two and the last two and then conclude that all three are the same color. That would be a valid inductive step, but it just doesn't work if we have two horses and we assume the proposition for n=1)", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgyhGRbpMsrMIpJObq94AaABAg.8WUZ4JwzO4D9PyVIl-tYgX", "comment": "And its Bill Gates", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghVAKDCeDbucXgCoAEC.8UVJB13kcoK8WUfwMWUIKf", "comment": "Because an even number has 2 as its factor and even we square it then it becomes 4. So you can say that square of every even number has 4 as its factor.    example :  let a= 2*n squaring both sides, we get a^2 = 4 * n^2 hence we can say that square of an even number has 4 as its factor or square of an even number is divisible by 4.", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugj2C4li3isHjXgCoAEC", "comment": "Holy shit, these lectures make me mind blow I might have to try and do the readings first and take some time to eat some of these ideas but holy hell", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiIHJ36xDfbTHgCoAEC", "comment": "How 3|[(0^3)-0] be true in base step at #39:09 ? It surely looks false to me since n|0 is not defined. Therefore there should be limit for n to be greater than 0.", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggEVqMDcxGGmHgCoAEC", "comment": "In the last proof of 2^n x 2^n tiles, can I make a proposition with \"any corner\" instead of \"anywhere\" ? This way I will have a more powerful P(n) without any need of lemma?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugi7yudsWvHofHgCoAEC", "comment": "If only I had a lecturer to teach at my university...", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgguvJvfLlvddHgCoAEC", "comment": "\"If you don't succeed at first, try something harder\". Hahaha great quote.", "votes": "35", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugj17Piidr0aWXgCoAEC", "comment": "This is awesome :)", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjvzUFeQnpdw3gCoAEC", "comment": "Also, I still can't figure out how come a harder case can be proved even more easily?", "votes": "1", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugh7syp3FUQkB3gCoAEC", "comment": "In the end, i don't follow. In the Bill's last case, he said that Bill could be anywhere, but the example shows that it specifically is put in the corner--not anywhere, is there a fault? Can it be proved?", "votes": "2", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugi_UQ5EP5lHaXgCoAEC", "comment": "I wanna to know the reading assignments. There is no information about this on the website of the course. Thx.^ ^", "votes": "1", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghCDRrtYhDd6ngCoAEC", "comment": "At 34:30, shouldn't that be \"for all n greater than zero\" as opposed to greater than or equal to zero?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgilFB9xj1O1MHgCoAEC", "comment": "Thank you MIT, for your education.", "votes": "4", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugj3n3SeusXfc3gCoAEC", "comment": "I wasn't aware there were mathematical whistleblowers in ancient Greece ! haha . Great lecture though.", "votes": "7", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiotI5f10U943gCoAEC", "comment": "Around 34:00, he shows that (n+1)/2+(n+2)=n^2+2n+n+2/2. ... What algebra method is used to determine this? I can see how the third and final result of (n+1)(n+2)/2 is derived from the reverse of the FOIL method, but how did he get from step 1 to 2?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggJ8PVYbh6RtHgCoAEC", "comment": "Man, that horse proof was a mindfuck...", "votes": "101", "replies": "4", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugi04ptVh_V2tngCoAEC", "comment": "I don't understand why he said 1:09:25 \"We don't want put Bill in the corner, but in the center.\". In his initial example with n=2 (1:01:40) he put Bill in the corner as well.", "votes": "3", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjLg_Od-OYVqHgCoAEC", "comment": "very helpful lecture", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjefHWloFr4MHgCoAEC", "comment": "professor explained things simply", "votes": "2", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugh6Vt-53vIn63gCoAEC", "comment": "In the induction step, why can we assume the induction hypothesis to be true?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UginJp51zSUh6HgCoAEC", "comment": "Hello, thank you for all your efforts. I would like to know if the Recitation videos for this class are available to the general public.", "votes": "3", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgikVdxnVORT4XgCoAEC", "comment": "absolutely brilliant class", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiIHJ36xDfbTHgCoAEC.8TCUHaRxOKN8TQeVlEcJid", "comment": "I assume you are talking about base case at 38:18. It is 3|(0-0), meaning that 0 is a multiple of 3, or 0/3 which is zero. I think you misunderstand this as 3/0 as an undefined quotient?", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiIHJ36xDfbTHgCoAEC.8TCUHaRxOKN8T_zDm5e53s", "comment": "well done kenta bro", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgguvJvfLlvddHgCoAEC.8Rw90S4XAI78mBBCCMEe86", "comment": "This actually works believe it or not.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjvzUFeQnpdw3gCoAEC.8OYsopE6uEK9C-M_Tinp7O", "comment": "Since the assumption was much more relaxed, we weren't constrained by the specific corner case to argue further.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjvzUFeQnpdw3gCoAEC.8OYsopE6uEK9FyR1S7xqR_", "comment": " @jamaluddin9158  Okay, but in that case, I think we should actually prove that ANY square will work, and not just that random square will work, as professor did. I'm a bit confused because of this approach.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjvzUFeQnpdw3gCoAEC.8OYsopE6uEK9G042F6I45M", "comment": " @xkali8119  can you elaborate on your doubt? What are you confused about?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugh7syp3FUQkB3gCoAEC.8OYsfjO6zvd8QX4zUFi7V9", "comment": "No.he just prove a stronger proposition that bill can be anywhere.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugh7syp3FUQkB3gCoAEC.8OYsfjO6zvd8jSUbGltvHH", "comment": "The original question asked him to prove bill can be in the center. He proved that bill can be anywhere, and therefore can be in the center.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugi_UQ5EP5lHaXgCoAEC.8Nx1YRpgLtV8Ny86snkqZl", "comment": "The readings can be found in the Readings section of the course website:   https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-fall-2010/readings/.", "votes": "5", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugi_UQ5EP5lHaXgCoAEC.8Nx1YRpgLtV8UVMDpZ4GH4", "comment": "You guys are God. Anyone who provides quality education is God. And that too for free, trust me you are making millions people living in third world countries where education is poor because of bureaucrats, internet is teaching us. THanks a ton. Once you teach us, we know how to fish for rest of our life? And an entire generation will thrive. Thanks a ton. Long live MIT.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghCDRrtYhDd6ngCoAEC.8Ms3czA0Hp98T_zMRVKqzk", "comment": "nope its right..check some avobe comment...it is right", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiotI5f10U943gCoAEC.8JPznOzJVvq8LtyWT_q8Ks", "comment": "jackobthesnakob by expanding \"n+1 \" with 2 , in Order to get 2(n+1)/2", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggJ8PVYbh6RtHgCoAEC.8J6G5Q9nNem8NLP_N3ywiL", "comment": "Have you ever followed the horse proof while high, man", "votes": "17", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggJ8PVYbh6RtHgCoAEC.8J6G5Q9nNem8NsviIxmeG5", "comment": "zooscientist1 you get get", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggJ8PVYbh6RtHgCoAEC.8J6G5Q9nNem8UAQkcW6vQh", "comment": "Please call", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggJ8PVYbh6RtHgCoAEC.8J6G5Q9nNem9FWiAisIznB", "comment": " @zooscientist1  hahahahahahahahahahahahahahahahahahahaha", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugi04ptVh_V2tngCoAEC.8IwhZcw87138p9_hYg7oR-", "comment": "The tiles are L shaped , the minimum size of area would’ve 4x4 , four L shaped tiles . Then Bill would be in the corner of each L shaped tile but in the center of the 4 L shaped tiles. To me  2 to the n has to be divisible by 4 .", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjefHWloFr4MHgCoAEC.8HI0ZtJNKYB9EJ_k7KZDp2", "comment": "True. Made it easy to understand 🙂", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UginJp51zSUh6HgCoAEC.8GnH1kZc9M-8GnWsNYEWTP", "comment": "Sorry there are no recitation videos available for this course but there are recitation notes available. Hopefully they will be of some help. See the course on MIT OpenCourseWare for the materials at http://ocw.mit.edu/6-042JF10.", "votes": "9", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UginJp51zSUh6HgCoAEC.8GnH1kZc9M-92amMSr9lui", "comment": " @mitocw  it is really wonderful how much mit does so that quality education is available to everyone for free.", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjqf-_xkA6YY3gCoAEC", "comment": "sir Time 15:45 , trying to prove 90>92  there in the doted line of a small triangle whose length is 2 is counted in both (small deducted triangle) square length whose length was supposed to be 9-2=7 but counted as 9 by8 AND  In that small Deducted triangle whose length and breadth is 2 either you count in (small deducted triangle)real length 9-2=7by8  Or  In that small deducted triangle whose length and breadth is 2 by 2", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiybfX03hZV-3gCoAEC", "comment": "and hey don't Natural Numbers start from 1 and it is Whole Numbers that start from 0 (zero) ?? \" 21:36  http://www.virtualnerd.com/algebra-2/equations-inequalities/real-numbers/number-types/natural-and-whole-numbers-definition", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghGlORnxDUn_XgCoAEC", "comment": "2/(triangleHeight -2) :: (suppposed2+Width/triangleWidth)  triangleHeight = 10; traingleWidth = 9 2/8 == supposed2+Width/9 9/4 = suppposed2+Width== 2.25  (triangleHeight -2)x(triangleWidth + supposed2+Width) == actual area 8x(9+2.25) = 90  how does that person @ 18:00 say 1.8 something and also the professor.. can anyone explain??  (a -2)(b + c) == ab    (conservation of area) c/b == 2/(a - 2)", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiOOthhKwavIngCoAEC", "comment": "killing that pythogarian was quite irrational... :P", "votes": "240", "replies": "4", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiAxrzNeZiUFngCoAEC", "comment": "In the horses example, we chose the wrong base case. we should have started with 2. But couldn't we just say the base case is 3 or 4 ? and that would yield a correct proof? What governs our choice of the base case ?", "votes": "0", "replies": "4", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Uggmaj6A8l3ys3gCoAEC", "comment": "What's with this guy and the God talk?", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjxOhc4XdvSF3gCoAEC", "comment": "https://www.facebook.com/photo.php?fbid=10208289402307051", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgimXkxuvth02XgCoAEC", "comment": "In the question about the horses,we get P(2) implies P(3),P(3) implies P(4) and so forth.Suppose,I frame a statement \"Given that 2 horses are of the same colour,any set of horses greater than 2 must be of the same colour\",wouldn't this become true?Which is wrong.So,what's wrong with my statement?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiJBa_K3OHIBHgCoAEC", "comment": "they are indepenndet sets yellow and red", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UginLs09X29qfXgCoAEC", "comment": "7:34 (2/a) how that ?!", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugg-Vflc46mPfXgCoAEC", "comment": "thx,mit,this course really helps", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggaIyFd7jRhqngCoAEC", "comment": "Can anyone tell me that how b is even when 2 | b^2  @ (8:08) Thanks in advance", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiPxicHCrB0VHgCoAEC", "comment": "Fuuuuuuuuuuuuuuck this.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghuaiWZRq2DZ3gCoAEC", "comment": "40:41 I don't get it. Can someone explain?  why'd he subtracted n from n^3+3n^2+2n? and how'd it ended up n^3-n+3n^2+3n.", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggoUu61v4maqHgCoAEC", "comment": "I have horrible ADHD and I thought I would never be able to learn this class, but when I am able to rewind the vid when my mind fazes, this becomes such an easy class. Thank goodness for online vids and a good teacher! Thanks", "votes": "189", "replies": "5", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjeP0p5FUh0E3gCoAEC", "comment": "Awesome lecture.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugj5rbmtInzztHgCoAEC", "comment": "At the inductive step, shouldn't be a double arrow between p(n) and p(n+1)? because at the end when you prove that p(n+1) is true that makes the expression p(n) also true", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghcnyWdhkvsmHgCoAEC", "comment": "Quick Question:  we assumed that P(n) is true, according to that P(n) implies P(n+1) is only and only true if P(n+1) is true, I got this. But, on the other hand, P(n) implies P(n+1) is also true if P(n) is false, regardless to what P(n+1) is, that's where I get a little confused, what happens if we assume that P(n) is false?", "votes": "0", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugi4ts6LCVbs1XgCoAEC", "comment": "On the court yard proof... the base case isn't correct because the statue isn't in the center. It's off to the side in one of the quadrants. It should be partially in all four quadrants to be considered centered...", "votes": "6", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggtEhxQvdmJbXgCoAEC", "comment": "Just this second class completely destroyed my ego. One of the most difficult but stimulating and satisfying classes I've ever engaged myself in; for once I'm truly haunted by what lies ahead.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgiOOthhKwavIngCoAEC.8GCPGLhak058U182wCcpkg", "comment": "get out", "votes": "23", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiOOthhKwavIngCoAEC.8GCPGLhak059D-SD0VMRN6", "comment": "Dude 😬😬", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiOOthhKwavIngCoAEC.8GCPGLhak059H0nsvbZDBP", "comment": "I seeee what you did there", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiOOthhKwavIngCoAEC.8GCPGLhak059HpFyxcAGdt", "comment": "Pun intended", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiAxrzNeZiUFngCoAEC.8FlQy9X2qo_8G1BvmerhjA", "comment": "If you do a proof, you'd want to do it with the furthest limit possible, right? I'm no expert, but why prove something for everything above three, when it's actually valid for anything above zero (or any other lower value than three)?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiAxrzNeZiUFngCoAEC.8FlQy9X2qo_8G1CGEngXve", "comment": "That said, I think the Base Case just represents the first time the proposition is true (in the direction you're working in, as it's sequential)", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiAxrzNeZiUFngCoAEC.8FlQy9X2qo_8G1H-261Qgr", "comment": "I think I got it. The proof would not work anyways. For the horses proof, we can prove p(1) but we cannot imply anything in the inductive step. In the inductive step, we will have two cases when there are common and uncommon elements between the two sets in which the n+1 reside or not reside. We will not be able to prove the inductive step when there are no common elements between the two different sets as the link we use to prove the elements of the two sets are equal is not missing. If we choose 2, 3 or more, we will not yet be able to prove it as a base case anyways; How can you prove two or three...etc elements in a set have common a color practically ? you can't except when the color is directly give to you.  Also, the base case could be any natural number :)  Cool ?", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgiAxrzNeZiUFngCoAEC.8FlQy9X2qo_8G1J_1D0lOy", "comment": "You can do any natural number yeah (in most cases), but what is most practical and simplistic in terms of proving something inductively? :) And my answer to your question wasn't specifically bound to the horses case, but your last one, which was what governs our choice of the base case.  To elaborate on the horses example: it just provided insight in how sets of countables are handled within inductive reasoning. If you have one of something, the 'P(1)' case can be true if the proposition you make refers to a property of an item in your set, so long as that first item has said property. It just shows that you have to be careful with sets of one. In such a case, it is wise to eliminate that as an option to work off of, so you go to 'P(2)' as base case. Which, in this case, will immediately turn out to be false, which is why you had to eliminate 'P(1)'. I think it's about eliminating ambiguity in a sense.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgimXkxuvth02XgCoAEC.8ETePEAb1Fy8ElGd5xDvk7", "comment": "That's almost right, and he even mentioned it toward the end of that section. If you start by assuming the base case P(2) is true, then the induction works perfectly. But your problem is that you didn't exactly state P(2) correctly, what the base case for 2 would really say is this: in ANY (and every) set of two horses, they are the same color.  If that's true, all horses are definitely the same color. However, it's also clearly false.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UginLs09X29qfXgCoAEC.8DwjswvkMzb8EPiCGNGP_Z", "comment": "If a ^2 = ( b^2) * 2 Then a^2 is always even ( as it's an integer multiplied by two) The only way to get an even number as a square is to start with an even number In other words, if sqrt(even number) is an integer it'll always be even.  Therefore square root of a^2 (which we know is even) has to also be even.  Therefore sqrt(a^2) is even  Therefore a is even.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggaIyFd7jRhqngCoAEC.8D2os8y_SsW8DEoq8i5Z4X", "comment": "+Rehan Ahmed odd ^2 always gives u odd. so if,  b ^2 is even then b must be even.", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggaIyFd7jRhqngCoAEC.8D2os8y_SsW8DF1ySKNzOR", "comment": "+Riken Maharjan Thank you sir :)  been waiting for someone to reply..", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghuaiWZRq2DZ3gCoAEC.8CPa-dnAsPn8Ck5vu9AKRl", "comment": "+“miltonius” miguel juan adjudicator He added +n  and  -n (which is zero and has no affect on result, so you are not changing anythink by doing it)  to have the fact  (n^3-n) . For the +n, its added to 2n resulted 3n. Mathematicaly shown;   n^3 + 3n^2 + 2n + n - n    =   (n^3 - n) + 3n^2 + 2n + n  =  (n^3 - n) + 3n^2 + 3n", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggoUu61v4maqHgCoAEC.8CFzyNHwroz8mZs_4n27yw", "comment": "im not sure if I have ADHD too, gottta go to a psychologist when I start working", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggoUu61v4maqHgCoAEC.8CFzyNHwroz8zd8d-xyibK", "comment": "ADHD gang! Keep up the grind bro!", "votes": "6", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggoUu61v4maqHgCoAEC.8CFzyNHwroz92qt6BIlnxd", "comment": "ironically, I got distracted by your comment and spent 3 hours of my life taking an ADHD tests", "votes": "8", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggoUu61v4maqHgCoAEC.8CFzyNHwroz95n28f1Y5VF", "comment": "you can do it bro <3", "votes": "3", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggoUu61v4maqHgCoAEC.8CFzyNHwroz9NTybB6Lu_W", "comment": "reading lines again and again until you get it, is same as rewinding again and again until you get it.", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghcnyWdhkvsmHgCoAEC.89H--7BcE138A0XNCjxBVR", "comment": "+Dimitri “Leonardo” Zubitashvili if one assume that P(n) is false then it means that P(n-1) must also be false in order to make p(n-1) ->p(n) true which in turn means p(n-2) must also be false and so on..then we come to point where  P(0) must be false which contradicts base case, so it means that our initial assumption about p(n) is false ,so we must assume that  p(n) is true and should prove that p(n)+>p(n+1) holds. I hope this helps. :)", "votes": "3", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghcnyWdhkvsmHgCoAEC.89H--7BcE138IpDECw38aW", "comment": "he uses a base case... so he knows that at least one 'n' works... but if he assumes that such P(n) exists (wich does because the base case was proven) and then he proves that P(n+1)... then all n works because n was arbitrary... so all n works... and how.. because u use the base case.. and from then bc of P(n) implies P(n+1)...u know that the next one works  and so the next next one and so on", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugi4ts6LCVbs1XgCoAEC.89146yta4-I8p-pNt-kLSS", "comment": "It depends on what 'center' means according to them.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC", "comment": "this is only making more scared to take discrete math", "votes": "8", "replies": "6", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghAz8Mhkz9KZXgCoAEC", "comment": "i have understood the lecture but i am not able to confirm my answers given in recitations and i am not sure what i did was right...pls help and after how many lectures should i attempt a test/exam", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggqfPlcnP0VyHgCoAEC", "comment": "@1:15:30  I don't understand how \"any\" makes it \"stronger\".  [Do whatever you want] seems much more relaxed of a requirement.", "votes": "4", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggqAQzcF3nBI3gCoAEC", "comment": "@19:00  The mistake right up-front was not that it was drawn wrong.  That is the secondary mistake.  The original mistake is that the Height-measure of the original triangles was altered to 8 (with the remainder of 2 added to the sub-triangles) PRIOR to estimating the new base-measure of the sub-triangles.  With the correct Height-Measure of 10 and Base-Measure of 9, we don't assume the base is anything-plus.  The base is obviously something-minus.  But if you first alter the height to 8 with a base of 9, we then assume the base is something-plus, because we forget about the 2 we just removed.  So the idea of perception is correct in that it covers up mistakes.  But the \"right up-front\" issue is actually the order of operations, not the sizes of the triangles.  The sizes of the triangles are a secondary issue.  When I saw the 2+, I wondered why the base of a sub-triangle was different in proportion to the base of the parent-triangle whose base is smaller than its height.  The image wasn't the cause of the issue, the order of operations was.", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggyZW5SrWrlw3gCoAEC", "comment": "I know this is a rudimentary question but what is the distinction between number subscripts, (n and n+1). Are these used synonymously?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggUWiQWfu-Zs3gCoAEC", "comment": "I always thought this proof by induction stuff is like magic. NEVER understood it. But now I do (I think).  Great video and thank you for providing it to us for free", "votes": "52", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghvlqjL4OjAXXgCoAEC", "comment": "proof by induction starts here :  28:31", "votes": "13", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggRlrXfXjD_w3gCoAEC", "comment": "Can anyone point me to the class notes please?", "votes": "4", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Uggjyml5TdLoVHgCoAEC", "comment": "With similarity of triangles you can disprove the statement that says \"90>92\" mentioned at minute 14:43.  In the big triangle before splitting in halves, the size of the vertical side is 10 and the horizontal's is 9. After splitting it, the sizes of the small triangles are 2 for the vertical side and unknown for the horizontal, let's call it x.  Their angles continue to be consistent, so we can apply similarity:  10/2 = 9/x  x = 1.8  So x > 2 is false.", "votes": "46", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjJuHV53EIAbXgCoAEC", "comment": "can anyone tell me what thm and ie means, im new with this stuff", "votes": "0", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghsXgg_zAIjI3gCoAEC", "comment": "So the horse proof was wrong because he tried to group the remaining n, the original set without the base case (n-1), horses into a set with n+1, to make n+1 the same color. This was wrong because he couldn't group the remaining horses since the base case was 1 and all the remaining horses from the original n set are 0, and he couldn't group 0 horses with n+1 and say that their the same color because the original remaining group of n has no color. Is that right? Can anyone elaborate, I'm still having trouble with this false proof...", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghE3YvIMA4_Y3gCoAEC", "comment": "so there is not recitation for this course?", "votes": "0", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC", "comment": "Are these videos have translate file ? i cannot understand what he says", "votes": "4", "replies": "6", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghBQAZk39R2F3gCoAEC", "comment": "I'm a business informatics student so I am taking introduction to computer science and computer programming,  and so far I hate everything that has to do with this major aside from these 2 courses which I am really enjoying so far, so I am considering changing to a computer science and engineering major,  but I want to make sure this is what I will enjoy before I make this change so I am researching some stuff  relating to computer science online, one of which being discrete mathematics.  Do you think discrete maths gives good insight on how CS is like?  How about 'Theory of computation' and 'Intro to Artificial Intelligence'?  Do you have any other recommendations for courses or subjects that DO give good insight on CS and  do not have any course prerequisites so I can look into them and be able to follow? Thanks in advance to those  who take the time to answer and help :) Apologies if this has spammed you on more than one video. I'm just trying to get as much information as possible.", "votes": "3", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC", "comment": "I'm confused as to how the last proof works.  It seems to me that you are trying to prove that (2^n)-1 is divisible by 3.  2^3 = 8.  Remove one tile and you have 7 tiles left.  7 isn't divisible by 3, so the theorem doesn't work for n=3...Where am I going wrong?", "votes": "2", "replies": "7", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ughx9EmUsylP_3gCoAEC", "comment": "About 41:00. I cannot understand why he wrote : (n + 1)^3 - (n + 1) = n^3 + 3n^2 + 3n + 1 - (n + 1) (n + 1)^3 is really equal to n^3 + 3n^2 + 3n + 1? Why? Which rule(s) he applied to find this?", "votes": "0", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Uggdssia1qYlyngCoAEC", "comment": "I feel like a wizard when successfully doing a proof by induction!", "votes": "122", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ughduw2oAkEf0ngCoAEC", "comment": "I enjoyed by your video. If you believe that Age of REASON is imminent, then you should check out my channel. I have teamed up with the Godless Engineer and The Prototype Atheist to create REASON, Religiously Educated Atheists, Secularists, and Other Non-Theists, also known as The Secular Round Table. We have a weekly livestream every Sunday at 9pm eastern, a biweekly podcast, a weekly newsletter, a brand new website, and tshirts. If you get the time, please check us out. You should also consider attending our live stream or podcast as a guest. We like to get different perspectives on our show and network with new people.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC", "comment": "If only my maths lecturer taught like this guy when I was at university...! ", "votes": "72", "replies": "6", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgietSvyCv9E73gCoAEC", "comment": "Thanks to all the mathematic professors who helped me hate mathematics over the past years... I'm loving mathematics again :)", "votes": "240", "replies": "4", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC.88crNuejgoX8913yrHd10e", "comment": "+MrWazzup987 Exactly how I feel on this...", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC.88crNuejgoX8915AC8BDEF", "comment": "+Tyler Langan 5 days", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC.88crNuejgoX897_WN4SXxR", "comment": "MrWazzup987 I don't see how proving the induction part of this is such a big deal when you can just assume n is true. That's like assuming a billion things and all the proof is doing is adding +1 to the n assumption.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC.88crNuejgoX8E7wUGnse_G", "comment": "+Robert Crawford III Wilson oh no worries, i had a little issues with predicate algebra but discrete math turned out to be my easiest class that semester. well up until big o notation and 4 color therum that sucked", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC.88crNuejgoX8QxWraFeBVw", "comment": "Big O won't make sense until you dive into this: https://www.coursera.org/learn/algorithms-part1 And page 100 here explains all the Asymptotic Notation stuff: http://www.cs.yale.edu/homes/aspnes/classes/202/notes.pdf Also read this, it is useful to you as CS or relative field(IT/IS/CE) student: http://v.ht/cs2013", "votes": "3", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugjp3IHN5S7aBngCoAEC.88crNuejgoX9J6_qy3pRQ-", "comment": "Really?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggqfPlcnP0VyHgCoAEC.88RqMD-CDdT9OzYGqL4fFl", "comment": "The requirement is more relaxed, but it might seem harder to prove because a solution to the more relaxed problem would automatically prove the more constrained problem.  In this sense, the more relaxed problem yields a \"stronger\" result because proving the strong result automatically proves the \"weak\" result.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggyZW5SrWrlw3gCoAEC.87lYKpmq1Qz8GCdSloJgGh", "comment": "next number in sequence... like arithmetic sequence, geometric sequence or harmonic sequence.....  value at nth position and (n+1)th position", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggUWiQWfu-Zs3gCoAEC.86LVOS7Zc918Tt0EgCL-FR", "comment": "same here but when he said p(0)->p(1) all came up", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UggRlrXfXjD_w3gCoAEC.84zkr28y84e7-wdIDZf-Yq", "comment": "+Akash Agarwal Sorry for the late reply! You can find the class notes in the Readings section of the course on MIT OpenCourseWare at http://ocw.mit.edu/6-042JF10.", "votes": "19", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Uggjyml5TdLoVHgCoAEC.83AltTdBmG5A5z0QM8jMU-", "comment": "this is great", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjJuHV53EIAbXgCoAEC.82cf9ZkL0CW72YFF6cy-qO", "comment": "+Mario Mejia \" theorem\" and \"for example\"", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjJuHV53EIAbXgCoAEC.82cf9ZkL0CW72aSZXMyOHw", "comment": "Thanks man", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjJuHV53EIAbXgCoAEC.82cf9ZkL0CW8HZv1AAP7Wq", "comment": "Correction: ie means \"that is\".", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghsXgg_zAIjI3gCoAEC.82cDpT4KutC8GGn8-pEnbk", "comment": "+Benjamin Rood but I want to know what went wrong in the application of induction...", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghE3YvIMA4_Y3gCoAEC.82T4Aaucli78GCdcefRh0q", "comment": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-fall-2010/recitations/", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC.81IsSRofbZG7-HOzNVqZW3", "comment": "aml sakr Sorry, no subtitles are currently available. We are doing the older videos as we get the money for them. Most of our priority is publishing new materials.", "votes": "7", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC.81IsSRofbZG7-J_7bavNmP", "comment": "thank you very much", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC.81IsSRofbZG7-J_DbPO8zi", "comment": "   .", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC.81IsSRofbZG7-ngokRVQtG", "comment": "*****  what is  solution ?", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC.81IsSRofbZG87WztYOTsAb", "comment": "+aml sakr just learn english :)", "votes": "22", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjVBNQNLvpGFXgCoAEC.81IsSRofbZG8jBpR9YnQ-H", "comment": "ertosns shut up you can learn math without english", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghBQAZk39R2F3gCoAEC.8-42PZglkTk72S4tctSQiH", "comment": "Kalernor  Good question. As I'm just learning discrete math myself, I can't say if it gives good insight, but I've been involved in Comp Sci in one way or another for 4-5 years now.    I think a good place to start would be to learn to program, if you haven't already. Programming is just a part of Computer Science, but I think it's going to pop up a lot along your journey towards the mastery of this topic. I'd personally recommend learning to program in Java or Python to start. Then, let your curiosity guide you to other languages from there (maybe a LISP, since you mentioned Artificial Intelligence and Theory of Computation). If you do start getting into a LISP, I'd recommended reading 'Structure and Interpretation of Computer Programs'. You can find the text for free online.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghBQAZk39R2F3gCoAEC.8-42PZglkTk73GtY0_gM0h", "comment": "thank you both of you. I read both your comments and took it into consideration and have benefited from you guys. I made the decision to switch majors and thankfully I got accepted and now I believe this is the right move for me. (btw I already am learning Java and am really enjoying it as well, but I think the real meat for me would be the theories underlying programming and stuff like the courses Benjamin mentioned :D if not then I already know I enjoy programming and writing code )", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo70eAOKN08dX", "comment": "*****: It's supposed to be -2 not -1. (2^3)-2 = 6", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo70fut_sdcLt", "comment": "***** They are actually trying to prove that 3|(2^(2*n)-1). 2^n multiplied by 2^n is 2^(n+n) which is 2^(2*n)", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo70gU-KJyobS", "comment": "***** excellent.  Thanks.  It took me a while to realize it was 4^n and not 2^n.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo70gVHfTU5CZ", "comment": "Andy 000 Right, but simplifying it further clarifies the problem:  2^(2*n) = (2^2)^n = 4^n.  This should have been intuitive since we're dealing with square courtyards, but I didn't get that from his notation.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo70hz43-mCfa", "comment": "***** Exactly!", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo71t6ZN3S_U8", "comment": "***** you don't subtract 1 because bill is already set in the n case, so your approach is right but don't subtract 1", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughgp9m0lrq3bXgCoAEC.8-1Nt1v9Wlo76GjASKvQG9", "comment": "+Brian Oleniacz Yup, and you can actually use that formula in conjunction with the ANY square removed condition for the inductive step. Assuming 4^n-1 is divisible by 3, we have (4^(n+1)-1) is divisible by three -> 4^(n+1)-1 = 4*4^(n+1) = (4^n-1)*4+3. Since the first factor is divisible by three, and 3 is divisible by three, we have that 4^(n+1)-1 is divisible by three. Much more convincing in my opinion than the visual proof.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughx9EmUsylP_3gCoAEC.7-H0Z7-CDhu7-KXjPbzghp", "comment": "Sid Arta if a - b = c - b and a = e, don't you think we can substitute a with e to get e - b = c - b? Replace a with (n + 1)^3 and b with (n + 1) and it should make sense", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughx9EmUsylP_3gCoAEC.7-H0Z7-CDhu70TTdUMHr5K", "comment": "Sid Arta (a+b)^3 = a^3 + 3a^2b + 3ab^2 + b^3 That's basic algebra, mate.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ughx9EmUsylP_3gCoAEC.7-H0Z7-CDhu70iHj0PIe9s", "comment": "Mohit Shrestha Yes, identity... I need revisions. Thanks a lot to you and Rasaq Otunba.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC.7-H0Z7-7WD48REKeViEHkb", "comment": "I need proof that such Math profs exist.  I think this is CGI....", "votes": "8", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC.7-H0Z7-7WD48WoIjIy_J3M", "comment": "Your assumption that this is CGI proves that there is at least one math teacher like him. If not, how would the CGI be made? Boom! Mind = Blown", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC.7-H0Z7-7WD48XWFLYw2bQa", "comment": "so are you saying dragons exist? orcs exist? all the other crazy things in movies and tv shows exist? CGI is just computer generated graphics - it doesnt have to be based of any real objects.", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC.7-H0Z7-7WD48X_Xk6c6p8w", "comment": "Again, flawed. He can be a combination of people if its CGI cuz atleast someone or some people should have thought about making him. Dragons are fictional, yes. But to make a CGI of a real person for one whole lecture with this much perfection surely means that there are people who thought of it. Meaning there are people who know how to explain it. Meaning there is atleast one math professor like him. Please try to think on it for longer. I am not saying he can't be CGI I'm saying his explaining and intellect must be thought by someone else he can't be CGI.", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC.7-H0Z7-7WD48X_e3LAjooT", "comment": "Yeah, you're totally right about that, I misunderstood what you meant initially.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugijwn7LhUWzp3gCoAEC.7-H0Z7-7WD48yRBoekbzJT", "comment": " @MaybeMisha  technically dragon orcs exists not in the way u are refering to but they exist if not how would u be able to refer to such thing my man", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgietSvyCv9E73gCoAEC.7-H0Z7-1okx9U1EHbXSDXD", "comment": "I thought I was the only one… apparently not.", "votes": "4", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgietSvyCv9E73gCoAEC.7-H0Z7-1okx9YzKlSuDq1Y", "comment": "i didn't hate maths but I didn't liked it either now I'm starting to like it hope I will love it when this course is over", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgietSvyCv9E73gCoAEC.7-H0Z7-1okx9ddkESfEl8w", "comment": "Oòlp", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgietSvyCv9E73gCoAEC.7-H0Z7-1okx9ec5xxfj2HR", "comment": "True story", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjKZdW-jmDOWHgCoAEC", "comment": "I like these staff...", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugjv6mlY8taC6XgCoAEC", "comment": "that 90 > 92 thing really got me... be hold, the splash zone!", "votes": "3", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugjykk_hk8m2HHgCoAEC", "comment": "For the one at the end make an 2^n+1 square out of a 2^n square (one fourth of the field) and the remainder, a 2^(n+1)x2^(n+1) L-shape out of 2^n L-shapes, meaning that each non-two-by-two square can resolve to a smaller square and L-shape where the square is in any quadrant, until you get to the two-by-two which is self-explanatory.", "votes": "2", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghtVvZRmX0QAXgCoAEC", "comment": "Damn....have to use a lot of brain power for this class. I like the approach of this professor where he engages the class, compared to other lazy professors who just read from slides.", "votes": "272", "replies": "3", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UggVbStxVrFZjXgCoAEC", "comment": "finally i hav no word to say its realy greate lecture thaks sir and thanks MIT", "votes": "24", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgjTmcHIVV_6RngCoAEC", "comment": "Well this is silly... we all know horses come in different colours. Don't we?", "votes": "2", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghNWDvhXN40t3gCoAEC", "comment": "The last but one theorem for the induction hypothesis was proven false for p(1) with one of the reasons contributing is 'In the inductive step, there are no horses for n+1=2'.  How he has proven the base case of the last theorem as we are not tiling for p(0). I mean how could both of the following phrases are true at the same time for p(0)? 1. 'a way to tile' and 2. 'any square missing'  Also any square missing meant a 2*2 square only(for Bill)? If so how could he have a 2*2 square for p(0)?   And as clearly not, does it mean the length of the square be the length of the 'L' tile. (That's too assuming the base case taken at p(1)).", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugh4jYZpS4Ww5XgCoAEC", "comment": "1:14:10 they cut the guy's voice hahaha", "votes": "2", "replies": "2", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghHtDtWWsmIHXgCoAEC", "comment": "Thanks, great explanation. ", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxdM9YaM7snGEf-MTh4AaABAg", "comment": "Finally induction is clear... Thanks a ton!", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzWwkZBhiUvNOOdoAJ4AaABAg", "comment": "Would it be more specific to say the fallacy-horse-proof fails because the set in which he is applying the induction proof on does not have the inductive property of the natural numbers? ", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzTJdGyuQBPqpZp7Ap4AaABAg", "comment": "can someone please give me a source of which I can find more information about what he said about infinity a being god? at 10:14", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwDOhy1h03XAYSEnCF4AaABAg", "comment": "To be more clear, +n - n = 0, so he basically just added 0, which doesn't change the value of the polynomial (which I just incorrectly referred to as an equation). Also, in case you missed it, he didn't just throw in the \"-n\", he also incremented the 2n (see the change to 3n), which is the +n I was referring to that cancels out the -n, leaving it unchanged.", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxAXCSGaF9jESabJRR4AaABAg", "comment": "He didn't say it wasn't divisible by three, he said it didn't \"look\" like it was divisible by three. Subtracting n, then adding it back to an equation doesn't change the truth of the equation, so the fact that the rewritten equation was divisible by three proved that (n^3 + 3n^2 + 2n) is divisible by three as well.", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "Ugw6alh3zgPGrZyoNDl4AaABAg", "comment": "Can anyone explain why @ 40:30, he throws in a (-n) to make the proof work. I understand that it does work but what rule allowed him to throw it in after the initial proof was false. i.e (n^3 + 3n^2 + 2n) did not divide three, so he changed it to (n^3 - n +3n^2 + 3n) which proved the theorem true.", "votes": "2", "replies": "1", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgyMLthyIb0i43Zcf7p4AaABAg", "comment": "Great introduction of inductive proofs. The use of invalid inductive processes is very instructive.", "votes": "1", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgwB-njBNK-ul-Z7mdJ4AaABAg", "comment": "me too", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgxhzLLcvHHSdg_JxE14AaABAg", "comment": "it is", "votes": "0", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UgzVr-raesuHjfIudrR4AaABAg", "comment": "Great lecture! I am absolutely in love with MIT open course ware.", "votes": "5", "replies": "", "reply": false}, {"vid": "z8HKWUWS-lA", "cid": "UghtVvZRmX0QAXgCoAEC.7-H0Z7-1Gxl94lhqz-o9Lw", "comment": "I love it. The better part of the internet. Challenge us humans.", "votes": "10", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghtVvZRmX0QAXgCoAEC.7-H0Z7-1Gxl94lhtAbwMLI", "comment": " @benisrood  for sure", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UghtVvZRmX0QAXgCoAEC.7-H0Z7-1GxlA3VhipCMnOV", "comment": "\"Brain power\"- well seems like you don't enjoy this 😊", "votes": "0", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "UgjTmcHIVV_6RngCoAEC.7-H0Z7-KTri8TJEZjZNLTX", "comment": "Prove it!", "votes": "2", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugh4jYZpS4Ww5XgCoAEC.7-H0Z7-Nxo77Cz1eZjF61a", "comment": "I was laughing at that, too ^^.", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugh4jYZpS4Ww5XgCoAEC.7-H0Z7-Nxo78fv-KSbmA2_", "comment": "his voice wasn't intentionally cut. the video switched from the professor's mic to the one that hears the professor + background noise lol", "votes": "1", "replies": "", "reply": true}, {"vid": "z8HKWUWS-lA", "cid": "Ugw6alh3zgPGrZyoNDl4AaABAg.8GbQomhc6RG8w-FUEQ1IDu", "comment": "He simply restated +2n as -n +3n. The rest didn't change. Effectively, nothing changed. It's like restating 5 as 3+2. You can do it if you like, the value doesn't change.", "votes": "1", "replies": "", "reply": true}]