[{"vid": "zTi3_l5h5PQ", "cid": "Ugz_STXnXqLFWb6RNlR4AaABAg", "comment": "Great video! Thanks!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwkeMeS-NO8tC5RUWJ4AaABAg", "comment": "And yet, the majority of the world's education systems are stuck in the 1910's era, sometimes worse. This goes to show that its not enough to invent technology that brings the potential solution to a problem, you also have to implement the solution. I'm not sure why change is so slow, but this problem (education) is certainly slowing humanity's evolution overall.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxQKTt-LzX7zRzsbeh4AaABAg", "comment": "I never thought I’d enjoy computer stuff, but watching your series has made me excited to learn more. With this series, I watched each video twice. Some more than twice, if I wasn’t getting it. So far I’ve loved it. Will try some free code camp and code academy to learn some languages, watch that free Harvard intro to CS lecture series here on  YouTube (it’s not opening up again to take on edX until next year) and then I think code academy’s Computer Science path. And then maybe full stack development through them or the Odin Project. It’s exciting.", "votes": "8", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxN3AzanrhlFmFLn214AaABAg", "comment": "this is the start of my journy to online education", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw3j5ofz_WcHrFtALd4AaABAg", "comment": "This is so relavent now!", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugy65aCrlkDTuKMXv4p4AaABAg", "comment": "Rewatching this during this kind of world event adds a little flavor to the context.", "votes": "10", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx_gCLJ0oEighFik0V4AaABAg", "comment": "I order books easier than ever!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz7OQb6JQtrrvTjIvp4AaABAg", "comment": "2020", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwY1pyCRZ8KXH19jb94AaABAg", "comment": "And with that I have to say Mastering (pick one) Engineering/Chemestry/Mathamatics from Pearsons is an example of how to NOT set up your education technology.  One might even suggest it is designed more to sabotage Ed Tech in order to keep textbooks in demand.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugyn-ZP0a83_pyU95494AaABAg", "comment": "This sounds bad but I just gotta get it off my chest. Carrie Anne looks like one of the overweight people living in space from wall-e.", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyB9Z48mwYlL5UEWsl4AaABAg", "comment": "Organic Chemistry Tutor.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugy6K7Y7ZfbNrthCuf54AaABAg", "comment": "At 7:48 she uses ‘she’ as an impersonal pronoun.   Ever since the English language evolved the impersonal pronoun has been ‘he’.   As far as I am aware, this is also the case in all other languages.   With feminism in the latter half of the last century, the unspontaneous sounding ‘she’ was adopted in academic circles, especially in the humanities.   Thus, into a very simple, tiny word that is normally not even a stressed part of the sentence was insinuated an agenda.   Whatever the topic, one’s mind had to be drawn to a gender issue.   However, language was being made to reflect a welcome change in society, one where men and women should have equal rights and responsibilities.   This necessarily involves shedding such former values governing inter-gender relations as ‘sail before steam’ (ladies first), and women taking care of the family, as no longer applicable.   It involves sharing 50/50 the cooking and cleaning, the restaurant bills, women inviting out men as well as the reverse, providing equally the necessary finances for supporting the family and having 50/50 custody over children in the case of divorce.  With this change, it has been common among male academics to use ‘she’ as an impersonal pronoun.  This really does sound contrived, but might be acceptable if women used ’he’:  after all, the best relationships are based on putting one’s partner before oneself.   However, women, in the legitimate pursuit of such change as allows them to assume an equally active role in society use ‘she’.   So perhaps it’s best to regard a word that is less than a four letter word as being as inoffensive as it is short, and those silly male academics who emasculate themselves by remaining stuck to such old world values as ‘ladies first in an age when women want to steam forwards should realise that it is at least as appropriate for men to use ‘he’ as it is for women to use ‘she’.", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxxzDJHw06_igTlVWJ4AaABAg", "comment": "The only complaint I have with this entire series is that the tips in this EdTech episode for writing notes and following examples yourself would have been really useful earlier on!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxIyAX4NDo2ZS3w9gJ4AaABAg", "comment": "Does anyone know of any education software like the one described in this video, that would be online and free?", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgybiGub8ELZ_p9uVkx4AaABAg", "comment": "That's just pretentious. I listen to Despacito to learn Spanish.. Despacito... nanananaaaa na na nana", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugzu3mOpavN2hkmsg-p4AaABAg", "comment": "carrie i have learned a lot from you... just love and thanx. For the wonderfull job you have done.. thank you thank you thanks a lot and lot. i have watched all videos of yours from abacus till robot... learned every bit from scratch. No doubt is in my mind . You have cleared all my doubt.. .thanx once again. Gain Knowledge . Be happy. God Bless You.", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyE8ynRjYeMYO50HSZ4AaABAg", "comment": "When I was in high-school, I once wrote a paper about a new way to educate students by turning a curriculum into a sort of Roleplaying/Puzzle/Exploration game in terms of non-linear progression and teaching mechanics, only a bit more abstract. It was heavily inspired by my favorite MMO at the time, EVE Online. Unfortunately, I lost that paper a long time ago.  You should look up the channel Extra Credits, as well as the show Digressing and Sidequesting (which is under the umbrella of The Game Theorists). The former is a channel dealing primarily with the principles of Game Design, but has an episode regarding \"Gamifying Education\" / \"Gamification of Education\". The latter, meanwhile, has an episode about Super Metroid, and how it is a shining example of how a well-designed game can effectively teach players through their design, and without using any words.", "votes": "4", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxJSUI4d2hBbiW-u9Z4AaABAg", "comment": "Thank you for advice! I've been looking for these two week and now, while procrastinating, I finally found them :)", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzBYoriP6pQkHINdht4AaABAg", "comment": "ayyyy already watching at 2x speed", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgySD0CieI5chKRYx7d4AaABAg", "comment": "I dealt with this type of tech in an accounting class. Wasn't very well developed. You had to put exact answers even if there was more than one way of entering your answer. These methods work well with scientific studies like algebra, but are total trash with fill in the blank type questions or essay answers.", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw7CwTBOR94EgNhYKd4AaABAg", "comment": "Seriously, no one in the comments brought up CGP Grey's \"Digital Aristotle\"?", "votes": "2", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwGXOvt5Bz954zP5uV4AaABAg", "comment": "Really nice videos,  great teacher!!!!!!!!!!!!!!!!!!!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugzzv7KhNHFbhFDkctd4AaABAg", "comment": "CYBERSECURITY CRASH COURSE WILL BE APPRECIATED", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz2GI3b1Wh8bT4AK9B4AaABAg", "comment": "2:31 Who else did it as the cursor clicked the 0.75 option?", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxsjSKlfEv4u7fFlcB4AaABAg", "comment": "did anyone else feel the urge to slow the video too hear her drunk voice?", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyMtmKUTqqELIzRqvR4AaABAg", "comment": "Thank you for creating an amazing course! :)", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyLI7uyCRlsqqMlubp4AaABAg", "comment": "How can we use technology to learn if most schools, including mine, don't even allow the use of Kindles. Seriously, I'm pretty sure they're gonna ban even smart watches next! I literally can't use Khan Academy.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz-79v3lUjpgE0rda94AaABAg", "comment": "My school blocks educational sites (and pretty much every other site)", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyUEA0SBF11jRfnGyd4AaABAg", "comment": "I love how I'm learning about taking your time to study subjects while I'm playing these video's at twice the normal speed XD", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzuiWk4lAPjHAbzAbF4AaABAg", "comment": "a load of bs having nothing to do with the reality of edumacation.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgylP4rIK3uIKDJIzVt4AaABAg", "comment": "This will definetly help with my Computer Applications Project.", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgykN7vnBfTLz0OL-7t4AaABAg", "comment": "Can I have Hank Green?", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxF63P89NKvE7dRcsB4AaABAg", "comment": "I hate that feeling when you suddenly realize you're  at the end of a good series.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugytf8eQ5P6tZZQk2HV4AaABAg", "comment": "Wasn't the first time Edison was wrong...or the last. Just ask Tesla.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzdR7gL1Wpgyr_LCo94AaABAg", "comment": "haha", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwBl_Ex68ZmBQ2R0fR4AaABAg", "comment": "This is a very well thought/made episode. Kudos!", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwmuhnnDxOSaqq_69J4AaABAg", "comment": "The Diamond Age: Or, A Young Lady's Illustrated Primer by Neal Stephenson is an excellent book. If you've watched all parts of this series, you should definitely read it!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugxoe1wg2Vi6NachDgx4AaABAg", "comment": "If anybody is interested in a network-based  (as opposed to broadcast) variant of the mooc they should check out the history of cMOOCs. cMOOCs or connectivist MOOC were actually the original model formulated by canadian educators and technologists like stephan downes and george siemens. It's based on quite a radical and emancipatory pedagogy and, for me, much more interesting than the later, broadcast model formulated by the ivy league/venture capital crowd", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxS1kkm8pQxcoKxk7V4AaABAg", "comment": "Not complaining but why were most the pics that you showed, included Indian/ south Asian women?", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgymxMuJoGkLeVkBgoJ4AaABAg", "comment": "Isn't duolingo an AI driven tutoring system like the one explored in the video? It felt like it merited mentioning :)", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw7CwTBOR94EgNhYKd4AaABAg.8mxof7jCiQ38o7tWRsdi4N", "comment": "Happy Fakeboulder. Thx for mention it, haven't know about it before.", "votes": "2", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugyfowms7IiBV1rCXAZ4AaABAg", "comment": "i know kungfu", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyvZSf1GlnAxIzGY_54AaABAg", "comment": "this episode is supported by skillshare", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxxaqhehGhXWauGHN54AaABAg", "comment": "Manfred Spitzer disagrees", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw75kuv_jjseLRVPzx4AaABAg", "comment": "Its not other types vedio on cc which are compact", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugxd9UUhHBhIULgTAVl4AaABAg", "comment": "\"So imagine our student is working on this algebra problem: 3x + 7 = 4. The correct next step to solve it is to subtract both sides by 7.\"  This brings up a problem of educational software: subtracting by 7 is not the only next step. If a student approaches the problem differently, they could divide by 3, and that would be just as valid (not as efficient, but this is just a simple example.). If educational software is too pushy in its methods and doesn't allow enough freedom on the user's part, then it can actually be more of a hindrance to learning than a boon. My younger siblings have struggled with annoyingly specific and unclear software, so this issue goes hand-in-hand with the psychology of computing, and the considerations of usability.   (Comment 129: breaking the computational symmetry of 2^7!)", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxuntynlepZp7KwW1F4AaABAg", "comment": "I loved how Carrie said \"Despacito\"!!", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwA3YHIlzNxacvbWPB4AaABAg", "comment": "Carrie Anne ma'am.. Your videos are remarkable..amazingly amazing ..the concept I gained from some videos really helped me to understand the basic fundamentals of a CPU. I had a request to you ma'am. If you could make a video about IBM's AP 101 and how it works ..and how it guided the space shuttles for reentry maneuvering TAEM .. If you please could make a video about it I will be grateful. I've searched our local library and the city library and also all over the internet.. Google ,YouTube and all but couldn't find a suitable concept or working procedure. I'm asking a lot I know. But ma'am I'm kinda counting on you. Place I'm from people don't usually feel interested in these. Thank you. I'll be grateful.", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzVrtv6bDl1c1op9214AaABAg", "comment": "I just found this course and caught up only for it to end in a few days.  Thanks for the information though, it has been fun learning it all.", "votes": "4", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugyysqb6fe8RnaQmpL54AaABAg", "comment": "Good job CrashCourse team! :) had a blast watching this series and I'm excited for the final episode next week..", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz-EJX-85Sx6O7boB54AaABAg", "comment": "busts down the door UPLOADING OUR BRAINS????? GET HYPED for both the episode and that actually happening", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw_08mNP70tEEPGhUV4AaABAg", "comment": "Series finale next week?! 😭", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxUgNbFfIm9CNTEjJR4AaABAg", "comment": "Great video! Thanks!", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzNPDDnuqNe1o9TnM54AaABAg", "comment": "what is that fruit on your shirt?", "votes": "0", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzAxoji9y3Bc_uoP3l4AaABAg", "comment": "This was a particularly interesting video for me, as I'm learning html coding via online courses. I think Carrie Anne believes in me.", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyB1BZdPX9QYOJ8eeV4AaABAg", "comment": "Series Finale??? NOOOOOOOOOOOOOOOOoooooooooooooooooooooooooooo!!! Thanks Ms Philbin for your informative, fun course. Cheerio!", "votes": "4", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzH4NIavQ_PzeBx-IV4AaABAg", "comment": "No dont go", "votes": "5", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyiHDmU5JZGYFGWBA14AaABAg", "comment": "Aww, this series is ending soon :(", "votes": "4", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugwqq8FsPplAXUyIDax4AaABAg", "comment": "Learning with videos at x0.75 speed? I'm learning at x2.5 (you will addapt very quickly to watching videos at high speeds), I can watch more then twice as much footage while the videos keep me engaged, because there is not time to drift away...", "votes": "1", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwM8h0rLIIm3Qn_Z8p4AaABAg", "comment": "The video speed controls? Haha, nice try! Would be nice if they added something like...oh, that wasn't a joke.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwakcwUKnmCdCcBTRJ4AaABAg", "comment": "Portuguese subtitles", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzNPDDnuqNe1o9TnM54AaABAg.8aCdSapk7o58aOFNfBwX7V", "comment": "gyromanx55 Raspberry. It's the logo for the Raspberry Pi", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgzH4NIavQ_PzeBx-IV4AaABAg.8aBqzVeHAQz8aBr0mV1Yny", "comment": "Please dont go", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugwqq8FsPplAXUyIDax4AaABAg.8aAY7RAQqJD8aAYKWhFi7l", "comment": "Ofcourse, when I there is something I dont understand, or if I have to take note, I watch at slower speeds. But being able to rapidly go trough the non-information parts of every video is very handy.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz0aiNscXfJV0ysNc14AaABAg", "comment": "You know what would be a good follow up series. CC Coding (programming), CC Networking, or CC Engineering", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxTgTVZRCd_Alz1qTR4AaABAg", "comment": "As a teacher who often wonders about these developments (and how I could integrate them into my teaching), I want to thank you for summarising the current research so elegantly!", "votes": "19", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyxIssNoWXFMWGJRkd4AaABAg", "comment": "The Diamond Age is a fantastic book. Good mention!", "votes": "5", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg", "comment": "Sorry but the prospect of being able to download information directly into our brains is impossible reguardless of how much time passes or how much technology evolves. This can be viewed from simple biology. Learning is quite literally the connecting of synapses to form new neural pathways in the brain. This is short term memory. With repeated revists this neural pathways become stronger over time, and with use, and so become long term memory. Learning happens through this process, however dumbed down this explanation is. To download knowledge and/or skills into our brains? It goes against biology, and how memories are formed. It just isnt possible.", "votes": "3", "replies": "8", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxZ8SPZaWKFl2MplJx4AaABAg", "comment": "There should be an episode about the blockchain", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwG8pgmosYeq1ZAFbV4AaABAg", "comment": "What app to creat animation and video like this...?", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzGX1k8bcMUNVrppTF4AaABAg", "comment": "Shhtudent?", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugy94z0IcZi4NjjBH754AaABAg", "comment": "She is sooo cuuute ))) Interstring and  useful videos ))) THANKS A LOT", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx4ne3lOswFadBQvp14AaABAg", "comment": "That Raspberry Pi shirt though.", "votes": "9", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugxp9Jts4NIHRppZhx94AaABAg", "comment": "Please do actual computer science video like the registry and RAM, CPU stuff..... That was way cooler than these history packed videos.  I know this is crash course and it is going to end like this but hey those episodes were awesome.... Like if u agree", "votes": "1", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx1dI5IWlal0ZQAIwZ4AaABAg", "comment": "I'd like either: a) Math crash course b) Music theory crash course c) MORE COMPUTER SCIENCE!!!", "votes": "179", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwJl3NdT1APeiLKVy54AaABAg", "comment": "I wish youtube had a setting where videos play at 90% speed.", "votes": "4", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgySwy1Ikrgnc6mBs2F4AaABAg", "comment": "Quick and dirty IQ test: average the speeds that you can watch CC and still understand. Example I could understand CC CS at 1.5 and 2(with cc). But CC Physics has me watching at 1.  If I round my average speed to the closest speed on the youtube player, and multiply by 100: I have an IQ of 125.  Look mum! I'm smart!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwMbeltUL49aRH9sRJ4AaABAg", "comment": "yes... uploading a brain virus... good idea", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgysRKB2LdI3nqpHHEV4AaABAg", "comment": "Seriously, a woman talks about computer science?! U guys are hilarious lol At least u should’ve picked a hot chick. There’s no amount of vodka that could fix this kind of ugly...", "votes": "2", "replies": "3", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw2oQ81CLhFgGTEeUJ4AaABAg", "comment": "Teşekkürler", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzOWikrKu-kNtvk0lR4AaABAg", "comment": "Amazing shirt <3", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz3NB5daxsD3jvCRZt4AaABAg", "comment": "played the video because of the t-shirt. spoiler alert - raspberry pi is not mentioned. disappointed. nice t-shirt tho.", "votes": "0", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugxv1yucShW_Mm5TzsV4AaABAg", "comment": "Here's a problem for machine learning (or our AI overlords), If educational technology keeps getting better and better why is it that the average person doesn't seem to be any smarter?", "votes": "9", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzCpPlb7Rcif2YhrN54AaABAg", "comment": "Stackoverflow is a great example of a giant searchable FAQ for all of programming.", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8aJohRSD1q6", "comment": "Well ok....  so if synaptic pathways are built from exercising the thought process and application of the knowledge learned then the physical state of the synaptic mass of brain matter can be synthesized and through electro-bio-chemical-nano stimulus they can be caused to form in the proper patterns and connections to duplicate from one brain to another. All that seems to be needed is a way to record the formation of the synaptic pathways(output) and reproduce the exact reconstruction of them into the recipient host(input).  This could also possibly be done through the physical extraction of the brain matter from a donor subject into a host subject's brain through invasive surgery techniques.  i.e. transplant that portion of the synaptic brain matter that contains the knowledge from one to another.  Now the questions becomes ... dose brain matter retain its properties after death or must the brain matter be moved from a living donor and some how be kept energized during the transfer to the host.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8aJqBJB5lZh", "comment": "So when a way to create a interface with the brain is developed then the addition of an interface port can be sygercely added that would allow the extension to the brain's synaptic network.  THink of it as adding a usb port to your brain and plugging in a micro sd ram bio chip with the synaptic pattern grown on it.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8aQqnyfqvCO", "comment": "There could be a way, like Michael wrote about.  However, even if we could figure it out, I do not think it should be done.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8aROQg0VkrS", "comment": "What would be the downsides and the upsides if this were to happen?", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8aS2lEhLBX5", "comment": "Michael McGinn I don't care, I just don't want it. Too much risk of bad intentions.  If others do want it, thats their choice.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8d6fPQkZlWN", "comment": "Yea I mean, if there's a way to make computers know what something means through the means of 1s and 0s,and there's also a way to make human know what a combination of 1 and 0 means through computers(graphics, audio). maybe connecting the wires to your brain which will give you the 1 and 0 bit in a way which is easy to learn for your brain will make human learn faster. Also, the fact that it takes time for human to learn something, like with practise, makes more sence to play that information in a loop for the human's brain process until it's learned(mathematics).  Now with the high speed of loop, the brain might close out completely, so the speed has to be controlled. This will get better with time. Although, the process of learning movement yet a mistery to solve(i guess).", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8mxnwBD0Ky-", "comment": "How about transferring human minds (or some form of high intelligence and consciousness comparable to a human) into a computer simulation?", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQE5FN52ZYTVGNO8N4AaABAg.8aA1kO1kM8H8o7shc6Lqd0", "comment": "Maybe, but maybe not.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugxp9Jts4NIHRppZhx94AaABAg.8a9RMdPGVwC8aA5TO1kYtv", "comment": "Those topics were at the beginning of the course.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugxp9Jts4NIHRppZhx94AaABAg.8a9RMdPGVwC8aApCag0J9q", "comment": "Don Reynolds  yep I agree but somehow they were actual computer science.... They should be extended...", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx1dI5IWlal0ZQAIwZ4AaABAg.8a99-XngcEb928IcCBjFpe", "comment": "Music theory. Please, please, please. Also history of music.", "votes": "19", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx1dI5IWlal0ZQAIwZ4AaABAg.8a99-XngcEb96odq7IkoIn", "comment": "For math look up MYWhyU and all their courses on Algebra. Math is such a broad subject we could break it into Crash Course Algebra and Crash Course Calculus.", "votes": "5", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwJl3NdT1APeiLKVy54AaABAg.8a8z7PmtnSL8o7sVFxPPVy", "comment": "Yea agree.. but if you on desktop there are chrome extensions youtube playback speed control and youtube speed changer for more speed option.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgysRKB2LdI3nqpHHEV4AaABAg.8a8kI5Wzqk68aA5MWtS59T", "comment": "I doubt John is sarcasm. As to whether Deyan is sarcasm, that can easily fall under Poe's Law.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgysRKB2LdI3nqpHHEV4AaABAg.8a8kI5Wzqk68aJr06biS7P", "comment": "I think she is absolutely beautiful.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgysRKB2LdI3nqpHHEV4AaABAg.8a8kI5Wzqk68mxoVUcuMOu", "comment": " @JB52520  Your username is very accurate", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz3NB5daxsD3jvCRZt4AaABAg.8a8cq-Z3cyp8a8dP8JP5I-", "comment": "She does mention it in one of the videos but I can't remember which. Oh well I guess you'll just have to watch all of them haha", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugwj0ReSqVuxeDqHVPt4AaABAg", "comment": "Series finale!? :o :'(", "votes": "5", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzMmfbX1CGleQ5Yft14AaABAg", "comment": "Can super computer of IBM  get Hacked and start learning itself", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwY80ISjIrkA11uUhR4AaABAg", "comment": "\"Uploaded with new skills, directly into their brains.\" Isn't that like \"The Matrix\"?", "votes": "8", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxXSAUmqU8frWr-EYB4AaABAg", "comment": "They made it to 32 episodes, so I expected the finale to be either episode 63 or 127", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyTj9uonI3vDF4MS6F4AaABAg", "comment": "We shouldn't let our vision for the use of edtech be limited by the band wagon effect.  I would like to see TOOCs (Tiny Open Online Coures) developed to help students in courses that are application or creative in focus so they can get personalized support from the teacher.", "votes": "2", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzCl-1GJwAybZAAP-p4AaABAg", "comment": "aren't we discuss neural networks,machine learning...", "votes": "0", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyGICIL9E5zjyMPc6N4AaABAg", "comment": "Series finale?! NO!!!", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyNGE88NkQuFHj3aRh4AaABAg", "comment": "Gangnam Style? Carrie Anne, we have to update your cultural references!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugyd6xplnz9t-04qcwd4AaABAg", "comment": "Big fan of Crash Course, especially the Computer Science series. I have been waiting for an Educational Technology video - thank you!", "votes": "5", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxHhwiPAMiGBwCiStx4AaABAg", "comment": "Best crash Course so far!, i Hope there will be Computer Science 2 with fokus on Deep Technical Content   about Operating system, Programming language, database, AI, Cloud computing, AR and VR .", "votes": "8", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugy8gcupxqsKGr97INV4AaABAg", "comment": "Wonderful series everyone, it was a lot of fun and I learned a ton.", "votes": "10", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyQjVrlk3cqy-AM4bB4AaABAg", "comment": "Next week the final episode? Time for a Math Crash Course! Please!", "votes": "28", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxNKllankTkznjqQjJ4AaABAg", "comment": "I don't want this series to ever end!  Please come back with a season 2 lol", "votes": "10", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwC3JL5o_nOC6trCJd4AaABAg", "comment": "Can't believe this course is ending! Amazing work so far, I loved it.", "votes": "16", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwZC6PXHCzycikOmt14AaABAg", "comment": "Thank you guys. Its hard to put in words how much online education has helped me. It's like leaving the cave in Plato's allegory. I never had access to quality education and have been surrounded by violence and drug abuse for a big part of my life. It gets lonely at times because many assume scholarity is education and don't see the value in interdisciplinary learning. Despite that, my life has improved because of people like you and I now KNOW that it's within my hands to develop myself and enjoy  every minute of life I have left. From the bottom of my cerebral concoction of neurotransmitters 😉 THANK YOU", "votes": "229", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwTeUSM4fL_-zPkps94AaABAg", "comment": "Now I want a Crash Course Teaching.", "votes": "38", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzC7gE4UwlmtTfSGa54AaABAg", "comment": "please have Carrie Anne present a continuation of this series!", "votes": "73", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzLM0GNJISYgFq970d4AaABAg", "comment": "The Diamond Age is one of my favourite books!", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugwhsoyeo6IxXtvVA1h4AaABAg", "comment": "You can get a head start on next week's topic by hitting some good futurist educational channels. Does anyone have some suggestions?", "votes": "1", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx96yKNsRLNfSW0GQB4AaABAg", "comment": "Way to go Carrie Anne!", "votes": "3", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwY80ISjIrkA11uUhR4AaABAg.8a8PuNSplLg8a8gsdBP1Sp", "comment": "Fox Smith ..............I know kung fu.", "votes": "3", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwY80ISjIrkA11uUhR4AaABAg.8a8PuNSplLg8aJqbRiDXq_", "comment": "Exactly. See my previous comment on that", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgzCl-1GJwAybZAAP-p4AaABAg.8a8KqK70Vzr8a8hEzvm2PT", "comment": "susantha warnapura 3blue1brown has a fantastic three-part series about neural networks", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgzCl-1GJwAybZAAP-p4AaABAg.8a8KqK70Vzr8aA5fsiy31a", "comment": "It was covered four or five episodes ago.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgxHhwiPAMiGBwCiStx4AaABAg.8a8F0KLPgWD8aJqVOLI3gq", "comment": "See... google.  this course give you a great foundation to formulate your search queries so you can deep dive into the subject matter your most interested in.", "votes": "2", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugwhsoyeo6IxXtvVA1h4AaABAg.8a83T3c6A148a83Uyi9wVt", "comment": "I'll start with my suggestion of Isaac Arthur.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugwhsoyeo6IxXtvVA1h4AaABAg.8a83T3c6A148aA5nBVCRt9", "comment": "Kurzgesagt", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgzuPEoImIknUl5inKJ4AaABAg", "comment": "I need John Green to replace OK Google. Someone get on this.", "votes": "0", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyUS9tBCSUPW4izKft4AaABAg", "comment": "Never been so saddened by the end of a series finale.  Don't do it!!!!! Plzz", "votes": "5", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugza_5p_VGVS0d4jEqZ4AaABAg", "comment": "Only one episode on brain uploading? :( I can't wait for the real science behind Arik from the C1764 series on /r/hfy.  Oh, and I guess it's the finale too.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzDUsAiztCRynrwfid4AaABAg", "comment": "First thing that popped into my mind about next week's topic: That sounds like Neuromods from the game Prey!", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw93xfp2P1Q4r4Wcmd4AaABAg", "comment": "And yet somehow we got MyMathLab.", "votes": "15", "replies": "3", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugx9Or_EBwx4o7trZLt4AaABAg", "comment": "\"Series finale next week\" :(", "votes": "36", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyUMHnyrc0Dzi0xA3p4AaABAg", "comment": "It's been a great series! Let's hope for one more level of abstraction!", "votes": "10", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugz3rECzRfvwy3hvZSh4AaABAg", "comment": "Please do something on quantum computing for your series finale!", "votes": "1", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwIo3YYrfDon9KvcxB4AaABAg", "comment": "I'd like learn programming language", "votes": "2", "replies": "5", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwrQpPwo-q1c24pLIJ4AaABAg", "comment": "I think the SAT writing tidbit speaks more to the quality of the human graders than to the algorithms ;)", "votes": "23", "replies": "3", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgwZ576JYbdo_UZGxWB4AaABAg", "comment": "we believe .. likewise .. Bang ON there with you guy's .. developmental 'Conceptual Models' .. is where it's at ! A4", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxGF5REFNZucGZGeU94AaABAg", "comment": "One of my favorite series from CrashCourse. Kudos for making it to 40 episodes guys, see you next week.", "votes": "197", "replies": "1", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyzQC7yVNv2_nav0yp4AaABAg", "comment": "Toilet paper should hang over. Just saying.", "votes": "85", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw8NoYSsGUbk2IcoT14AaABAg", "comment": "I doubt one singular thing will revolutionize education, but things do change. A lot of teachers show their kids videos, slide show presentations, and websites instead of lecturing and writing on the board. I think education will change, but not in a heart-beat.", "votes": "9", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxDSr7VXXeI5_Y-GSZ4AaABAg", "comment": "Series finale next week? aww felt that this series had the potential to go on longer than the other series. oh well, been a good journey; hope the last episode goes out with a bang.", "votes": "133", "replies": "3", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgxdJjvYwMCIvp35Wrl4AaABAg", "comment": "What is Network", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzuXH7RRpaY5pICRIZ4AaABAg", "comment": "The idea of uploading anything into our brain is quite a scary thought  Ghost in the Shell anybody?", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "Ugy6I7-NLEZtWVbtz7N4AaABAg", "comment": "Ed.  EEEEEEEEDDD. Come to bed dahlin.", "votes": "0", "replies": "", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgyCxa6MyvR5BD8Qw4R4AaABAg", "comment": "Notifsquad", "votes": "3", "replies": "2", "reply": false}, {"vid": "zTi3_l5h5PQ", "cid": "UgzuPEoImIknUl5inKJ4AaABAg.8a7zauqU4VJ8aJrRtTRODh", "comment": "Add celebrity voice packs to all these virtual voice assistants. Like your gps in the car.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgzuPEoImIknUl5inKJ4AaABAg.8a7zauqU4VJ8dN0rm1tuu5", "comment": "John Green, where I can find crash course world history?     \"On youtube, Crash course or CC world history, is an one course of crash course channel. You will find on official crashceourse channel.\"", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw93xfp2P1Q4r4Wcmd4AaABAg.8a7tmZ8QL6j8a85eUZkWK7", "comment": "There is an explanation for it we just don't have all the details of the inner works of Pearson, until someone leaks this information I doubt we will.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw93xfp2P1Q4r4Wcmd4AaABAg.8a7tmZ8QL6j8n-Du2ihbZN", "comment": "For real. Pearson is such a ridiculous company. New editions of all their texts almost every year. And very little learning actually happening because lots of teachers take a hands off approach because they assume MyLab will do their jobs for them.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "Ugw93xfp2P1Q4r4Wcmd4AaABAg.8a7tmZ8QL6j9-m8c_8aH4N", "comment": "What's wrong with it?", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwIo3YYrfDon9KvcxB4AaABAg.8a7pzv8L6si8a7s5PBcOLC", "comment": "which language?", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwIo3YYrfDon9KvcxB4AaABAg.8a7pzv8L6si8a80H7k9kgr", "comment": "This series is a good start towards doing that.  There are a number of good \"how to learn programming\" resources out there, and you can pick from a variety of computer languages to learn.  In short, though, computer programming is:  1) recognizing the problem  2) breaking the solution to the problem down into small, simple steps  3) writing the code and combining the small steps 4) test, test, test, test, test, fixing the mistakes between each test.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwIo3YYrfDon9KvcxB4AaABAg.8a7pzv8L6si8a8ZRLG0aa4", "comment": "PHP (7.2) or JavaScript", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwIo3YYrfDon9KvcxB4AaABAg.8a7pzv8L6si8a8nB_cboUB", "comment": "PHP and Javascript are the top 2 horrible languages.", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwIo3YYrfDon9KvcxB4AaABAg.8a7pzv8L6si8aOEysnBq-F", "comment": "Java. Just saying.", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwrQpPwo-q1c24pLIJ4AaABAg.8a7pWUpYvMW8a8mXbwMLN5", "comment": "True. Also I suspect when we're talking about \"just as accurately\" we're talking about on a macro scale, not an individual scale. No algorithm truly understands English, so with machine grading we're seeing correlations, like maybe for example quality academic writing tends to have more clauses per sentence than poor writing. A program that doesn't even understand the writing, that just counts the number of clauses per sentence, is not going to grade correctly at all, but it happens to correlate with an accurate score about as often as a tired, biased, or poorly trained human does. Of course, the clause-counting app can go through tens of thousands of essays a minute and doesn't expect to be paid a salary, so testing institutions are strongly incentivized to go with their app. As long as your essay isn't one of them it makes an error on, there's nothing wrong with the testing institution following its incentives...  ...until people start figuring out the algorithm and we get generations of students being trained to write to impress a computer that doesn't understand English instead of just doing quality writing in the first place.", "votes": "10", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwrQpPwo-q1c24pLIJ4AaABAg.8a7pWUpYvMW8aAU39VnDuA", "comment": "we already do the last bit in school teachers know what the testers want and teach you how to do it in that way it would be no different with computers", "votes": "5", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgwrQpPwo-q1c24pLIJ4AaABAg.8a7pWUpYvMW8aBSJFOzVYy", "comment": "The difference is that teachers teaching to what human raters want are still pushing students to use language to communicate with another human being. The \"5-paragraph essay to appeal to a human SAT rater\" might be a very limited genre of writing, but it is actually a form of writing. If teachers were to push students to write in a way that games an essay-rating algorithm that isn't part of a fully-sentient, language-capable strong AI, then communication wouldn't actually be happening. Arguably, language might not even be happening.", "votes": "3", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgxGF5REFNZucGZGeU94AaABAg.8a7oRvXZJ5a8hM4of9lxSt", "comment": "Nice", "votes": "2", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyzQC7yVNv2_nav0yp4AaABAg.8a7oR2W9uEh8a8cxV4HXPX", "comment": "the fact that cats disagree just proves even more that they are assholes", "votes": "0", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyzQC7yVNv2_nav0yp4AaABAg.8a7oR2W9uEh8aAFBiKj3th", "comment": "I know. I was waiting for her to circle that one and say \"that way... that's the right way\". I'm not even sure how it's a debate. It's superior in every single way!", "votes": "3", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgxDSr7VXXeI5_Y-GSZ4AaABAg.8a7nsk0iVwI8a7tygtsFEs", "comment": "I do computer programming as a career and I think the series is about long enough. To go further it would have to get into more detail on a subject which goes against the idea behind CC (give an overall summary on a topic) which won't be as interesting to most people. Maybe they could add one or two more classes (like object-oriented programming), but then it would start to lose focus.", "votes": "18", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgxDSr7VXXeI5_Y-GSZ4AaABAg.8a7nsk0iVwI8a8gRSsqKuI", "comment": "NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "votes": "1", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgxDSr7VXXeI5_Y-GSZ4AaABAg.8a7nsk0iVwI92OZwsEJU46", "comment": "Noooo! I neeed MORE layers of abstraction!", "votes": "2", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyCxa6MyvR5BD8Qw4R4AaABAg.8a7m-_EUCoO8a7m4aDKhqT", "comment": "Edit-firsteh", "votes": "2", "replies": "", "reply": true}, {"vid": "zTi3_l5h5PQ", "cid": "UgyCxa6MyvR5BD8Qw4R4AaABAg.8a7m-_EUCoO8a7ot2ttr8w", "comment": "same", "votes": "1", "replies": "", "reply": true}]