[{"vid": "zUDxgehxQqs", "cid": "UgzrvQYeDxmlncdJQ7d4AaABAg", "comment": "I subscribed just bc of that intro lifting up my mood", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwN9V1Gr-1qee8Q3Sx4AaABAg", "comment": "Thank you sir for your dedication and for making this free! 🙏", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwR4MAol3Xgr890A_Z4AaABAg", "comment": "Beautifully explained.", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugzuihk3XW8TN6duCcV4AaABAg", "comment": "Is the email for Dr Dave still working or has it changed?", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwjiYdNY1w6UM6M1fp4AaABAg", "comment": "1:04 why d²y but dx² ?", "votes": "1", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwF1vtcUm_wF7cXrbx4AaABAg", "comment": "I wrote it.", "votes": "1", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwB0HSTZciqFnNI0s14AaABAg", "comment": "So THAT'S why it is meters per second squared ... Am sitting there with a feeling like after a good and thought-inducing movie", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxeAQHf-2fAyb4ciqZ4AaABAg", "comment": "You are the only teachers who teaches all the subjects", "votes": "1", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxSAYLt54ij34moiZN4AaABAg", "comment": "Terrible video. No different from blabbing teachers", "votes": "0", "replies": "5", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgyUlGLaBzv63FH4SoJ4AaABAg", "comment": "just look  video 103( Derivatives of Polynomial Functions: Power Rule, Product Rule, and Quotient Rule) first derivative is d/dx.  there is some misunderstandings.", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgyeMEax3qLIg0MHE2J4AaABAg", "comment": "He knows a lot about ___ stuff fill in the blanks", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugw0tkhoTl8Twbjo5EN4AaABAg", "comment": "Means high dimension are their to pop 😂😂😂😂", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwiHS6OVRXKwhUGEIV4AaABAg", "comment": "Why is the notation for the second derivative d²y/dx² and not d²y/d²x²?", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugz_Hk4kQxmI2vWR-uF4AaABAg", "comment": "Nice video thank you", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxO6lSwhMWGHR3hGYZ4AaABAg", "comment": "Done.", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugy1efEdqZrXOkkaLvR4AaABAg", "comment": "f(x)=e^x ?????? Is everything same?", "votes": "0", "replies": "1", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugwkq8Yawr6wtQZmZdN4AaABAg", "comment": "The graph showing position, velocity and acceleration side-to-side is by far the best showing of intuition of differentiation I've ever seen. I couldn't stop analyzing it. Watching your videos I can tell that you actually know what you're talking about and that you like it a lot (unlike my college teachers who simply memorized this from their also shitty college teachers that also probably didn't give a fuck.) At my college classes I memorized formulas ad infinitum, with these videos, I actually understood what's going on behind the scenes. Thanks, Dave! Cheers from Brazil!", "votes": "18", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgybayqLktj1hHrMe7B4AaABAg", "comment": "I LEARNED SO MUCH IN JUST 7 MINS.", "votes": "1", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugy2y_cdrjceWNyJ0W94AaABAg", "comment": "Very very nice teaching thank you sir", "votes": "1", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugz4qufchPsoqweSLMZ4AaABAg", "comment": "I will first thank him in my graduation", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxSAYLt54ij34moiZN4AaABAg.9mNYfobMalu9mNZpDVo89p", "comment": "It’s very different, since I explain it immaculately and with visuals.", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxSAYLt54ij34moiZN4AaABAg.9mNYfobMalu9mNelH9KWLD", "comment": " @ProfessorDaveExplains   Forgive my post. Just pissed off that no video has helped me so far understand(This is not an excuse though for that comment).Most videos I have seen today on YouTube from Organic Chemistry Tutor to \"Tuittor\"  understand the concept but pass the message as if their viewers are IMO medalists.  I would appreciate if you will incorporate the fact that some viewers need concepts to be broken down better in future videos.    Have a great day", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxSAYLt54ij34moiZN4AaABAg.9mNYfobMalu9mNiVXDdX4-", "comment": "This calculus playlist is cumulative, so if there is something that is unclear, it would be a good idea to go further back in the playlist so you can get all of the prerequisite concepts down.", "votes": "1", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxSAYLt54ij34moiZN4AaABAg.9mNYfobMalu9mrznDyMtE8", "comment": "That's right, you may need to go back a bit to make sure you understand the basics right. Also google what you can't understand, I personally had to do it to make sure that d/dx (y) is completely the same as dy/dx (and y' as well btw)", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxSAYLt54ij34moiZN4AaABAg.9mNYfobMalu9z-FS4yacE0", "comment": "​ @ProfessorDaveExplains hi can you pls explain to me how you got the second the awnser to the last question in the comprehension part, I know how you got the first derivative but not the second derivative 😅", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugy1efEdqZrXOkkaLvR4AaABAg.9VDd-yYXQ4c9VDd2w7mJ4I", "comment": "Yeah! It's its own derivative.", "votes": "2", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgwnAht0M_X4IyShT6p4AaABAg", "comment": "I'm used to listening to you and your song at 1.5x and one time I decide to listen to it at 1x it does NOT feel right!", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxxGz62fRLPKOXCBOx4AaABAg", "comment": "How did I get from searching for Snap, Crackle and Pop?", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxQceRsTm2U_x-SwTN4AaABAg", "comment": "What is 3rd 4th 5th 6th 7th 8th 9th 10th of of derivative of of speed", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgzBlSAJuRqqyEcYC-B4AaABAg", "comment": "You look like shakespeare in a parallel universe.", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugy2QeYmYaUfDs3oh794AaABAg", "comment": "It's 3am and that intro cracked me up so hard that I couldn't breathe.   I'm on a search for the applications of higher order derivatives of acceleration in physics software. If anyone knows anything it would be great help. Doesn't matter how advanced the info/source is, in fact, the more advanced and complex the better in my specific case.  I frankly can't imagine what kind of physics software, such as a simulation, would require anything beyond a jerk derivative, but I really hope that when I find the info that I'll become pleasantly surprised.", "votes": "0", "replies": "2", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxiYZ-7AHna-jxHM414AaABAg", "comment": "Anybody can help me that why we write d^2 by dx^2 and not d^2 by d^2x^2", "votes": "2", "replies": "1", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgzDgtYmsfuGZtkZNrZ4AaABAg", "comment": "Love from Bangladesh", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwwzgOrPHBahdNGShV4AaABAg", "comment": "This series has changed my life!", "votes": "3", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugy23Uf_wsS34iltL6J4AaABAg", "comment": "made it so easy. hands down better than school ❤", "votes": "4", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgzPsxRwpR2enUZB_jR4AaABAg", "comment": "Are these really higher derivatives? I was expecting to see at least d4x/dt4", "votes": "5", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugxo7cDJLQENwAupE7l4AaABAg", "comment": "3:35 Either I don't get something, either the first graph doesn't actually represent position. What is that, an object that leaves one place and returns to the same place? I also don't get how the second graph is connected to the first one. Is it like a vehicle that is reversing, considering we have velocity that is below zero at some point?", "votes": "4", "replies": "3", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxD7DT1VI-4rmbGBN54AaABAg", "comment": "Dec 25, 2019, Wednesday, 09:16 pm . It's miracle. 260 likes and 0 dislikes. Whoooooo!", "votes": "2", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgzOm-CO2bv2k2P3b4l4AaABAg", "comment": "Where did he get the 5?", "votes": "0", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgyDTYx_iNHYFRyVOlF4AaABAg", "comment": "I am Shahjahan from Bangladesh . I am very much benifitted by watching and memorizing these lecture ,Professor Dave (sir).", "votes": "10", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxGrv1FFqZg8dEP_vd4AaABAg", "comment": "Position.  Velocity.  Acceleration.  Jerk.  Jounce (also called Snap).  Crackle.  Pop.  Higher derivatives have names and are useful in fluid dynamics, cam shaft design, telescope light collection, etc.  Any time you need to minimize Jerky motion,  Bouncy motion  (Hence, Jounce).  They are refinements on the subtleties of higher order forces producing variations in accelerations.", "votes": "57", "replies": "3", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwSfWsxNaCEhLtLsb94AaABAg", "comment": "4:08 Pisa tower would suit more...", "votes": "6", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugyj9fO2Nim4X81ww8V4AaABAg", "comment": "sir you give a best concept of higher order of derivatives according to physics level but in math the derivative is define as tangential slope then what's the meaning of second derivative and as so on. please guide me", "votes": "3", "replies": "2", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgzH-0x0FoQSAVGuWp94AaABAg", "comment": "I have been lookin' for this since 2016.", "votes": "15", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgxYbSc__Fy_rEIZYEh4AaABAg", "comment": "This is the best of entire other videos regarding higher derivatives .", "votes": "12", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwWBw9tGJANq8hwjup4AaABAg", "comment": "Was it so easy,I never imagined.", "votes": "2", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugy2QeYmYaUfDs3oh794AaABAg.9Fk-qzP01sJ9aGDyhcWT_U", "comment": "same. the intro got me goin too 🤣 ... you ever find anything about snap, crackle and pop?", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugy2QeYmYaUfDs3oh794AaABAg.9Fk-qzP01sJ9aGH2RNY0Zc", "comment": " @devmehta4144  bro my course is no longer doing these things I cant even remember what the fuck they were lmao. reading back my comment I sound like an alien like what the fuck are derivatives lmaooo  1 year makes u forget things u dont use beyond college exams", "votes": "3", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxiYZ-7AHna-jxHM414AaABAg.9FKESEtV0TS9RG_qVqgkpV", "comment": "Short answer: history, that's how Leibnitz wrote derivative notations.  It is implied that dx^2 really means (dx)^2.", "votes": "2", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugxo7cDJLQENwAupE7l4AaABAg.96iFkNmZZYP97mpNo9SAbF", "comment": "You're actually pretty spot on with both speculations.   If the object was a car then its position graph says that it was (1) stationary, then (2) sped up away from the origin, (3) maintained a speed, (4) slowed to a stop, (5) stayed stationary for some time, (6) slowly sped \"up\" to reverse towards the origin, (7) maintained that speed, and finally (8) abruptly slowed down to a stop at approximately the origin.   For reference, let each of the points above refer to successive vertices on the second graph. Imagine slicing the three graphs vertically at each of these points:  The second graph describes the car's velocity (or speed) in the same time frame as the position graph.  Simply put, if the car moving forward then its velocity hovers above the x-axis (points 2 to 5) and if it is reversing, then its velocity hovers below the x-axis (points 6 to 8). If there is no change in velocity (intervals where the velocity graph is flat) then the car is either stationary (velocity is zero - points 0 to 1, 5 to 6, 8 to 9) or it is moving at a constant speed (where the velocity graph is flat but not at zero - points 2 to 3, 6 to 7).   The gradual rise/fall on the velocity graph refers to a change in velocity. Let's try and develop an intuition for why this is true but before we can do that, let's first review mathematics. Recall the definition of a slope: rise/run. When we talk about \"the rate of change\" of a function, we are referring to its slope within some interval. In calculus, this is referred to as the derivative of the function - its slope over an infinitely small interval. The second graph demonstrates the rate of change in position over time and the third graph demonstrates the rate of change in velocity over time; thus, we say that velocity is the first derivative of position and acceleration is its second derivative. But what does all this mathematical jargon actually mean?  We all know from experience that a car cannot just go from rest and magically travel at 60mph at the snap of a finger - it has to speed up from rest and traverse through 1mph, 2mph, 3mph and so on until it reaches 60mph over some time. This gradual change in velocity is just the car's acceleration (\"speeding up/down\"). Notice the first rising curve in the first graph (points 2 to 3)? Well that section corresponds to: (1) a positive change in velocity (the first rising slope in the second graph) and (2) the first positive \"step\" in the acceleration graph. By interpreting the acceleration vs time graph, we find that the car is speeding up at a constant rate in this interval. The steepness of this slope describes how fast the car is accelerating (speeding up) or decelerating (slowing down) - where a steeper slope = greater acceleration (analyze the first two slopes in the second graph and compare it with the magnitude of acceleration in the third graph). In English, we would describe a steep positive slope in the velocity graph as \"speeding up quickly,\" and conversely, a steep negative slope as \"slowing down quickly.\" At the extreme end, we would describe a nearly vertical negative slope as \"abruptly stopping.\"   Notice how language agrees with math - [speeding up] [quickly] = [velocity/time] per [time] = [distance/time] per [time] = [meters/second] per [second] = [m/s]/s = m/s^2. Voila - we have derived the SI units for acceleration using just English!  When the car is speeding up, we should expect: (1) a positive \"step\" in the acceleration graph, (2) a rising slope in the velocity graph, and (3) a rising curve in the position graph. Conversely, if the car is slowing down we should expect: (1) a negative \"step\" in the acceleration graph, (2) a downward slope in the velocity graph, and (3) a flattening curve in the position graph.   It is also important to keep in mind that while a negative velocity implies that the car is in reverse, a negative acceleration does not imply the same - a negative acceleration just means the magnitude of its velocity (speed) is decreasing relative to the direction of motion - a car can still be moving forward even if its acceleration is negative. Given enough time, a car moving in the positive direction with a negative acceleration will eventually come to a stop. This is evident in points 3 to 4. Moreover, a negative acceleration also does not imply that the car is slowing down. Take points 5 to 6 for example. The car is speeding up but in reverse!  Bonus: The area under the curve of a velocity graph is the total displacement (vector counterpart of distance) of the car - in this case, by our analysis of the position graph, we can extrapolate this value to be zero which means that the car returned to the origin. By analyzing the geometry of the velocity graph we see that the area (in blue) above the x-axis is approximately the same area below the x-axis. A positive area \"I\" plus a negative area \"I\" equals zero, thus the net displacement of the car is zero. This is yet another relationship between the position and velocity graphs. The same relationship applies to velocity and acceleration. In calculus, displacement (position) is known as the integral of velocity (speed) and velocity is known as the integral of acceleration. In essence, integrals are anti-derivatives *wink*, vice versa.   Professor dave actually goes over this in this video: https://www.youtube.com/watch?v=bqf8m7xNvLg", "votes": "4", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugxo7cDJLQENwAupE7l4AaABAg.96iFkNmZZYP97o2RVkxmRh", "comment": " @Sooper35  Holy moly you were bored", "votes": "4", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugxo7cDJLQENwAupE7l4AaABAg.96iFkNmZZYP97o8dWN9Xqh", "comment": " @aleksszukovskis2074  just a little cracked out on caffeine :) drank too much coffee for a midterm hehe.", "votes": "1", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxGrv1FFqZg8dEP_vd4AaABAg.91V18Kr5N6SA3oIk6EhLDp", "comment": "Distance incremental fan know this shiet in 1030163 BC", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxGrv1FFqZg8dEP_vd4AaABAg.91V18Kr5N6SA3otJRAKHXd", "comment": " @thiennhanvo2591  Derivatives of functions imply that the functions means something in the real world.  Just because you can apply a derivative formula to a function like X^7 and get answers does not mean that the function has a meaning in the real world, and that your rote derivatives are meaningful.  Math is more than rote iteration of a rule - it should stand for some aspect of reality.  To take the fourth derivative of a function and end up with a position, you first have to have a meaningful higher function - one that signifies motion in reality.  Math is not just repetitive fun and the following of rules, it makes a contact with reality.", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgxGrv1FFqZg8dEP_vd4AaABAg.91V18Kr5N6SA3ovPuHvrXo", "comment": " @charleshudson5330  i aint reading allat", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugyj9fO2Nim4X81ww8V4AaABAg.8wy5OJpemeQ97BAbbR_UbS", "comment": "It's also a tangential slope but of that derived function. In this case of graph of velocities at given time and tangential slop is acceleration.", "votes": "1", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugyj9fO2Nim4X81ww8V4AaABAg.8wy5OJpemeQ9RG_h2KoVEO", "comment": "For slopes close to zero, the second derivative is proportional to the curvature.  Actual curvature (reciprocal of radius of a circle that matches the function in question) is a combination of both first and second derivative.", "votes": "0", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgzmA8LlrykDOJeSC1d4AaABAg", "comment": "You just saved me from failing maths 💛", "votes": "4", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwLTEFpsTKFXrS-j854AaABAg", "comment": "professor Davs are u a lecturer in any university??????", "votes": "1", "replies": "3", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugys5qApOOElnppySKZ4AaABAg", "comment": "Professor Dave is the best.... Must get a million subscribers", "votes": "47", "replies": "3", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugzkq_vnsv0cTvCzrl54AaABAg", "comment": "I want more videos related To function of maths I very good in maths but my calculation mistakes r feel me baad", "votes": "4", "replies": "3", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugy9ObipFC65m_8qoaV4AaABAg", "comment": "I want a 💓 please", "votes": "2", "replies": "1", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "Ugz7F6WFhBjOwGsF2O54AaABAg", "comment": "Thanks for all efforts to present science and light away for whom not clearly know about it", "votes": "3", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwNnep3Ewl9VatUnit4AaABAg", "comment": "thank you sir!", "votes": "3", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgztZbiuQYFnXhcdjnV4AaABAg", "comment": "very nice sir keep it up!!!! 👍👍👍", "votes": "3", "replies": "", "reply": false}, {"vid": "zUDxgehxQqs", "cid": "UgwLTEFpsTKFXrS-j854AaABAg.8eNN1VYjfZS8eNyy-FMz8f", "comment": "no just a science communicator!", "votes": "3", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgwLTEFpsTKFXrS-j854AaABAg.8eNN1VYjfZS8eNzhmkm0gb", "comment": "Professor Dave Explains ok boss", "votes": "2", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "UgwLTEFpsTKFXrS-j854AaABAg.8eNN1VYjfZS8eNzp3ZrsPH", "comment": "I m in 12 class and I m a science student i always see ur videos fr best understanding", "votes": "1", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugys5qApOOElnppySKZ4AaABAg.8eMo_8JUVNI8eMwXB4-j3C", "comment": "i agreeeeee!!!!!", "votes": "30", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugys5qApOOElnppySKZ4AaABAg.8eMo_8JUVNI9Fk-tXpRlpI", "comment": " @ProfessorDaveExplains  you got a million subs dude. good job.", "votes": "18", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugys5qApOOElnppySKZ4AaABAg.8eMo_8JUVNI9tvZu-Cua_v", "comment": " @ProfessorDaveExplains  much more than one mil now 😂", "votes": "3", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugzkq_vnsv0cTvCzrl54AaABAg.8eKii01wDee8eLKJuSQs7G", "comment": "check out my mathematics playlist! start from the beginning and clear up all the basic errors!", "votes": "2", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugzkq_vnsv0cTvCzrl54AaABAg.8eKii01wDee8eLM9_Qz6Rk", "comment": "ok sir", "votes": "2", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugzkq_vnsv0cTvCzrl54AaABAg.8eKii01wDee8eLOQav4lVv", "comment": "u r really best explaner!! 👍", "votes": "2", "replies": "", "reply": true}, {"vid": "zUDxgehxQqs", "cid": "Ugy9ObipFC65m_8qoaV4AaABAg.8eK5-1iyxyr8pOaa6yOoEI", "comment": "Got a 👍", "votes": "3", "replies": "", "reply": true}]